{"title":"London/South Kensington-Chelsea","name":"The Jade","address":"52 Hogarth Rd, SW5 0PU","directions":"tube: Earl's Court Station or West Brompton","phone":"+44 20 7373-6297","tollfree":null,"email":null,"fax":null,"url":"http://thejade.reserve-easy.com/","checkin":"15:00","checkout":"10:30","price":"From £45","geo":{"lat":51.4936,"lon":-0.1916,"accuracy":"APPROXIMATE"},"type":"hotel","id":16441,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Una Hotel in Rome is fantastically located and a stylish, quality, contemporary hotel. We were (for some reason) upgraded to a suite and I can honestly say it is the best room I have ever stayed in. Room: Suite had a living room with desk and sofa, sliding doors to a seperate bedroom with a massive solid walnut bed with controls for all the room functions on the bedside tables. Bathroom had a huge showerhead and bath and so many items included - shower gel, shampoo conditioner, hand cream, body lotion, manicure set, shaving set, batch salts, scented candle, tootbrushes and tootpast, robles, slippers etc...There was also an illuminating wardrobe and safe. For me, having lovely tea and coffee facilities was a real bonus abroad. There was Twinings tea bags! Service: Excellent. Very polite, English speaking Reception staff and porters. We checked in at about 4pm, went out for the evening and returned at around 10pm to find that our room had been turned down. Towels were replaced, robes folded and milk replenished. Food The restaurant / breakfast room was a lovely cosy, contemporary room with a good ambience. There was an excellent variety of breakfast items although I would say the quality could have been slightly better. Tea / coffee was brought to the table (although we were forgotten about initially) Location A stones through from Termini Station - the main hub for the train, Metro and Taxis. You can get anywhere easily from here with excellent links to the airport too. Termini is walkable to the main sights (we did) but not completely central. If you want to be really right in the middle of things, opt for a location near the Spanish Step[s or somewhere like that. Metro is brilliant and costs only 1 euro for 75 mins Overall, I would recommend this hotel without hesitation and most definitely return myself","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Berniece Ward","date":"2012-08-03 05:47:00 +0300"},{"content":"we stayed at this hotel on our first stop on our italian trip modern rooms with high ceiling, modern bedrooms and baths with all the up to date gadgetry at your bedside the hotel was very clean and would stay here again the service was good and the location pretty close to the train terminal mary maggiore church, a must see","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Rodrigo Bartoletti","date":"2014-04-12 18:26:36 +0300"},{"content":"We stayed at the Una Hotel Rome for 4 nights. Our room smelled of mold. We looked in the washroom and the bathtub had black mold everywhere. It was disgusting. We told the front desk and they moved us to another room (which appeared to be better). The second room, although a bit bigger had the worst plumbing problems; toilet, bathtub and sink were all blocked and we told management a few times to no avail. The bed had a dry blood stain in the sheets. Beyond gross. It was finally changed after we pointed it out. The room in general was dusty and not taken care of properly. The maid forgot to leave clean towels twice and to top it all off, there was an ant colony all over the room. We had to keep our luggage closed. They were everywhere and after pointing out all these problems, management finally sent a plumber and they sprayed for the ants. Would definately NOT stay here ever again. It's not the guests' duty to tell the hotel what is wrong with the rooms. We chose it due to the proximity to the station since we were travelling by train and also because it is a \"new\" property. The food too for breakfast wasn't all that. The same old boring packaged stuff, runny eggs, worst espresso ever. . Being in Rome, I expected more from the food at least. The hotel lobby and the furnishings are modern but the hotel is definately not worth the price it charges. Terrible! Stay away and spend your money elsewhere.","ratings":{"Location":3.0,"Overall":1.0,"Value":1.0,"Service":2.0,"Rooms":2.0},"author":"Ola Hauck","date":"2015-12-23 20:23:30 +0300"},{"content":"We had read that the area surrounding Termini station wasn't the best but we wanted to stay somewhere accessible to different transport and this place turned out to be perfect. We were even within walking distance to the collosseum so that was a bonus!! Included in the rate was breakfast which was quite simple but I really enjoyed the fresh bread rolls in the mornings. We didn't eat in the restaurant, just had coffees and light meals. There are several decent restaurants that are really close by. The staff were quite friendly and very helpful with questions about sites and restaurants. Overall it was a great place for my husband and I to stay at and we would definitely recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Seth Mohr","date":"2013-06-28 22:14:59 +0300"}],"public_likes":[],"vacancy":false,"description":"Long-established private 2-star hotel around 2 minutes' walk from Earls Court tube station. Well-heated, double-glazed and secure. Telephone and cable TV in room (Sky News, CNN), free wi-fi and continental breakfast.","alias":"formerly &quot;Green Court Hotel&quot;","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}