{"title":"San Francisco/Union Square-Financial District","name":"Hotel Triton","address":"342 Grant Ave","directions":"at Bush St","phone":"+1 415 394-0500","tollfree":null,"email":null,"fax":"+1 415 394-0555","url":"http://www.hoteltriton.com/","checkin":"3PM","checkout":"12PM","price":"$229-$300","geo":{"lat":37.7903,"lon":-122.4053,"accuracy":"APPROXIMATE"},"type":"hotel","id":26236,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I stayed here as I was attending an exhibition at the nearby Dubai Exhibition Centre, and I like to collect my priotity points so always prefer to stay at a Holiday Inn if i can. I usually stay at Holiday Inn - Al Barsha which is a great hotel, but was fully booked so I opted for this one. The room wasnt overly clean, the sofa was dirty and had crumbs on it and looked like the covers on it needed a wash. There was only one plug-point in the whole room which is completely useless when you have 2 phones to charge, a laptop to charge and and an iron to plug in. The room looked like it needed updated, modernised and given a good clean overall. The bed was comfy and the staff were friendly and organised my wake-up calls and taxis no problems, but at over £100 per night it was far too overpriced, even for Dubai standards. I would not stay here again.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":4.0},"author":"Elvis Muller","date":"2013-05-20 12:45:06 +0300"},{"content":"Good location (near Jumeirah beach), but you'll need a car or have to rely on taxis. Good room, OK breakfast. Basic but good.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Jaylin Hermiston","date":"2014-01-07 19:07:05 +0300"},{"content":"My wife and I were going to be in Dubai for the weekend, so we looked at the TripAdvisor reviews and did our booking through one of the agencies on the TA site. Our first surprise when checking in was the fact that the room rate charged was much higher than what we had booked at - the reception staff attributed it to taxes and other incidentals. Our room was small, had a musty smell and the furnishings were tacky. Standard items like drinking water, glasses and tissue boxes were not provided. The bathroom had no soap or shampoo, instead there was a hair/ body wash which my wife said made her hair texture oily. The shower knob had no hot or cold markings and needed to be turned clockwise, so one had to be very careful to control the water temperature. When I called Housekeeping to send up some glasses they asked me to call the restaurant which i did. Their response? You guessed it - they asked me to call up Housekeeping. Finally, they sent up two plastic glasses. The hotel is located in a very isolated area of Jumeirah with a \"picturesque\" view of the dry docks and no restaurants, shopping, activity spots within walking distance. The only attraction is for beach-lovers because the hotel operates a free shuttle service to the nearby Jumeirah beach. Everywhere else, you have to travel by taxi which ranges from 20 AEDs to 60+ AEDs. The hotel security staff try to push private taxis and city tours which we found were were at least 300% costlier when we compared similar tours offered by agencies advertising in the Official Dubai Tourism magazine available free in the room. The one bright spot of our stay was the helpful Filipino staff at the reception who went out of their way to accommodate our request for early check-in and late check-out. Before leaving, we requested for a weighing scale to check our luggage because we were afraid that we may have over-shopped but once again, we were disappointed being informed that this was a 2 star property and such \"luxury\" items were not available. This was not our first trip to Dubai but it will certainly be our last to Holiday Inn Express, Jumeirah.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":1.0,"Location":1.0},"author":"Mr. Joanie Wyman","date":"2013-02-02 12:28:21 +0300"},{"content":"very clean and friendly hotel, the staff is very friendly, especialy the reception guy from morocco","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Milton Terry","date":"2014-06-06 15:37:31 +0300"},{"content":"I booked the room by online and it was for accomodating two persons in one room. I paid the bill amount for one night against one bill after the check-out . Later I have noticed that they are deducted double amount from my credit card seperately for me and my spouce. I am not receive any updates from them on I contacted the customer care in Holiday Inn Website.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Sarah Zboncak","date":"2012-11-30 06:46:37 +0300"},{"content":"We live in the UAE and only wanted the room for the night to pick family up from the airport. We were welcomed with smiles and friendly joking staff who quickly processed our booking and sent us to our room. the room was very tidy, clean and modern It had a pull-out couch that we were going to use but our 3yr old had other ideas. Breakfast was great, it is stated it is contnential, we were more than satisfied with what was on offer. Had to pay and extra 20% taxes but we were also aware of that from looking into the booking. Area is near the port but is a short (4km) walk to a great mall, Mercarto, and beach is also near here.Excellent choice of cafes and resturants about 2km walk. Overall it is exactly what we wanted, we only slept there and were out most of the time.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Uriel Fadel","date":"2012-01-30 21:43:33 +0300"},{"content":"The Grand Midwest Express Hotel Apartments are rather basic and worn down, located in a cluster of non-specific building developments. Good for families needing space, and/or cooking/washing facilities in the room, or for long-term stays for business on a budget. Very firm comfortable bed, and quiet, allowed for a great night's sleep; this was the highlight of my experience. Service: The staff, mostly philipino like in much of Dubai, were friendly and helpful. Rooms: Large, tiled floors, with kitchenette. The kitchenette and bathroom were both old, tired, worn-down; not of the caliber of most new Dubai business hotels. Location: In Discovery Gardens, the best part is proximity by taxi to the Marina (5-10min; inexpensive, ie 15-25 AED). Also, proximity by foot, 10min, to Ibn Battuta mall, if shopping is a priority. In proximity: A few basic conveniences are next door, in adjacent buildings, including a Subway sandwhich shop, massage parlor, mini-mart, and one or two other basic restaurant/lounges. Ibn Battuta Mall is apparently large, though we couldn't find much of it, and were overall unimpressed. Includes a functional simple gym; was a bit tired and old feeling, but did see several people using it.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":2.0,"Location":2.0},"author":"Nina Gleichner","date":"2014-03-20 05:32:44 +0300"},{"content":"First impression not good. When checking in another member of staff pushed in and gave the receptionist something else to do. I was staying here for at least 6 weeks. My room had a washer dryer but it didn't dry. 4 separate members of staff came to check it (there were no instructions) and 1 stayed watching it for the full cycle sure I was lying. Eventually it was replaced. Fridge filled with water daily. If you pay in advance by credit card they will have lost the receipt and only find it if you argue for at least 3 days (this happened to me twice). Reception staff are mostly inefficient and rude. Most bedding and towels stained and frayed. Convenient location but thats about all you can say.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":3.0},"author":"Jacey Ullrich","date":"2014-08-28 21:22:02 +0300"}],"public_likes":["Raphael Frami","Destini Muller Sr.","Marcelo Cummings","Caroline Lynch","Sandy Cremin","Taylor Dibbert","Julia Schiller","Ettie Weimann V"],"vacancy":true,"description":"Located just outside Chinatown, directly across from the south gate. Trendy, modern, and a little pricey. But the rooms are nicely appointed, and they offer a free tasting of local wines every afternoon.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}