{"title":"Ukiah","name":"Discovery Inn Ukiah","address":"1340 N. State Street","directions":null,"phone":"+1 707 462-8873","tollfree":null,"email":null,"fax":"+1 707 462-1249","url":"http://www.ukiahdiscoveryinn.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":39.168981,"lon":-123.211824,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":31642,"country":"United States","city":"Ukiah","state":"California","reviews":[{"content":"It is one of my favourite hotel. Staff are very friendly and helpful. I have stayed there for 2 times. Although it is not located in city centre, shuttle bus is available to Shatin Town Centre and Tsim Sha Tsui. I also highly recommend Sha Tin 18. After you try the suckling Peking Duck, it just melts in your mouth.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Deion Boehm Sr.","date":"2014-07-06 07:34:40 +0300"},{"content":"We brought our son to HK to celebrate his 4 yr old b'day. We chose to stay at Hyatt, Shatin mainly because of its Kids Club. Booked for 3 consecutive nights (Hyatt's website) and we were given an upgrade to a 1 bdrm executive deluxe. We loved the bedroom so much that we didn't want to go anywhere else. It's large and has the view of the mountains, waterfall and the constant MTR plying in front of us (minus the noise). We only left the hotel twice for an early lunch and some shopping at Shatin shopping center (2 MTR stops away). The rest of the time we spent in the room watching free in-house movies. Our stay was made extra special when my son was given a complimentary birthday cake (large chunks of fruits) which was so yummy!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Lue Wuckert","date":"2012-07-30 06:26:54 +0300"},{"content":"The Hyatt Regency Sha Tin is located outside the city, its at least 20 mins away from Hong Kong. But at the same time it is very accessible as it is right next to the metro & bus station. You can take a bus, or a cab, or take the more convenient metro to the city. There is even a free shuttle to the other Hyatt located in the shopping district of Tsim Sha Tsui in downtown Hong Kong. The hotel itself is well built, modern & sophisticated. It seemed almost new when I stayed there so I dont know how old it is, but everything was very modern, well kept & clean. The rooms are large, very well made & up to the Hyatt standards. The food is good as well, & I dont know if it seemed reasonably priced to me because of the value of the Hong Kong Dollar or because it was actually cheap compared to other hotels? You be the judge & try it out yourself. Great hotel, great stay, but...is it worth staying so far away from the city? Is it worth spending up to 30 mins on the metro to reach any of the sights & attractions? I guess it depends on how much money you are willing to spend on a hotel. The hotels in the city are not cheap, & compared to the Hyatt Sha Tin are a lot more expensive even if its a three or four star hotel. So it pretty much depends on how you want to spend your money I guess. Spend less on a hotel & more time commuting to & from the city sights & attractions, or spend more on a hotel & no time commuting by staying in the city. There is a Hyatt right in the city centre, a lot more expensive though. You decide.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":2.0},"author":"Emmett Bode","date":"2013-10-08 05:38:45 +0300"},{"content":"I'm a business traveler and I spend a considerable amount of time in hotels across the world. I am come to truly value the distinct experience I feel when I stay at Hyatt hotels. Everything you would expect from a Hyatt - you won't be disappointed! I was impressed with the hotel and especially the staff. They were all very friendly and professional.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Mr. Sadie Donnelly","date":"2013-12-18 07:23:54 +0300"},{"content":"We stayed here for a business conference, it was amazing... Had the water front view... Room #1129...amazing... A bit far away from central & tst... But is definitely the best hotel in shatin","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Vallie Friesen","date":"2015-06-15 10:21:09 +0300"},{"content":"I have stayed at this hotel last year. It has not changed. What ever your needs, they seem to excell. The staff is trained and professional. Young proffessional staff is including the door men to the lady who puts your nightly treat in your room! I recommend this Hotel highly. Close to University MTZ, just acouple stops from Sha Tin shopping. Nice pool with a great excerise room. Oh, don't forget the breakfast buffet. Close to the Sha Tin Racecourse.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Aditya Hessel V","date":"2012-07-25 19:04:56 +0300"},{"content":"Very nice hotel, great rooms and facilities. It has a great gym and swimming pool. However they seem to try and charge you for absolutely everything. You would think that a chain as large as hyatt, with it's room rates, would include free or very cheap wifi but it is extortionate. And the business centre charges quite a bit to use the printer and for paper.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Sandrine Feest","date":"2014-03-28 02:59:18 +0300"},{"content":"I spent three nights at the Hyatt Regency Hong Kong Sha Tin hotel during a recent business trip. The hotel is very nice, with large, well designed rooms and comfortable beds. My room had a great view over the river. The bathroom had a walk-in shower and a separate bath. The breakfast buffet had a large variety of food, and the quality was excellent. Unfortunately, dinner off the menu in the Cafe was not so great. The dinner buffet may have been better. The rooms have both wired and wireless internet access, which worked well, but was an extra charge. I don't like this policy, but it is common in mid to high end hotels. (Lower cost hotels do not see the need to charge extra for Internet access, so this charge is more of an opportunity for the hotel than a necessity.) I was there only for business, so I cannot comment on how far the hotel may be from downtown Hong Kong.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Lonzo Conroy","date":"2014-09-21 09:21:00 +0300"},{"content":"Very low end version of the Hyatt properties. Its ok for the price but rooms are small and its far away from the city. Staff was not willing to upgrade despite being a Hyatt Platinum member (whats irking is that he didnt even check availability until I insisted). Water views are ok, but that depends on how well you haggle for the room with view. Don't expect alot...","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":4.0,"Service":1.0},"author":"Florencio Corwin","date":"2012-08-24 19:01:36 +0300"}],"public_likes":["Jonatan Cremin","Hilbert Auer","Nyasia Ledner"],"vacancy":true,"description":"Ukiah California Hotel, Discovery Inn offering comfortable and affordable accommodations located in the heart of Mendocino Wine Country.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}