{"title":"Sonoma","name":"Sonoma's Best Guest Cottages","address":"1190 East Napa Street","directions":null,"phone":"+1 707-933-0340","tollfree":"+1 800-291-8962","email":"info@sonomasbestcottages.com","fax":null,"url":"http://sonomasbestcottages.com/","checkin":null,"checkout":null,"price":"$159-$300","geo":{"lat":38.289941,"lon":-122.435849,"accuracy":"APPROXIMATE"},"type":"hotel","id":27827,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"We chose this hotel because of location and it was perfect for what we wanted close to restaurants shops + attractions. The apartment was lovely much bigger than we expected with a full kitchen + washer dryer facilities which we did make use of. The bathroom was great with jaccuzi bath + large walk in shower with a second bathroom that we did not use. Bed huge + comfortable we had great view over looking lake + pool and spent time on balcony with nice glass of wine to relax after long hot day. Ate in Restaurant once lovely steak meal + very reasonable used pool + hot tub in the evening which was great after tiring days in themeparks. apartment kept spotless already planning to return 2012 with family cant wait....","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Marie Erdman","date":"2013-03-12 22:39:16 +0300"},{"content":"Myself and my family have visited Florida many times, usually staying in villas. This time we decided to stay in an apartment and definitely made the right choice with Lake Eve. The apartments are just as comfortable as staying in a villa, with all the facilities you could possibly need. The beds were all large and very comfortable, and all three bedrooms had a lovely view of the lake. Both bathrooms were nice, the en-suite was very smart with a separate shower, twin sinks and a Jacuzzi bath! The kitchen was well equipped with a washing machine, dryer, large fridge etc . The only difference we found between the apartment and a villa was of course the shared pool, this was more than compensated for by the wonderful view from the balcony.... of the lake by day, and the lights of Orlando by night! The pool area itself was plenty big enough and there were always sunbeds available, the sun does go off this area late afternoon, but to be honest it was so hot we were quite happy by then to have some shade. The position of Lake Eve is excellent, this end of International Drive is quieter which is lovely after a day at the parks, but is within walking distance (10-15 minutes) or 5 minutes by bus, to a Publix where you can get any groceries you need, a McDonalds, Dominoes Pizza, a couple of other restaurants and The Premium Outlet shopping mall. The apartment was clean, the cleaners coming everyday was also a bonus and they even put the dishwasher on if we had gone out in a hurry and left some crockery out! , Any staff we met were very friendly and helpful, especially the young barman who we chatted to while waiting in the bar for our taxi to arrive. We were very impressed and will definitely stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Courtney Klein","date":"2012-01-06 16:28:02 +0300"},{"content":"I found this hotel on Hotwire for approx. $100/night – a great find for a two bedroom/two bathroom condo. This hotel is comparable to Vistana Village (which is right across the street). It is in a great location if you are going to Disney. The hotel appeared to be new and our room was very nice. It had new appliances, furniture etc. The bathrooms were very large – loved the Jacuzzi tub! The patio was also great – we could see fireworks at night. We stayed on July 4th so the hotel was a little noisy as I am sure most hotels were that night. Our only complaint would be that the wait for the elevator was a little long every time we needed to use it. Also, I’m not sure why valet parking is offered for the small parking lot, but you don’t have to use it. It was a great stay. We will be back.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Vaughn Zulauf","date":"2015-10-23 01:49:26 +0300"},{"content":"I stayed at ths hotel with my husband and my 3 year old daughter in May 2011 and would come back again certainly. It is a very new hotel and so all the rooms are very new, well decorated, spacious and confortable. There's a big swimming pool and an astonishing and relaxing lake view. The staff of the hotel is very friendly too and it's very well located, close to a big Publix and a Walgreens, close to Disney parks, Sea World and Premium Outlet. I do recommend it.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Lamont Baumbach","date":"2015-11-14 07:52:15 +0300"},{"content":"Waited at front desk 10-15 minutes before someone acknowledged presence, couldn't check in but we were there at around noon which was before check in time, so we returned later. Then we discovered that microwave was missing the turntable, so called and someone came up a while later, and when turned stove on, there was white smoke coming out so we turned it off and decided that we probably shouldn't use it. We also had bed sheets which were stained and had cigarette burns. Also a couple of towels had stains on them, and finally the door to the balcony didn't have a screen door so when you kept it open for a nice Florida breeze, bugs would fly in. Definately not impressed and would suggest you think twice.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Lonny Brekke","date":"2012-08-19 11:39:57 +0300"},{"content":"I booked 3, two bedroom suites back in November for a conference that my colleagues and I were attending. The day before we left I emailed to confirm our reservation, I received an email confirmation. The day we left one of my colleagues called to make sure that the hotel knew of our late check-in (our plane did not arrive until 11:30 pm). Upon arriving at the hotel, by this time it was past midnight, we were told that check-in was at 3:00 pm and since we were not there at the allotted time they had given our rooms away. Completely unacceptable! Needless to say we were very upset considering the difficulty we had in locating new rooms during the spring break in Orlando at 12:30 am. We were assured by the man/boy working the desk that our rooms were only given away for the night, and that the rest of our reservation was secured for the next day. Some of our team had to scramble to find another hotel for the night while I had to share 1 bedroom with 3 work colleagues. During this period the night desk person was very rude to us. The next day we tried to confirm the rest of our stay, and the day desk person told us that the entire reservation was given to someone else. Unbelieveable! We had booked for 5 days to attend a work function and were now homeless. The person at the desk actually said to my boss \"too bad, so sad\" The staff at this hotel are the most unprofessional that I have ever encountered. I'm sure they gave our rooms away to the first people that walked in off the street offering a kick back to them. I will never stay at this hotel again, nor do I recommend it to anyone.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":3.0},"author":"Loren Bernhard","date":"2014-12-29 00:45:58 +0300"},{"content":"I just stayed at Lake Eve Resort last week and it was Amazing. We are a family of 7 adults and we stayed in the 2 bedroom room w/kitchen etc. This worked so well for our family. We were in Orlando visiting all the parks. It was nice to come back at the end of the day and be able to relax. The hotel was very clean, the employees were very curtious. And it was just great. I would definently recommend staying here if you are visiting Orlando for an extended stay. We will definently stay here if and when we return to Orlando.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Linnea White","date":"2015-06-10 08:11:23 +0300"},{"content":"Resort was very nice. 2-bedroom suites were amazing: full kitchen, dining room with table, living room, 2 bedrooms, 2 baths, balcony, washer/dryer. Master bathroom was huge (jetted tub and separate tiled shower). 3 big screen TV's with nice channel selection. Didn't have to go get ice down the hall because refrigerator had water and ice dispenser. Large swimming pool with kiddie pool and hot tub. Free wi-fi was very fast. Not much of a business center (2 computers in the hallway). Charged for internet use, so went to room and used free wi-fi. We got a great last minute rate. Much cheaper than staying on Disney property. They have complimentary shuttle service to Epcot (3 times a day). Resort is not far from the Disney parks and Universal Studios. Many restaurants and grocery store close to hotel. Did not try hotel restaurant. We really enjoyed our stay. Great value for the money!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ashlee Champlin","date":"2015-11-26 16:18:05 +0300"},{"content":"Stayed here for 2 weeks on the 14th floor, and received excellent service from polite and informative staff. The 2 bedroomed apartment was clean,spacious, comfortable, and well appointed ,with a beautiful view. Centrally located, it was handy for supermarket(Publix), Outlet Mall(Premier), Restaurants ,and of course the Parks. The Trolleyline came in handy a few times too.The hotel amenities were very good (pool,fitness centre etc).Provision of electric jug/kettle would have been appreciated for cups of tea(,a coffee perc is provided ). The large screen LCD TV's in each room were well used.All in all a very very comfortable and enjoyable stay. We would certainly stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Janis Kozey","date":"2014-02-01 15:57:54 +0300"}],"public_likes":["Mr. Ally Wyman","Jordane Koch","Orlo Schultz","Tania Klein","Crawford Bruen","Ms. Veda Will","Deven Bogisich"],"vacancy":false,"description":"Four quaint cottages owned by the folks who own Sonoma's Best, a local general store. About a 30-minute walk from downtown Sonoma, this is a great launching point to check out Sonoma Valley and visit Napa. Romantic with private patios. Free internet.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}