{"title":"San Francisco/Nob Hill-Russian Hill","name":"Fairmont Hotel","address":"950 Mason Street","directions":"at California","phone":"+1 415 772-5000","tollfree":null,"email":"sanfrancisco@fairmont.com","fax":"+1 415 772-5013","url":"http://www.fairmont.com/sanfrancisco","checkin":null,"checkout":null,"price":"The grandest suite costs $10,000 a night, but you can get a nice room for $300-400","geo":{"lat":37.7924,"lon":-122.4102,"accuracy":"APPROXIMATE"},"type":"hotel","id":25964,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The hotel location was great- it is only a short walk to all of the major highlights of Rome. The rooms were spacious; however, one of the pillows on the bed appeared to be blood stained and it also looked like there was blood splatter on the wall. Either way, the hotel rooms could use some major updates.","ratings":{"Cleanliness":2.0,"Sleep Quality":3.0,"Overall":3.0,"Value":4.0,"Service":4.0},"author":"Laura Hilll","date":"2014-12-09 13:28:30 +0300"},{"content":"My friend and I were in Ocean City for a day, and decided to stay in town that night. After calling a few places, we called the Thunderbird and they had a room available for just the night. The front desk staff was very helpful and friendly. After check-in, we made it up to our room to find a very clean, surprisingly quiet room. It was Memorial day weekend, I was not expecting it to be so quiet. The room had everything we needed for our day (turned overnight) trip. I would recommend the Thunderbird to my friends and family after having a positive experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Elinore King","date":"2014-06-18 23:06:01 +0300"},{"content":"My family absolutly loves staying here. It's a very short walk to the beach. The staff at the Thunderbird are always polite and willing to help us with our every need. Hotel appears to be very clean and well kept. I would highly recomend this hotel to anyone wishing to have the ultimate beach experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Ettie Daugherty","date":"2013-07-27 01:36:10 +0300"}],"public_likes":["Amely Rippin","Marianne Torp","Joey Schowalter IV","Alverta Mueller","Ole Anderson","Freddie Thompson IV","Arjun Fadel Jr.","Therese Sanford IV"],"vacancy":false,"description":"One of the most famous hotels in the city, having been gutted in the 1906 earthquake and fire, and rebuilt. The lobby is fantastic, and many rooms have fantastic views.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}