{"title":"San Francisco/The Avenues","name":"The Moffatt House","address":"1401 7th Ave","directions":"at Judah","phone":"+1 415 661-6210","tollfree":null,"email":"innkeeper@moffatthouse.com","fax":null,"url":"http://www.moffatthouse.com","checkin":null,"checkout":null,"price":"$73+","geo":{"lat":37.7621,"lon":-122.4643,"accuracy":"ROOFTOP"},"type":"hotel","id":26139,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Every aspect of the Fairmont Heritage Place is excellent. Everyone is so helpful! The townhomes are beautiful. I cannot find one thing upon which to improve. I only wish that we could return soon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Reva Christiansen","date":"2013-10-01 06:16:27 +0300"},{"content":"We stayed at this amazing hotel for 3 nights during our California honeymoon. They upgraded us to a 2-bedroom, 2 bathroom condo with a full kitchen, fireplace and unbelievable views of San Francisco Bay & Alcatraz. The hotel is a 5-minute walk to the famous Fisherman's Wharf where you'll enjoy some of the best food you've ever had. The hotel has a car service, which we took advantage of since we're from Florida and not used to all of the hills. They served a complimentary continental breakfast and had a wine & cheese hour each day. This hotel made our first trip to San Francisco extra special and we can't wait to return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ashly Frami","date":"2013-07-20 09:18:16 +0300"},{"content":"We loved this place. My husband and I took our two boys (9 &14) for a long Halloween weekend trip and got a 2 bedroom city view. It was HUGE! There are 2 masters -- each with own bath - ours was a bit more posh -- but you could definitely have 2 couples share a 2 bedroom. The kitchen and living room are very large and brand new -- you feel like you are in a NYC loft apartment. (I was hoping they would upgrade us to a \"Bay View\" and I asked several times -- but it was fine having CIty view since we rarely looked out the windows.) This hotel suite was so light and airy you didn't feel the need to have the shades up. The hotel is in a great location -- close enough to walk to Fisherman's Wharf and all the sights but tucked away at Giaradelli Square which is much more mellow. There are restaurants all around and a great Cupcake Store and Candy Shop right outside. Also, a Starbucks and the Buena Vista Restaurant is 2 blocks away (where the first Irish Coffee was \"invented\" or brought to the States -- advice-- go for the Irish Coffee - but DO NOT eat a meal there -- not very good!). The water is literally 2 blocks away or less. And there are 2-3 bike rental stores also right around the corner. This is a Fabulous place to stay with kids and the Wharf area has great things for kids to do. But you can still get around to other parts of the city and there is a Cable Car stop one block away as well. Breakfast is included -- They have a lovely comfy breakfast room (with upholstered chairs) and also a great outdoor patio with coal fire pit, which we sat by every morning (in light jackets) and ate our breakfast -- alone -- it was as if we owned a huge house in downtown San Fran. The Breakfast is really nice -- coffee, fresh juices, 3 kinds of cereal, very nice fresh fruit, an assortment of bagels and muffins. (Might have been some boiled eggs.) We ate there all 4 mornings and were quite satisfied with it. One of our best experiences was that they have a \"House Car\" which we used every day and it was always available when we needed it. The first day we were driven to the Alcatraz Ferry and our driver (I wish I could remember his name he was so nice) decided to give our boys a thrill so he drove us down a few winding, bumpy streets, including Lombard (most crooked street)!! He did this even though it was a bit out of the way to our destination but we had time and just loved the adventure! That that started our morning off with a bang and the boys were thrilled. It saved my husband and I having to walk them down it the next day! The hotel also gives a Wall Street Journal or New York Times each morning and the staff could not have been nicer and more helpful. Each driver we had was friendly and personable and really made the trip! I can't say ENOUGH great things about this hotel! Worth EVERY penny -- splurge and get the Bay Viewl egs we were there and just ate a larger lunch each dayre3 mo( and and it felt like we owned theend eely patio with outBreakl th Bay openas a pobt THe weather was great 0ea late October -- (Last d","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eduardo Prosacco","date":"2013-06-14 14:10:27 +0300"},{"content":"After using trip advisor for our honeymoon we had our 1st bad experience of a good bad review, and checked into no 3 at the time Inn at the Square. This was a very bad experience and a bit of a throw back to the 70's after 30 minutes I decided to go have a look at what else was available. I luckily found the Fairmont on Nobhill and for $150 got an amazing room with a view of the bridge and alcatraz. We were only staying in the bay for a night as it was our honeymoon and planned a big tour of america over 5 weeks. I was lucky enough to see an advert for Ghirardelli Square and booked that for our last two nights prior to departure. It was truly the send off we needed after a fantastic tour fo the states, driving from San Fran to Portland, to Missoula montana to yellowstone, jackson wyoming, then to vegas, death valley, yosemite, santa barbara and then back to san fran. The highlights for context were. No 1. Four Seasons Santa Barbara.(hard to beat watching hummbirds whilst drinking a coktail and watching the waves come crashing in from the Pacific.) No 2 Fairmont Ghiradelli Square for the unbelievable room. No 3 Spotted horse Ranch, Jackson. No 4 Paws Up Ranch , Montana.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mekhi Crooks","date":"2013-05-11 04:34:57 +0300"},{"content":"We stayed for nearly a week at the Fairmont and would highly recommend it! We arrived early in the day, but they graciously stored our luggage while we did some sightseeing. Later, Peter, the staff person in charge of the wine room, graciously served us wine on the terrace while we waited for our room to become available! All of the staff members were very congenial, and the concierge staff was particularly helpful. We found the complimentary house car to be very helpful (within a 2 mile radius), and the drivers generally very friendly. The 2-bedroom residence we stayed in couldn't have been more beautiful or convenient. The terrace, firepit, and gazebo were just steps outside our door along with daily serenades from the musicians below in Ghirardelli Square. The view of the bay was spectacular from our room, and we often used the table and chairs just outside our door to read the complimentary newspaper that was delivered daily. A delicious breakfast with lots of fresh fruit, cereal, yogurt, pastries, etc. was also complimentary, as well as a wine and cheese happy hour and games/puzzles! The beds and pillows were very comfortable, the kitchen well-stocked with daily necessities, and there were three large flat screen TV's. Unfortunately we couldn't figure out how to use the bedroom TV's except with DVD's - we discovered on the last day that the controls were concealed in a nightstand panel - who knew!?. The bathrooms were lovely, though a solid door separating them from the bedrooms would be more conducive to sleep for anyone remaining in bed while the bathroom was in use (the doors had frosted glass panels). The frosted panels would be more useful on the shower doors for a bit of privacy when someone else came through to use the separate water closet. There was also some street noise from pedestrians on the street-side of the hotel. Overall, the bay view, terraces, location, amenities and staff made it the perfect place to stay in San Francisco!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Dr. Britney Abshire","date":"2012-01-27 05:17:18 +0300"},{"content":"Really could not be better. A two bedroom condo in Ghiradelli square, with great views, an outdoor fireplace etc etc..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Esperanza Zieme","date":"2013-06-29 20:53:55 +0300"}],"public_likes":["Talia Baumbach","Hardy Wolff III","Wayne Blanda","Dr. Jarret Deckow","Alize Kovacek","Eva Schmitt","Sister Von","Yessenia Fritsch"],"vacancy":false,"description":"Reasonably inexpensive B&B lodging.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}