{"title":"Newcastle (Down)","name":"Burrendale Hotel","address":"51 Castlewellan Road, Newcastle","directions":null,"phone":"+44 28 4372-2599","tollfree":null,"email":null,"fax":"+44 28 4372-2328","url":"http://www.burrendale.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.2283,"lon":-5.8973,"accuracy":"APPROXIMATE"},"type":"hotel","id":20123,"country":"United Kingdom","city":"Newcastle","state":null,"reviews":[{"content":"Somebody get me out of here !!! I m still here and I m on the internet looking for a quick way back home !!! The food is terrible, the staff is lazy but the room is nice, when there s electricity . Of course, air conditionning is optional . Don t waste your money of the Elegance Club ..half the thing they promise in the booklet are not even available . Forget your pillow menu, your aromatherapy or anything that would make your trip special ...took us 4 days to get the slippers and the exclusive bottle of $@!#% champagne is not exclusive ... the 4 bottles of alcohol they promise in the room are as follow ... a 2 once bottle of vodka and 3 x 10 ounces of rhum, scotch and bailey s ... and yeah, they re not renewable !!! pools are cool if you have eskimo blood I guess otherwise you could probably use it to keep your drink cold. The Elegance Club has a self serve bar , which is a cool concept , they only forget to bring alcohol to the bar ... i ve been begging for vodka for 2 days now ... that s beside the international beers that are well presented in the booklet, yet unexistant once at the resort ...","ratings":{"Service":1.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":1.0,"Overall":1.0,"Value":2.0,"Rooms":3.0,"Location":3.0},"author":"Pauline Bahringer","date":"2012-10-23 01:34:00 +0300"},{"content":"Awful - could not wait to leave This was by far the worst vacation experience i have ever had. We warned by our travel agent that this was a new hotel and everything might not be open for our trip but I never imagined it could be so bad. Upon 1st arrival they did not have our reservation in their system and it took an hour to straighten that out and the manager was very rude. The when we finally get to our room it just had a foul odor, which I thought maybe I could just get used to. The room is beautiful but had exposed wires, broken tiles, back door didn't lock, A/C worked intermittently, and mosquitoes bit us all night as we slept. And then when you take a shower it floods the room. We called to have someone look at the door and AC but no one ever came and were told the slding doors all had the wrong locks. As for the food it was horrible - buffet was cold and the french place was horrendous. The positives were the wait and bar staff, all were very friendly but the bar had only one beer available - Presidente. The beach and pool were nice. Stay away from this place until it matures - it has potential but right now it is a mess.","ratings":{"Service":4.0,"Business service":1.0,"Cleanliness":2.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Yasmeen Herzog","date":"2014-06-13 17:08:25 +0300"}],"public_likes":["Dr. Van Steuber","Mrs. Pearlie Jerde","Ellie Simonis","Nathanael Hane","Savanna Walter","Alec Miller","Edwina Runte"],"vacancy":false,"description":"Good 4-star hotel with 68 bedrooms and spa and conference facilities. Some distance from the town centre on the road towards Castlewellan.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}