{"title":"Bridgeport (California)","name":"Buckeye Campground","address":"Toiyabe National Forest, Bridgeport","directions":null,"phone":"+1-760-932-7070","tollfree":null,"email":null,"fax":null,"url":"http://www.fs.usda.gov/recarea/htnf/recreation/camping-cabins/recarea/?recid=65272&actid=29","checkin":null,"checkout":null,"price":null,"geo":{"lat":38.2389,"lon":-119.3254,"accuracy":"APPROXIMATE"},"type":"hotel","id":4099,"country":"United States","city":"Bridgeport","state":"California","reviews":[{"content":"We stayed at the Whaler for the 2nd half of our honeymoon from December 16-22nd. We were in Tower 2, and booked through AAA/Pleasant Holidays. The first room they had us in was fairly outdated so we simply asked if they had any more updated rooms and they showed us a room on the 8th floor. It was a studio, completely re-done with a King-size Murphy bed in the wall, sofa, chair, and all the comforts of home. We had plenty of space for the 2 of us, they did offer us an upgrade to a 1 bed/bath for an extra 100/day, but seeing that is more of a hike than their original ticket price, we decided the studio was the perfect fit. We overlooked Whaler's village, but also had a view of the ocean and mountains and the perfect sunsets (the same view all units have). We stopped at k-mart by the airport and got breakfast and lunch food and went out for dinner each night. The beach area right out in front of the Whaler was great as well, it never seemed as crowded as the areas in front of the large resorts. It was a honeymoon to remember and we would definitely stay at the Whaler again.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Elyssa Gutkowski","date":"2015-11-27 12:26:08 +0300"},{"content":"The Westin Resort and Spa at Lahaina is a beautiful property. While it could use a little updating in places, it was in very good shape overall. The landscaping is excellent, and the exterior design is very nice. Our main concern was the sheer number of people who were using the property -- beach chairs sold out very quickly, and conveniently-located chairs on the pool deck could be hard to find. The resort restaurants serve very good food, and the staff is courteous and diligent.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Mr. Lauriane Parker","date":"2015-09-12 15:45:06 +0300"},{"content":"We just got back from getting married at the westin maui, sarah snider was a huge help in making this happen. they gave us a nice room for the wedding night and when we showed up there was rose pedals all over the room and a bottle of wine for us to enjoy. Everyone at the front desk was helpful and nice to deal with. The grounds for this resort were so nice we enjoyed every minute. You can see whales off in the distance right from the beach, the restaurants were amazing, i had one of the best steaks in my life at tropica. Having whalers village right next door for shpping and cheaper food was great as well. my only complaint was having to leave!!! cant wait to come back to maui it was truly paradise on earth.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ara Hermann","date":"2015-03-10 18:16:52 +0300"},{"content":"The down side was that we only booked for one week. We rented a car, but didn't use it very much so there is so much within walking distance. Anyway, a wonderful resort with a wonderful staff. I don't understand the people on here that complain about the cost of things. You're in a waterfront resort in Maui. If you want to spend less, move inland or stay home. We're booking for two weeks next year. We won't bother with a rental car for the first week, we will make use of the car in week two. By the way, we highly recommend the Blue Hawaiian Helicopter tours, it is worth every penny. Anyway, enjoy. We certainly did, and will again. :-)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lolita Kshlerin","date":"2013-04-28 03:40:22 +0300"},{"content":"What an amazing place to stay right on the ocean with beautiful amenities and plenty of opportunity to explore this beautiful get away. The lodging itself was gorgeous enough not to speak of the setting. Very comfortable room that had a jacuzzi in the bath that could open up to the room to sit and look out the window to the ocean. Very nice lanai to sit and soak in the atmosphere as well. We only ate at one spot and spent most of our time exploring Lahaina for eating establishments. The resort is close enough to take day trips away and see the sites of Maui. We enjoyed both the beach and the pool. The staff there was very accomodating. We were celebrating a birthday and I wanted to have fresh flowers in the room and they arranged that very nicely for me and included an \"unasked\" for small birthday cake for my traveling companion. They went all out to make it a wonderful stay, my only regret is that we only spent 3 days there and then were off to Oahu. In retrospect I wish our week would have been on Maui. It is a much more of a relaxing and less hurried atmosphere than we found on Oahu. It depends on what you are looking for. As for the Westin, do stay!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Mia Cremin","date":"2013-03-02 06:14:49 +0300"},{"content":"We booked our trip 11 months in advance and traveled with family with a total of 9 people total, 3 of them kids. I sent the guest manager, Sean an email a month prior to our trip to let him know this was our first trip with a Starwood Property and that we were very excited to celebrate my birthday and our anniversary during this trip. Upon arrival, we were greeted by several valet attendants who all welcomed us with huge smiles and helped us with the kids and our bags. At check in, I was excited to learn we had been upgraded to an Ocean View room by Sean. Will brought our bags up to our room and gave us a quick yet detailed run down of the property and what to do and how to get there. Our room was fantastic! Great view of the ocean, the pools and the whales every morning! We went out for dinner shortly after for less than two hours and returned to find a delicious cake and a bottle of champagne waiting for us!!! Thanks Westin! That was the best birthday I had ever had, HANDS DOWN! And that was just the first night. We enjoyed some relaxation time in the pools with the kids the first night after a long day of flying. The second day, we retrieved our vehicle from valet and the attendants told us some Road to Hana tips and even loaned us a CD with a guided tour to help us on the trip. Each and every hotel employee that we came in contact with had a smile on their face and made us feel like we were at home and were the most important person on property. The people who claim everyone was rude or unconcerned with them, I can only think that you get what you receive. Smile at someone, and someone will smile back. On occasion, the line at the front desk was long and the process seemed a bit tedious. If you want something quicker, check and see if you can find a Holiday Inn near by and go there if that's the biggest concern you have. YOU ARE ON VACATION. IN HAWAII. RELAX. The rooms are great, the beds somewhat heavenly, I am pretty picky when it comes to beds and I slept like a baby on them. The rooms were quiet, which is a huge deal for me as I am a light sleeper. The fridge was a great plus to have in the room to keep drinks cold, and a few snacks on hand with the kids. My brother in law even got a microwave in his room to warm food and formula up for their daughter. I was never concerned with anyone jumping on to my patio to break into my room, not from the 9th floor, and I wouldn't have from the 2nd floor either. The sliding glass door has two very suitable locks. Use them if you feel it necessary. The only problem I had with the property involved the internet. I never EVER leave my credit card on file with a hotel after a HORRIBLE problem with another property that you can read about in my other reviews. For some odd reason, not having a card on file prevents you from accessing the free wi-fi that comes with the resort fee. This boggles my mind, because my resort fee had been paid for, why does that not cover my wi-fi? It also covers parking and not having a card on file didn't effect this. I think that is something Westin needs to work out to ensure a better hotel experience. On one occasion, we also didn't get housekeeping while we were out, we left later in the day when they came by I am sure and a quick call to the front desk had it taken care of upon our arrival while we were at dinner. I also think there should be some double checking by housekeeping for rooms that don't get cleaned in the morning because not everyone gets up and our by 10 or 11 AM. Other than those two issues, and the fact that the parking spots are very tight and people don't know how to park in between the lines, this place is spectacular! The staff is wonderful, in fact I have never been to a hotel with a more friendly staff. There is golf right across the way, several amazing restaurants with great seafood. If you need any tips on anything, just ask the valet guys. They know everything! We even left some beach toys we purchased at their stand so if you need them, go borrow them and return them for the next kids!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hazle Miller II","date":"2015-09-10 23:30:49 +0300"}],"public_likes":["Eliseo Nader DVM","Mariane Blick","Kaitlin Graham","Joey Russel","Jeffrey Farrell","Emelie Tromp","Fae Ondricka","Mrs. Adaline Kertzmann"],"vacancy":false,"description":"Hiking trails, hot springs, firewood, toilets. No potable water available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}