{"title":"Wikivoyage:Listings","name":"Hotel Eldorado","address":"rue des Dames 18","directions":"17th, metro: Place de Clichy","phone":"+33 1 4522 3521","tollfree":null,"email":"eldoradohotel@wanadoo.fr","fax":"+33 1 4387 2597","url":"http://www.eldoradohotel.fr","checkin":null,"checkout":null,"price":"€23-39 sgl, €49-79 dbl","geo":{"lat":48.88487,"lon":2.32478,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":34194,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Pros, Cons  My husband  I just returned from a weekend at Club Med Punta Cana. It was our first Club Med experience.Pros: The weather was wonderful, the beach excellent. Water in the Carribean in Jan is not warm, but it is ok, once you get used to it. The bread in the restaurants was excellent, you have to try the chocolate bread!Neutrals: The food was tolerable. I do not eat seafood, and that is a big problem at Club med. They even put tuna on their pizzas! Yes, they always had beef or chicken, but it was not what you would find in an average american restaurant. There was an abundance of fruit at every meal, which I ate  had no problem with. I also drank a lot of sodas with ice from the bars and had no problem with the water. We did not take our teenagers with us, but they would have been unhappy with the menus. The hotdogs  hamburgers that they offer would not have been eaten by my kids-I tried the hotdog, and I wouldn't eat it either.Rooms were adequate, not luxurious, but very clean with lots of closet space. They have a small refrigerator that doesn't cool very well and 2 small safes, neither of which would lock properly. Negatives: If you don't speak french, don't expect to make a lot of new friends, don't expect to be seated with english speaking guests at dinner. My guess is that 90% of guests were french. With this comes topless sunbathing  thong bikinis; If this bothers you, you might consider another resort. Kids: Looks like a great kids club for those parents that wanted to spend the $ to enroll their children. Most children were in the infant to 6yr age group. That means at every meal there were screaming children, crying babies, and parents who have never heard of disciplining their children. While at the pool, there were a number of toddlers around the deep end of the pool with no adult close by. At the beach, there were unsupervised children galore, and I wonder why children don't end up getting hurt, since their parents don't seem to watch them very well. Dress ran the gamut from semi formal to ultra casual at all meals, but casual was the norm.Hints: If you want to spend time in the sun, wear your swimsuit to breakfast with a cover-up, and on your way to the restaurant, deposit your sunglasses, towels, books etc in a lounge chair. If you eat first, then go back to your room to change, there will not be any chairs left. On the beach, avoid the white plastic chairs, they are not as comfortable as the blue.You are expected to check out by 11, but club med provides wonderful changing rooms with lockers, showers, towels etc., so you can check out, put your carryon in the locker  then go to the beach until your afternoon departure. Don't depend on the airport transfers being included, even though it says so in your papers from your travel agent. We waited an hour at the airport trying to get transportation to the resort, and on the way home, had to pay for a taxi, since suddenly, there were no english speaking GO's around. Taxi is $10 each way to the airport, so plan ahead! It was an enjoyable getaway, but I would have to say that I would certainly book a 7 day carribean cruise before I would spend a week at this resort.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Wilfred Welch","date":"2013-06-20 23:15:15 +0300"},{"content":"Cet endroit est 脿 mes yeux Paradisiaque le Club super   showReview(6752390, 'full');","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Allie Boehm DDS","date":"2015-04-05 14:04:21 +0300"},{"content":"We spent one night after our cruise at the Marriott San Juan Resort & Stellaris Casino, we had a corner duel balcony room on the seventh floor, with an amazing view of the beautiful beach. It was a great way to finish our cruise and prepare to come back to reality. The room was clean and spacious, the bed was extremely comfortable, the staff was polite and helpful. I won $10 in their casino and was able to view my cruise photos on the flat screen tv with the interface they provided from my laptop. It was a fantastic visit!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Judge Johns","date":"2015-10-24 22:53:29 +0300"},{"content":"I tussled between average and very good for my overall rating because there was nothing that wowed me about my stay at the San Juan Marriott Resort - in fact there were more things that pushed my stay toward average than very good. Let me explain... CHECK-IN: We arrived early (well before 4:00 PM check-in) on Monday, April 2nd. I was very happy the front desk was able to accomodate us early but not so happy that the front desk clerk seemed a little robotic and a tad bit unfriendly. I'm never expecting cartwheels but actually looking up at me as you're speaking to me and a smile would be nice. ROOM: We get to our room and it's typical full-service Marriott - comfy bed, too soft pillows, typical amenities, the usual. On the upside, the room was airy and clean (except for the hair left behind on the bathroom floor), there was a fridge and the partial ocean view from our \"city view\" room was a definite plus! HOTEL AREA: If you're visiting Puerto Rico looking for a rich, historical and cultural experience be sure to rent a car and venture far from the Condado area and this San Juan Marriott. This area of San Juan felt more like South Beach Miami to me. It wasn't until I ventured out of the area that I felt like was in Puerto Rico. High-rise condominiums, Starbucks, Walgreens, Fuddruckers, Pizzeria Uno's, Wendy's, Chili's are all within walking distance from the hotel (all of which I can get at home) -which brings me to my review... FOOD: We ate breakfast at La Vista in the hotel and honestly, the best thing about this restaurant was our server Senora Clarimar and perhaps the view (running a distant second). Clarimar was genuinely friendly, she was sweet and extremely helpful with guiding us on what to see in Old San Juan and other parts of Puerto Rico. The ONLY reason we chose to eat there a second time was because of her and the wonderful service she provided. Otherwise, skip it!!! La Vista is drastically overpriced (buffet 24.95 pp) and the food was edible but not great. As we took an early morning walk around the neighborhood one day, we noticed a few local spots serving breakfast for much less. Take the walk and save a bunch! GETTING AROUND: We rented a car which I definitely suggest. I bought my GPS along which I HIGHLY recommend. GPS may not be as reliable in PR since road changes accur so often but it's good to have and a general guide. One morning before heading off to the rainforest (which I'll review seperately) we stopped to ask the concierge for directions. Without looking up, she handed me a pre-printed direction card and sent me on my way. ***SIGH*** HOTEL ACTIVITIES: We didn't spend a great deal of time at the pool so a review wouldn't be fair. I can say that there's an activity board posted daily so check that for what's happening around the pool. Included as \"justification\" for your hefty 16% resort fee is a one hour two bike rental. Use it! The pre-printed resort fee \"justification\" card says one bike, two hours but Senora Rita at the activities desk quickly made the correction for us. One note of caution, when biking on the streets in the area BE CAREFUL - drivers in PR are unforgiving! CHECK-OUT: I didn't wait long to check out and was disappointed I had to wait at all. The in-room express check-out wasn't working. I stay at Marriott properties because, for the most part, I know what to expect. Some stays I am wowed and that's because of the people and service. This Marriott did not WOW me and I'm not sure I'd stay here again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Laurel Wiegand","date":"2014-08-09 09:47:08 +0300"}],"public_likes":["Melvina Hirthe","Frances Von PhD","Hanna Murazik","Ricky Jones","Jannie Bode","Dr. Monserrate Weimann","Brycen Ullrich","Toby Willms"],"vacancy":false,"description":"The Eldorado, a former ''maison de rendez-vous'', was once home to the kept women of the 19th century bourgeois. Now a very cute ''no'' star hotel, its charm more than makes up for what it lacks in amenities (who needs a TV in Paris anyway?). The  staff are super friendly, the décor is garage sale chic, and there's a lovely courtyard that fills with neighbourhood hipsters on warm evenings. It also has a very good location and you can easily avoid the noise of Pigalle or Montmartre's high prices, but they're within stumble distance if you decide to explore. For early risers breakfast (€5, until 10:00) is served in the attached restaurant/bar. Some English spoken, especially for those who pet the cat sprawled across the reception desk.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}