{"title":"Paris/1st arrondissement","name":"Hotel Henri IV","address":"25 Place Dauphine 75001","directions":"Métro: Cite","phone":"+33 1 43 54 44 53","tollfree":null,"email":null,"fax":null,"url":"http://www.henri4hotel.fr/home.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.85672,"lon":2.34185,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21721,"country":"France","city":"Paris-1ER-Arrondissement","state":"Île-de-France","reviews":[{"content":"i am going to tell you the things that i disliked first since i am assuming you need to have that information first this was a well deserved family vacation and I was prepared to spend money I had done my research about this hotel and was mentally prepared for sticker shock My children are a 15 yr old son and 10 yr old daughter - they loved the place. they are easily pleased as we usually are From their point of view, the pool and beach were fantastic and we certainly kept them busy- the concierge set us up with a car rental (disgustingly dirty and older model)snuba diving, snorkeling, Pearl Harbor, and a helicopter ride. I had already planned surfing lessons at Blue Hawaiin and the luau at Old Lahaina both were well worth the money and trip to lahaina. The thing that I can advise is plan ahead - dont waste a half a day with the concierge and it is more expensive through them. upon arrival we were greated by Rosie who was very friendly- you have probably read reviews about her- but she only said aloha Check in was a different story, being hilton honors members and taking 2 rooms for 10 nights didnt get us a thing we were in rooms 5118 and 5120 not a great view - too low if you are in this part of the hotel, you have to be ready to walk to the main pool and beach area it is far!! if you are having health issues definately ask for a closer room- you may go through the grand ballroom for your car but this is a very large hotel and spread out-the room was slightly dirty some mold in bathrooms but after talking to housecleaning they took care of it during turn down service - which i personally love I got sick there with strep throat and went to the clinic in kehei- they couldnt have been nicer at clinic however when we ordered room service that was an eye opener! expensive is too mild-holy cow for 1 mozzerella appetizer, four soups, house salads and 4 sodas i spent almost $180! then the second night my daughter got fish and chips with a bone in it that could've killed her! no exaggeration!! it was the size of a tooth pick and as sharp! they said that we wouldnt be charged but I am still fighting that one with them-the rush for the pool chairs is certainly true unless you are willing to pay $300/day for a cabana-which seem to take up all the space around all of the pools - you can get chairs however by the adult pool near the beach and the staff there were great they expected to be tipped but at least they smiled and made you feel good about spending money to sit down if you can get the breakfast buffet it is worth the money, although I must agree with reviews about the birds - too many and it is a health concern we watched them cr.. on the tables next to us the hotel should consider netting-one more thing - i booked photos with the hotel photographer, at sunset on our last day there - that didnt turn out well-he double booked and he tried to divide his time with us and them the other family complained quite loudly and took over the session - I am currently waiting to see if he gives us the discounted rate that he promised to - the hotel is absolutly breathtaking and there is a premium for that beauty one of the nicest places on the island of maui and the property is immaculately maintained the pools are fantastic and they even have manicure and pedicure services poolside along with popcorn and slushies! the restaurants are great but you would do better eating out if you are looking to save money somewhere hard rock in lahaina was really good and less then half the price of the grand wailea the pizza place across the street from hotel, matteos, was not new york pizza so we did not care for the sauce at all - plus im italian so its hard to compare any gravy to mine haha the overall feeling from the people on maui is laid back, kind and considerate great vibe from almost everyone i dont want you to think that we didnt have a fantastic time, we did i just thought that you would want to hear about these things so that you can be better prepared when you step off the plane onto paradise!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Granville Ferry","date":"2014-04-16 00:09:26 +0300"},{"content":"Staying at the Grand Wailea is definitely an experience. The grounds are phenomenal, the rooms are gorgeous and the staff is helpful and will do just about anything for their guests. The pools are spectacular. This resort is just about perfect. My family (2 kids ages 6 and 9) had a great time. However, perfection comes with a price. A standard mixed drink at the pool and lobby bar was $14.00. Regardless of price, if you are hanging out at the pool and use the slides from pool to pool, one should invest in the cool plastic Pineapple container for your drinks ($21.00 initially and $14.00 for cocktail refills). It has a handy sealed lid to keep your drink somewhat safe as you slide from pool to pool or if you drink too much. Once you get home, the pineapple doubles as a piggybank for the kids or your next trip back to the Grand Wailea. The Spa Grande is one of the nicest spas I have ever been to. The Terme baths are unique! Here's the stuff you may or may not care to know: The daily resort fee was $20.00 plus valet parking is mandatory at the resort at an additional $25.00 per day...not to mention every time you want your car, you have to fork over more money for a tip for the valet. Our room contained a king size bed and a pull out couch for the kids. The first night we had to put sheets on the pull out couch. Fortunately, the sheets and blanket were neatly sealed in a box in the closet. I am not super high maintenance but it would have been nice for the staff to recognize our reservation would be using the pull out couch and prepared accordingly for our arrival. The bed for my husband and I was super comfortable and we slept well but the mattress topper had obviously hills and valleys in it which to me indicates wear. Again, I am not the type who is going to demand for my bed to be ergonomically redesigned for my liking on vacation, so I just dealt with it. Other than my small complaints, The Grand Wailea is awesome. The Grand is not necessarily for those who are frugal like myself. However, I work hard and play even harder so the expense of staying at the Grand Wailea was completely justified in my eyes. I will be going back!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Victoria Wiegand","date":"2013-07-06 20:05:32 +0300"},{"content":"We stayed last weekend at the Grand Wailea. What a weekend it was. The grounds are so beautiful. Its like a nature hike with a bonus of tropical flowers and plants. The room was very nice, lots of room to relax, sitting on the balcony watching the weddings from the Hawaiian Wedding chapel was special. The ocean view of Molokini was great, the over view of the property and also people watching is always fun. The staff at the hotel are very nice and always looking for someway to make your stay more enjoyable. We live on the other side of the island, but it was so nice to be pampered for the weekend. All of Maui is so beautiful and staying at the Grand Wailea they take many flavors of the island for us to enjoy at their resort. We will definately be back to stay at this resort if just to relax and recharge our batteries.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Zoe Kshlerin","date":"2012-11-07 14:51:45 +0300"}],"public_likes":["Eunice Lang","Wilford Greenholt","Hobart Ferry","Reynold Schmidt","Laron Reichert","Ms. Reanna Price","Louvenia Bernhard","Vivianne Huel","Emelia Waelchi"],"vacancy":false,"description":"A few steps from Notre Dame and the Louvre, nearby Boulevards Saint-Germain-des-Prés and Saint-Michel, 3 min from Subway Pont-Neuf and only 30 min from Paris Orly airport.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}