{"title":"San Francisco/Fisherman's Wharf","name":"Hyatt Fisherman's Wharf","address":"555 North Point St","directions":"between Jones St and Taylor St","phone":"+1 415 563-1234","tollfree":null,"email":null,"fax":"+1 415 486-4444","url":"http://fishermanswharf.hyatt.com/hyatt/hotels/index.jsp","checkin":"3PM","checkout":"noon","price":"$250-$350","geo":{"lat":37.8059,"lon":-122.416,"accuracy":"APPROXIMATE"},"type":"hotel","id":25674,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I stayed here for work the first 2 weeks of August. It is right by I-5, so ask for a quiet room on the opposite side unless you like highway noise. Even the \"quiet side\" gets highway noise but you get used to it. There is a large 24-Hour Fitness across the street which the hotel has an agreement with, which was great and convenient as well. There is also a Starbucks next to the gym. Hotel provides free breakfast (eggs, waffles, cereal, fruit, oatmeal, etc.). Rooms are clean and average - small from a suite perspective. I was able to walk from the hotel straight down Stewart Street to the Fish Market in 15 minutes (but I walk fast). There are better\\cheaper hotels closer to downtown and free bus stops. If coming for vacation or for a day or 2 - you are better off using Priceline and bidding for a 5 star downtown. Hotel parking is $18 day. I didnt see the cheaper parking lot that others have indicated.","ratings":{"Service":3.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Dalton Mertz","date":"2012-04-10 05:14:49 +0300"},{"content":"My daughter and I stayed at this well-priced hotel ($99 a night for a king suite) for two weekend nights, and I was really impressed with the exceptionally welcoming service from the time I made my reservation through our departure. Every hotel employee we talked to seemed really friendly and eager to help with our questions. I was amazed in this day and age. The L-shaped hotel pool is tiny, but looked like fun for kids, and there is a hot-tub and exercise room as well. Breakfast was indeed abundant. We could make our own waffles, then add scrambled eggs, bacon, sausage and fruit. Also available were bagels, muffins, oatmeal, yogurt--just about everything you could have wanted. One morning there was sort of a long line, waiting to make waffles, and then waiting for scrambled eggs. But that's being picky. Our room was really nice (we asked for one away from the freeway after reading reviews here earlier) and it was still a bit noisy, but hey, it's the city. It felt like a deluxe room, considering the reasonable price, with nice bedding and even art on the walls that we really liked. We could even see the Space Needle a bit from our window. The shuttle runs hourly, so it wasn't as though we could reserve it to go to a certain place at a certain time. But it worked out well for us, and when the shuttle missed us by just a minute when we needed to return from the Space Needle, they promptly paid our cab fare without my even having asked. We will definitely go back when we have a need to stay near downtown Seattle again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Avery O'Conner","date":"2012-01-19 03:26:12 +0300"},{"content":"We bought two nights at this hotel through an online site that does not disclose what the hotel is but only the rating before booking, (hotwire I think...) We took a big chance and really lucked out! The hotel has a modern edge but has very funky older yet classic rooms which were large with VERY comfortable beds. Our suite had been recently renovated and we thought it was perfect for our small family of three. We had a fantastic view and really enjoyed our stay! The best thing about the hotel is the area and tremendous choice in restaurants and shops! There is everything that you could ever want or imagine and it was also a short drive to the famous market and other hot spots including malls. We will definitely stay there again!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Jonathon Brakus","date":"2015-10-30 23:45:14 +0300"},{"content":"I came Seattle for a brief stay last week, and I have to say it was one of the best experiences I've ever had. First, I called a week before explaining that my single occupancy had to be changed since I had a friend coming to stay with me. They immediately made the change for me with no additional fees. One of the main reasons I chose Hotel Deca was because of it's close proximity to the Neptune Theater. I had plans to see a concert there, and it's across the street. When we arrived, we met with Front Desk clerk Emily. She was friendly and personable, and made sure that we had a room with a great view of the city skyline. Later, we learned that they had a shuttle service, and another clerk suggested we eat at Ivar's Salmon House for dinner. He drove us there, and later picked us up. The dinner was delicious. The next day, we met with another clerk Ryan. He, also, was very helpful in providing suggestions on where to go. Our room was great! Clean, spacious, and comfortable. The only downside is that taxi service from the airport to the hotel ranges up to $50-60. Hotel Deca does have a car service which comes at a flat rate of $50. The car service was prompt, and the driver was very friendly. I do recommend that you call ahead of time to make arrangements for the service. Overall, it was a fantastic stay, and I wish I could have stayed longer. If I make another trip to Seattle, Hotel Deca will be my hotel of choice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kurtis Hackett","date":"2015-02-04 08:27:13 +0300"},{"content":"We stayed at the Hotel Deca last week for 4 nights and had our son's rehearsal dinner in the Governor room. It was all wonderful! The rooms were clean and attractive and well maintained. the view from the 15th floor was amazing. The catering staff, Governor room, food, bar set up, were all great. There were lots of restaurants close by. This part of Seattle was not a \"garden\" spot - streets dirty, creepy people, but Deca was immaculate, safe, an oasis in that part of town. Providing transportation from the airport would have been helpful since they have the shuttle and seem to go to other places in town. But, we were able to park our rental van there at no charge. I liked that you needed to use your room key to use the elevator.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Larry Macejkovic","date":"2012-01-04 14:24:47 +0300"}],"public_likes":["Haleigh Wintheiser","Aniyah Schneider","Leonor Nolan","Oleta Orn II","Barney Spencer","Haskell Feil","Myrtice Hudson"],"vacancy":false,"description":"Modern hotel with full-service and clean and comfortable rooms.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}