{"title":"Denbigh","name":"Guildhall Tavern","address":"LL16 3NU","directions":"Near the statue of HM Stanley on the square","phone":"+44 1745 816533","tollfree":null,"email":"info@guildhalltavernhotel.co.uk","fax":null,"url":"http://guildhalltavernhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.18353,"lon":-3.41855,"accuracy":"APPROXIMATE"},"type":"hotel","id":7624,"country":"United Kingdom","city":"Denbigh","state":null,"reviews":[{"content":"Our family of 8 people, including a 4 month old, was really looking forward to a nice relaxing vacation at the Biltmore over the Memorial Day weekend. As an added bonus, we got a great rate ($100/night including the resort fee!) for three rooms. That's where the excitement stopped. We had problems getting what we asked for (we are talking simple things like towels and ice), the pool was packed and ridiculously expensive with terrible service and rude people, and parking was awful. Check in was easy, however, with a baby, I needed a crib and a microwave brought to our room. When we got to our room, it was the furthest set of buildings in the hotel and a little worn out – could use some updating. I was told to use the refrigerator in the room, I’d have to empty the mini bar. When I went to empty it half of the bottles were open and half drank and never replaced. Gross --- not to mention I’m sure an extra charge to me. The crib came within an hour of check in without a hitch, but the microwave was a $25 charge, took 5 phone calls to get, and interrupted our baby's sleep by finally getting it at 9:15pm (11:15pm our local time) after we had been told they were out and we wouldn’t get one until the next day and were already in bed. To get ice in this hotel, you need to call food service, who then brings you a little container. You can’t take your ice bucket to get it yourself. When we asked the person who came if we could get more, he told us the first floor maid area had some if we wanted to go there to get it – of course this was after we had to tip the guy. In my parents’ room next door, they had the smoke detector going off in the middle of the night because of a dead battery. They called to get it fixed—the front desk sent an “engineer” who pulled the smoke detector off the wall and left the cord hanging. It was fixed two days after it was reported. We spent Saturday and half of Sunday at the Paradise pool. Our group is all early risers, so getting a chair wasn’t a problem, although it was for many around us. Our problem was they don’t start serving food at the pool until 11:30, and when they do, a cheeseburger is $18. A few people in our group ran to Safeway and brought back donuts for breakfast and sandwiches for lunch. We were a big group, so it would have been expensive to eat there. Upon bringing the donuts down to the pool, we were told that they served food in this area so carry-ins weren’t allowed. At 8:30 in the morning the line at the coffee shop was out the door and around the corner and the pool grill didn’t open for another 3 hours – give me a break, not to mention that it wasn’t posted anywhere because we looked. Our family is usually a pretty “go with the flow” kind of family, who gets along with anyone and doesn’t say much, which is why I felt compelled to write this review when we all felt strongly about our stay. The grounds are very pretty (which you see on your 20 minute walk from the parking garage), but we felt nickel and dimed the entire stay, the rooms could use updating, and the level of service we received was barely par level and certainly not what I was expecting from a place with the reputation of the Biltmore.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Myrtie Wuckert","date":"2013-12-08 10:08:03 +0300"},{"content":"Well I am writing this review from my room at the biltmore, and I have to say that the hotel is wonderful and beautifully maintained, and the service is top notch. When I checked in I was upgraded to a terrace suite in the newly renovated wing, and the resort fee was waived. I am impressed with the decor in the room, it is well appointed and feels like home. The plasma tv is huge, and the bed is very comfortable. The bathroom is beautifully done with double vanities, and a soaking tub with a large walk in shower. There are three phones in the room, and plenty of choices with the lighting. I also enjoyed sitting out on the terrace with the comfortable outdoor furniture. The staff is friendly and helpful. I just ordered room service, and they are preparing something for me that is not listed on their menu. I am enjoying my stay, it is a relaxing retreat in the city, and I would definitely return. This is a first class hotel all the way. The service is excellent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Carolyn Schaefer","date":"2013-01-18 23:27:21 +0300"},{"content":"My husband and I just spent 5 nights at the Biltmore for AZ spring training and golf. The hotel is stunning - the architecture and grounds are beautiful with the mountains as a backdrop. The fitness facility was great - not the most up to date machines, but plenty of selection and the locker rooms included access to steam/sauna, etc. Very relaxing! All of the staff that we encountered were super friendly and accomodating and we met some really great locals and guests while sitting around the fire pits. As per previous negative reviews, the food and drinks are pretty expensive, but there are plenty of off property options to take advantage of. Golf was expensive as well, but no more so than equivalent courses in the area. And, yes, the hotel is \"older\" but we felt that the history made it more interesting. We would definitely stay again. Be sure to walk through the neighborhood - there are some amazing properties.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Jovani Wolff","date":"2014-03-14 05:39:59 +0300"}],"public_likes":["Okey Hayes","Bethany Dickinson","Karlee Bode V","Dale Fisher","Mauricio Graham"],"vacancy":true,"description":"A hotel and pub in a restored Grade II* listed building steeped in history, with a strong heritage of association with the crafts or guilds of Denbigh Town, which included glovers, weavers, smiths, shoemakers, saddlers, curriers and tanners.","alias":"Tafarn Neuadd y Gild","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}