{"title":"Beverly Hills","name":"The Beverly Hilton","address":"9876 Wilshire Blvd","directions":null,"phone":"+1-310-274-7777","tollfree":null,"email":null,"fax":null,"url":"http://beverlyhilton.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.066632,"lon":-118.413193,"accuracy":"ROOFTOP"},"type":"hotel","id":3422,"country":"United States","city":"Beverly Hills","state":"California","reviews":[{"content":"My wife and I stayed at the Hyatt Oct 26th thru Oct 31st. The Hotel is in an excellent location. You are in the heart of the theatre district and steps away from the play Wicked. We arrived to the Hotel by noon and were able to check in with no problems. Our room was on the 8th floor and had a nice view of the downtown area. We did not use the restaurant at the Hyatt because of the price. Breakfast for two could easily could run $40.00. We opted for a Starbucks or Dunkin donuts that appear to be on every corner for breakfast. Renting a car would be a waste of money if you plan on just hanging out in the downtown area. My wife and I walked everywhere. The subway is a breeze to figure out and cheap to ride. That appears to be the primary mode of transportation and is very clean and safe. Please e-mail me if you have any questions. pep078@yahoo.com","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Maximillia Smith","date":"2013-11-17 07:53:42 +0300"},{"content":"The location was PERFECT. Very close to Boston Commons, where the freedom trail begins, Quincy Market and Aquarium. The elevator thing was NOT a big deal at all. My biggest problem was we checked in at 9:30 at night and our room was NOT ready and they could not give us a time when it would be. They gave us a king room ( for three of us) and we had a very uncomfortable night. They did move us to a room with two doubles in morning. When check in is at 3 your room should be ready by nine. Consierge was EXTREMELY helpful and pleasant.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":2.0,"Overall":2.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Linwood Beier","date":"2013-01-23 15:21:38 +0300"},{"content":"The Hyatt Regency Boston is by far the most superior hotel I have ever stayed at. Having always used Marriott in previous trips, I decided to venture out from the norm and book the Regency. Upon entering, I was immediately intrigued by the elegance of the building and decor. Every employee I encountered always had a smile on their face and was willing to help. The staff was very knowledgeable on the surrounding city and I often utilized their advice for restaurants and things to do. Even the bell staff was willing to answer questions about directions and such and were always one step ahead in opening the doors and helping with bags. I was very impressed. The room we stayed in was gorgeous. We were on the 19th floor overlooking the city. The views were breathtaking. Waking up in the morning and looking out over the surrounding area was a pleasant experience. The architecture of the hotel was also impressive. Stepping off the elevator, there was an atrium that was three floors tall. Instead of walking out into a narrow and claustrophobic hallway, we were greeted with a sitting area complete with artwork and statues. Normally, hotels focus their main decorating on the lobby. But this hotel had all the right touches in all the right places. The beds were one of a kind. I have never felt so rested before. Everything about this hotel will make me want to choose Hyatt in the future. I forget exactly what the nightly rate was, but it was definitely worth every penny. The fitness center was well-equipped and the pool was very nice, complete with sauna, steam room, locker room, showers, and rest room. The restaurants also looked very good, but I did want to leave the hotel to walk around. Next time I will definitely dine in the restaurants. The only downside was the expensive parking garage.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Gavin Hilpert","date":"2012-10-22 11:25:47 +0300"}],"public_likes":["Dr. Aimee Langworth","Malcolm Bosco","Jody Kohler","Joy Torp","Sonny Luettgen","Willow Willms","Darryl Bode","Mrs. Myrl Prohaska"],"vacancy":false,"description":"Walk to Rodeo, enjoy the restaurants along the way.  Be sure to stop at the Buena Vista Cigar Club and say hello to Rigo - ask him to make a recommendation and enjoy a good smoke.  Or stay in your room and order up room service and be treated like royalty.  Circa 55 in the hotel has a delicious roasted crispy duck, or you can walk next door to Trader Vics and enjoy a Mai Tai made right.  You may not spot a celebrity here, but you will definitely be treated like one.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}