{"title":"Helensburgh","name":"Imperial Hotel","address":"12-14 West Clyde St,Helensburgh, G84 8SQ.","directions":null,"phone":"+44 1436 672320","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":56.00308,"lon":-4.73468,"accuracy":"APPROXIMATE"},"type":"hotel","id":11377,"country":"United Kingdom","city":"Helensburgh","state":null,"reviews":[{"content":"we stated at this hotel for only one nite and wished we had stayed here on a previous trip. The staff at check in are fantastic, the hotel is modern, clean, comfortable, and has a fantastic free internet thoughout the entire hotel- we were Sooo impressed. The only thing missing is a swimming pool, but having paid a lot more a couple of weeks earlier, for another hotel with a pool, then finding we didn't use it because we were always out and about, we found this less important to us.We were thrilled with the high speed internet, and would happily sacrifice a pool for that. We also felt, no pool possibly was the reason there were no children about tying up the computers, playing games- we experienced this at another Singapore hotel when we urgently needed some travel information. The breakfast was good, the location, is good, the staff were all excelent, all in all, we had no comlaints, infact couldn't fault this hotel. We had been told, by others, that the beds were hard, we would say, they were on the firm side, however, we slept well. We would not hesitate in strondly reccommending this hotel, as good value, up to the minute equiptment, and overall fantastic..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Waldo Ebert","date":"2014-06-28 23:12:09 +0300"},{"content":"Ibis on Bencoolen street would steal your heart (and not your money) and leave memories to cherish no sooner you enter the Hotel. The staff at reception very courteous at the reception was real quick to check in. The Hotel stands clean and extremely organized in every aspect be it rooms, hygiene, food, extra services. A no-frills hotel, provides free high speed internet (which worked quite well) and meals are very economical with a good amount of options. Their respect for global cultures was reflected in their prompt agreement and arrangement for vegetarian food options (although repetitive each day). Strategically located, this hotel is 5 to 10 mins away (by cab) at the important Marina Bay Financial Center,Orchard Street and Little India (hence Indian food not far away). Recommended for both, business and Leisure travelers, the Ibis on Bencoolen provides all basic requirements. It has a bus stop and a cab stand right outside the hotel. Bedrooms and bathrooms are compact, but not uncomfortable at all. I got everything I asked for. The Europeans (French) know what i'm talking about.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Keon Walter","date":"2015-02-21 23:18:07 +0300"}],"public_likes":[],"vacancy":false,"description":"In the centre of town on the sea front.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}