{"title":"Paris/8th arrondissement","name":"Plaza Athenee","address":"Avenue Montaigne 25","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.dorchestercollection.com/en/paris/hotel-plaza-athenee","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86635,"lon":2.3043,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21852,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"The maui prince is along the long strip of South Maui hotels...not nearly the caliber of the four seasons or the grand wailea...but then again, the price isnt as ridiculous as well. We were glad we chose the prince though, because you're in hawaii....how much time do you really want to spend in a hotel room? The staff was friendly enough. Seashell leis, cold towels when we got there. The housekeeping kept our room nice & we got a lot of towels from them. The pool was fine, small, but that kept it from being a kid zone. Never had troubles getting spots under the canopies & the drinks were good (though pricey). Hottubs were fine as well. It worked out well for us though. We got on the top floor & had a garden view, but when your view overlooks a lush golf course & a mountain, it's still not bad, so I didnt miss that we couldnt really see the ocean. It's a short walk anyway. The hotel room was slightly dated...could use an upgrade, but it wasnt bad. our shower had a leak in the faucet on the first day, but was fixed by the 2nd. There's a mini fridge in the room that you can use & they give you 2 bottles of water at the beginning. The room safe was free & handy to have. The AC worked fine, though we mostly had our door open w/ the screens because the weather was so nice. Bed was nice & soft, felt great. The tv was kinda lame, but then again, we didnt watch too much. They had internet hookups in the room (for ethernet ports), & I had thought it would be free, but it was about $40 for the week. Our room was on the south side of the hotel & overlooked the garden area where they held the Luaus. THAT got reallllly old after awhile & we were glad we never paid to go to it...we just got a bottle of wine & sat on our lanai & watched. Saved $80 each & we could go inside when it got too cheesy. Instead we went on a dinner cruise & had a great time. We also went on the early morning snorkeling trip from our beach on the Kai Kanaii. The staff there were excellent & it was a great trip, esp since we just walked right out of our room for it. We had breakfast once at the hotel buffet, but only once, as it was $25/person & we felt that was a little overpriced. The birds seem to fly around all over Maui & hop around on tables, so guard your food well...even with good wait staff, they'll take advantage. The beach at our hotel was fantastic...mostly sand & very secluded most of the time. on our snorkel trip we were about 200 ft out from the beach & swam with huge seaturtles (it's one of the 'turtle towns'). About 1/2 mile to the south is a great black sand beach where you can see the turtles from the shore. We never swam there as the water was too rough when we went. Big beach to the south is great too, very classic. Snorkeling around south maui is excellent. We rented equipment at Maui Dive shop (a heck of a lot cheaper than the hotel) & went to as many beaches as we could. BEST ADVICE: buy the \"maui revealed\" book & bring it with you everywhere...it's the best resource for places to see, eat & go.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Jazmin Strosin","date":"2012-04-30 11:11:27 +0300"},{"content":"We just returned from Maui. We stayed at the Maui Prince and the Sheraton Kaanapali. Maui Prince was by far the favorite. We had ocean front rooms in both hotels. At the Prince on the fifth floor, we saw a lovely crescent white sand beach, Lanai and Earthquake Hill in the distance and koi in a landcaped stream right below the room from a spacious lanai. At the Sheraton, we saw a sea wall in building 6 off our balcony with just room for two chairs and a small table and the ocean with no beach. Yes the room at the Sheraton was fresher with a bigger bathroom but the hotel was more crowded and I felt that I could have been at any beach. The bed at the Prince was a winner. At the Prince, there was still a feeling of old Hawaii and relaxation. As a bonus, I could step out of my room at sunrise and see it over Haleakala framed by the huge garden atrium with waterfalls and a stream. At the Prince the beach lounge chairs and pool cabanas and valet parking were complimentary. The Sheraton charged for all three amenities. A lounge chair rental on the beach was $10.00. We did enjoy the luau at the Sheraton with prime seating at ring side for just an extra $10.00 with Maui Adventures. The Sheraton told me prime seating was sold out. All in all we enjoyed the beauty and serenity at the Maui Prince at Makena. Snorkeling off their beach is great and I swam with two sea turtles. There are lots of coves in Makena to explore. Spend the extra $ and rent a convertabile car to see t he island.","ratings":{"Overall":5.0},"author":"Anais Bogan","date":"2015-03-22 17:51:11 +0300"},{"content":"This is the baby boomers delight!!! Rember old Maui when we couldn't aford more than a tent at Makena beach? Well, you can't do that anymore, but if you want to walk a trail through the trees to Makena stay here! Soon this classic will be torn down and investors will start over with some huge place that will be way over priced. The Prince still has the ambience and beauty of a stylish garden hotel, and the pictures on line do not lie. The aloha spirit is fabulous as staff will bend over backwards to make your stay comfortable and happy. The rooms are spacious and comfortable enough. We moved to an oceanfront room and spent most of the time on the lanai watching for whales. Because the Prince has lost its reputation for swank, there were not the usual wannabe's we experience at other hotels...and we had the pool virtually to ourselves and a few other readers. The beach in front of the hotel is in a little cove and protected from the wind. We hope to stay here again before it bites the dust...","ratings":{"Service":5.0,"Cleanliness":2.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":5.0},"author":"Evalyn Franecki","date":"2015-12-15 13:58:41 +0300"},{"content":"The rooms are dated like everyone says. However, they aren't that bad. I found the rooms to be nice and clean. The beach is nice. The pool was small. The hotel service was nice, friendly and accomadating. The downside of the Prince is there is very few choices for dining. If you just want a causal meal during the day you needed to eat at the pool bar. During the evening the only choice is their high end restaurant, which appearred not to get much activity. For breakfast if you wanted buffet you are at the right spot, however, if you just wanted something light you are out of luck. So you need to go into town which is a 15-20 minute drive. Our biggest gripe was our unfortnate timing with a World Championship competion being held at the hotel during our entire stay. They let us know at arrival that it will be noisy with loudspeakers, helicopters, celebrations etc, I just wish they would of told us when I was making my reservation!","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Fabiola Vandervort","date":"2013-09-23 19:53:11 +0300"},{"content":"My husband and I had stayed at the Maui Prince August 30-September 2, 2007 to celebrate our anniversary. We had booked a prime ocean view room and the view was just gorgeous. We had the top floor, room 526. The room was clean and very spacious. The lanai was large with good outdoor furniture which included a drying rack (good for drying dive equipment)! We enjoyed the pool bar and the Molinkini Lounge. All staff were very professional and friendly. Big Beach is within walking distance of the hotel. The Maui Prince has beautiful and lush gardens to enjoy. We will most definitely return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Camryn Simonis","date":"2012-02-20 01:22:39 +0300"},{"content":"I have never written a review of any travel experience before; however, I believe the courtesy and excellent service extended by this hotel should be shared; as well as our experience at this wonderful hotel, as a whole. We had just found flown into Maui and found out, when we picked up our rental car, that the road to Lahaina was closed due to a brush fire. We immediately phoned the hotel in Kaanapali (one of the large ones- which will remain unnamed) where we had been originally booked to stay. We asked for referrals to other hotels under the circumstances and they gave us no information. So, we were essentially - on our own. After trying several hotels in Kihei and Wailea which were booked because of the fire created chaos; and, finding that other hotels that still had rooms were extorting high room fees because they realized people had no choice -- we stumbled upon Maui Prince. What an incredible relief! The atmosphere was extremely relaxed and beautiful. Rather than overcharging, they stated that they understood the predicament of the people caught in the fires and gave us a special rate. The grounds are beautiful. It was like a Zen type atmosphere. The food was great. All of the employees showed extreme courtesy. I highly recommend the Maui Prince Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Cassie O'Hara","date":"2012-10-24 14:40:20 +0300"}],"public_likes":["Meagan Harber","Manuela Williamson","Jaylan Rath","Demarco Lubowitz","Ms. Enrico Wintheiser","Jovany Pfeffer"],"vacancy":false,"description":"The legendary hotel in Avenue Montaigne and home-away-from-home to numerous celebrities is undergoing an expansion, after the ownership (Sultanate of Brunei) purchased three adjoining buildings. While the Plaza Athenee remains closed between October 2013 and May 2014, the well-heeled patronage is invited to stay at another Dorchester Collection property in Paris, ''Le Meurice'' in [[Paris/1st arrondissement|the 1st arrondissement]].","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}