{"title":"Epernay","name":"Chateau Les Aulnois","address":"61, Rue du Général de Gaulle, Pierry","directions":null,"phone":"+333-26-54-27-23","tollfree":null,"email":null,"fax":null,"url":"http://www.ila-chateau.com/aulnois/","checkin":null,"checkout":null,"price":"from €150","geo":{"lat":49.01893,"lon":3.938652,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":8962,"country":"France","city":"Pierry","state":null,"reviews":[{"content":"My husband and I booked our honeymoon through travelocity to stay at Paradise Point Resort and Spa. I was a little nervous because when we normally book trips on-line, we are somewhat familiar with the city and hotels. For this trip we had to total trust customer reviews and the hotel website pictures because neither of us had been to San Diego before or heard of Paradise Point Resort. We got a great rate, and upon arriving at the hotel, the staff was extremely friendly and accomodating. When I happen to mention in passing that it was our honeymoon, they upgraded our room (even though we had pre-paid through travelocity). Throughout our stay they were accomodating of our needs and extremely helpful with suggesting restaurants, local attractions, etc. We enjoyed our guest room and found it very comfortable and cozy. We had a suite that you walked directly into from the driveway, and it had a private patio with a little creek behind it. It was very relaxing and very different from a traditional hotel experience. The location was great too. We rented a car and found it very easy to get around San Diego and its surrounding areas. It would only take between 2-10minutes to get anywhere, even downtown. And, our room had a parking spot right next to the door, so parking was extremely convenient. Although we were spending our honeymoon there, we were also impressed with how family friendly Paradise Point is (yet, we didn't feel over run by kids- definitely a plus for newlyweds just wanting to spend some quality-quiet time together for their honeymoon). We feel as though when we have a family we would definitely go back and stay there. Overall, Paradise Point was a great experience that I would recommend to family, friends, colleagues and anyone else. The pictures that you see on-line are a true representation of what you see and experience when you get there. I would go back in a minute and as my husband says....that means/says a lot considering that I am a picky traveler when it comes to cleanliness, comfort, and quality :)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Guy Donnelly","date":"2013-05-18 06:52:46 +0300"},{"content":"My now Husband & I live in San Diego and were planning our wedding and decided to 'stayhoneymoon' and support our local economy. We checked out several locations and we wanted a hotel with a lovely view, privacy, good food and a feeling of comfort and relaxation. We found it at Paradise Point. The service was great, the room was just right, and the memories are irreplaceable. We will definitely be back again and again.. Thank you to everyone for making our honeymoon fantastic!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ruby Mayert","date":"2015-10-23 08:18:01 +0300"},{"content":"The layout of the room was wonderful. We stayed in a bayside bungalow and were able to take advantage of the refrigerator and microwave. We liked the two dressing areas on either side of the bathroom. The room was comfortable and felt just like home. Can't wait to come back.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":5.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Gregoria Volkman","date":"2012-11-22 02:38:16 +0300"},{"content":"My husband and I were first time visitors to San Diego, and it definitely won't be the last. We were a little nervous about booking this hotel based on the reviews. But, we took the chance, and it really did pay off. The grounds are immaculate. Our room had been renovated within the last 6 months. It was spacious, clean, and very comfortable. The pools were lovely. The Bare Foot Bar and Grill was a pleasure. The employees were wonderful. The bellman took his time with us, and gave us plenty of suggestions of places to go and things to do. The young lady at the front desk made sure our room was ready within half an hour, even though we were there 3 hours before check in. I'm a New Yorker through and through and would never have thought there would be another place on Earth that I'd be willing to live. But, San Diego is extremely alluring. The city is beautiful, clean, and has tons of restaurants, I never felt overcrowded, or rushed. Between the dog friendly Balboa Park with all it's museums, the incredible San Diego Zoo, Hip Pacific Bay, the mountains in the distance, and the very chilly but beautiful Pacific, give me seven more years, and I may be looking for a transfer.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0},"author":"Ernestine Hyatt","date":"2014-07-07 12:25:07 +0300"},{"content":"Just got back from a 5 day stay at Paradise Point and here is my plus and minus review. Plus side Great location, Easy driving distance from the airport, Sea World, Old Town San Diego (great restaurants in Old Town), parks etc. The resort feels very lush with many pools to choose from, and the fire pits are a nice touch. Staff was helpful with directions and at check-in. (your on your own getting to your room) The Negatives: Stayed in room 158, the beds are the worst I've ever slept on. The beds in the room need to be replaced, they are saggy, and every time you moved the springs creaked like a cheap motel 6 bed. (Wife and I had the worst sleep ever on a bed here) As mentioned from a previous reader, resort is quite large and when we checked in, we got a map and basically had to fend for yourself to find the room. It was kinda funny watching people wander around looking for their room especially at night when its dark at the resort. Not cool. Their high end restaurant (Baleen) is way over priced and average food. Wife ordered the steak and I had the halibut dish. Both were very salty. This is to bad since the location is lovely and the waiter was nice. Their other restaurant (Barefoot) has okay, breakfast food nothing special, their dinner wasn't great. Again nice location. The waiter/waitresses were average Paying $25.00 per day for parking and $9.95 per day for slow internet is ridiculous. Isn't the rooms expensive enough?? My one major recommendation if you stay in their garden view rooms is request a room that isn't facing the road around the resort. Ask for the rooms that you have to park and walk around the building,they are facing the ponds, grass etc. They are a lot quieter.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":4.0},"author":"Sandra Sawayn","date":"2013-06-14 22:51:03 +0300"}],"public_likes":["Raphaelle Schamberger","Barrett Schamberger","Ms. Gia Murphy"],"vacancy":false,"description":"Recently refurbished chateau & former champagne house, now a small luxury hotel with gourmet food.","alias":"Table d'Hotes","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}