{"title":"London/Hammersmith and Fulham","name":"Plaza Hotel","address":"53 Shepherds Bush Rd, W6 7LU","directions":"tube: Goldhawk Rd","phone":"+44 20 7603-2667","tollfree":null,"email":null,"fax":null,"url":"http://www.plazahotellondon.co.uk/","checkin":null,"checkout":null,"price":"From about £40","geo":{"lat":51.5005,"lon":-0.2217,"accuracy":"APPROXIMATE"},"type":"hotel","id":16172,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Fun even though I returned home with an unwanted gift.       There is a nice view of an old beached ship.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Hank Windler","date":"2014-07-15 04:06:57 +0300"},{"content":"bambu was just fine! We stayed at the Bambu Jan 20-27, 2007.Overall we had absolutely no issues! The operations manager was visible very frequently which seemed to keep his folks on their toes.The beach was just fabulous as were the grounds and the rooms. We saw zero insects or garbage anywhere.The food was very good - not gourmet but then consider the price you are paying. We experienced no health problems and did not hear of anyone else with any food-related issues.The people staying there at that time were largely Canadian and European with some Americans and South Americans. The diversity was just fine with us.We golfed at Punta Blanca. The golf itself is a little rough but they did their best in the proshop to make it a good day. The casino was as advertised: suspect decks for Black Jack for example. But then again remember you are in the Third World - not Las Vegas. My advice is if gambling put a smile on and relax (while you are quickly losing your money).If we had one bone to pick it would be with the persons manning the reception desk. We found them to be borderline rude and not very helpful in comparison to the very good service everywhere else.Overall we had a great time and I would recommend this resort to anyone.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Dr. Albert Ankunding","date":"2014-07-22 08:12:38 +0300"},{"content":"Does not match its rating We just came back from a week of staying at Riu Bambu and the whole family (4 adults and 2 children ages 8 and 5) feels somewhat disappointed. When we booked the trip we felt that 5 stars resort would be good enough to get a decent service. But it seems like the number of stars in this particular case was very misleading. I would give it a good 4 stars (3 US).Pros: 1) Very nice beach: a lot of shade, white soft sand, terrific sea bottom, enough beach chairs; 2) very well kept hotel grounds; 3) nice pools: clean and big; 4) big rooms: we had space to move around even with an extra twin bed;5) extra requests were quickly satisfied.Cons:1) kids activities not well supervised: about 30 kids were taken on a trip to the nearby hotel for pizza and movies with only 2 persons staff supervising the trip - since we chaperroned our kids we could see that the staff clearly had no control over the situation, they had no communication devices available, they didn't even count all the kids they took and there were no labels provided to identify children even though it was a multi-hotel event; 2) stained bed linens, room and beach towels: they looked washed but not clean, once we suspected the maid just folded a towel we asked to replace and put it back on the rack since it had dirt at the same very spot as the day before; 3) some staff members were extremely unfriendly: the guy that distributed beach towels tried to sell me his own rule that only 1 towel a day was permitted with no exchanges - I had to go to the reception desk to clarify that it was not true;4) not enough kids activities in the evening: there was nothing besides the disco after 6:00PM;5) some of the evening shows were not appropriate for kids but were not identified so on the advertisement flyer - the girls in one of the shows called Cabaret were dressed and danced in such striptease-like manner that I had to remove my kids from the audience as fast as I could; 5) hot food selection was extremely limited: it felt like the same dishes were cooked every day except for a couple of days when they had some specialties;6) no honor for special room requests placed before the arrival: we placed a request to have 2 either connected or next to each other rooms using 3 different contact options provided - the rooms we got were in the same building, same floor but across a long hallway.The overall impression is that they went too far with their costs cutting initiatives. There was a new manager appointed about 3 months ago and people that have been to the resort before claim that it lost a lot of its touch since their previous trip a year ago.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":4.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":4.0},"author":"Donny Heller","date":"2015-01-16 08:06:35 +0300"},{"content":"FANTASTIC Beaches My husband  I stayed at the Bambu Oct 1-8, 2006. I have to say the beach is the best I have ever seen. We called it Paradise.The room: Was OK, but thought the bathroom was too small. Pillows thin and sheets worn. My husband likes the room cold at night to sleep and they have no blankets, so I froze. Fridge was kept well stocked. Room was VERY clean, which impressed us. Food: From my experience with all-inclusive you do not get the best meals. Great fruit selection and even if you are a picky eater there was something to eat. Breakfast was my favorite.Pool: They have two pools, one was shaped like a doughnut and the other was the large pool with the swim-up bar. The pool with the swim-up bar was always crowded and noisy, all of the activities was done at that pool. We stuck to the smaller pool.Beach: I have to say the beach is the reason you go to Punta Cana. Simply beautiful. That is where we spent most of our time. This is for the Americans out there. You are going to a foreign country, where there is a language barier. Most of the vacationers are from Europe and do not speak English. While at the airport on the way home, so many people were complaining about no one speaking English at their resort. HELLO, if you want English speaking only resorts go to Florida!!! I now know why we are called the Ugly Americans. We truly enjoyed our stay at the Bambu  hope to return next year.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":4.0},"author":"Omari Spinka","date":"2015-10-21 23:40:34 +0300"},{"content":"Be Aware ... My husband  I just returned from a 3 Night/4 Day stay at the Riu Bambu (booked by Apple Vacations). We flew out of Newark, NJ to Punta Cana, DR on USA3000 Airlines. The flight out of Newark (on Friday, July 7th) was 2 1/2 hours late to depart (our pilot became ill, and his replacement had to fly in from Pittsburgh, PA). Once in the air, the flight was smooth  easy (though one of the flight attendants did become ill  had to be assisted by a passenger, an RN). There was no coffee cake. Our arrival in Punta Cana went very smoothly ~ we felt very welcomed. The weather was awesome! We were greeted by an Apple Representative, and boarded a bus to our hotel.  I should say, I do ALL OF the driving at home ~ I am a terrible backseat driver. The bus ride was HORRIBLE ... our (very large) Charter Bus PASSED (that's right, PASSED!) atleast a dozen vehicles on the VERY narrow, VERY crowded road to the hotel. And, the view outside of the bus window is beyond heart wrenching. All you see on that 40 minute ride, is complete poverty. You feel very greedy, being on vacation. The Riu Hotel's (Bambu, Macao  Palace) are all in a walled compound (for safety's sake), next to each other, on the same property. The Bambu is the least attractive, of the three. If they had not dropped us off last, we would not have noticed that. Check-In was very easy, the lobby is beautiful, and we were given some cold Hawaiian Punch in a wine glass, which was very nice. ALL of the hotel staff were very friendly. Our room was (unfortunately) very far away (#2805) and to my dissapointment, we were on the first floor. I specifically requested a BALCONY (with Apple) because of all the reviews I had read here, about mold. Luckily, the room smelled fine (though it was a smoking room ... which was MY FAULT ... I completely forgot to request non-smoking, but it truly smelled fine). I brought a box of Bounce (just in case) and I did use them in the drawers  closets. The room was VERY clean  always bug free. I checked the fridge next ~ it was empty (no gallon of water, no beer, no soda) ... and (within seconds) I put my hand on the wall, and had a hand full of WET PAINT!?! I dialed O to talk to the front desk (though looking back, that was a waste, because I couldn't have communicated) ... there was no answer. My husband found the first hotel worker that he could, and he showed up in minutes with (although warm) a full lot of drinks for the fridge. The room was very cool, the A/C worked fine ... we froze in our beds the first night. AND, the language barrier IS an issue ... you CAN get by with the basics, but ... you aren't going to pull out your English to Spanish Dictionary and say I put my hand in Wet Paint or I requested a Balcony or I really prefer a Non-Smoking Room ... so you WILL let a lot of things go. WARNING: There was a fence outside of our room, with a barbed wire top ... which we also noticed on most of the businesses we passed on our bus ride the hotel. Which means ... you need to BE ALERT  BE AWARE of your surroundings. We headed out to eat ... Mamajuana's was the only choice, and it was awful. Every bad review you will read on here, about the food, is absolutely 100% true. No matter where you eat, it's bad. I won't rehash it all. Let me just say, REMEMBER the mini market has bottled water, soda, chips, etc. ~ and it's well worth PAYING for! The conversion rate is 32 cents on a dollar. Just tell the cashier you want to pay in US Dollars. My husband spent the 3rd  4th Day of our trip, running from the bathroom to the bed. He is still having issues. And, he DID NOT drink a drop of water. We blame the food. Bring lots of Immodium. The beach was gorgeous, the pool is very nice (I won't lie, as clean as it is, a $@!#% floated by me in the jacuzzi, so I got out). Another issue ... the CONSTANT selling of goods  services is very annoying ... you begin to cringe when you hear someone say Hola ... we were approached, non-stop. The hotel staff will do ANYTHING for a tip (one even offered to carry me, on her back, from the beach to the Massage Hut!) If you go, bring LOTS OF $1's (luggage, maids, bartenders, etc.). Also, another WARNING: there are stray dogs that roam the grounds  the beach, looking for food. They seem OK with people, but do fight with each other (over food) at times. I am afraid of dogs, so they kept me very on edge. We will not go back to Punta Cana, and we will not recommend it to anyone. We are beyond THRILLED to be home.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":-1.0},"author":"Jamaal Doyle","date":"2015-08-22 07:49:37 +0300"},{"content":"Bambu.....p. uuuuuuu!!       This is why we love PC and the Bavaro Beach.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Renee Hoeger IV","date":"2014-07-25 08:53:53 +0300"}],"public_likes":["Carmen Wilderman","Brendon Green MD","Jamar Dickinson","Rudolph Bode"],"vacancy":true,"description":"Actually three hotels all run by the same company - The Plaza, The Rex and The Acropolis. All similar standard and nearby to each other.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}