{"title":"Hollywood","name":"Hollywood Heights Hotel","address":"2005 N Highland Ave","directions":null,"phone":"+1 323 876-8600","tollfree":null,"email":null,"fax":"+1 323 876-3272","url":"http://www.hollywoodheightshotel.com","checkin":null,"checkout":null,"price":"$99+","geo":{"lat":34.106661,"lon":-118.337732,"accuracy":"APPROXIMATE"},"type":"hotel","id":11789,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"I used to live in Chicago and always was intrigued by this hotel when I drove by it, mostly due to the big cheesy sign (which I love). I was back in town to do some work and, although I usually stay with friends, I decided to get a hotel for a couple of nights. Since I was using my grant money, I wanted to save on costs so that I can use the money for other things. I read the reviews on here and decided to give the Heart a try. I was not disappointed! I got a large spacious room for less than $90 a night! It is clean, has FREE wireless, and a free breakfast (although the food choices are limited, can't complain about the price!). As a former resident of the city, I can say the location, while not ideal for getting downtown, is very good, especially if you enjoy the neighbourhoods of Chicago, rather than the downtown core. Andersonville is within walking distance, which is a great neighbourhood. Also, the Clark bus (#22) is one block away and this bus will zoom you down to Wrigleyville/Lakeview/Lincoln Park quite easily, or even downtown. Although, if you're heading to Michigan Ave, I would catch the #84 to Bryn Mawr station and take the red line downtown. Essentially, this is a great deal and you will not be disappointed, especially if you like retro things!","ratings":{"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Milford Reichel","date":"2014-10-17 18:33:14 +0300"}],"public_likes":[],"vacancy":false,"description":"This boutique-style hotel is relaxed, comfortable, and uniquely personal with 160 rooms fitted with amenities including FACE cosmetics and flat-panel TVs.  Starting in March 2012 this hotel will be rebranded as the Hilton Garden Inn.","alias":"Hilton Garden Inn","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}