{"title":"San Francisco/SoMa","name":"St. Regis Hotel","address":"125 3rd St","directions":"between Mission and Minna","phone":"+1 415 284-4000","tollfree":null,"email":null,"fax":null,"url":"http://www.stregissanfrancisco.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7862,"lon":-122.4014,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26029,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We are seasoned travelers, but we're also from the Puget Sound area, so it was quite a challenge to \"choose a home base place\" for a small Seattle Downtown movie, dinner, romance adventure (on a budget) for our anniversary eve (we were married in Seattle and stayed at one of the large, but very nice \"corporate\" hotels, the Westin for that special evening...) Homewood (now a Hilton after being called Pike Place Suites and Summerfield under previous nameplates) quite simply was the best overall value we could find, and WE really knew where and what to look for. Its location is outstanding for walking, exploring and being right in the thick of the things most really want to \"see\" in Seattle. And if you need to go further, it's ideally situated to do it from. \"Top Marks\" for: Front Desk friendliness/knowledge, Engineer (we had a door lock glitch, so they gave us a quick upgrade 'til getting the room back open), Location (They are easy off I-5 and away from a lot of the one-way hassles of downtown) besides their valet during the week you may get lucky like us and find free parking across the street - from late Saturday through Sunday when meters are off) they're one block from the Wa State Conv Ctr if that's of interest, and only 3 blocks or so from the Regal Theater complex and literally scores of great local and chain restaurants and shops. Finally, it's a straight shot right down Pike about 9 easy blocks to the Pike Place Market \"pig\" entrance. \"Good Job\"s for: Rooms (a bit tired, but nice kitchens, baths, furnishings and comfy Hilton beds), Exercise Room with water cooler, towels, TV and some weights, plus 2xTreadmills, 2xEllipticals, 1 Recumbent Bike - all NEW Precor with Cardio Theater TV's and near-pro gym quality) \"Hot\" Breakfast (better than Denny's but not quite up to Embassy Suites standards - but the price- Free - was right!), Shuttle Service (we didn't use but it was a great itinerary and they were flexible about pick-ups until around 9 pm. Great if you are tired after walking all over the city. Biggest Surprise: The price, just over $100 incl. tax for an admittedly quiet night, just after New Year's. The Last Words...This is a great place to stay if you want a quiet and close-by hotel to kick back (even play pool in their lounge!), with a weekday manager's reception, and to keep some food, drink around your room (big fridge, a microwave and a stovetop, plus a coffee maker and the bonus - Starbucks coffee always hot in the lobby, incl. real creamer. You can buy munchies from their quick selection but there are markets everywhere, including a fairly close QFC supermarket up on Capitol Hill, a mini mart by the Conv. Ctr. and a nice IGA with decent wine prices right down on 3rd Ave. off Pike. If you want to work out and not pay extra, it's a 24-hour fantastic value - so pick the \"off-times\" to avoid any crowds and get a real workout incl. in your room price. Or just head down the hill, to Pike Place, Pioneer Square, or the waterfront. You'll be walking lots, especially back up the hill to the hotel, but there's lots of food and drink along the way to cure what \"ales\" you... \"Top Tips\" nearby from a Local \"Tourist\": Pike Place Pub for beer and magnificent crab-stuffed Salmon filet. Everything's wild, food is best quality, beer brewed there has won awards. McCormick and Schmick's...great drinks, consistently better seafood, reasonable wine list values. Key Lime Pie that is more like cheesecake but puts others to shame! Avoid Rock Bottom, Tap House Grill has a great selection though...Want to see Seattle and its environs from the water - try Argosy Cruises, a family-owned company, and always focused on service and true value. or just hop a WS Ferry!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Shawn Jaskolski","date":"2013-01-06 13:20:50 +0300"},{"content":"This was my 2nd stay at this hotel and it was great. The staff is very pleasant and helpful. The common areas are clean and quiet. The rooms are spacious and nicely appointed.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Amparo Stroman","date":"2015-12-19 04:38:02 +0300"},{"content":"I find the hotel location most convenient for budget muslim travellers as there are numerous malay ( halal) eateries. The Paya Lebar MRT station is a mere 10 mins walk from the hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Tre Yundt","date":"2012-06-01 00:08:00 +0300"},{"content":"I booked 2 rooms for a family of 2 adults and 3 children with a specific request for adjacent rooms on the pool floor, because of the young children, through a friendly female concierge. This hotel gave us rooms on the wrong floor which were very far apart. When this was pointed to hotel's manager, he did not only refuse to apologise, he argued with us, exhorting that hotel rooms were \"subject to availability\". This despite the female concierge acknowledging that (1) a special request was made and (2) \"subject to availability\" was never mentioned when the rooms were booked. An extremely sour experience with the argumentative hotel manager that spoilt the entire experience. I also add that the hotel's fittings are decidedly second hand. This is also in a red light district and is a long walk from the subway station.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Location":2.0,"Rooms":1.0},"author":"Cassie O'Hara","date":"2014-07-02 01:21:45 +0300"},{"content":"just a one nite stay, its ok, room product is hip and modern, but sort of annoyingly so. there is nothing to eat in this area, except a Ruby Tuesday across the street which was filthy. staff at desk are fine, hi, checking in, heres your key. The little fridge at the desk has sandwiches in it, which work in a pinch. bottom line, you will survive a night.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":2.0},"author":"Foster Hoppe","date":"2013-11-11 16:34:05 +0300"}],"public_likes":["Damien Ledner","Einar Cruickshank","Eliza Kulas","Rory Carroll","Blake Rice"],"vacancy":false,"description":"A historic and very upscale hotel with a spa, butler service, and on-site restaurant.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}