{"title":"Inverness","name":"Culloden House Hotel","address":null,"directions":null,"phone":"+44 1463 790461","tollfree":null,"email":null,"fax":null,"url":"http://www.cullodenhouse.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.49042,"lon":-4.135215,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12241,"country":"United Kingdom","city":"Culloden","state":null,"reviews":[{"content":"We were visiting my son in Seattle over the holidays, but had to stay at a hotel with my mother who requires handicap facilities. The staff at the Nexus couldn't have been more accommodating. From the moment we checked in, to checkout 8 days later, they helped make our stay comfortable. All requests were quickly filled. The hotel is not overly pretentious, but it provides the traveler with all the comforts that make guests happy. The rooms were clean, simple and well appointed. Bathrooms were recently renovated. They were clean, modern and attractive. The hotel offers a free laundry on site, as well as a workout room. The breakfast is always busy, but food is constantly replenished . Free newspapers and computers in the lobby, are always available, as is coffee 24 hours a day.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Kayleigh Bayer","date":"2012-07-31 07:26:11 +0300"},{"content":"Great location near hospital and Northgate mall, walk to Starbucks and dining. The lobby is updated in fun and comfortable style, the staff were absolutely the best in their assistance, accommodation and attitude, and the rooms were nicely appointed with microwave and fridge. We weren't there for the scenery, so it didn't matter to us that the rooms didn't have a great view. Found the prices reasonable for Seattle (we traveled from out of state) and our family group received a great discount for booking a number of rooms well in advance. Rooms were clean, beds were just right and even the pillows were a combination of soft and firm for those picky people like us. I actually prefer outside access to rooms rather than indoor hallways. Breakfast offered variety of choices, even for those with gluten allergies. Very family friendly, and staff truly made us feel at home. Will definitely stay again and recommend it very highly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Liliane Donnelly","date":"2013-07-23 14:20:06 +0300"},{"content":"Hotel Nexxus was more than perfect for my wedding guests. Not only did they provide beautiful rooms with a great staff the hotel was able to provide the Breakfast Room...which was a lot more spacious than I thought....at no cost and we used that for our rehearsal space the night before. The hotel has a great pool and outdoor seating area with large tables with umbrellas and chairs. This area ended up being the gathering place for many of my guests. The hotel also ended up providing a complimentary shuttle from the hotel and wedding venue...Golden Gardens Bathhouse...for the guests that were staying at the hotel. The hotel was also very easy for my out of town guests to find because it is right off the freeway. Everyone I talked to before hand responded to calls really fast and were really usefull with information. I would definately recommend Hotel Nexxus and am very pleased to have used them for my wedding.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Service":4.0},"author":"Anastacio Gulgowski","date":"2013-08-03 02:00:32 +0300"}],"public_likes":["Deonte Wyman","Hermann Mraz","Larue Kihn"],"vacancy":true,"description":"Beautiful Country House Hotel set 3 miles out of the city centre, great food, magnificent rooms. Culloden House is where Bonny Prince Charlie slept, the night before the Battle of Culloden in 1746.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}