{"title":"San Francisco/Union Square-Financial District","name":"Westin-St Francis Hotel","address":"335 Powell St","directions":"west side of Union Square, between Post and Geary","phone":"+1 415 397-7000","tollfree":null,"email":null,"fax":null,"url":"http://www.westinstfrancis.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7878,"lon":-122.4087,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26238,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We got the family room since I'm 7 months pregnant and my 2 boys (9 & 11) can never sleep in one position. It was very spacious! The room has its own electric hot pot, a small fridge inside the cabinet, instant coffee is replenished everyday plus fresh towels everyday too. We were also able to ask for bottled water everyday. The receptionists were very friendly and helpful too! The bus stop is just a block away and the MRT station (Kallang station) is only about a 5-minute walk. Also, the hawkers are just a street away. My only complain would be the hard pillows but that's only because I'm pregnant! And i needed a soft one for my belly. If not it would really be not a problem.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Bernard Hagenes","date":"2014-11-23 21:49:37 +0300"}],"public_likes":["Sammy Abshire","Prince Jenkins","Susanna Towne II","Modesta Anderson","Constantin Purdy","Juana Lindgren","Ryder Hagenes MD","Connor Carroll","Caroline Kub"],"vacancy":true,"description":"Now a member of the Westin chain, this is an iconic San Francisco hotel. The lavish lobby and cafe area are used as a meeting place by quite a lot of people who aren't guests there, despite the pricey lattes and ritzy atmosphere. In a peculiar bit of design, the lobby has a side entrance to the Harry & David store, should you need to pop over for a few chocolate-covered cranberries. A ride on the exterior glass elevators offers a splendid view of the skyline, and can be done even if you're not staying. Although the St. Francis has a reputation for being pricy, it runs off-season specials.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}