{"title":"San Francisco/SoMa","name":"Harbor Court Hotel","address":"165 Steuart St","directions":"between Mission and Howard","phone":"+1 415 882-1300","tollfree":null,"email":null,"fax":"+1 415 882-1313","url":"http://www.harborcourthotel.com","checkin":null,"checkout":null,"price":"$230–$280","geo":{"lat":37.7927,"lon":-122.3921,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26024,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Right then. First off, I do write long reviews so bear with me. We didn't have a great deal of money and were staying in Dubai for three nights. As much as we'd have loved to find the deal a friend of mine found (six nights at Atlantis, with flights, for £600 - unfortunately his wife went and booked a week in Wales) we asked our travel agent to find us the cheapest there was, and he found this - the Ibis Deira City Centre. Some relatives actually had stayed there a year before and found it very nice and in a great location. So off to Dubai we go! We'd actually flown to Melbourne, done some stuff there, then to Sydney, and now Dubai on the way back to Manchester. In order to save some more money we were actually flying into Abu Dhabi and travelling into Dubai on a coach but that's another story. Long plane flight, coach trip and then taxi ride later we arrived at probably about 9am. Fair enough. The hotel is actually on a main road (isn't everything in Dubai?) and is opposite the Deira City Centre shopping mall. Although check in isn't until 2pm we go in anyway and try our luck. As luck would unfortunately have it, nothing is available. The staff did say we could try at 1pm and see if there's anything then, so plus marks there for the staff offering that, and minus luck marks for us. The staff did offer to hang onto our luggage for us, which we were grateful for, and we went to the shopping centre to $@!#% a few hours, then came back at 1-ish and found that a room was available. I must mention that, despite being billed as \"very cheap\" according to the travel agent, the standards were very good. The hotel foyer looked clean with three PCs set up for use and international newspapers. The room was also nice - plenty of space, a decent enough bed and a spacious bathroom with walk-in shower and line to hang towels on. Definitely better than expected. Only real problem was that I was woken up at 5am (I think) by what I assume is the \"call to prayer\". Never mind - that's an issue with Dubai itself, not the hotel as the noise was coming from outside. The view from where we were was also pretty good - you could see across the shopping mall to the Burj Khalifa (definitely something worth doing). The TV also picked up a large amount of TV stations, along with a lot of western stuff (given the amount of nudity there is in True Blood you would have thought it wouldn't be screened, but there it is). The breakfast was also decent - an okay variety of warm and cold food including breads, cereals, sausages, beans, toast, juice and others. Nothing spectacular though it was better than the comparatively bland breakfasts I'd had at other places on our trip in Australia. Though check out was at about 10am we were flying back at 2am and so would need our luggage held until about 9pm (otherwise we couldn't do anything and would die of boredom). Again, the hotel kindly held our luggage for us until we came back and used a taxi (they're everywhere in Dubai! Just walk out of the hotel and there's normally three there waiting!) to get to the airport. I will briefly note that, though it didn't affect us, the hotel does not have swimming facilities, though for a small supplement you can use the facilities at the neighbouring Novotel. We found this hotel to be in a good spot - again, across the road from the Deira City Centre shopping mall (good for all your shopping needs, though nowhere near as spectacular as the Dubai Mall) and about three minutes walk from a metro station. Taxis were available and we found the neighbourhood (well, our short walks to the metro) to be one where we felt safe (having said that, Dubai is supposed to be one of the safest places around). The hotel was good value - nothing spectacular, but it's not going to be. The breakfast was good and it had all the amenities necessary. I wasn't sure whether to award a three or a four star. I think that, for the price and value for money, as well as the helpfulness of the staff (they did try to help when we asked them about Ferrari World and the metro, but unfortunately didn't know much about them) I think I'll award it four.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Wyman Huels","date":"2014-05-15 01:36:08 +0300"},{"content":"I stayed there for 3 nights after a stopover from beijing. The room was a little bit small but ok for me as i was alone, very clean always the a/c on as it is very hot in dubai. The reception desc was very helpful and kind. Outside you can find a mall(deira city center) with a lot of shops,fast food, and hypermarket carrefour. Also there is a metro station outside the hotel and taxis. Avoid the luxury \"taxis\" because they will double charge you!! Take only the public taxis and they are very very cheap conversely the european taxis. If you want to go at the beach you can take the metro until marina station and then with taxi.It costed me about 20 dirhams. Also the airport is very close to the hotel you can take the metro and it takes about 10' to get there.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Jeff Lehner","date":"2012-05-22 07:47:18 +0300"},{"content":"No complaints about the hotel location, rooms, cleanliness etc. The only thing comes to my mind thinking about my stay here is terrible behaviour of reception people. They are not ready to hear your problem. Firstly, they give you a significant lower exchange rate as compared to USD. I had one night local currency avaialable with me at the time of check in and I deposited the same with them in addition to my credit card details. They blocked the telephone lines of my room and even demanded for my passport. Also, please avoid the pathetic breakfast for which they charge $15 or more. Awful experience, terrible guys, so unfriendly, felt like a torture.","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":1.0,"Rooms":2.0,"Location":4.0},"author":"Aaron Cummerata","date":"2015-03-16 15:54:39 +0300"},{"content":"The hotel is literally accross the street from the City Center mall. Dubai is all about malls and this one is as good as any. It is also a great spot to catch the Dubai Big Bus tour which showed us all we wanted to see of the place. The rooms are small but spotless with good beds and nice showers. Do arrange airport shuttles with the hotel in advance as they don't seem to run at fixed times. We didn't realise this on arrival but a taxi from the airport took a few minutes and cost about 20UAD. The shuttle back was free and as quick.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Reba Stehr","date":"2012-11-21 06:18:33 +0300"},{"content":"This was my husband and I's first trip to Dubai and didn't really know what to expect! I had read all of the previous Ibis reviews before our trip and was I was not disappointed. The reason for our trip was 'shopping, shopping, shopping' (well my reason anyway!) and the hotel is just across the road from one of the best shopping malls in Dubai (in my opinion) The check-in service was quick as we were the only people checking in! it was about 1am in the morning. All of the staff that we spoke to during our 4 night stay were kind, friendly and very helpful. There is also a free shuttle bus to the beach which you need to pre-book at reception, the times are leaving the hotel at 9am or 12pm and coming back at 3pm or 5pm. The beach charges 5dhs per person to get in. I could not really fault the hotel, our room was big enough for two people, always clean, the bathroom although compact was no problem at all. The shopping mall was just outside my window too! just a little word of warning, when you get into the lifts make sure you put your room card in the slot then take out when you see the green light press the required floor otherwise the lift will not move! this was not explained to us at the reception desk but found out by getting stuck in the lift. Overall a great hotel, nothing like the Ibis hotels we get in the UK, I would recommend staying here to anyone.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Claud Boyer","date":"2014-07-06 20:18:34 +0300"},{"content":"Nice hotel in downtown Seattle. This hotel is within walking distance of many restaurants and coffee shops and a short drive to attractions such as the art museum and the Pike Place market. My room was small (don't take a room ending in -04 they are the smallest) but really perfect for just 1 traveller. I think the other rooms were larger. The bed was very comfortable and bathroom small but updated with granite countertops. The best part was that they offered a free \"heavy snack\" in the early evening, including beer or wine, so I didn't even have to go out for dinner if I didn't want to. That plus a hot breakafst in the AM at no charge was certainly a bonus. There was a small sundry shop for snacks in the lobby if you wanted something extra. Beware the parking fee however. It is valet only at $32 a pop. I received a call just after check in to see if I needed anything which was appreciated.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Orland Nikolaus","date":"2012-05-13 10:51:10 +0300"},{"content":"This hotel is less than 2 blocks from the Convention Center, centrally located. All rooms are suites with mini kitchens. Rooms were very comfortable, onsite laundry was also a plus. They serve daily breakfast and evening drinks with light dinner Monday - Thursday. Staff was very helpful. Would definitely stay there next time we are in Seattle.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Robb Rodriguez","date":"2014-08-15 12:00:50 +0300"},{"content":"The first thing you need to know is that there are two Homewood Suites by Hilton in Seattle: \"Convention Center/Pike Street\" and \"Downtown\". This review is for the Convention Center location, which is situated on top of the partially covered I-5 freeway (not as bad as it sounds). I was on travel for work and stayed three nights. I was impressed by the size and layout of the 1-bedroom suite. It had a separate bedroom with dresser, a \"living room\" with pull-out couch bed, desk and dresser, and a kitchen with stove, dishes, cookware and dishwasher! I didn't do any cooking on this trip but if I were traveling with family this would have been perfect. Bathroom was large, with shower and tub. There wasn't any noise from inside the hotel but my room overlooked the city and there was some street noise. Breakfast was included and there was a moderate spread of cold and hot choices. I think coffee and tea were available 24/7. The hotel is 2-3 blocks from the Convention Center, about 7 blocks from Pike Place Market and even the space needle is walkable distance. Note: Seattle is hilly and you will be doing some walking as this hotel is on a hill!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":4.0},"author":"Anastacio Langworth","date":"2012-10-10 17:12:24 +0300"}],"public_likes":["Raymond Schultz","Mariela Mueller IV","Elnora Klein","Clyde Beier"],"vacancy":false,"description":"A waterfront boutique hotel on the Embarcadero, across from the San Francisco Ferry Building, with views onto San Francisco Bay.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}