{"title":"King City","name":"Quality Inn King City Hotel","address":"1190 Broadway","directions":null,"phone":"+1 831 385-6733","tollfree":null,"email":null,"fax":null,"url":"http://www.qikingcityinn.com","checkin":"3PM","checkout":"11AM","price":"$59.99 - $69.99","geo":{"lat":36.204876,"lon":-121.139331,"accuracy":"ROOFTOP"},"type":"hotel","id":14006,"country":"United States","city":"King City","state":"California","reviews":[{"content":"We loved the Hyatt. I agree with the others that the Lobby Decor is odd. But you are never in the lobby. The rooms are great, brand new everything. Spacious. Comfy beds, great bathroom and amenities. Pool was great. They do need some more chairs as all were taken eventhough it did not feel crowded ., There were so many activiites it was sad that we didnt have enought time to do them all. I would absolutely recommend this hotel to anyone looking to stay in the Disney Orlando area. Only thing is you need a car.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Sabrina Hansen","date":"2012-01-22 11:27:08 +0300"},{"content":"We booked this hotel through the British Airways Wesbite as it was highly recommended by them. Compared to the quality of the hotels in Orlando, this would be at the higher end, without question. The rooms are lovely, and the cleanliness of the hotel itself is excellent. Location wise, it's not walking distance to International drive, and is only accessible by taxi or car. This basically means that if you don't hire a car, you will have to depend on the shuttle services provided by the hotel, which not all parks and attractions are provided for free. As a typical example, we had tickets for the Wet & Wild park, but had to pay $38 for two adults to get us there, which only took 15 minutes. The part is actually across the road from Universal Studios, and if we had known, would have ordered the free shuttle service from the hotel instead. So although paying the $25 daily hotel service free, free travel only applied to some of the parks. Another matter which greatly annoyed us is that complimentary breakfast was included in our package, which included tax and 15% gratuity, which we had in writing from the hotel. Despite this, we were on one occasion in the middle of eating, when one of the waiters rudely interruped to mention \"I know you have a voucher for the buffet breakfast, which means I get nothing, and indicated that we should leave him a tip\". Neadless to say, we refused to sit in his breakfast seating area, and it left quite a bad taste taste in our mouths after that bad experience. We feel strongly that the $25 daily hotel service fee should be part of the hotel cost, which isn't cheap. We feel that a hotel should as policy, let you use their facilities; pool, gym, use their towels etc as this is what the minimum requirement of providing a satisfactory service without having the charge their customers for the previledge. I have stayed in many hotels worldwide, and have never came across this charging policy before. 'Mears' the taxi company the hotel use, were quite aggressive about tips. Although they appear rather overly friendly initially, if you don't tip them, expect quite a nasty reaction! All in all, not a bad hotel. Location isn't perfect, if I was booking again, I would look for a hotel in the north nearer the main theme parks. They also need to rethink the hotel service charge. We walked away with an additional mandatory $250 bill upon checkout just for staying in the hotel, and it does make you think you are being charged just for staying there using facilities you believe you have already paid for when you book your room. So if you are going to stay in the Hyatt, you will need to budget for this additional expense. It's not a hotel that we are likely to return to, to be honest, and I would advise to shop around and use trip advisor.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Zachery O'Connell","date":"2013-02-19 06:22:50 +0300"},{"content":"Newly renovated rooms are great. Pool is awsome and plenty of things to do for kids. Great value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Gust Ondricka","date":"2014-05-03 00:17:36 +0300"}],"public_likes":["Ms. Hailee Hickle","Everardo Ferry","Norma Schamberger","Josie Kling","Madie Funk","Miss Haley Sauer","Marcelle Kuvalis","Ron Bauch","Mavis Reichert"],"vacancy":false,"description":"The Quality Inn King City hotel located near Monterey Bay and Carmel in Central California. Information on local attractions, rates, rooms, and reservations. Enjoy the comforts of home when you stay at Quality Inn King City Inn! Each of our gracious Standard King, Standard Queen and Double Queen guestrooms is a model of comforting convenience.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}