{"title":"San Francisco/Union Square-Financial District","name":"Hostelling International-Downtown","address":"312 Mason St","directions":"at O'Farrell","phone":"+1 415 788-5604","tollfree":null,"email":null,"fax":null,"url":"http://www.sfhostels.com/downtown","checkin":"2PM","checkout":"11AM","price":"Dorms $27-$30, privates $69-$109","geo":{"lat":37.7865,"lon":-122.4095,"accuracy":"ROOFTOP"},"type":"hotel","id":26210,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Loved this hotel. Booked it off priceline, and for less than 130 a night we got two double beds, a flatscreen tv, a microwave, and a fridge!!! The hotel was a bit of a walk from the Eaton Centre and shopping, but since it was summer we didnt mind, but if it wasnt sumer i definitely would have not made the walk. The hotel is right next two a few nightclubs and bars though. The people at the desk were nice, the hotel was clean and very new looking. They had an office room you could use for free but it was occupied alot....they should get more computers other than just two.....but besides that, we LOVED this hotel!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Albina Wehner","date":"2012-12-23 03:29:47 +0300"},{"content":"We came to Toronto to celebrate our friend's birthday at Tryst night club (which is literally right beside the hotel!). We basically just wanted something that was close to the night club but we were very pleasantly surprised with the Hilton! The room was absolutely beautiful! Everything looked brand new and it was extremely clean. There was a microwave and a mini fridge which was very convenient. The only cons about this hotel was that check-in and check-out was extremely slow. We requested a later check out and they would not accommodate this....which I have never had happen before. Also, if you are planning on parking your car there is only valet parking available which at $35 per day is quite pricey. If you are looking for a hotel that is within walking distance of many things to do....this is the place. It was a quick walk to the shops and restaurants on Queen Street....try Fressen if you are vegetarian/vegan....its delish! We also walked to Kensington Market in 15 minutes or so.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Karlee Emmerich","date":"2013-01-25 22:31:49 +0300"},{"content":"We stayed here one night on our vacation while touring the Toronto area. We chose it because we wanted to eat at Gretzky's for supper and then visit the Hockey Hall of Fame and the CN Tower in the morning. The location was good for us but it is definitely not the nicest area of town. The hotel is beautifully decorated, very modern and the restaurant was great for breakfast. Our check in experience was not great. They told us in a very rude tone and with attitude that our credit card had been declined over the last few days and that they had tried it several time so we would have to provide a cash deposit. Now, keep in mind that this is the third Hilton we had stayed at in three days and the other two had no issue and also my husband is a Gold member. Anyway, we called visa and it turns out that the Hotel had been entering the wrong expiry date. Their fault, not ours, no apology from them. Another issue I had is that we always ask for a room on an upper floor, this is the only Hilton on our entire trip that did not honor our request. They only put us on the 8th floor. It was a very noisy Saturday night as there was lots of partying going on in the streets till 3 or 4 in the morning and we could hear it loud and clear. I would not stay her again because of the rude front desk staff and the street noise.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Monte Jenkins II","date":"2015-09-22 00:26:48 +0300"},{"content":"Sleek, modern, minimalist rooms with some interesting design elements. Open bathroom concept. Enclosed shower. Separate enclosed toilet, dark colours, felt a bit claustrophobic. No fan. Very clean, and the housekeeping staff were fantastic. Overall, a great value, great experience. Room can be a bit noisy, depending on what is going on outside, especially on the weekends. Friendly helpful staff. Free WiFi in lobby/lounge area. Location was very convenient, close to Metro. Abundance of taxis just outside the hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Pierce Hettinger","date":"2015-04-18 22:42:15 +0300"},{"content":"it is the hotel with good location (train and metro), helpful staff. The breakfast is ok (typical European breakfast). Positive is that all soft drinks are free and will be re-filled every day.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Marty Buckridge","date":"2014-10-04 09:40:22 +0300"},{"content":"We stayed in this hotel for three nights when we went to Barcelona for the first time. We had booked well in advance to get the special tariff - 15 per cent off. The booking process was as easy as could be. A week before our arrival we got a welcoming email promising the nice 1.8 by 2 metre bed and the free minibar. Sounded nice. When we arrived the checkin process was fast and so we arrived to see our room which was clean and furnished in a modern style. Black glass dominates the bathroom section. However, while laying ourselves to rest we started to doubt that the bed really was 1.8m wide. In fact, it was just 1.4m which meant that we had been given a single room. Well, we didn't complain because we really just spent the nights there but having had a glimpse at the \"normal\" rooms we were - understandably - a bit jealous. Well, next time I would complain because I find it quite cheeky that people who book the discount rates get lower quality rooms. If this is company policy then I'd rather stay away from AC hotels. The wifi internet access is provided via a prepaid card which can be obtained at the reception. The good thing about it is that you get access for 24 hrs - as in our case - for three days. If you don't access the net you wouldn't get charged. The free minibar is stocked up everyday and provides you with pops and water. Best part of our stay ...","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Mr. Joshuah Gorczany","date":"2015-07-15 03:52:43 +0300"},{"content":"Pros: -located near a metro stop -great service -well designed and comfortable rooms -good food at the lobby restaurant -waterfall showerheads -reception workers had great english -quiet at night Cons: -rooms were hot and A/C was off for the season -a little far from the sites, 30 minutes by train system -restaurant servers sometimes struggled with english -inaccurate taxi approximate costs on their hotel information (off by 20TL in one case) We enjoyed our stay here, but due to its location, we probably won't stay again. We were more of a fan of the Sultanahmet side and it took 30-40 minutes to get there by train. If you like the Beyoglu district, thie location is just 2 stops away from Taksim.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Joey Rempel","date":"2014-05-01 21:22:14 +0300"}],"public_likes":["Angela Emard","Donald Denesik","Mia Homenick","Miss Johnny Weissnat","Devonte Williamson","Guiseppe Ebert"],"vacancy":false,"description":"Clean, cheap, safe and fun.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}