{"title":"Isle of Wight","name":"Castlehaven Caravan Site","address":"Castlehaven Lane, Niton, Isle of Wight","directions":null,"phone":"+44 1983 730495","tollfree":null,"email":null,"fax":null,"url":"http://www.isleofwightholidays.com/castlehaven_caravans.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":50.57668,"lon":-1.289274,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12357,"country":"United Kingdom","city":"Niton","state":null,"reviews":[{"content":"we spent 4 days at the jw marriott in las vegas. the hotel room was really great, big, and the bathroom was all you would want and more. we did make what i consider a find as far as a place to eat. there is an irish pubb at the jw named wooloughan's that has wonderful comfort food at reasonable prices. we had a waitress named dorie who made us feel so much at home that we came back again and again. we were given an extended balcony room, which i would recommend. i think most rooms did not have a balcony, but french doors that opened to a railing. the pool was nice, but i did hear someone ask another person where she lived, and she said right down the road and would be back with her kids the next day. i guess locals can come and use pool when ever they want. other than that, would recommend hotel.","ratings":{"Overall":5.0},"author":"Ward Miller PhD","date":"2012-01-29 03:05:18 +0300"},{"content":"I LOVED my stay at the Las Vegas JW!!! I could not believe how big the standard room was. There was so much room I almost felt like they wasted space - but I'm not complaining. The bathroom was so luxurious. We used the whirlpool tub every day we were there. PROS: - Huge room - Awesome shower and whirlpool tub - Very classy common areas and beautiful landscape - Nice view of the mountains - Restaurant Row (connected to the resort) had a variety of different types of food - American cafe, Starbucks, Japanese like Benihana, buffet, Irish pub, Italian, as well as the hotel's standard restaurant Ceres - we ate at the Promenade Cafe which had the standard coffee shop type of menu and all three times we went the food was superb. We also ate at the Japanese restaurant and it was good. Each morning we had breakfast at the Ceres restaurant. The buffet was standard. I've had better. We decided to order off the menu for breakfast and both dishes were wonderful. - Nice sized casino - We're not gamblers so I didn't choose this hotel for the casino scene, but it was a nice size. I actually won $50 at blackjack. It was nice to see $5 tables on a weekend night. In the past, the other hotels on the strip only seemed to offer $25 minimum tables. - The pool was closed for the season, but I would definitely come back to try out the pool. - Clean and classy - Overall good service from everyone we met CONS: I can't really think of any cons except that maybe the towels and pillows didn't smell fresh, but I understand some people don't like a scent in their pillows. Not a big deal at all and not a real complaint. We weren't interested in going to the Strip, but it didn't seem that far to me, especially if you have your own car. I thought the location was perfect. Overall, a wonderful stay and we will be going back soon!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Lori Ebert","date":"2013-01-12 16:54:27 +0300"},{"content":"When we arrived I was supprised to find that the hotel was much bigger than it seemed on the website. We had chosen to stay there for our first few days in Vegas, away from the Strip. However it was a little more like the strip hotels than I had imagined - the hotel is set around a large casino. Having said that the room was amazing and the bathroom was bigger than my bedroom at home!","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":3.0},"author":"Rodolfo Emmerich","date":"2014-11-04 07:44:02 +0300"},{"content":"Resort is written all over this hotel. What a gem in the Vegas area! The layout and landscaping gave the impression that this hotel could have been in Hawaii or Florida or Palm Desert. Many amenities on location and excellent staff to answer questions and attend to your needs. We would absolutely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Al Hartmann","date":"2013-02-15 12:51:51 +0300"}],"public_likes":["Buck Brown","Dr. Kraig Gottlieb"],"vacancy":true,"description":"Caravan park right on the waters edge giving incredible sea views.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}