{"title":"Newcastle (Down)","name":"Slieve Donard Hotel","address":"Downs Road, Newcastle","directions":null,"phone":"+44 28 4372-1066","tollfree":null,"email":null,"fax":"+44 28 4372-4830","url":"http://www.hastingshotels.com/slieve-donard-resort-and-spa/index.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.21591,"lon":-5.88465,"accuracy":"APPROXIMATE"},"type":"hotel","id":20122,"country":"United Kingdom","city":"Newcastle","state":null,"reviews":[{"content":"Everything was great, we complain about the noise, because there was a construction nearby and they gave us 2 adjacent rooms instead of a suite which was kind of small (for 3 aldults and a 2year old) in the other part of the hotel where it was al quiet without any extracharge. Very clean and very happy to be there. We´d go back again","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Nathanael Powlowski","date":"2013-10-21 04:44:22 +0300"},{"content":"Normally I find that Hilton properties tend to be overrated. Understandably, during a UFC weekend in Montreal the prices were inflated but the price of this Hilton was surprisingly competetive compared to other hotels in the area but on a non-event weekend even in the summer it's cheap at $120/night. The location is excellent walking distance to both St. Laurent and St. Catherine's so for nightlife and eating purposes it's great. The service was amazing. I made the mistake of booking a 1king bd instead of the 2-queen I intended. This is one of the few that actually has 2 queens in the room by the way. After realizing the mishap, we went back to the front desk and they were able to find a room to accommodate us with no extra charge. Room was simple but really clean with great comfy sheets and an amazingly comfortable bed. Us girls had a great sleep. I work for public health in Toronto so I'm very cautious about hotels and its cleanliness. This location was very well kept. Security was amazing as well as you need to swipe your room card in order to access the elevators, the parking garage and pretty much virtually every part of the hotel. The staff really make everything easy for their patrons. I highly recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jamar Langworth","date":"2013-01-24 04:30:43 +0300"},{"content":"Actually, we thought we were booked into the OTHER Central Park Hotel, and for what we paid, we should have been. I noticed a review that indicated payment of 25 pounds per night and we paid more than three times that! How were we to know that there are 2 Central Park Hotels! The elevator (lift) was not in working order and we had 2 full suitcases each, plus hand-luggage because we had just come off of a 15 day cruise. I feel sorry for anyone staying in the room beneath ours because the floor squeaked horribly with every step. The curtains on one window were coming down and did not close completely. The first day we had both hand towels and bath towels; after that we only got bath towels. The bed linens were clean and fresh, but consisted of only a bottom sheet and duvet with cover. The first night was quite warm, so we took the cover off the duvet and used the cover as a top sheet. The bathroom was tiny but clean - and sadly in need of an upgrade - but there was no place to put anything! No hair dryer, and I didn't realize that we could have borrowed one from the front office until I happened to see someone return one on the final day of our stay. There were no water glasses in the bathroom or room, but the night registration desk clerk got us 2 when requested. The next morning, when I asked for 1 more, the dining room attendant rudely addressed my request noting there are not enough for everyone to have a glass. Excuse me! If this location is going to advertise as a hotel, then water glasses in the room is a very minor amenity they should provide - along with hand towels. Desk clerks were very friendly and helpful and even loaned us a converter so we could charge our camera batteries. As with other reviewers, I agree that it is conveniently within minutes walking distance to bus or tube transportation. Free internet was nice. As for noise level at night, weekends were very noisy during the late hours; the week-day nights were quiet. Be aware that this location is more of a hostel than a hotel, and not worth what we paid for the accommodation.","ratings":{"Service":2.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":2.0},"author":"Baron Hilpert","date":"2013-04-04 04:47:12 +0300"},{"content":"4 Star that will be a 5 star in a few months!! My husband and I stayed at the Majestic Elegance from December 28th - Januaury 4th. After reading some of the reviews I think some people completely over reacted to the severity of the resorts problems. When we initially arrived at the hotel we were greeted with a smile and were pleasantly surprised at how much the hotel resembled the pictures in the travel brochures. We checked in at about 2 pm and were told our room wasn't ready so we headed to the Seaside restaurant for lunch and upon returning to reception our room was ready. At first, our room's shower was not completely finished, but after making the front desk aware of this it was immediately attended to. Other than that our room was gorgeous. I have stayed at many resorts and never have I had a room that was as nice. Two nights when we went to shower there was no hot water, but once again after calling the front desk that problem was looked after. These types of problems are very common with a new resort and hopefully they will have these glitches worked out sooner than later.All of the restuarants were great with lots of selection. You could always get something made on the spot. The only down side to the main buffet was that none of the food was labelled so at times we had no idea what we were getting into.The beach was incredible. We could walk in either direction for miles and walked the beach everyday for at least an hour. The pool was also great and went on forever. Some people complained of the pools temperature, but it was nice and refreshing amidst the hot weather. Go here with a relaxed attitude and you will have a fanstatic time!","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Kelli Ratke","date":"2013-11-08 02:09:00 +0300"},{"content":"Great Stay Dec. 26, 2008 - January 2, 2009On arrival, we were advised that our room would be ready by 3 pm. We went to the buffet, followed by a walk on the beach and shortly after 3 pm we were taken to our room (Colonial Junior Suite). A worker was putting last finishing touches on the hot tub area which was not a big deal to us. We had two balconies, one facing the pool and ocean and the other with complete privavcy, comfortable lounger for two and hot tub. Our room was beautiful.That night we discovered switch for lights in bathroom and shower did not work (they stayed on all night). We called in the morning and they were fixed right away. That was the only minor problem we had with our room. A friend staying in Junior Suite also had no problems and a beautiful room. We had buffet for breakfast every day and found the choices to be excellent. The baked items were decadent. We had dinner at the Italian Restaurant twice (lasagna was served stone cold and veal scallopini was dry one night and excellent the other. Aside from that we still enjoyed our meals there. We had a wonderful evening at the Gourmet Restaurant (greeted with champagne) as well as the Steakhouse and the Sea  See (shrimp  lobster) overlooking the ocean. This is where we also ate our lunch every day, which was a buffet with lots of choices and a couple of new things every day. The cakes and baking were outstanding. New Year's buffet was superb. Greeted with champagne at the door and there was everything under the sun on the buffet - it was a real extravaganza. We found all staff to be attentive, friendly and quick to serve. Before going, having read some of the reviews and room problems, I was worried but I can now say that this was one of the best holidays I have ever had (cruises included). The people were excellent and any issues we did have were remedied in short order, including lack of face clothes. Initially, we did not get any in our room but when we asked they were there every day following. Staff are very eager to please. There was champagne and fruit plate in our room on arrival and again champagne to enjoy on New Year's Eve. New Year's eve, there was a band, excellent show, and fireworks. In all, we had an excellent time at the Majestic Elegance. We saw every day, workers ironing out the room and facilities problems but again, we had two rooms and both had no problems that weren't fixed within minutes of letting the front desk know. Would definitely go back.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Uriel Kuhic","date":"2015-01-16 22:40:38 +0300"}],"public_likes":["Melba DuBuque Jr.","Favian Keebler","Mrs. Deshawn Hand","Maxwell Shanahan"],"vacancy":true,"description":"The pre-eminent hotel in Newcastle and one of the best in Northern Ireland. Includes a spa and conference centre. Close by the Royal County Down Golf Club.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}