{"title":"Fishguard","name":"Garn Fach B&B","address":"Llanwnda, Goodwick","directions":null,"phone":"+44 1348 873161","tollfree":null,"email":"stay@strumblebandb.co.uk","fax":null,"url":"http://www.strumblebandb.co.uk/","checkin":null,"checkout":null,"price":"£70","geo":{"lat":52.01381,"lon":-5.01462,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":9154,"country":"United Kingdom","city":"Pembrokeshire","state":null,"reviews":[{"content":"My new wife and I stayed a week here after our wedding. From the moment we landed and called for the free shuttle, we felt very taken care of. The grounds were amazing (18 acres - more than half of that protected wetlands), the lobby and main entry room were beautiful, and the staff both professional and extremely courteous. Our room was perfect, the bed was comfortable, and the bathroom was very generously appointed. This hotel has living room areas in each of the guest buildings with complementary water, string cheese, yogurt, ice cream, and a selection of very delicious malt balls. Their shuttle will take you, free of charge, to the SeaTac light rail station, airport, and a local mall with some excellent restaurants (be sure to try Joey's at the Southcenter Mall) and a Target right across the street from the mall in case you have forgotten anything you need. When you're ready to return to the hotel, a quick call gets you a reasonably quick pickup and ride back. While we were within walking distance to the airport, we rarely heard airplane noise even when outside and never while inside. We could not have chosen a better place to spend our honeymoon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Saul Renner","date":"2012-06-12 21:26:24 +0300"},{"content":"Our experince started with the free airport shuttle and continued right throught the checkout. Awesome place!! Love the common lounge areas and the walking paths around the grounds. Great food and bar too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eileen Runolfsson","date":"2014-05-11 06:48:01 +0300"},{"content":"If I was searching for a place where I could relax, be surprised and enjoy without the risk...this would be it. My only caution is not to eat too much and beds are semi firm it that matters to you. Great staff...shuttle to light rail and area. Rent a car only if you need to!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Tyler Cassin","date":"2015-08-06 23:04:17 +0300"},{"content":"We stayed here the night before we had to fly home after traveling to Vancouver for a wedding. What a great way to end the trip. This hotel really knows customer service. They upgraded us to a corner suite for our anniversary. Beautiful grounds. We had a light dinner in the almost empty restaurant and it was good. We will be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cecile King","date":"2012-01-26 00:53:44 +0300"},{"content":"I imagined it was going to be beautiful just by looking at pictures. I even did a quick drive through before I actually checked in but once I actually walked through the door, I realized that pictures did not even do the Cedarbrook lodge any justice. They also have living rooms in each off the buildings and they are fully stocked with chips, cookies, ice cream and water bottles. The rooms are fairly spacious and have a very clean and fresh scent. The bed was extremely comfortable and the sheets were some of the softest I've ever laid in. The bathroom was AMAZING with a huge soaking tub. My boyfriend and I are in a long distance relationship so staying in beautiful hotels for our weekend getaways is a thing that we have embedded into our relationship. I wanted our stay here in Seattle to be perfect and the Cedarbrook lodge is honestly one of the absolute best hotels we've ever stayed in during the past year and a half of our getaways.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rhett Oberbrunner","date":"2015-03-03 10:14:20 +0300"},{"content":"Minutes from Sea-Tac but so far removed in atmosphere, this amazing lodge delivers impeccable service, accomodations, and amenities. Seemingly, every need is anticipated and provided for and every staff member has genuine concern for your comfort. A truly relaxing experience as a base for exploring the area, as a stop over when cruising or traveling West, or for business.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lilian Emard","date":"2014-03-07 15:05:39 +0300"},{"content":"I stayed at Cedarbrook lodge for 3 nights for work. I loved everything about it. The rooms were very clean, very comfortable bed, nice bathrooms, and every meal was great! (breakfast, lunch, & dinner!) The best part was the atmosphere. There were beautiful trees and pond features on the property. I loved the outside fireplace and all the indoor fireplaces. Very warm and cozy. The fitness center was great too! The \"living rooms\" were great, it was nice to sit by the fireplace and have some free icecream and malt balls. Also the customer service at the bars, dinner rooms, and front desk were wonderful. The best was a bartender named Pete. Very friendly and fun to talk to. I hope work sends me here again, it was a great stay! If you are needing to be near the Seattle airport, this is the best place. I'm not sure if I'd stay here if I was wanting to spend my time in Seattle due to commute. Regardless, I loved this place!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Rowan Goyette","date":"2013-03-12 20:34:54 +0300"}],"public_likes":["Torey Rodriguez","Margarita Stanton","Emery Blick","Desiree Heller"],"vacancy":true,"description":"A quiet rural 4-star bed and breakfast in Llanwnda on Strumble Head, close to the [[Pembrokeshire Coast Path]] and ideal for walkers","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}