{"title":"Birmingham (England)","name":"ibis Styles Birmingham Centre","address":"65 Lionel Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48196,"lon":-1.90647,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3617,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Stayed here for a business meeting (we actually used the hotels facilities, which were very nice). Rooms were clean and trendy (reminded me of the W chain). Front desk was very nice, helpful. Cocktail hour each day was nice, although early (I think it's from 4-6). Didn't get to tour Chicago, because we were stuck in meetings, so I can't comment on location. But the beds were super comfy and linens were nice. My only complaint was noise. (If you are in a lower room, you'll hear street noise. Higher rooms, you'll hear the train noise. If you are in the middle, like I was (7th floor) - you get BOTH! Take earplugs if you are a light sleeper!!) But, I don't think you can avoid noise in a city!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Cathy Roob","date":"2014-07-04 05:56:28 +0300"},{"content":"We stayed here on a \"deal\" and were very pleasantly surprised. The staff was outstanding in terms of helpfulness with our questions about Chicago. Housekeeping and maintenance also gave prompt attention to needs such as delivering a hair dryer to the room and fixing a remote control on the wide screen TV. Free coffee in the lobby (which we brought into the on-site restaurant to finish and they didn't mind). Comfortable room, free internet (if you sign up for the free rewards program with Kimpton Hotels). The L is just 1.5 blocks away so we took it out to various sites.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Guillermo Hyatt","date":"2013-01-30 17:05:06 +0300"}],"public_likes":["Stanley Jakubowski","Brady Bernier","Kendrick Dickens","Connor Kertzmann"],"vacancy":false,"description":"Located east of the core city centre on Lionel Street, it is a former Holiday Inn Express property that became and ibis Styles after some very light refreshment. As in all ibis Styles, breakfasts and free WiFi are included in the room price, which can be very attractive, compensating for the less central location.","alias":"formerly Holiday Inn Express and Lionel Street Hotel","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}