{"title":"Paris/8th arrondissement","name":"Champs Elysées Plaza","address":"35, rue de Berri","directions":null,"phone":"+33 1 53 53 20 20","tollfree":null,"email":"reservation@champselyseesplaza.com","fax":"+33 1 53 53 20 21","url":"http://www.hotel-elysee-plazza.info","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.8737,"lon":2.30622,"accuracy":"ROOFTOP"},"type":"hotel","id":21842,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Let's get the negatives out of the way first. It's not on the beach. It's not in the loveliest part of Maui (Kihei in general is looking pretty old). The restaurant needs a complete overhaul. So, why stay here at all? Because you will not receive finer service anywhere. The staff, from front desk to housekeeping to the shuttle drivers, are all simply wonderful. Your room will be short on luxury but very long on comfort. Our one bedroom suite had a fabulous king bed as well as a sofabed in the living room area, and had 2 plasma TV's. I believe most rooms come with a mini fridge, microwave and coffeemaker. The room was kept spotless by our kind and lovely housekeeper, who always asked what time she should service the room. I locked myself out of the room one day with no ID etc. One of the desk clerks actually delivered a new room key to me where I was sitting by the pool. Now that is service!!! We liked the complimentary shuttle, which will take you 3 miles in either direction. To the north you'll find plenty of strip malls with grocery stores and casual eateries. To the south you can get a ride to Wailea, full of gorgeous resorts, restaurants and a shopping mall. Also complimentary are bikes and use of 3 computers in the lobby. The pool is okay, nothing fancy but attractive enough and we could usually find a vacant chaise. We did not care for the adjoining bar or the restaurant. Breakfast is fine, but we were served a couple of inedible lunches and decided to skip it for the remainder of our 2 week stay. We also liked that we could walk to a great beach in about 5 minutes, and 2 more great beaches were beyond that. There re plenty of small sandwich joints across from all the beaches, so having a picnic on the beach is no problem. We'd highly recommend this place overall. If you are coming to Kihei for any length of time, you may want to consider renting a beachfront condo with a kitchen. If you're going for business, or for a short stay to check out this side of Maui, you couldn't do any better. MAHALO to all staff who went out of their way to make our stay pleasant.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Camron Welch III","date":"2015-01-25 11:38:01 +0300"},{"content":"Wonderful value - we have paid 2-3 times as much at higher-end resorts and walked away (drastically) less satisfied. Rooms were quiet, clean, and modern; our room was outside of the elevator, and we never heard a peep. We appreciated the fridge/microwave but never had the chance to use it; did not use restaurants/room service/fitness area either. Front desk was genuinely friendly and helpful. We stayed Christmas week, and even though they were booked, they permitted us to have a bit of a late check-out. Pool water was a bit cool/crisp, but it would be a waste to have a pool heater due to Maui's warm temperatures. Pool and hot tubs were very clean. Enjoyed the music in the pool areas in the evenings. Liked the hotel's proximity to the beaches and the rest of the island. Definitely would stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Anika Waters","date":"2012-06-16 17:19:36 +0300"},{"content":"This is a great hotel , although its not on the beach the beach is right across the street. Very clean rooms, Best bed I have ever slept in at a hotel. Can't say anything negative about this hotel. Would definately stay again","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Oran Gutmann","date":"2013-07-03 05:28:02 +0300"}],"public_likes":["Ford Durgan","Arnoldo Ortiz","Korbin McClure","Porter Schmidt","Ms. Kyle Russel","Josianne Robel","Hailey Brown"],"vacancy":true,"description":"Unusually large rooms and suites. Elegant and sophisticated, with high tech equipment and comfort, they offer a unique mix of contemporary chic décor with ceiling moldings, marble fireplaces, and large windows looking at two beautiful and quiet streets.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}