{"title":"Lochmaddy","name":"Lochmaddy Hotel","address":null,"directions":"2 minutes walk from the ferry terminal.","phone":"+44 1876 500331","tollfree":null,"email":null,"fax":null,"url":"http://www.lochmaddyhotel.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.59802,"lon":-7.15909,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15977,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"Moved to ZiQoo from the adjacent Grand Midwest Express hotel (see my review of that unsatisfactory experience). Though the ZiQoo Apartments are in an identical building, the ambience and feel could not be more different - in this case significantly better and calming. A lovely aquarium in the foyer with the sound of running water. Attentive front desk personnel and housekeeping staff who run to open doors, press the lift buttons, ask if they can help with your bags. Almost embarrassing for someone from Britain where service comes grudgingly if at all! The apartment furnishings are excellent - a mini chaise longue in my deluxe studio, a beautiful large tripod leg lamp, plenty of socket outlets and extension leads, a really nice halogen desk lamp and of course that wonderful firm but stylish bed - with lights underneath - nice touch! Kitchen has everything I needed making my purchases needed at the previous place redundant. Out on the balcony, there are two wooden chairs and a table, there is a vacumn cleaner and iron. A storage storage storage! A lovely desk with lots of drawers. The bathroom is functional - it is not some Bauhaus stand up shower but it is functional clean and with a good powerful shower. Where there have been small problems - someone had clearly burnt their clothing with the apartment iron - that was replaced in five minutes, cleaning and fresh towels most days and when I forget to do my wahing up, it gets done for me - again makes me feel lazy!! Internet connection is cabled but it is pretty fast (the whole of Dubai seems to have slow Internet compared to UK) but cable in my view is better that a weak WiFi signal which is often the case on higher floors in a building like this. I have already mentioned excellent service - the car parking area below is free and ZiQoo have a reserved area. You get a notice if you fail to display your parking authorisation card. The other night I got a call to say that my rental car interior lights had been left on and they were worried the battery would run down - that's service. Con's? I am struggling - there's one Muzak track with crazed trumpeting that opos up at night but that has been attended to, and something beyond the hotel's control is the traffic in the morning exiting the Discovery Gardens area - due to what seems to be totally inept traffic engineering and planning, there can be long queues to get into the one lane out of the place on weekday mornings. Similar problems can arise on the way back - but my tip is - southbound on Sheikh Zayed Road, take Discovery Gdns turn off, get into left hand lane as you cross on flyover, then after first lights, get into right hand land before left turn for ZiQoo, then don't join the inevitabel queue in left hand lane, stay in left hand straight ahead lane and when lights go green turn left from straight ahead lane. Perfectly legal and could save you 10 mins getting back here if you are driving. Other tips for British travellers, there's a nice if expensive Waitrose in Marina Mall less than 10 minutes away across Sheikh Zayed Road - great bread and other home comforts - free parking too (at the time of writing - Feb 2010). Been here a month already and about to extend for another. Highly recommended if you don't need to be in central Dubai and are working in Marina, Jebel Ali or Jumeirah Lake Towers areas of Dubai i.e on road to Abu Dhabi before Jebel Ali.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Jayson Hegmann","date":"2013-04-09 03:43:31 +0300"},{"content":"Decent Trip We just returned from the Iberostar Bavaro.Rooms:Great, beds excellent, nice layout and very clean.Resort:Grounds Impeccable, Layout is average. I did not like the only bar open to be between the lobby and theatre area. The theatre shows were substandard. Workers are nice.Food / Drink:I found the diet coke to be syrupy at times, which ruins the cuba libre. Food was the best out of all my 10 trips down south. Room service was not bad.Beach:Amazing. Little wavy but lots of fun with the tubes we purchased on the caribbean street.Disco:The wing of a DC-6 airplane is the bar countertop, kind of cool. Not very busy but set in a cute plaza area.Dislikes: Shared services with the other two resorts. Too many trucks and mopeds on main walking paths. We stayed in 2401. Had trouble sleeping due to the operations at 4:30 am taking out the trash from the back of the restaurant. It was also close to the pool which was being renovated in the middle of the night, tile cutters buzzing at 2:00am. We then got extended checkout, which was really expensive $50pp, but we still had to pack up and move to a different room. If we had adequate rest we never would have needed extended checkout. Overall: The dislikes are just a minor aspect of the trip, i would go back here again for sure, price may be a little much though.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Kimberly Sipes","date":"2012-01-04 20:57:22 +0300"},{"content":"It was so wonderful until we got home.... My husbnd and I stayed at this resort September 8th through the 15th 2008. Our room was wonderful. The service was great. The grounds were beautiful. Everything was great while we were there. We tipped in the restuarants and the wait staff never forgot us. My husband tipped the cook and a rib eye steak was his anytime. That was at the buffet. It wasn't until a month after we got home that we realized there was a problem. The fraud department at our bank called. Our bank account had been compromised from someone in the Dominican. We had stayed in Punta Cana and the charges were coming from Santa Domingo. My husband had only used his debit card at the ATM in front of the bank on the resort.I do remember that one day when we came back from the pool our safe was open. Of course I asked my husband and he said that he thought that he closed it. We checked everthing and everything seemed to be there.The bank believes that my husband's card was compromised directly from our safe. All the information about you is in the strip on the back of your card. Who ever compromised our account actually has my husbands pin number. So a word to the wise make sure you don't bring any cards with you, only bring travelers checks or cash. I'm not sure how safe either would be at this resort. I can't find an e-mail address to notify the resort. If anyone has one please let me know.Thanks","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":3.0},"author":"Camylle Huels","date":"2014-02-20 20:52:43 +0300"},{"content":"OMG this hotel was amazing.! this hotel was great and the staff was amazing.! Im 16 years old and my sister is 13, and we traveled with our parents. And this is a all inclusive (joke with the staff) is a great resort for everyone. room-Conveinent (spell?) to my mom we got connecting rooms which was easy to get inbetween ours and our parents rooms. I thought the beds were really comfertable and we got good night sleeps, and the maid service was amazing and everyday we came home to a clean room with flowers and chocolates. pool  beach-the beach was really pretty and the water was basically air temp. the only thing is for people who havent traveld or dont live in europe, may be offeneded by the topless beach goers. There was plenty of things to do on the beach like volleyball and snorkling, windsurfing, kyaking and much more. The pool was awsome and had activites to do as well as a pool side bar. the towels were convient because you could trade in yours anytime you wanted a fresh one. It was really clean as well and lunch is pool side.food-breakfast is a buffet but its like art and for dinner as well. the way they set it up is basically set for a picture.! the food at the buffet is good because they have so many things to choose from and an amazing dessert. the resturants are okay, they have cajun, mediterainian, and japanese and alot of other things. supprisingly the resutants arent that good, and becareful THEY DONT CLEAN THE SHRIMP, my sister and i are vegitarians and it actually was wast to find food, even without the shrimp. another great thing is that there is ALWAYS food.! if you miss a meal, there always is food by the pool.staff and entertainment-i CANNOT say enough good things about them.! they were the ones to make this vacation as great as it is.! There is always things to do during the day and the star friends always try to get people out of their comfort zone to participate, in a great way. Spagetti, pikachu, j.p, trebelin, and henry just to name a few were so funny always up for a laugh for example, dressing up in makeup and bikinis to take pictures with the guests on the beach.! the night shows were the BEST time of the day, both funny and dancing your mouth is either smiling, laughing, or just open with suprise.excursions and airport travel-the day excursions were fun but we only did the half day ones which pretty much took up a whole day. The only thing was the roads arent very developed so its a bumpy ride, same with the two and from airports. But it was all worth it.Overall it was a great trip.! we met people from all different places and all different ages.! i highly recommend this to anyone who wants an amazing vacation.!","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Fritz Marquardt MD","date":"2013-12-26 22:09:40 +0300"},{"content":"WONDERFUL!!! The resort was wonderful. All of the staff was very nice and took care of everything. My husband and I went with our 19 month old son, my parents, and my brother. The rooms were very clean and the maid service even arranged my sons diapers in order on the tables. All of the staff was exceptionally nice to my son and there were many activities for him. The food was wonderful also. The variety was amazing.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":3.0,"Rooms":5.0,"Location":5.0},"author":"Herbert Hauck","date":"2012-03-19 17:26:49 +0300"},{"content":"Back Again and it Keeps Getting Better!!       Cajun Gourmet, Almost there","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Jayson DuBuque","date":"2013-08-23 08:42:32 +0300"},{"content":"watch what you eat!! Try to use cash!!! My husband and i spent our 10 year anniversary. When we arrived the hotel staff was not that friendly. We were not offered a drink, as other guests where. Upon arrival to the room, we thought the room was very nice. The grounds were also beautiful except for the stagnant pond neer the dining room. The second day of our trip, my husband became ill with tourista. I had to cancel reservations to the restaurants. I was told i had to come to the reservation desk to reschedule, they needed a receipt. The third day of our trip, i became ill. Overall the experience was not great. The food was bad. The service ok. Beach was beautiful. When we returned home we were called from our credit card company that there had been fraud like spending on two credit cards. The hotel was where we used these cards. Apparently there is some way you can copy a card, because we did not loose them.","ratings":{"Service":3.0,"Business service":2.0,"Cleanliness":4.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":4.0},"author":"Ms. Clotilde Bradtke","date":"2012-11-03 10:33:30 +0300"},{"content":"Loved It!       Restaurant Jambalaya (Cajun) - the best one!","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Jacky Marvin","date":"2013-10-07 11:50:55 +0300"},{"content":"Great Resort Our group of 27 stayed at this resort from June 4th-June 11th for my daughter's beach wedding on Friday, June 6th. The wedding photographer assigned to our wedding took many great shots and didn't mind family members taking pictures, either. The wedding coordinator was new to her job and did her best, as some of the smaller details were overlooked. The staff was very friendly, efficient, hard working and made sure you had a great time. The food at the buffet was plentiful and served hot. We never had a problem getting a spot at the pool or beach. The Dominicans appreciate any tips and remember those with better service and a big smile. Remember to bring lots of singles or smaller bills, as the front desk usual doesn't have change. The rooms were comfortable and cleaned early in the day by maids. My clothes did smell a little musty when I returned home, but were fine after washing them. We did the Stingray Bay trip and I would highly recommend this 1/2 day experience. Hint: The hot water in the shower is not all the way to the left, but set the top of the knob to the 1 to 2 o'clock position to get hot water. The only complaint I had was the peacocks. They are beautiful, but make call to each other in the night and expecially early morning, which makes it had to sleep in. They nest in the palm trees or on the balconies. Our room (1093) was in the first bungalow after the lobby area and many nested in trees. Some of our party were away from this area (closer to the pool) and didn't hear them as much.","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Garret Durgan","date":"2015-01-27 05:01:22 +0300"}],"public_likes":[],"vacancy":true,"description":"An established hotel next the ferry terminal.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}