{"title":"Inverness","name":"Bunchrew House Hotel","address":null,"directions":null,"phone":"+44 1463 234917","tollfree":null,"email":null,"fax":null,"url":"http://www.bunchrew-inverness.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.482521,"lon":-4.300607,"accuracy":"ROOFTOP"},"type":"hotel","id":12240,"country":"United Kingdom","city":"Highland","state":null,"reviews":[{"content":"Trip Advisor member - norfolk, UK Stayed at the Ramada Plaza for three nights from the 28/12. Having read a couple of reviews on TA site I was dubious about the accommodation, however, on arrival the receptionist was friendly and gave us directions to our room. We were in the motel section on the upper level. We parked below our room and there were not too many stairs to climb to upper level. Room was large with two double beds. Checked sheets, matress, etc and all were clean. Bed was comfortable with enough pillows and bedding. Air con worked well, tv and all lights worked. Coffee maker provided, as well as iron, board and hairdryer. No safe in room but I believe they were available from reception. Bathroom clean and provided with enough towels and products. Close to Disney and all restaurants, etc on I192. Overall, my daughter and I found this accommodation satisfactory and good value and would use again if visiting Orlando. No resort charges.","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Glenna Abbott","date":"2013-08-05 07:03:09 +0300"},{"content":"Having used this web page on many occasions to get the low down on planned holiday accommodations, I thought it's about time someone else benefited from my Hotel experience. My wife & I have just returned from a holiday to Orlando staying at the Ramada Plaza hotel in Kissimmee, This is our review. Reading the past reviews on this hotel ranging from '$@!#%' to 'good value for money', We arrived with some in trepidation on what to expect. Well generally the hotel staff were very friendly and helpful. Booking in was quick and we were directed straight to the 'motel' room (141) accommodation on the ground floor, (not the tower rooms, where reviews have always seemed more favourable) Our room also had handy car parking right outside the room. (Not always a good thing, as you will read later). Our room was very clean, had 2 large queen size beds, nicely made up, the bathroom had a bath, shower and toilet, plenty of fresh towels and a separate sink area. This also had a small but adequate fridge, ironing board, an iron, hair dryer, all working. There was a large TV (with free and pay as you view options). A small table and 2 chairs, and 2 adequate sized chest of draws. So we were pleasantly pleased with the room. Beds were made up every day but not with fresh sheets, these were changed once a week, but towels were changed daily. Now for the down side. Being on the Ground floor, and discovering later we were situated close to a hotel maintenance room, we found there was little regard for those trying to sleep. On a few occasions we had the need to report noisy staff congregating outside the maintenance rooms after 11 at night and on our first night a large delivery vehicle left its engine running for over half an hour after midnight outside the room, while the driver chatted with staff. A phone call to reception on each occasion did restore the peace, but I cant help wondering if this was a coincidence & It did not prevent similar issues on subseqent nights. Each morning we were woken early by the movement of maintenance and laundry trolleys being pushed along the path outside the room from 7:30am onwards, and during the 1st week our room maid knocked on the door at 8:00am to see if we were out. Not Impressed! Vehicles parking up and driving off at all hours of the night also presented a problem especially for a ground floor room, so be warned. If it wasn’t for the fact we were so very tired after the resort trips it would of been a greater issue. We should of realised that after the first problem we should of asked to move, But we were reluctant to change as the room was nice,the parking convinient and you never know what you will end up with. If I could of got a tower room, I would of done so, but these always seemed to be full. Both pools were small, clean and adequate for a quick dip. The pool surrounds were nice and the gardens well kept. There were always a free lounges to use when we were there and clean pool towels available. Be advised that there were some motel style rooms next to the heated pool and games area, which could present some unwanted noise, but great if you have kids. So in a nutshell, the hotel is generally very good for the money, its not luxury so don’t expect it. Staff were helpful and friendly. Its excellent located for the Disney Resorts, Only 10 mins from the closest (MGM). There are local amenities (shops, restaurants etc) right outside the hotel if you need them. I never went up the tower, but I would recommend a room there based on what we got and the reviews on these rooms, or at least be very choosy on what you get if they give you a motel room. I would use them again but would be more wary of my room location next time. If anyone wants any information on this Hotel or generally about holidaying to Orlando or the resorts then please feel free to contact me.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":4.0},"author":"Jerald Veum","date":"2013-11-28 00:58:55 +0300"},{"content":"-Staff are a mixed bunch. Half are con artists, the rest are just incompetent. If your not hiring a car DO NOT let them push Ceasers Transport on you. They're paid comission by this unreliable, over priced taxi firm. Insted look up a local taxi, which we found to be almost half the price. -Room wasn't in a good state, needed new light fittings and plug sockets were hanging off the wall. However room was cleaned daily to a good standard. -Didn't use the pools, looked clean and in good repair, but Imagine they are absolutly heaving in peak season. -Location was excellent, a half dozen eaterys within walking distance, a free shuttle to Disney and not more than 15miles from the Universal parks. As a stand alone hotel it was very poor, however from a value for money perspective it was satisfactory.","ratings":{"Service":1.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":1.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Lelah Blick","date":"2012-07-21 14:37:36 +0300"},{"content":"I recently booked a room there for three nights, but only stayed one. Everything in the room was wet, the rooms were very dark, and the service was just so-so. I got a refund for my other two nights and switched hotels. Was much worse than what I had expected and would not stay again.","ratings":{"Overall":2.0},"author":"Kian Eichmann","date":"2013-11-03 17:30:09 +0300"},{"content":"Well I didn't quite have the experience that some of the other guests have experienced. We stayed there due to the \"24 hour airport shuttle with nonstop service\" that was advertised on their website and the great deal they were offering. Well, it isn't nonstop service, you have to schedule it. And the front desk staff did not notify the driver so when we went to the front desk (thankfully a little early) in the morning they had to call her. It was no problem and very early and the driver was very pleasant despite the early hour. Front desk staff was always very friendly. They gave us the wrong keys the first time and it was easily changed. The shared accomodation areas (conference center, pool, etc.) looked pretty nice and in decent shape. Our room was an outside room, which is not ideal and probably would have stopped us from booking but whatever. The room was...not good. There was stained furniture and the bathroom wasn't too clean. I took a shower with my sandals on and had my husband do a sponge bath, figuring he would be dirtier for getting in the actual shower. The sheets looked clean and the bed was fine. We didn't watch too much television, so can't comment on that. The hotel has it's ups and for us the airport transfer was one of those. Their shuttle actually goes all over the city and is conveniently located, so nice for out-of-town travelers who don't want to rent a car.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":3.0},"author":"Ricardo Jakubowski","date":"2013-06-17 23:37:20 +0300"},{"content":"March 14, 2008 I Stayed at the Grand View Inn and Suites. I was amazed when I arrived at the property dispite the bad comments I have heard from friends that it wasnt all that bad. The hotel is currently going through remodeling. At one time im sure this place was booming. Grand View has an indoor pool, a bar and restaurant. Im sure in June when they have their grand opening busiiness will be booming once again. I enjoyed my stay Friday night. My kids and I enjoyed the swimming pool all the way until closing it was very peaceful. I would love to see the property once everything gets going In june.","ratings":{"Service":4.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Flo Rau","date":"2015-02-20 00:07:16 +0300"}],"public_likes":["Rickey Wilkinson IV","Jett Rosenbaum","Jeanie Schmeler","Estrella Goyette","Hardy King"],"vacancy":true,"description":"County house hotel on the waters edge of the Beauly Firth.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}