{"title":"Lampeter","name":"The Falcondale hotel and restaurant","address":"Falcondale Drive","directions":"about a mile out of town, up its own private drive","phone":"+44 1570 422910","tollfree":null,"email":"info@thefalcondale.co.uk","fax":null,"url":"http://www.thefalcondale.co.uk/","checkin":"from 3pm","checkout":"after 11am","price":"from £150 bed and breakfast, for two people sharing","geo":{"lat":52.1213,"lon":-4.096,"accuracy":"APPROXIMATE"},"type":"hotel","id":15135,"country":"United Kingdom","city":"Lampeter","state":null,"reviews":[{"content":"Things I Liked about the Lazy Parrot: -The price was right -Tastefully decorated from top to bottom -Even though it's a \"mini-resort,\" it doesn't feel pretentious or uppity; just comfortable--like coming home. -Food at the Rum Shack was great -Friendly, very helpful staff -The view from our room was GREAT, and we got a HUGE balcony (patio would be more accurate) without requesting it/paying more Things I Didn't Like So Much: -For being a hotel in a city all about surfing and beaches, there were painfully few places in the room/bathroom to hang up wet items. Our \"closet\" wasn't even tall enough to hang up a shirt without the bottom brushing the shelf! (We had the railings outside on our balcony, of course, but since it rained both our nights there, that was counter-productive) -The shower and I didn't get along. Futzy temperature control burned me, then froze me. Water pressure left something to be desired. Overall, the good definitely outweighs the bad, and I would stay there again for sure!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Jordan Moen","date":"2013-07-03 13:35:33 +0300"},{"content":"Very friendly owner and staff, the facility is tastefully done, quality furnishings are used and attention to detail during construction was obvious, fit and finish is very professional. Our room was excellent, all tile floors, tile bath and shower, air conditioner worked flawlessly, ceiling fan moved the air well, bedding was very comfortable, good quality. Small refrigerator and microwave. Continental breakfast was adequate, fresh fruit, bagels, cereals, pastries, juice, milk and great coffee.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Damion Brakus II","date":"2013-02-12 00:48:36 +0300"},{"content":"It was literally ironic I came to this Resort because all of the good reviews it had. But I was surprised when I found out that it was terrible. The room was not what I expected, too little, the bed was uncomfortable, the air conditioner was so noisy I couldn't sleep the last night and for the last the pool was dirty. I almost forgot prepare to take a shower with cold water. There's no service, the buffet breakfast is very poor. I will never return to this place again, maybe if is for free!","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":1.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Reginald Lindgren","date":"2014-04-01 00:04:37 +0300"},{"content":"My husband and I spend 5 wonderful nights at the Lazy Parrot. This was our first time at the Parrot & to Rincon. Our room overlooking the pool, was one of the best we've stayed in. The food at both the hotel restaurant & Rum Shack were great. Special thanks to Lenore at the Rum Shack helping us when we unexpectedly adopted a puppy during our visit. The only disappointing part of the trip was that the hot tub wasn't working & that the pool was too cool to use due to the time of year. We would definitely recommend the Parrot to friends & family.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Krystina Lynch DDS","date":"2014-04-27 21:55:15 +0300"},{"content":"We scheduled our vacation to Rincon and The Lazy Parrot after winning a free 2-night stay at a travel expo. Tacking on an additional 6 nights, our stay at \"The Parrot\" was 9 days/8nights of nothing but complete relaxation and enjoyment. Chock full of character, this place is designed as a maze of walkways through gardens and grottos, with hidden nooks around every corner. Once you're here, it truly feels like a different world. If you want to lay in a shaded hammock and quietly enjoy a book, you got it. If you want to lay by the pool and soak up the rays, you got it. If you want to stroll over to the poolside bar and order up a cocktail or quick bite, you got it. Fine dining on premises, you got it. Spotlessly clean, spacious, well-appointed rooms worthy of 4 stars, you got it. But here's the best thing you've got......personalized service from a family and their staff who are second to none. Usually after a stay of this length, you can find something, even something minor, to complain about-something that you would do differently if it were your place. The only thing we would do differently is to stay longer next time! The Lazy Parrot is a one-in-a million gem and we will return, hopefully soon!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Maiya Friesen","date":"2014-12-09 06:08:25 +0300"},{"content":"We love the Lazy Parrot! We stayed (family of 5) 12/24/-12/29 and had a great time relaxing and enjoying ourselves. The rooms were comfortable and tastefully decorated. We loved dinner at Smilin Joe's and drinks and lunch at the Rum Shack. The gift shop is absolutely packed with the cutest trinkets and souveniers. The front desk staff were accomadating, friendly, and always helpful. Even the cleaning crew was nice! We will definitely be back.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Darius Rutherford","date":"2014-01-30 11:03:50 +0300"},{"content":"I just returned from Puerto Rico where we spend part of our trip in Rincon at The Lazy Parrot Inn. It is nestled in the hills and has views of the ocean. We stayed in the new building - our room was comfortable, clean and nicely decorated with a large balcony overlooking the swimming pool. There is a casual, friendly feel to the place and it was a nice contrast to the large resort in San Juan where we had stayed. The pool is nice but the hot tub was cold during our visit. There are 2 restaurants, one outdoors by the pool which has a decent menu and good food. We did not eat at the restaurant upstairs which is a little more formal but the menu looked inviting. There are some lovely outdoor tables set in little secluded areas. There are 2 cages with parrots and love birds that our kids loved. Our stay included continental breakfast which again was eaten by the pool. While waiting for our dinner the first night, our kids played with other kids around the pool area while we chatted with other guests. It was definately relaxing for us and our children. On the downside, when we arrived, we had already been in Peurto Rico for a week and had three big pieces of luggage. We had to lift them up a flight of stairs, then down a series of steps at the other side and then up two flights of stairs to our room!!! I asked if there was anyone to help with bags and was told no! On our departure, we discovered that we could drive down the side of the inn and bring our bags out by the bar but that still involved lugging them down two flights. Also, on our first night, the ice machine was out of ice and the blender to make frozen drinks was broken. The second night we stayed, there was an engagement party by the pool and some other event going on and the place was crowded. We placed our order for dinner shortly before 8pm and at 8:40pm were told that they were out of one of the items that we ordered. I ordered a salad instead (thinking it would be quick) but by 9pm still no food and one of our kids had fallen asleep. At that point, we cancelled our order and went to our room. There was music blaring by the pool until 11pm which was right underneath our balcony. This may have been a once off - the waiter was really haried - but it might be worth checking with them if there are any parties scheduled during your stay. Also, there is a small step-up going from the pool area to the breakfast area that is not that obvious and we noticed a few people trip over it. On the morning we were leaving, a woman fell over it dropping a glass plate and landed on a piece of broken glass that went into her knee. This is a definate hazard that could be easily rectified by painting the step up a bright color. Pool hours are only from 10am to 6pm but did not seem to be strictly enforced. Our kids are early risers and bugged us from 8am to go in the pool but we did not permit them because of the rule. We were more comfortable with breaking it when other guests were swimming in the pool outside these hours. You also need your own towels to bring to the beach, which we did not know. On the whole, we loved the ambiance and the casual laid back feel at the Lazy Parrot. I think we were unfortunate on our second night and that this may have been an anomoly. We would give it another try.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":4.0,"Location":2.0},"author":"Maybelle Greenholt","date":"2013-04-03 03:57:43 +0300"},{"content":"We stayed for one night on our PR tour and I wish it had been for longer. This hotel is glorious. The grounds are perfectly manicured, the whole thing is right on the seafront; all the rooms and facilities, including the pools are sea facing. The hot tub by the main pool is HOT - very painful if you've spent too much time in the sun! Our room was slightly worn around the edges, but beautifully furnished and decorated. The one negative was that the air conditioning was way too loud to have on at night. We had to switch it off and rely upon the fan. The night we stayed, the restaurant was not open, but we had a perfectly acceptable meal at the cafe. The menu was not extensive and was the same for both lunch and dinner, zo more variety would-be appreciated for an extended stay. The beach was particularly beautiful, with soft white sand and plenty of shade for those who need it. We would definitely return here and wish we had been able to stay longer.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Missouri Boehm","date":"2015-10-08 07:19:08 +0300"}],"public_likes":["Kirk Mante","Aurelie Heller MD","Ferne O'Kon","Kennedy Rogahn","Zackery O'Keefe","Zoey Bednar I","Carmelo Weber"],"vacancy":true,"description":"A Country House Hotel in 14 acres of grounds, including lawns, woodland and gardens. Built in an Italianate style in the 19th Century as a private house, and converted to a hotel in 1980. All 18 rooms are en-suite with free wifi internet access. A 2AA rosetted restaurant is open to non-residents.","alias":"Falcondale Mansion","pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}