{"title":"Bedford","name":"Park Inn","address":"2 St Marys Street, MK42 0AR","directions":null,"phone":"+44 1234 799988","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.134,"lon":-0.46589,"accuracy":"ROOFTOP"},"type":"hotel","id":2623,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"We were traveling with in-laws and child so we needed 3 bedrooms. This place was just what we needed. The shuttle service to Disney could have been a little more frequent, but other than that no complaints. Staff we interacted with was very nice and knowledgable.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Clinton Sporer","date":"2015-02-14 03:51:30 +0300"},{"content":"My wife and I took our niece and nephew to Dinsey World. We drove down from Mass. and were looking for a suite/condo setup so the kids could have their own room. Since we were on a budget, any setup like that in the parks was out of the question. We chose Worldquest based on price, location to the parks and the overall ratings from previous guests. From check-in to check-out, all the employees were great to deal with. Anytime we had a question, they answered it with a smile and most thanked us for staying there. The room was huge, the pictures on their site do not do any justice to the size of the rooms. Everything was clean, the floors, bathrooms, bedrooms and kitchen. The kitchen was fully stocked with anything and everything you would need to cook and feed your family. As a point of info for anybody who needs ice for their coolers on the way back home, the freezer has its own ice maker and makes alot in one night. I was able to fill my cooler with 2 nights worth of ice making. We never used the hot-tub in the master bedroom or the dishwasher, but everything else worked good. The kids had their own bedroom with bathroom which worked out really good for us. And they loved it too because they were able to play with their toys or video games right in their room while we were able to take care of packing, cooking or just getting ready for the parks. The washer and dryer were a great addition to the room, we were able to wash towels and our clothes before we left so we didnt have multiple suitcases of laundry when we got back home. We stayed in building one. The room was very quiet, we never heard any or our neighbors. It was a short walk, only a couple of minutes over to the clubhouse for breakfast in the morning. We were there at 6:30 most mornings and all the food was out and ready to be eaten. Not a big variety of food but it tasted good and we didnt have to pay a small fortune every morning eating at a restaurant or buying more food to make in the room. The pool as pretty big and always clean. Every morning I would see a worker at the pool cleaning it. We never went to the tiki bar, the fitness area or the variety store, so I cannot comment on that. One thing if you need a luggage carrier, ask for it when you check in, there seems to be only a few around for the entire property and had to wait a little while for one to show up before we could unload our truck at check-in. The location is very close to Disney. We stayed in Disney about 5 years ago at Corondo Springs and at Worldquest we were closer to some of the parks. Unlike one of the previous guests I was able to use my gps and bring me to the front door. But off of the main st to turn onto their property, there is no streetlight, so we would look for the Nickelodeon hotel and we knew to turn from there. With the exception of a couple minor problems that the staff was able to take care of quickly, we had no problems and would easily stay here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Miss Lyda Ondricka","date":"2012-03-29 20:32:49 +0300"},{"content":"Stayed at World Quest in Aug/09. Very nice condos we stayed in building 6 which was a long walk to the pool. The condo was clean except for the floor the grout was black with dirt. The dishwasher did not clean the dishes, and the pool was dirty we found worms at the bottom. For the price it was good we had alot of space which is good if you are travelling with kids. I would stay there again for the room size and kitchen.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Cecilia Waelchi","date":"2015-12-18 12:58:50 +0300"},{"content":"This was our first visit to Florida and were all a bit apprehensive, however our feelings changed when we arrived at our Condo, the accommodation was the best I have stayed in for a long time. I especially liked all the facilities, especially the large fridge and the ice box. It was great having a dishwasher and made my life a lot easier when we had meals in on the spacious balcony. The bedrooms were very comfortable and the children loved the spa bath. The pool area was also great. I was delighted that I did not ever have to fight for a sun lounger, most people were very considerate and did not reserve their loungers all day if they were not going to use them. The pool area one day I thought was getting a bit dirty due to inconsiderate people leaving their rubbish, but within the hour of seeing it, it was all cleaned up. We thoroughly enjoyed our stay and if we come back to Floriday one day it will definitely be to stay at Worldquest. My only negative point was the bread and bagels did tend to run out if you did not have breakfast early.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Tavares Nolan","date":"2013-03-26 23:36:40 +0300"},{"content":"My family and I stayed at World Quest a couple of weeks ago for 6 nights/7 days. Looking at the website, it looks fantastic. However, they fail to tell you that housekeeping only picks up trash daily. If you want towels or washcloths daily, there is a fee. Also, if you want your sheets changed, there is a fee. There is a fee for everything they do at the resort other than take your trash. While we were there, we had to call the front desk after being at the park all day, just to have someone come get our trash and bring us towels and washcloths so that we could take a shower!! And, we paid in advance for the service which is what made it even more frustrating. So actually, they didn't even do it with the fee until we would call. We were very disappointed with the service and the stay at the resort. If tyou plan on using the shuttle provided, be prepared. It only runs 3 times in the morning and 3 times in the evening. And, it drops you off at Epcot to catch the monorail. So, make sure you allow an hour just to get to Magic Kingdom or anywhere other than Epcot. We ended up spending so much money on taxis because of the inconvenient shuttle schedule. It is a beautiful resort, but the convenience and service is not worth the view! We are definately going to do our homework next trip.","ratings":{"Overall":2.0},"author":"Miss Noelia Wolff","date":"2015-09-19 20:53:25 +0300"}],"public_likes":["Curt Glover","Dakota Lowe DVM","Stefanie Hilpert","Gus Keebler","Melyna Hudson","Gerhard Ernser"],"vacancy":false,"description":"Modern concrete block on the other side of the river from the Swan.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}