{"title":"Birmingham (England)","name":"ibis Birmingham Centre","address":"Ladywell Walk","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47501,"lon":-1.89642,"accuracy":"ROOFTOP"},"type":"hotel","id":3614,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"From the minute that we entered the lobby we knew that we had selected the perfect hotel! Everyone that is with the hotel seems so proud of the place and you get the feeling that they are there to make you feel welcome!Location.. is perfect!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Santos Dare","date":"2012-11-13 10:55:00 +0300"},{"content":"Beautiful, smaller hotel in a great location, caddy corner to Marshall Field's and two blocks from Millenium park. Had a beautiful corner suite ($289 plus tax etc.) with huge windows looking up State Street. Room decor and amenities both excellent. Art deco design, but not South Beach psuedo art deco. Lobby areas beautifully designed - walk through it even if you don't stay there. Wine tasting from 5-6pm is a very nice feature and a nice way to end a day or begin an evening. Hotel will match any internet rate and you always benefit booking direct. If you need to stay in the Loop versus on the Magnificent Mile, this is a great choice. Only disappointment was the continental breakfast - should have just walked down to Starbucks for the same muffin and coffee.","ratings":{"Overall":5.0},"author":"Vernon Rice","date":"2013-07-01 03:33:55 +0300"},{"content":"I stayed at the Hotel Burnham during the second week of Aug. '04 and thoroughly enjoyed my stay. The entire staff was totally accommodating to anything I asked for. The concierge, Brent, went out of his way to help me. I love the Burnham!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Leann Volkman","date":"2013-12-26 11:13:53 +0300"},{"content":"My daughter and I were in Chicago for a college visit and we stayed in the Monaco. We asked for a room with a river view. The location is superb, right in the middle of city. All the staff was very friendly and helpful, we received excellent service. The room decor was interesting, not like a standard, boring hotel room. There were window seats, literally in the window, which were great. I thought it was great value for money. Our stay at the Monaco definitely added to the pleasure of being in Chicago and we are planning to stay there again when we go back.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Madisyn Osinski","date":"2013-09-11 14:14:27 +0300"}],"public_likes":["Rusty Stanton DVM"],"vacancy":false,"description":"A standard and slightly dated ibis hotel in the very centre of the city","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}