{"title":"Tenby","name":"Fourcroft Hotel","address":"North Beach","directions":null,"phone":"+44 1834 842886","tollfree":null,"email":"stay@fourcroft-hotel.co.uk","fax":null,"url":"http://www.fourcroft-hotel.co.uk","checkin":null,"checkout":null,"price":"from £120 per room per night£","geo":{"lat":51.67511,"lon":-4.70228,"accuracy":"ROOFTOP"},"type":"hotel","id":30017,"country":"United Kingdom","city":"Tenby","state":null,"reviews":[{"content":"just got back from Pier House. Stayed in Lanai room...the beds were heaven. Loved the beach area, pool was too warm during the day but great at night and open 24H. Location was great walked everywhere. Took the new CityView Trolley and Fury for catamaran ride. Loved walking the boardwalk along the ocean. Great stay at the Peir House and would stay there always the beach was such a plus ! Went to South Beach to watch the great 4th of July Fireworks too","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Mrs. Noemy Cummerata","date":"2014-04-04 20:59:08 +0300"},{"content":"My boyfriend and I stayed here for 3 nights, which was way too short. The hotel was perfect! extremely clean and well maintained, great food, a beautiful beach (which was a pleasant surprise being i was prepared for the \"lack of great beaches on key west\" as I was told) but it gave me my \"fix\" when i wanted to lay out. Ironically we found we only layed on our beach for 2 hours during the entire 3 days as we explored all the streets of key west. there's so much to see and so much to do. I owe a great thanks to all the wonderful people on tripadvisor, as the suggestions on things to do and see was spot on. We loved our bartender Brian who sadly is moving back home. he helped us a lot. I highly recommend renting the bicycles...it's a good way to explore the town and burn off the calories from the wine the night before! few key points: great small clean beach and clean beautiful water hotel provides computer to check-in online and print boarding pass service was EXTREMELY nice always greeting you hotel was VERY clean... location is PERFECT..steps from mallory square/sunset festival/ (Roof top cafe is great to eat at) VERY QUIET despite being on top of Duval street. I AM A LIGHT SLEEPER and I swear they must have installed sound proof glass! Enjoy all key west has to offer .....I underestimated how much fun it would be","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mathilde Marks","date":"2015-12-10 08:10:05 +0300"},{"content":"I would not recommend the room with the spiral staircase to the bedroom upstairs. The staff were friendly. The food was good. I would reccommend eating at Blue Heaven and having the Lobster Benedict. It was nice to look at all the boats going by. The location is where its at! Walk to everything! The cost of this hotel should be in question though. The pool is cold, and there isn't a beach. The deck is small. Safe and nice all in all.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Titus Boehm","date":"2015-10-04 18:39:08 +0300"}],"public_likes":["Abigail O'Kon","Velva Konopelski I","Gussie Marks","Demetrius Runte","Brenden Waters","Laurianne Kilback","Syble Mohr"],"vacancy":true,"description":"This place offers well-equipped rooms, many with lovely views over the old fishing harbour and across Carmarthen Bay. It's part of a Listed Georgian terrace, built over 175 years ago as individual summer houses. A lift runs from the first half landing and there are footpaths directly to the beach.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}