{"title":"Farnborough","name":"Village Hotel","address":"Pinehurst Road","directions":null,"phone":"+44 871 222 4590","tollfree":null,"email":null,"fax":null,"url":"http://www.village-hotels.co.uk/hotels/farnborough/welcome","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.287098,"lon":-0.759841,"accuracy":"APPROXIMATE"},"type":"hotel","id":9085,"country":"United Kingdom","city":"Farnborough","state":null,"reviews":[{"content":"My brother and sister-in-law recommended this basic motel very near Shelter Island and just across the street from the harbor where they leave on their yearly deep sea fishing trips. We were greeted by a very helpful, congenial fellow, Jeb who throughout our 3 night visit made it more memorable than the motel itself. Actually the motel was memorable in its simplicity, making you realize just what you do and don't need in your 'home away from home\" when traveling. The rooms are just big enough for a very comfortable bed, a folding chair, a big flat screen TV on the wall, a couple of small bedside tables with lamps, a small closet (no light which was a tad annoying to me) and your basic tiny bathroom, shower no tub but great water pressure (always a plus for my husband). There is a room AC which is fairly noisy when on. If you just want outside air and leave your window open, there is both street, other vacationers and sometimes airport noise. WiFi is free but my husband had trouble at times connecting his iPad. The folks at the desk at one point generously gave him the use of their laptop! You won't find all kinds of specialty bath items in the bathroom, such as lotions, shoe shine stuff etc. BUT if you forgot your toothpaste or run out (as I did) or need a straight razor or other toiletries or even a hair dryer, they have them for you at the office. The room comes with breakfast which consists of good coffee, hot water for tea and tea bags, Yoplait yoghurt in the fridge and when we were there, daily muffins - big and for me overly sweet. Since my husband and I are trying to watch our carbohydrate intake, we tried to find other places close by for breakfast, the closest being the one on Rosecrans connected to the Holiday Inn, I think it was. I think it was called the Point Loma Cafe. We had breakfast there 2 of our three mornings. It was adequate, a sort of glorified Denny's, not cheap but you could find all kinds of egg dishes and the portions were huge. The last morning we decided to find another place for breakfast which I would recommend highly. The Living Room Coffeehouse, 1018 Rosecrans. I think you could walk there but we drove. I will write a special review of this place because I want to give it 5 stars for the delicious food at an incredibly reasonable price. All this said, we went by the Ramada Inn next door to compare prices - twice as much, no breakfast whatsoever and probably pretty much the same type of rooms although we didn't look. We've spent many a day in San Diego mostly in the downtown area so this area was new to us. We enjoyed it and will think about staying there next time we go.","ratings":{"Location":4.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":3.0},"author":"Julianne Macejkovic","date":"2014-12-19 16:26:50 +0300"},{"content":"It was Comicon weekend in San Diego & had a very hard time finding a hotel. We happened upon Dolphin because of trip advisor reviews. We agree with all the reviews. this is a very clean & quaint motel right across from a fishing harbor. The staff was very helpful & friendly. We enjoyed this little motel very much. If there is anything to be said on the negative side it would be that the rooms are VERY small & pretty much no frills. Make sure to bring your own hair dryer & shampoo as they are not provided. No in-room coffee pots either. Not a big deal, but the tv seems to be set on some kind of timer as it shut itself off in the middle of a movie we were watching. Same thing happened the next day.","ratings":{"Cleanliness":5.0,"Sleep Quality":3.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Carmel Prosacco DDS","date":"2015-09-23 21:20:15 +0300"},{"content":"The staff is very friendly and very helpfull. The restaurants they recommend are very good. The rate is very low. The room is very basic and white. BUT the room is very clean and has everything you need. Free internet and parking. The breakfast is a choice between 2 kinds of muffins. But the muffins are very good. The breakfast is served outside on the patio. If you are ok with a basic room and look for an attractive rate, than this is the place to be. I would remcommend this place.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Verlie Pollich III","date":"2015-05-03 03:20:26 +0300"},{"content":"This is not a fancy place but it was perfect for a friend and I that needed a safe clean place to stay on a budget. The morning was topped off with a few tables and chairs to sit outside in the courtyard in the beautiful weather and eat our muffin and drink our juice the hotel provided. Overall this place was just what we needed! The owner said they may be getting some bikes for patrons to take out for the day too so I will be back :-)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miguel Kutch Jr.","date":"2013-02-09 09:12:49 +0300"}],"public_likes":["Reta Grimes","Clark Harvey","Katarina Wilderman","Theodore Ward","Theresia Kozey","Keara Wisozk","Miss Whitney Purdy","Stanton Pollich","Ms. Manuela Abernathy"],"vacancy":true,"description":"IQ Farnborough business park","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}