{"title":"San Francisco/Chinatown-North Beach","name":"Columbus Motor Inn","address":"1075 Columbus Ave","directions":"Columbus and Francisco","phone":"+1 415 885-1492","tollfree":null,"email":null,"fax":"+1 415 928-2174","url":"http://www.columbusmotorinn.com","checkin":"3PM","checkout":"12PM","price":"$90-295","geo":{"lat":37.804,"lon":-122.4159,"accuracy":"ROOFTOP"},"type":"hotel","id":25508,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Chancellor Hotel has a great location, right on Powell street by Union Square. It is VERY easy to get to from SFO Airport, take BART to Powell Street station and walk 4 blocks to hotel. The hotel is older but nicely renovated and well kept. The rooms are small and the walls are a little thin. The Powell line cable cars are right outside and can be a little loud if you have the window open. Powell Street can be very busy too. We were on the 6th floor, street side and the noise was not too bad. The couple in the room next to us did keep us up one night arguing about naked pictures on her cell phone, but other than that the noise did not keep us awake or wake us up. The beds and pillows are very comfortable. The bath room is pretty small but the tub/shower is good sized and the shower head worked great. The desk staff, cleaning staff, and door man were all very friendly and helpful.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Jorge Herzog","date":"2014-01-02 04:17:17 +0300"},{"content":"This place simply oozes charm. I have stayed here three times now and I have never been disappointed. Rooms may be on the small side but they have everything you would want. Some nice touches are the free jar of sweets on the dresser, the pillow menu and the rubber duck in the bath! Very conveniently located for cable cars, Union Square and some brilliant restaurants.","ratings":{"Overall":4.0},"author":"Alexane Ortiz","date":"2015-10-03 21:28:59 +0300"},{"content":"Location location location. Extremely clean. Comfy beds. Nice linen & pillows. 'Boutique' covers description of decor but still old fashioned. Lovely service at breakfast. San Fran weather is unpredictable so lack of air con a non issue. Bathroom was dated but spotlessly clean. Would defo recommend.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Francis Kohler MD","date":"2015-06-10 20:50:20 +0300"},{"content":"What a perfect, fairly priced, nicely modernized, charming, conveniently located, clean, and professionally-staffed beauty! Very knowledgable concierge staff. Great happy hour value. Many public transportation options easily accessible (cable cars, F-Line trolley cars to Financial and Wharf districts, easy 3-block walk to BART station to, e.g., SF Int'l. Airport (easy ~35-minute ride $16 RT). In the very heart of the shopping district. Also an easy walk to Chinatown, Little Italy (\"North Shore\"). The Chancellor is a perfect find. Don't tell anyone! LOL P.S. buy the 3-day public transportation pass from the hotel concierge for a mere $21. Forget about needing a car in San Fran!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Megane Mills","date":"2014-01-01 06:52:14 +0300"},{"content":"Choose the Chancellor after good reviews on trip advisor. It is superbly located, mere minutes from Union Square itself and with tram stops literally outside the hotel. The hotel is relatively basic in itself - there is no on-site gym, and the bar and the breakfast area are all self-contained with no natural light and so I didn't use those so don't know if the food or drinks are good or good value. The rooms are a good size, the bathroom is decent enough and the hotel is pretty quiet given its location. There is a tour desk on the ground floor that will give you maps, information and make bookings for you. The staff are efficient and functional in their interactions. Free wi-fi is available and there is a PC available by reception where they will let you print things for free too, so very traveller friendly. They have a small \"library\" space on the 2nd floor for travellers to leave books and pick up those that have been left. It was in the process of being renovated and probably needed it as it does look a spot tired but is clean despite that. A good stay for the price and the location.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":3.0},"author":"Trace Kemmer","date":"2013-06-28 09:20:59 +0300"},{"content":"This hotel is highly recommened on this site, and I can see why. The hotel is extremely well priced for the location. Its right on Union Square, where all the great shopping and restuarants are. Cable cars run right past the door We arrived around 10.30 am but our room wasnt ready. We checked our bags and went off for a few hours for some exploring and and lunch. We returned around 1pm and checked into our room. The rooms are very small and tight, even by a big cities standard. BUT we didnt spend much time in the room so it wasnt a big deal. The room was tastefully decorated, but you should be prepared for not too much space. We where given a room overlooking union square which was really nice. The check in staff where really helpfull with dining recommendations and car rental enquiries. This is a great base for getting around the city. We only had 2 nights but we stayed midweek and got a great rate of $125 a night for this hotel. That was a bargain for a hotel in this location of this quality There are many many great restuarants close by, but Sears next door is excellent and famous enough for its brekfast that is has lines out the door for half hour or so! It was so good we went and ate one evening for dinner which was excellent. When we are back in San Fran we would definatley stay hear again , we where very impressed","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Harrison Jacobi","date":"2013-03-23 20:09:02 +0300"}],"public_likes":["Angel Welch"],"vacancy":true,"description":"The Columbus Motor Inn is in the nice part of North Beach, on the border of the Fishermen's Wharf district, within easy walking distance of all Fisherman's Wharf attractions, and from Washington Square. Public transportation is very convenient, with the No. 30 bus stopping at the door, and the Bay and Taylor Cable Car Turntable a short walk away. Rooms are spacious, with good views and balconies on most Columbus Side rooms. Parking is limited, but covered: the first two floors of the building are parking, with all guest rooms above. No on-site food, but nearby restaurants cater to every budget and taste.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}