{"title":"Stornoway","name":"Cabarfeidh Hotel","address":"Manor Park, HS1 2EU","directions":null,"phone":"+44 1851 702604","tollfree":null,"email":null,"fax":null,"url":"http://www.cabarfeidh-hotel.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":58.21948,"lon":-6.38808,"accuracy":"APPROXIMATE"},"type":"hotel","id":28657,"country":"United Kingdom","city":"Stornoway","state":null,"reviews":[{"content":"Enjoyed staying at this location off the Strip last year so decided to stay again this trip with our 25 year old son. Our suite on the 7th floor would have been a little cramped with our son sleeping on the sofa bed so we asked for a larger corner suite. No problem - we were given one on the 3rd floor. It was next to the restroom for the bar, but as the bar closes at 11pm it was never a problem. The staff at this hotel are very helpful, the breakfast buffet is excellent and sets you up until the evening.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":3.0},"author":"Aileen Blick","date":"2014-08-21 23:08:38 +0300"},{"content":"My wife and I stayed at this hotel from March 23-25 and enjoyed mostly everything about it. the location is great...not too far off of the strip. we rented a car for the weekend so it was not a problem to get to the strip and back. I would recommend renting a car versus taking the monorail or walking because the monorail is not that close to the hotel and parking is free all over the strip. The happy hour was fantastic and so was the breakfast. The only downside about the breakfast was the line got a little long..but it moved fairly fast. Plenty of choices and they kept bringing food and more food when it was getting low. The hot tub is huge! We didn't use the pool...so can't really comment on that. The rooms were big and the beds were comfortable. The only downside was our room smelt like smoke. It was a \"non-smoking\" room but clearly there was smoke in there. It didn't really bother us after a few mintues so we just stayed in the same room. Everything in the hotel was really clean and nice. I would say it was above average for the typical Embassy Suites. It was nice to be a little of the strip to receive a break from the lights, people, and casinos! I will definitely stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":3.0},"author":"Isaac Schoen","date":"2013-08-19 12:27:38 +0300"},{"content":"I have to admit, I booked this little hotel for it's rate... But I will stay again and refer others because of it's location (within easy walking distance) from most major Istanbul sites. The kind and thorough attention we received from staff (my sister broke her ankle at the Hippodrone) and they went out of their way for her. Best part of all? Several wonderful restaurants that were fantastic respites for tired travelers and the kind neighbors... (if you're looking for a rug in Istanbul, just walk across the street...they had the finest and best priced rugs in Istanbul) plus? They ordered us dinner to be brought to the hotel when they heard my sister was injured that afternoon. That's more than kindness, that's family. I can't encourage you enough to stay Armagrandi Spina.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jena Brakus DDS","date":"2012-04-16 17:35:27 +0300"},{"content":"We stayed in this hotel for 5 nights. This lovley little hotel is close to all the major sites in the Sultanahmet district. The staff were pleasant, helpful and very knowledgable and accomodating. In particular, Serkan was always available to help. The view from the rooftop terrace is breathtaking in all directions. Rooms were clean and comfortable and the breakfast which is included was also very good.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Antwon Metz","date":"2014-03-16 13:11:08 +0300"},{"content":"This hotel is quite literally in the middle of the Blue Mosque and the Haggia Sofia. Just stepping out through the back door, taking a few steps , and you are there! We stayed at the beginning of our 2-week stay and again for the final 2 days but in a different room. The first one was on the 1st floor and comfortable. It had some upkeep issues (peeling wall paper, missing molding) but the second time there, our room on the 2nd floor was better maintained (minus the broken shower head holder and less than sparkling white sheets). The breakfast was very tasty, offering a variety of cheeses, pastries, olives, eggs, breads, yogurt, breads, cereal. For a small fee, you could get fresh squeezed orange juice, too. As you return to the hotel after a day of touring, you are offered tea, coffee, or wine. I suggest having this outside your hotel at it would probably be just as expensive but with better ambiance. The staff was very helpful and pleasant, especially Suleman. He was very friendly, showing us the terrace, the tram system, and offering easy conversation. I would recommend this property for its location and value.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Assunta Corwin","date":"2013-12-16 04:27:00 +0300"},{"content":"Hotel situated in a lovely, quiet street between the Blue Mosque and Hagia Sophia, perfect for travelers because you can walk to all major attractions. Rooms are very new and clean, and some of them directly overlooks the Blue Mosque. From the terrace you can see also the Bosphorus while you have breakfast. My experience in the hotel was very nice, excellent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Estel Bechtelar","date":"2015-11-04 12:37:24 +0300"},{"content":"Lovely small cosy hotel in a great spot near to both the Blue Mosque and the Hagia Sophia; despite being very close to both these landmarks, the hotels location is extremely quite and peaceful. The Topkapi palace and tram station are also nearby. Our room was spacious and clean with excellent decor and the view from the rooftop terrace is absolutely stunning; there is also free wifi throughout the hotel. The staff spoke good english and were really helpful and polite.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Bobbie Bergstrom","date":"2013-02-27 05:45:09 +0300"},{"content":"This location was perfect for 2 women traveling alone who wanted to spend their money elsewhere. The desk clerks spoke clear english are were most helpful with dinner reservations. The small tour buses were able to access the road and pick us up at the front door. This is how great the location was; we were within walking distance to the following-1 block from the Four Seasons Hotel; 1/2 bl from the Blue House(nice for an after dinner drink); 6 minutes to the tram- Balikci Sabahattin(phenomenal restaurant); 1 minute to the Blue Mosque, Sophia Haggis, Underground Cistern. At breakfast we looked out at the Blue Mosque and beautiful tulips planted in the center of the city. We were very comfortable walking around this area at night. There were slight inconveniences in changing rooms but the upside was that one night they moved us to a very nice suite. Request your rooms on the Blue Mosque side as there was a lot of noise (cat noise) on the front side.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Kassandra Haag","date":"2014-09-12 12:43:25 +0300"}],"public_likes":["Bria Olson","Burnice Leuschke","Godfrey Kuhlman","Shirley Mayer","Abe Nienow","Alverta Stark"],"vacancy":true,"description":"The furthest from the ferry.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}