{"title":"San Francisco/Nob Hill-Russian Hill","name":"America's Best Inn","address":"2850 Van Ness Avenue","directions":"between Chestnut and Lombard","phone":"+1 415 776-3220","tollfree":null,"email":"info@vannessinn.com","fax":"+1 415 921-7451","url":"http://www.americasbestinn.com/hotel-details/ab-san-francisco-ca","checkin":"2PM - $50 deposit and credit card required upon check in","checkout":"11AM","price":"Average Price $180","geo":{"lat":37.8021,"lon":-122.4243,"accuracy":"APPROXIMATE"},"type":"hotel","id":25959,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"my sister and i stayed the week of 9/9/2007-9/16/2007. the staff was great. the bell men, scary carrie,all the front desk people. they made us feel welcome everyday,and were receptive to our needsi the two bedroom suite had everything in it we could use. thankfully we were in the tower, with the pool and jacuzzi. my sister was suffering with a sprained back and used the jacuzzi for relief every day, while i used the pool to get my aerobic water exercise. i would come back in a heartbeat. dlarge","ratings":{"Overall":5.0},"author":"Mr. Kim Lind","date":"2014-03-20 10:40:44 +0300"},{"content":"After reading other reviews of the property I was skeptical, but everything worked out fine. I asked for a unit near the main building, and it was in fact nicer and safer than others farther out appeared to be. Housekeeping did only an okay job, and the pools are overclorinated, but still enjoyable.","ratings":{"Service":2.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Gerda Hilll","date":"2015-01-09 07:01:58 +0300"},{"content":"Before i went to Vegas i looked at the reviews on tripadvisor and i was very concerned as to what we were turning up to! But i couldn't have been more pleased, the accommodation was lovely. The room was very clean and tidy and the furniture plus kitchen appliances all appeared to be very new. I did however get a room in the main block, this was after reviewing the bad reviews and i thought this might be the best option. The reception staff were very friendly and helpful and they were ok with me asking to stay in the main block. I can also say that everyday we walked through reception area and i never once saw anyone that appeared to be unhappy and wanting to change accommodation. The great thing about staying in the main building is that if you don't have a car, which we didn't, then it is the nearest building to the strip. It only took 5 mins (if that) to get to the back of Harrah's casino. You have to walk through a car park to get there and i was a bit concerned on our first walk that it was a bit dodgy and especially at night, but i couldn't have been more wrong. It is well lit at night and there are always plently of people around plus there are security cameras. The only one negative i can say about the resort is that there is no view, as we looked out onto a carpark. But who needs a view in Vegas, there is too much to do to spend to long in your room!!","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Leopold Dibbert","date":"2014-09-14 06:47:48 +0300"},{"content":"My 3 girlfriends and I just got back and highly recommend this hotel. Yes it is off the strip, but only about 75 yards from the Imperial Palace. We had a two bedroom with a pull out couch in the living room/dining room, a queen in one room and a king in the other. All things required in a kitchen were provided. We cooked breakfast (bacon and eggs) for breakfast and had cold meat sandwiches which we packed for lunch and ate dinner out. What a cost saving and how nice to lie around in the morning without having to run for coffee. There is a little convenience store down the street about 1/4 mile. Every staff member we met went above and beyond our expectations. Who wants to stay on the strip at night! Unless you are prepared to pay $1,000 a night at one of the strip hotels you won't be facing the strip, but stuck in a room with a bed, no fridge in the back of the hotel. I would definately go back!!! If you are looking for a great reasonable lunch or dinner, try Max's in the Aladin. $3.99 for chicken breast in bun with fries, or $6.99 for dinner. Amazing value compared to $5.12 for a muffin in a kiosk at Caesars.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Roma Rice","date":"2012-10-01 23:46:01 +0300"}],"public_likes":["Mateo Bechtelar","Arielle Fay","Reagan Schamberger","Jaida Price","Violette Rath"],"vacancy":false,"description":"Nothing fancy, but a clean and comfortable hotel, situated a few blocks south of the Wharf.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}