{"title":"San Francisco/Golden Gate","name":"Hotel Drisco","address":"2901 Pacific Ave","directions":"at Broderick St","phone":"+1 415 346-2880","tollfree":"+1-800-634-7277","email":"reservations@hoteldrisco.com","fax":"+1 415 567-5537","url":"http://www.hoteldrisco.com/","checkin":"4PM","checkout":"noon","price":"$189-$259","geo":{"lat":37.7921,"lon":-122.4432,"accuracy":"APPROXIMATE"},"type":"hotel","id":25811,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The ONLY good things about this stay were the indoor waterpark and the location of the hotel, which was close to many other attractions and restaurants in Branson. We stayed in March over Spring Break with our three boys. They love the water and were able to swim and play daily inside. Otherwise, the hotel itself seemed VERY cheap to us, especially since we booked a family \"suite\" and paid over $200 per night (for four nights.) For that price, we felt the beds/mattresses at least should be much nicer than they were. The children's bunk bed---the bottom bunk---was like literally laying on boards. TERRIBLE!! Our 4-year old could not sleep on it and we didn't force him to because it was so uncomfortable. And the regular beds were not much better. You know it is bad when the pull out sleeper is more comfortable than the beds in the room. We've been alot of places and this by far had the absolute worst beds ever. It would be different if it was cheaply priced, but it isn't. So, unless they upgrade their beds and make the rooms nicer, we won't be back.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Karen Jacobson","date":"2012-04-27 13:15:37 +0300"},{"content":"The beds were uncomfortabe. The staff were not friendly. The front desk called our room twice and told us to be quiet and all were doing was walking in the room after 10:30. There were kids running in the halls and down the stairs case and it wasn't us. Any additional quests staying in room and and you don't have enough wrist bands for the water park they charge you 20.00. To me that is stupid. We stayed there in the summer I was charged to sit out by the pool and I don't even swim or get in the water. The floor is more comfortable than the bunk beds. The restaurant is more like a grill and are over over price . The staff is not friendly. We were at the pool and they ran out of towels. Check in time on Sunday is 4 and the pool closes at 5. The hours for the water park need to be longer since that is why you go there in the first place. I brought 4 gift cards for family over the year I won't do that again. I would go to the other water park it also has hot tubs. We also has scheduled another trip and they canceled it because they had a problem with water when we were. My grandson was itching and had spots on him. They seem not to care.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Adela Bogisich","date":"2014-12-03 04:54:07 +0300"},{"content":"We stayed one night and had the best time! We were greeted with kind employees at the front desk who informed us of all the amentites. Are room was excellent. it was clean and stocked with towels etc...We traveled with 2 children, 10 yr and 17 yr old. the water park was very relaxing...especially enjoyed the lazy river and water slide. Lots of towels to dry you off when your done swimming. Lots of seats to watch the kids. Quiet night atmosphere, unlike the loud strip noise if you stay on hwy 76. Nice, well stocked contenental breakfast in clean restaurant atmosphere. They even had a scavenger hunt plus other resort activities for more fun. Overall, I would stay again especially if you have small kids. We went minature golfing with gocarts which is right next door within walking distance. we never left the hotel except to eat dinner. buffet is right up the street also within walking distance. I cant wait to go back! My teenager loved sleeping on the bunkbeds with her own TV. I highly recommend and is in a great location. Way to Go Castle Rock! Loved your hotel! I will be back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jerod Beer","date":"2015-11-30 04:28:40 +0300"},{"content":"I do not recommend anyone staying at this place they call a resort. The restaurant was not open and on the website the do not mention this, nor did they when I called to book the reservations. One slide was broken; but the water part was enjoyable to my 8 year old and 3 year old and the lifeguards were very nice. Now the manager of the resort Michael is a total different story! He is one of the rudest mangagers I think I have ever had to deal with. I checked into the hotel on Monday and checked out on Wed. I paid cash for my stay; but the hotel also charged my credit card not once but twice for my stay. A $323.60 stay ended up costing over $1200.00; when I contacted Michael to get the charges removed he was friendly at first and got 2 of the charges off. So after 48 hours 2 charges were still on my account; once again I contacted Michael; he told me once again he was working on this, after a few words he informed me if I was not nicer it would take a little longer than usual for the charges to get removed from my account, he was not concerned that I was calling the Better Business Bureau or my bank on the fraudulent charges. He also would not let me talk with his superior and hung up on me. Luckily the bank removed the chargers since I have my receipt showing I paid cash and I am contacting the Better Business Bureau. I would not recommend anyone to stay at this resort; newer is not always better.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":1.0,"Rooms":1.0},"author":"Ignatius Gutkowski","date":"2015-12-20 00:13:38 +0300"}],"public_likes":["Brayan Quitzon","Amie Murphy","Edythe Dickens","Ms. Dewayne Jacobs","Rodger Kirlin","Emile Greenfelder"],"vacancy":false,"description":"Built in 1903, this is a higher-end, boutique hotel right in the heart of Pacific Heights.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}