{"title":"Betws y Coed","name":"Ty Capel","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.landmarktrust.org.uk/our-landmarks/properties/ty-capel-12707","checkin":null,"checkout":null,"price":"4 nights from £148","geo":{"lat":53.0867,"lon":-3.8368,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3376,"country":"United Kingdom","city":"Conwy","state":null,"reviews":[{"content":"We stayed for 3 nights. Prior to arriving I had applied for several types of standby upgrades, including the Business Plan upgrade. I discovered on arrival that I got the Business Plan upgrade. I received a letter from the front desk clerk informing me of what this included (internet, local and long distance phone calls, one breakfast daily, a bottle of water, etc). Boy was I glad I saved that letter. The staff at this hotel simply don't know what they offer. One of the days we went to breakfast. I had to argue with the hostess that I was 100% positive that one breakfast was indeed included on my room rate. And upon checkout I was told that long distance calls were not covered. I pulled out the letter to show the desk clerk that indeed they were covered. She quickly changed it and said that they had just changed what the business plan offered. Fair enough but then management needs to be better about communicating to staff about what is included in the rates. I don't want to have to go to the front desk to check out and get a corrected bill. I would rather have checked out online in my room. But this wasn't an option as the included charges had to be removed from the bill after the fact. Very annoying. Another annoying thing were the bellboys trying to hijack our luggage constantly. One bellman came over to my husband and TOOK his suitcase despite his protestations that he could manage it himself. It seems like they are simply desperate for tips. Or that's how it comes across to me. The location is good. The rooms were ok. But I wouldn't rate it high for cleanliness - I noticed an M&M on the carpet and it was still there the next day. Same for the gum wrapper that was near the chair. Bed slept ok though. All in all, I wouldn't say that it was a particularly good value for the money. And the management needs to get the staff to be more competent and knowledgeable.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Donna Kassulke","date":"2015-08-19 12:31:40 +0300"},{"content":"Stayed at the Hyatt Regency Boston after getting it thru priceline for $90.00 per night. We really only have 2 complaints. 1) The walls are paper thin. You can hear EVERYTHING going on in the rooms next to you...and I mean EVERYTHING!!! 2) the pillows seemed very hard. I took one out of the pillow case and found it was hard because it was jammed into this very skinny case that was about 12 inches wide. I guess they were going for looks, not function! The location was very good for what we were in town for. We wanted to stroll around a bit and visit Quincey Mkt. It was very east to get to the hotel from the Mass Pike too!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Mike Kemmer","date":"2014-12-23 10:09:11 +0300"}],"public_likes":["Tyrell Lang","Breanna Abshire","Tamia Hettinger","Dexter Konopelski","Mac Will","Cristina Volkman","Raymundo Ruecker"],"vacancy":true,"description":"A former chapel and schoolroom. Sleeps 3.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}