{"title":"San Francisco/Union Square-Financial District","name":"San Francisco International Hostel","address":"140 Mason St","directions":null,"phone":"+1 415 982-5010","tollfree":"+1-888-919-0140","email":null,"fax":null,"url":"http://www.sanfranhostel.com/","checkin":"11AM dorms, 2PM privates","checkout":"10AM","price":"Dorms $29+, privates $45+","geo":{"lat":37.7848,"lon":-122.4092,"accuracy":"APPROXIMATE"},"type":"hotel","id":26212,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My wife and I have lived in Vancouver all of our lives and when the opportunity came up to spend a night at the newly built Shangri-La Hotel for New Years Eve, we couldn't resist. We had heard so many wonderful things and were very excited. Our good friend Jeffrey Victor happens to be one f the concierges at the Hotel (although he was not working the night we stayed) and arranged to have a fabulous corner suite (the view rooms were all sold out by the time I booked) with a nice bottle of wine and fruit basket awaiting our arrival. It was one of those 550+/- SF units with a bar area and living room, and office with a flat screen TV (in both rooms) and even a TV in the bathroom MIRROR!!??!! The marble bathroom might have one questioning if there was any marble left in the world?! Flood to ceiling and heated floors! We didn't want to leave the room but I promised my wife some shopping on Robson before New Years dinner so off we went. When we came back, we just relaxed, watched some TV and enjoyed our bottle of wine until our late seating (9:30) at The Market restaurant down below. The restaurant was below our expectations due to the poor service. There were far too many people for such an intimate 6 course set-menu that we weren't eating our main until closer to midnight. However, the food was INCREDIBLE! My wife was not feeling like eating at that hour and was pretty full so we ended up taking our food back down to the room to eat the next day. All of our drinks were comped (all 6 of our 11.00 Martinis) for the inconvenience. It was hard to be angry as we didnt have far to go after dinner to get back to our room and the food was amazing after all. The next morning, I hit their state-of-the-art fitness facility for a workout (Damn, that was hard!) and enjoyed a delicious protein shake from their smoothie bar afterward. I went downstairs and next door to the Urban Fair market and grabbed us some delicious breakfast items to bring back to the room and called down for a late check-out (until 1PM). All in all, it was an incredible 24 hrs and we would not hesitate to stay again. It was an oasis in the city. I vacation in our own home town.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Hailee Quitzon Jr.","date":"2012-12-05 19:03:28 +0300"},{"content":"What a delightful and beautiful hotel! I concur with the vast majority of the 5 star reviews. Our stay at the Shangri-La Hotel was fantastic, with wonderful service from the concierge, registration desk, and bell staff. The room was fantastic with a great view and by far the best hotel lighting. The hotel's in a great location with convenient access to most of downtown Vancouver, including walking distance to Stanley Park. Our only complaint was the service at the hotel restaurant (Market), which was below par for any restaurant, let alone a high end one like this.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Ralph Kohler","date":"2013-04-12 23:24:00 +0300"},{"content":"During a recent Alaskan Cruise due to mechanical difficulties we were unable to visit Vancouver. So we decided to go on our own. After researching hotels we decided on the Shangri-La. Thank goodness we did!! What exceptional service. Jarren the concierge never and I mean never steared us wrong!! We enjoyed every minute of the 3 days we had, we had great food, drink and hit all the great spots. If he didn't take the time each day to help us out and point us in the right direction it may not have been so rewarding. He went above and beyond. The hotel is just glorious, amenities are superior and the spa also is top notch. If you have the opportunity go, don't pass this one up!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jeramy Rice","date":"2015-11-22 04:29:17 +0300"},{"content":"This is the most wonderful hotel you could imagine!! From the chek in- to the LARGE room ameneties- to the breakfast! All is just WOW. The best yet! I forgott my postcards (7-8 )in my room- and rememberd it a day later, and they cindly posted them for me- without a fee. What other hotel do that??? For what you get - this hotel is NOT expencive! Go for it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Bertha Mueller","date":"2014-12-09 21:33:06 +0300"},{"content":"What can I say about the Shangri-La that has not already been said, it is truly a unique experience from the mood lighting in the bedroom to the fabulous staff, I have travelled extensively and stayed in some of the best hotels in the world, but this was my first experience of a Shangri-La, from the moment you arrive you feel important and welcome, the reception is quaint and the staff excellent the concierge brilliant. The room staggering, I have never seen as many buttons to alter the lighting. The bathroom was wonderful and filled with L’Occitane products, yes you are in the city and privacy could be problem, but you have automatic blinds so who cares. A separate bath and shower are provided and two sinks so travelling with a partner makes getting ready a simple affair, a separate dressing room for all your cases keeps the main bedroom neat and tidy. So are there any issues, well yes, it is noisy, we stayed on the ninth floor and could not believe that an inner city hotel had such poor sound proofing, our room was on the corner of Thurlow and Alberni, it was so bad we could get to sleep until 4 in the morning, we did mention this at check out and got a very negative response as though it was impossible that anything could be wrong with the hotel. Due to the attitude you start to find other problems, the plug did not work in the second sink, the TV did not come on with sound sometimes, a lamp did not work properly, and would this stop be going back absolutely not, I would just get a better room. P.S. The lounge bar staff fantastic, and now they can also make a proper Pimms","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Delpha Rippin","date":"2014-06-21 14:05:54 +0300"},{"content":"From the moment you step foot inside this emaculate hotel you feel right at home. The staff are most helpful, the atmosphere is relaxing, the food is great and the facilities cater to almost every need! And if you are passionate about good beds, this hotel takes first prize for comfort. The softest, fluffiest most luxurious sheets, pillows and duvets will keep you sleeping for days!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Charles Witting","date":"2014-12-21 23:32:20 +0300"}],"public_likes":["Rolando Blick","Louisa Raynor","Marjorie Kreiger III","Mathilde Aufderhar"],"vacancy":true,"description":"Can't beat the convenience right in the main hotel district, a block from Powell Station and Union Square.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}