{"title":"Newcastle upon Tyne","name":"Rooms Inn","address":"40 West Parade, NE4 7LB","directions":"About 1 mile West of Central Station, along Westmoreland Road / Saint John' Road","phone":"+44 191 273-3034","tollfree":null,"email":null,"fax":null,"url":"http://www.roomsinn.co.uk/","checkin":"14:00","checkout":"12:00","price":"Double £30-85, breakfast extra","geo":{"lat":54.96824,"lon":-1.63185,"accuracy":"APPROXIMATE"},"type":"hotel","id":20147,"country":"United Kingdom","city":"Newcastle upon Tyne","state":null,"reviews":[{"content":"The W Hotel is an incredibly dependable and consistent brand. From the techno music pumped into the lobbies, the psychedelic light shows, cool bathrooms and bliss bath products, its the same whereever you go around the world. I am a starwood gold member and was upgraded to an ocean view when i checked in. The staff were young, energetic,and helpful, the room was completely modern, clean, and comfortable. I had the most wonderful massage on the 73rd floor Bliss spa (I used my Starwood points to pay for it.). The hotel is located in West Kowloon, a part of the International Commerce Center development, is in the heart of HK's financial district where you have access to all the shops and restaurants you'll ever need. You are also at the West Kowloon station of the MTR (subway) which is easy and convenient. Lastly, you can check in for most airlines right there for the In-town check in. (Meaning you can drop off your luggage right there!!) and take the airport train to the airport. A huge time savings. I will definitely stay here on future visits to HK.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Murphy Cruickshank","date":"2015-09-22 13:33:22 +0300"},{"content":"A very nice hotel, as what I expected from a W. Quite spacious room and bathroom for hong kong standard. A modern and stylish interior typical of W. Friendly and helpful staff. Tried the bliss spa, very impressed with the location on the top floor, and the facial was relaxing. However, the location is quite secluded, other than the element shopping mall adjoining the hotel. Taking MTR is a hassle. Not a good choice if you are a tourist coming to hong kong to shop. But I stayed there with a couple of my girlfriend for girls' trip, and we found the hotel excellent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":2.0},"author":"Imelda Hammes","date":"2015-06-13 11:38:51 +0300"},{"content":"I stayed here with my family, which includes two kids aged 7 months and 3 years. The room was spacious enough to ensure we were all comfortable, and everything was of very high quality. The cot for the baby was excellent and the big bed was super comfortable. Amenities were good and everything was fairly functional (though perhaps they do tend to err more on the side of design rather than functionality, but that's ok). Staff were very friendly, helpful and professional. They are obviously well trained and are keen to help customers. Food was fairly good. The only thing to consider carefully is the location. It's kind of in the middle of nowhere but does enjoy very good views of the harbour on one side (though partly obscured by the massive ICC tower) and is close to a shopping mall if that's what you're interested in. Everything is within quick reach by taxi though, and the hotel cars and drivers are also outstanding and affordable. Another odd arrangement is the reception... when you arrive you have to catch a lift to the 6th floor and get out. That's where reception is. Then you catch another lift to the room floors. A bit tiring after a while, especially when travelling with kids (though I'm being picky here). There was wireless internet but it wasn't cheap. Finally, you must check out the pool at the top. Fantastic spot with a stunning view! The pool was closed for a few weeks until January 20120 but is not open again. Overall, we had a great stay here, enjoyed the cool design and decor, as well as the great service and hospitality, and would probably recommend it to others.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Carey Pouros","date":"2013-04-19 05:35:56 +0300"},{"content":"Trendy business hotel next to the ICC in Kowloon. Excellent Service mentality from the staff whether it is reception, housekeeping, restaurant or concierge. The whatever, whenever principle is really embedded. Excellent breakfast as well as diner buffet. The hotel even takes care of arranging visa if you go to mainland China. Rooms are great, bed is superb and all facilities to be online of docking your ipad are there. Arriving from the airport just take the train which brings you right under the hotel for 90 HK$. On the way back you can even check in your luggage at the train station, liberating you from carrying it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sylvia Halvorson","date":"2014-02-28 17:47:44 +0300"},{"content":"Brought my UK colleagues for happy hr wine tasting and everyone left with a smile on their faces. Colleagues were wowed by the food & wine (great jarmon ham) and shoutout to Emma Tsang the receptionist in the living room lounge kept us smiling all night. Colleagues They still talk about W hotel night-! Had a blast, thank you guys!","ratings":{"Overall":5.0,"Service":5.0},"author":"Landen Blick","date":"2014-05-14 02:14:42 +0300"}],"public_likes":["Estell Gaylord","Bertrand Cormier"],"vacancy":true,"description":"Basic hotel in a residential area.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}