{"title":"San Francisco/Golden Gate","name":"Motel Capri","address":"2015 Greenwich St","directions":"at Buchanan St","phone":"+1 415 346-4667","tollfree":null,"email":null,"fax":"+1 415 346-3256","url":"http://sfmotelcapri.com/","checkin":"3PM","checkout":"noon","price":"$100-$135","geo":{"lat":37.7992,"lon":-122.4329,"accuracy":"APPROXIMATE"},"type":"hotel","id":25808,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed at the Best Western Avalon from March 19, 2005 - March 23, 2005. This hotel is located in New Orleans east and is about a 10 minute interstate ride to downtown and the French Quarter. The rooms were in excellent condition and the decor was nice. The staff at the hotel was helpful and very kind, from the front desk to housekeeping. Our room was always kept clean and we always had more towels than we needed. There is a swimming pool at the hotel as well as an exercise room that we did not use, but passed by. There is also a resturant that offers room service as well as a daily continental breakfast. This was our second stay here and we will be back every time. I highly suggest booking through the Avalon hotels website for the best deal!","ratings":{"Overall":5.0},"author":"Gennaro Howell","date":"2014-11-12 07:05:39 +0300"},{"content":"Stayed for one night and the hotel is clean and in a greta location. A little noisy as on the main road and no double-glazing but perfectly adequate for one night.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Lesley Gutmann","date":"2015-01-13 03:41:04 +0300"},{"content":"I found this hotel on the internet. friends of ours were getting married nearby and i don't do travelodges. It is easy to miss from the outside but very attractive and well located for the tube. The decor in the rooms was quite contemporary and orientally influenced. On the other hand the service was good old-fashioned British hotel with a tasty (and very reasonable) breakfast served in an airy dining room and a member of staff on reception all day. I thought the price (£85 per night for a spacious double) was very good for Central London and I'd be happy to stay again. LCD TV and DVD or CD playback are available and movies etc can be hired.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Verner Kirlin DDS","date":"2014-04-07 22:51:02 +0300"}],"public_likes":["Cali Ankunding","Antonetta Torp"],"vacancy":false,"description":"This is a small family run motel with just 46 guest rooms.  Thankfully, this one is set back one block from the noisy Lombard St in a quieter residential area.  This is definitely an older, slightly jaded motel, but the rooms are clean and the staff are extremely friendly.  It's close to the shopping on Union St as well.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}