{"title":"Benllech","name":"Llanbedrgoch Holiday Caravan","address":"Llanbedrgoch","directions":null,"phone":"+44 1248 450051","tollfree":null,"email":null,"fax":null,"url":"http://www.walestouristsonline.co.uk/anglesey/caravan/Caravan_Rental_Benllech_N256X538.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.299418,"lon":-4.258753,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":40177,"country":"United Kingdom","city":"Isle of Anglesey","state":null,"reviews":[{"content":"Stayed for one night as catching the eurostar early the next day and was great for this purpose. 10 min walk to st pancreas... Check in was fine. although I had asked for a quiet room and been allocated one on the main road and with young children I wasnt happy with this but reception were very friendly and happy to change us to the basement. (although this meant we ended up having to collapse and take the travel cot to our new room) but this was a small price in my eyes to get a lovely quiet room. Room modern, clean and new tv. Paid £29 so great value for money and a bargain for central london.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Tommie Steuber","date":"2015-10-30 00:52:19 +0300"},{"content":"This was only £85 for one night for a family room including breakfast, cheap for London.However be aware that there is a reason for this. The hotel is clean as you would expect and the room had air conditioning which was a god send with 31degree temperatures BUT you would think that the windows were wide open with the noise from outside. Not just the station noise but bus noise and people coming home from pubs. Stayed in another travelodge in the City on previous nights with no noise but no A/C. I guess you cant have it all!!!","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":3.0},"author":"Grayce Crooks","date":"2012-09-21 06:02:58 +0300"},{"content":"I stayed in this hotel for 1 night before travelling on the Eurostar to Paris. I choose it because its only a 5 minute walk from St Pancreas station and right beside Euston Station. However I did not sleep a wink because of the terrible traffic which goes on all night long. The hotel itself was ok for a Travelodge as it was clean an quite comfortable. We did have breakfast included, which was a bonus, but the choice was very limited. All in all very handy location but don't stay here if you are a light sleeper","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":2.0},"author":"Nikolas Beer","date":"2013-02-21 19:53:18 +0300"},{"content":"Me, my partner and our 6 year old son stayed in London Euston Travelodge for 3 nights from Friday to Monday. Room was clean and spacious for the price we paid (£95+£19+£19= £133 - for all 3 nights) on the third floor facing back of the house. Room was medium size with king-size bed and sofa bed. Sofa bed actually had a pull out, so if needed 4 people could sleep easy in one room, they say 2 adults and 2 kids, but sofa cold accommodate adults as well if needed. The hotel is situated right next to the Euston station, easy access to trains, tube and buses and it is easy walk to Kings Cross and if you don't mind 10-15 walk you could walk to soho or Oxford street. Bed was comfortable. Only thing I would mark down is that only continental breakfast was available, but there are plenty options in near station. Staff was very friendly toward us and between them pleasure to deal with them, I would employ them myself. They gave us a room on the back of the house after we asked politely for a quite room.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Abner Wolff","date":"2013-04-30 08:32:57 +0300"},{"content":"Travelodge is a basic hotel chain. It delivers what it says it will, at a great low price. I stayed in the London Euston travelodge for two nights. The reception was busy when I arrived. I knew that check-in was after 3:00 and I planned my arrival accordingly. I like that check out is up to 12:00, an earlier time can be troublesome. There were two receptionists on duty and the queue cleared quickly. The Euston Travelodge only offers continental breakfast. Watch out for the times as it is quite late on weekends, 8:00. I arrived early, then again dead on time and the door was locked. When I was there only a few people were eating so the self service was fast and convenient. It was probably healthy for me too. The room was basic, which was what was expected. There was a double bed and somewhere to hang clothes, hospitality tray for tea and coffee, tv and desk. All adequate, clean and comfortable. The bedside lights were mobile and gave enough light. There was a good blind on the window, which faced onto other buildings not the busy streets. Euston station is 2-3 minutes away, less if the crossing lights are with you. The British Library is very close as are the Eurostar terminal at St Pancras and Kings Cross. Both Euston and Euston Square underground stations are close. There is a catholic church down the road. There is no restaurant but the area has several to pick from. This is a bed and breakfast hotel in an excellent location with no frills. I liked best the lack of fuss and the efficient nature of the service provided. Least good were the breakfast times, at weekends, and the number of pillows, but you can always ask for another pillow. This hotel is five stars because you get exactly what was advertised.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Amara Hilll","date":"2013-11-24 15:11:40 +0300"}],"public_likes":["Estefania Volkman"],"vacancy":false,"description":"8 berth, 3 bedroom caravan sited in its own grounds situated in the garden of a farm.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}