{"title":"Birmingham (England)","name":"ibis Budget Birmingham Centre","address":"Great Colmore Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47135,"lon":-1.9004,"accuracy":"ROOFTOP"},"type":"hotel","id":3616,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"I stayed at the Monaco based on the TA reviews. After I booked it, I later found out my sister stayed there and she told me she loves Kimpton hotels. This hotel is in the heart of everything, in my opinion. Each day I got out and walked around made me realize what a fantastic location this place is. I got lucky and got a fantastic high room with a view of the river. Part of what makes this hotel unique is that each room has a nook, which juts out over the street so you have (or I had) a fantiastic view of the street and the river. It's a great place to read and watch over the city. We used it ever day we were there. The hotel had a very lively social hour each day, that many people went down to hang out. Of the 5 nights I was there, I could walk to 4 of the restaurants I booked. Walking to the Michigan shopping district took less than 10 minutes. I love the comforter on the bed. The staff was great and you can \"adopt\" a fish if you get lonely, believe it or not.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Ocie Haley V","date":"2012-06-15 04:37:17 +0300"},{"content":"I stayed here for a couple of nights in a Mediterranean Suite. Check in was a breeze, the bellman brought up our bags and gave us a tour of the room and everything in it and made sure we were good before he left. I think everyone talks about the window seats, but I'm going to talk about them too because it was the BEST thing about the room. It was the first place I went to when we would come back to the room, they are great. The bathroom was super nice. The bathtub was huge, the shower was a bit on the small side, but it worked fine. The separate living room with a tv was nice and the room was decorated beautifully. The bed was very comfortable and the staff brought up extra pillows within 5 minutes of calling the front desk for them. The staff was great about answering questions about good restaurants and some great local festivals that were happening over the weekend. Our room was on the 9th floor and had a clear view of the river which was beautiful, especially at night. I posted a comment on the hotels facebook page and when we came back one evening there were two cupcakes waiting for us, with a nice note thanking us for being a facebook fan...it's the little things! :) Kimpton Hotels really know what they are doing. They truly know how to make people feel comfortable and know how to make people happy. The coffee/tea in the mornings was great and the wine reception in the evening was a great way to meet other travelers and get to know people. I can't wait to go away again just so I can stay at a Kimpton Hotel, the next time I think I'll bring my dog.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cruz Stokes","date":"2015-10-15 06:26:22 +0300"},{"content":"Our first stay at a Kimpton in Chicago and we will return. Everybody we interfaced with was interesting, helpful, warm and made us feel special. Wonderful location for walking in every direction and most convenient for the train to the airport. Quiet, warm and inviting. Marcia","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Addison Harris","date":"2015-05-24 12:02:12 +0300"},{"content":"We've stayed at this hotel before as Hotel Monoaco is one of our favorite hotel chains. This was the first time we've stayed in a two-room suite. The living area was large with plenty of seating and a desk. The desk being in the living area was great because my teenage son likes to stay up late on the computer. The sofa bed could use replacing, but isn't that always the case with sofa beds. The bedroom was huge and being a corner room with window seating you could sleep on, provided great views overlooking the river. Two flat screen TV's were also a plus. We always enjoy the afternoon wine in the lobby free of charge! Since it was extremely cold this time of year, the morning coffee and tea and afternoon hot chocolate hit the spot. Hotel Monaco is located in a great location for visiting the Theatre District, Art Museum, Macy's, the park, etc., but the only downside are the beggars that hang out on the corner outside the hotel. One night we were screamed and cursed at as we walked to dinner, and another time we were stopped by someone as we walked back from Mag Mile. During the day the area is crowded with shoppers and workers and there are no problems, but later in the evening it's more secluded. We've been in the summer when the days are longer and have had no problems.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Adam Johnston","date":"2015-09-24 08:32:29 +0300"},{"content":"We booked online at another website. We could have gotten a slightly better rate if we had used the Kimpton Hotel's website with their promo rate section. So be sure to check. This is a wonderful small boutique hotel in an excellent downtown Chicago location. The property is very well cared for with all furnishings fixtures in perfect condition. Free internet for Kimpton members--so it is worth joining. Good location for walking north up the Magnificent Mile, close to many excellent restaurants, and around the corner from the theatre district. Excellent nearby public transportation. We especially appreciated the hotel staff. All were professional, helpful and attentive. The 5-6 p.m. wine hour was well managed and also offered a small tray of hors d'oeuvres. The atmosphere is subdued elegance with a small entry reception area, and beautiful well designed guest rooms in an art deco style. Considering how close it is to the trams, which is a plus if you like to use public transportation, we were not disturbed by the noise.You need to ask if you wish a coffee pot in the room. Hot beverages are available in the lobby in the morning. Cold beverages were available throughout the afternoon. Would definitely go back to the Hotel Monaco Chicago.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Katrine Jakubowski","date":"2015-05-25 08:45:02 +0300"},{"content":"Just got back from long weekend in Chicago at the Monaco. The location was fantastic with rooms overlooking the river. We had a suite which had plently of room and the service was great. Just a few blocks from the blue line getting to/from O'hare was very easy. Would stay here again in a second.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Miss Jaydon Little","date":"2013-05-20 13:06:20 +0300"},{"content":"I got home from our stay at Hotel Monaco yesterday. We enjoyed everything about the hotel! Beds are SIX diamond, room service was nice, the room was extremely clean, staff was friendly and the AC temperature was perfectly cool! The bartender Dan makes a killer bloody mary at the attached restaurant. I'm officially a fan of the Kimpton brand after having such a great experience at Hotel Monaco! If only they had a location in New Orleans or San Antonio! A few things to know before your stay..using the business room was a bit overpriced, so if you have to print anything off during your trip try to do it before you get there. Also, if you want your room cleaned when you leave for the day just $@!#% around the sign on the door so it says Service. The maid service was outstanding so I recommend it! We left to see the sights around 12PM each day and they still came to our room each day, Another couple travelling with us did not get their room cleaned because they did not use the door sign, One of the friends I travelled with works for a very popular hotel chain and agrees that this place rocks! Room 410 has no cushion in the window seats but we were so impressed with the rest of the room, I'd still recommend it...the view and overall experience was worth MORE than what we paid. :)","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Bria Emard","date":"2014-04-28 00:48:20 +0300"}],"public_likes":["Melany Romaguera","Yessenia Herzog PhD","Godfrey Koch"],"vacancy":true,"description":"Offering perhaps the cheapest hotel stays in Birmingham, the ibis Budget is a chain hotel optimized for low costs, with very simply appointed rooms with just enough space.","alias":"formerly Etap Hotel","pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}