{"title":"Yosemite National Park","name":"Yosemite Creek","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":37.826741,"lon":-119.595839,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33902,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"Great Vacation...10/11-10/19 We returned last night from eight days at Paradisus. It is a beautiful resort and we don't think there is a bad location on the site. The employees were so friendly and helpful (yes, one room was not ready for one hour and our room was not cleaned one day until 5PM....but this did not even begin to hurt our vacation).---The grounds, pool and beach are knockout gorgeous and there was plenty to do. The restaurants all have a different atmosphere and were very good - not five star, but good.  We had a second story room and it was very attractive. Our friends who traveled with us also had a second story room two buildings away. I loved walking around the complex but my husband preferred to take the shuttle (so we took turns). There was construction going on but it interfered with nothing. We had requested ocean view but knew before we went that it would not be available....actually, we preferred the room we got.  We did not do horseback riding (included) or any of the excursions. However, golf was praised by other guests and the Saona excursion will be on our list next time. There were several families there and the children were so good and so well behaved. 98% of the time you were not even aware they were there.  We used room service daily and they were very prompt and accomodating. There is a power boat that goes out at 10 and 1 (about 20 min. along the beach) to a grouping of vendors. The boat captain stayed with us the entire time and it was fun (this, and most excursions, you need to sign up for at the boating area).  We celebrated our anniversary while we were there and emailed the resort this. They made sure we had a dinner reservation at El Romantico on that night and certainly made our stay extra pleasant.----The photographer at the resort goes around taking pictures and then they are for sale at $6/each. Good photographer and some great souvenirs. The Miami Herald newspaper was available each morning at the towel booth.  At the lunch buffet, they had little ice cream cones and 3 types of soft ice cream - we made these every afternoon and they were a great treat. The ONLY time we ran into bugs was one night in the lobby waiting for our friends.....I was bitten (by no seeums) on the ankle....but they left my husband alone. A little Spanish goes a long way.. if you can go knowing 10 words, you will put a smile on the employees faces!  We have also been to Secrets Excellence and, although the food was more top notch, we would tend to return to Paradisus first.  The only criticism I would pass on (and you can work around it) is that the Dominican Music at the pool bar (9:30 a.m to 6:00 p.m. was repetitive and quite loud). All you need to do is locate away from it a little bit and it is fine............One suggestion. The resort does not have pool floats but allows them. Brookstone has a great float that is easy to use and to get in and out of. The center is mesh so you keep cool in the water. They fold up into a circle and into a small carrying bag that will fit in a decent size suitcase (diameter about 24-30).  Before we headed off, the weather forcast was for 7 days of rain beginning with Tropical Storm Mindy....Actuality was 1 1/2 hour of rain one day and rest of the weather was gorgeous and perfect!  To anyone going to Paradisus we say enjoy - we just had a wonderful vacation.....To anyone from Paradisus who reads this we say Muchos, muchos gracias!!!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Tess Schinner","date":"2014-07-07 18:49:07 +0300"},{"content":"Paradisus was a HUGE disappointment We've just returned from the Paradisus and feel the resort was totally misrepresented. We have traveled extensively all over the Carribean, and this was far from a Luxury resort.I will start with our check-in which was smooth. However, when we were dropped off at the room, it was already occupied. We sat there for 10 minutes while the bellman/shuttle driver called back up to the lobby (another family was waiting on the shuttle). Finally, he took us to another room and the maid had to let us in. He said someone would be right behind us with new keys. After 5 calls to the front desk and over an hour of being stranded in our new room, we had new keys. On one call, they had the nerve to ask us to call back in 5 minutes because they were busy checking people in. The rooms are not bad, but not exactly what I would consider 5-star luxury.Finally, we head out to explore the resort. The pool area is beautiful and the foliage thruout the resort is very well maintained. The ocean is breathtaking and the beach is clean. That's about it for the positives.The entire resort is under renovation which means electric saws, drills, workers everywhere. You could not even hear the music in the bar for the construction. There were men busting out sidewalks, installing new roofs, painting, etc. You constantly had to stand to the side to let a worker with a wheelbarrow or load of palm fronds get by. And it was no different on the beach. They were building a new cabana on the beach complete with electric saws again so we moved down away from those sounds. Only to be greeted by the scent of fresh paint as they touched up the massage cabana on the beach. And if you want a chair, make sure you break the rules and leave towels on it 24/7. There are signs everywhere that you can't save chairs unless someone is there, but it is not enforced.Restaurants and service in general were fair. Make sure you ask for reservations before you get there --- I emailed the hotel directly and had reservations waiting when we arrived. The only restaurant where we had a great meal and service was El Romantico. The Japanese was a joke -- we had an 8pm reservation, got seated at 8:50 and didn't get a drink until 9:10. Everything else was so-so, including the buffet which was basically the same everyday. But the people in the restaurants generally don't understand service. The service in the bars is much better.Regarding the included excursions, two words -- GOOD LUCK. Everything was booked up when we arrived. They only take 30 people horseback riding per day (15 each twice per day) and it is only 3 days of the week. Same with scuba, snorkel, shopping, etc. When the shopping excursion was full, the resort offered to have a boat take me there and wait to bring me back for a fee of $40. We opted to go on our own after we learned it is a 10 minute walk from the resort. You can get there by walking on the beach or out of the front lobby.Needless to say, I would not recommend this resort to anyone. Perhaps when all the renovations are complete, this resort will live up to it's name. It has a loooong way to go.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Rachelle Blick","date":"2012-10-17 11:46:51 +0300"},{"content":"Nothing to complain about My husband and in-laws and I just returned from a week at Paridisus Punta Cana and had a lovely time. The grounds are just beautiful and lush. The beach and pool were wonderful. (We spent much of our time at the lovely pool.) The resort is on the Atlantic, rather than the Caribbean, so the water at the beach can be rough.)We were anticipating some difficulties at this resort a la other folks' reviews, but were pleasantly surprised. The food was tasty (albeit not gourmet in most of the restuarants). We would recommend the Brazilian and Mexican restaurants. The service was good and the staff were friendly. With a little Spanish, your requests will be honored without hesitation. In many cases, non-English speaking staff would ellicit the help of English speaking staff rather than trying to muddle through the language barrier. We were there very off season so the staff to guest ratio was high. I could see how the staff coordination could be more challenging with an increased number of guests. We took the trip to Manati Park to swim with the dolphins. For us it was worth the $70 price tag (incl. park . The park is small and interesting, but not worth the $25 admission fee on its own. Vendors are lined up at the park to sell you this or that throughout. None of the rooms were beach front, but most were adequate and had nice garden/pond views. (We stayed in building 12.) The rooms closest to the beach were the lowest and highest building numbers. Our room was pleasant, cool and clean. We pushed our two full sized beds together. Each room has a small living room area and patio. (It's helpful to remember that this is not the Ritz Carlton, but a lovely, relaxing caribbean-type garden apartment-type setting. I would eagerly return to Paridisus and I would return with children and family. Be prepared to relax and take it easy and you will enjoy your stay there greatly.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Dejon Nolan","date":"2013-08-21 21:09:51 +0300"},{"content":"Great Hotel, Highly Reccommend It! My husband and I visited the Paradisus hotel in October of 2001, right after 9/11. We were nervous about traveling but figured if it was our time to go, then it wouldn't matter where we were. The hotel lobby was beautiful and they had drinks awaiting our arrival. The hotel staff was very courteous and although language was a barrier, it wasn't difficult to convey basic needs. I will say that one should avoid the tour of surrounding hotels because while the lunch and t-shirts are free, the tour takes all darn day (don't let them fool you-- It's really a time share pitch in disguise.) We had a few problems (bugs appeared after I left a fruity drink on the night table-bad move!!) and the bed seemed broke (maybe my husband and I broke it-who knows) but the staff fixed these things promptly. The Japanese restaurant and El Romantico where THE best restuarants there. I did not enjoy the townspeople as I found them to be rude and annoying. i was willing to spend about $400 on liquor and presents but after not receiving back change from the first store I was harrassed to shop in, I had my fill of the locals (the gift shop at the hotel was not that expensive and they were cheerful and friendly) . The main reason I would highly reccomend this hotel is months after my husband and I were back home in the states, I searched in vain on the internet for the Cigar factory (Don Lucas) we had toured while there and couldn't find a link. I emailed the hotel and they provided the link, a contact and phone for the factory the very next day after I emailed them. It just goes to show the level of service that they provide. My husband and I will always view the Paradisus as one of the best hotels we've been to everytime we hold our little souvenir Anayah Michelle, born nine months after our return from Punta Cana! :-)","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Dr. Annie Wehner","date":"2012-02-05 20:02:10 +0300"},{"content":"Its all that! This place is all THAT!!! We spend more money then we expected but it was worth the money. After all we did go to have fun!!!! People are great, Grounds are just the best it get in a resort. We got a great room. Clean and looked like new. Food was what I expected so that was great. One thing next time I am getting Bungalow 8 its the best. My friends had it and its just in the perfect location. Thank you and WE WILL BE SEEING YOU AGAIN!!!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Javonte Mitchell","date":"2015-09-16 14:13:20 +0300"},{"content":"Perfect We got married at the Paradisus in Dec. of 2002. We planned the entire wedding over the internet and were a bit nervous never having seen the resort. We had over 50 family members and friends join. All I can say is that it is truly paradise. Our wedding could not have been more perfect. After our wedding we decided to head up to Bayhiebe (s.p.) to check out some other resorts. We hated it. We immediately called our travel agent and came back to Punta Cana. This time to the Melia Caribe  Tropical which is run by the same company as Paradisus. We loved it there too.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Tito Buckridge","date":"2012-02-21 17:59:24 +0300"},{"content":"H么tel sur茅valu茅 - Pratiques douteuses   showReview(16713590, 'full');","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":4.0},"author":"Elody Powlowski","date":"2014-11-01 04:10:07 +0300"},{"content":"Merveilleux paradis , Paradisus Hotel   showReview(6437918, 'full');","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Luigi Kuhn DDS","date":"2012-10-31 14:22:30 +0300"}],"public_likes":["Tressie Sauer","Amos Wehner"],"vacancy":false,"description":"Open from July through early September, this campground is located off of the Tioga Pass Road and offers 75 sites on a first-come, first-served basis for tents only. Creek water only, must be treated before drinking.  Vault toilets are available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}