{"title":"San Diego/Mission Beach-Pacific Beach","name":"Crystal Pier Hotel","address":"4500 Ocean Blvd","directions":null,"phone":"+1 858 748-5894","tollfree":null,"email":null,"fax":null,"url":"http://www.crystalpier.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.79605,"lon":-117.25784,"accuracy":"ROOFTOP"},"type":"hotel","id":25243,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"We had a fantastic experience staying here. The rooms, pools, restaurants were all A+. We loved the variety of outdoor seating/lounging, especially around the fire pits since the evenings get a little chilly. There were quite a few families there with school aged children.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Meta Tromp V","date":"2012-07-20 00:47:10 +0300"},{"content":"Had a great time at the Arizona Biltmore while in Phoenix for a business trip. Originally planned to stay at the Arizona Grand resort, which was much more affordable, but not nearly as luxurious. The Arizona Grand would have been great for a family on a budget, but the Biltmore was perfect for adults and business. Such a large resort, such beauty all around. So many pools! I imagine when it gets really hot, those pools get packed, but since there are several of them spread out amongst the resort, I imagine there's always room at one of them. Ate and Frank & Albert's several times. Great for breakfast - not bad for dinner, but not amazing. The staff was all great. We were placed in the main building on the 4th floor above the lobby. Couldn't imagine it gets any better. See my pic for the amazing view out of our window. The room was large and spacious, although I might have preferred wireless access over the one wired port in the room. Plenty of electrical outlets. Depending on what was going on, we could actually get a wireless signal from the lobby - but it wasn't always reliable. I found the Starbucks on the premises to be a little expensive ($5 for a croissant?!) but with Hilton Silver Honors, you get a free large coffee each day of your stay. I think I could have stayed there a week, and I imagine it only gets better when the weather really heats up. Self parking was the only minor hassle. It was a bit of a ways away, but still a pleasant walk. Not much around the resort itself. A shopping mall isn't too far away, but you'd need to drive anywhere. I'd definitely go back.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Rudolph Welch","date":"2013-08-21 18:57:46 +0300"},{"content":"My husband had a business trip 3 days after our wedding so I started our honeymoon here. We stayed in a Villa which was great. The room was HUGE. The resort is beautiful but the staff isn't. We ate dinner at the restaurant twice and the food wasn't good either time. The wait staff was not attentive. We would have to waive them down to get water or drink refills. I spend the days at the pool and the staff there is just as bad. The hotel concierge was the worst. I asked for them to arrange for a taxi to bring us to the airport the following day and he said he would see what he could do. The next morning come to find out they never called for a cab but wanted us to use their private car service.","ratings":{"Overall":3.0},"author":"Garret Spencer","date":"2014-12-17 22:33:37 +0300"},{"content":"This is the second time I have stayed at the Biltmore and it remains my favourite hotel in Phoenix. It was built in the thirties and has a charm lacking in so many of the resort hotels in Phoenix. That being said the rooms are starting to look a little frayed around the edges. My room was a cottage near the main lawn. It was a good size but the bathroom felt a little tatty and the shower was also a little worse for wear. Normally I would not care but the Biltmore is at the top-end of the market so everything should be spot on. The general hotel environment is lovely - especially the fire-pit area where you can chill with a nice glass of wine. The Biltmore gym has been re-kitted out since my last stay with an excellent variety of cardio kit. Overall a very pleasant stay at the Biltmore but it is just one small step away from being a truely great experience. Also played golf at the resort. Have to say that the links course is much better than the other course (cannot remember its name).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Aubrey O'Kon III","date":"2013-04-15 04:58:53 +0300"},{"content":"I came here for a business trip and was pleasantly surprised at the luxury of this location. It offers a variety of sleeping quarters from a traditional hotel room to cottages and villas. The resort was at approximately 70% capacity, but because it is large and spread out, you never felt crowded or overwhelmed with other travelers. There are several pool areas accommodating kids and adult relaxation. There is a nice fitness spa. Also, a nice walking trail and golf right on the property. The service of the housekeeping, bartending, and waitresses was great. There is not much of a night life activity except for the bar and the pool. No music or dancing on property. The food was good and reasonably priced. I would recommend this to my company for a meeting. And I would also come back for a vacation destination.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Service":5.0},"author":"Lesley Will","date":"2015-10-07 05:00:34 +0300"},{"content":"My husband and I got married at the Biltmore in August. The staff was so helpful, and got us everything we needed. The property is gorgeous, the rooms are nice, and everyone is very courteous. I would highly recommend it for anyone for any occasion!","ratings":{"Overall":5.0},"author":"Ophelia Hermiston","date":"2012-10-07 09:43:08 +0300"},{"content":"Great Art Deco design and the service was outstanding. Friendly staff and very helpful. Spacious and comfortable rooms A nice surprise was Frank and Alberts restaurant. All our meals there were outstanding.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Margarete Koch","date":"2013-10-20 19:55:13 +0300"}],"public_likes":["Cathrine Stiedemann PhD","Ben Heidenreich","Samantha Lakin","Lauretta Schamberger"],"vacancy":true,"description":"The closest that you can get to staying on the beach.  Built on the historic pier, these rooms offer amazing views and soothing ocean sounds to put you to sleep at night.  With a room, you can actually drive out on the pier and park in front of your quarters.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}