{"title":"London/South Kensington-Chelsea","name":"Merlyn Court Hotel","address":"2 Barkston Gdns, SW5 0EN","directions":"tube: Earl's Court","phone":"+44 20 7370-1640","tollfree":null,"email":"london@merlyncourthotel.com","fax":"+44 20 7370-4986","url":"http://www.merlyncourthotel.com","checkin":null,"checkout":null,"price":"From £45 (without bathroom); from £65 (with bathroom)","geo":{"lat":51.4928,"lon":-0.1901,"accuracy":"APPROXIMATE"},"type":"hotel","id":16444,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"otel wasn't hard to find (we'd rented a private limo) and for the price we'd paid (special rates for stays over 3 nights) this hotel is a steal. Location beside the bus, train & metro terminals were both a blessing (easy access to the city via bus, tram & metro) and a curse (lots of undesirables lurking around the perimeter and thus the need for tough looking security staff). Front desk staff are aloof and smiles do not come easy to them (despite my best efforts to establish a rapport... might be a function of the \"big city\" mentality). Rooms were well appointed and the bathrooms equally nice. We had a bit of a draining issue with the basin and it was promptly fixed the next day by housekeeping (bonus points for us not even needing to call it a request for repair). The shower doors are ill designed and the floors do tend to get a tad wet as a result. 35+ degrees outside and the air conditioning worked flawlessly (although we had to get an extra key to keep it powered on while we were out). The complimentary breakfast was one of the best I'd had (although didn't remember we had access to it until the last day when I overheard the front desk informing another guest of it... wished we'd been reminded of it when we'd checked in... my bad). And like other's have mentioned, wireless is pay as you go (€3 for 30 minutes minimum). I ended up bringing my iPad and getting a local micro SIM card from a shop in the terminal (do not use any of the stores around the hotel... they are a ripoff!). €8 for 3Gb @ 3G speeds for the whole month (I was lucky and they were having a special promotion).","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Herta Stark","date":"2014-04-14 21:10:02 +0300"},{"content":"- Downstairs bathroom is super clean, with modern design - We stayed in Superior Queen. It is definitely small. But clean. Modern. - Bed was comfortable - Bathroom was modern and clean - Shower doesn't totally close. - Temperature is controlled from the front desk. - When getting off Termini, from the Airport, you just cross the street and it is a short block away - Hotel's name is sideways, hard to find at first - Little away from the city center, but the convenience of the tram makes up for it, all metros stop here, so you can go anywhere quick - Breakfast is great, hot and cold breakfast. If not included in your hotel, I don't think it's worth it, though.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Zelda Okuneva","date":"2014-06-20 07:55:57 +0300"}],"public_likes":["Lila Wilkinson","Price Gutmann","Ernie Kemmer","Caterina Feil","Sterling Witting","Elian O'Reilly","Erich Kessler"],"vacancy":false,"description":"Lovely and friendly family run bed and breakfast hotel. Totally no smoking. Located in a quiet Edwardian Garden Square. Bright and clean rooms. Family rooms are available.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}