{"title":"Birmingham (England)","name":"Hotel at Conference Aston","address":"Aston St","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48621,"lon":-1.8887,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3628,"country":"United Kingdom","city":"Aston Triangle","state":null,"reviews":[{"content":"I stayed in the Omni hotel for 9 nights with my mother and sister. We found the Omni Hotel to be in an excellent location for shopping and visiting all the tourist attractions. The concierge Mellissa was very helpful and assisted with all our enquiries. Jared at reception was also very helpful with all our queries. The room was cleaned daily and in good condition. Sheets and towels were changed daily. The beds were comfy and there was no noise problems at night. I would advise anyone wishing to book this hotel to book via the hotel directly. I booked through a third party website and i would not do this again as the hotel room type I booked was not the one I recieved. I was informed by the hotel that when you book via third party you are placing a request and are not gauranteed the room type you book. All in all this hotel is a lovely one in a fantastic location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Bennett Breitenberg","date":"2012-10-12 14:02:23 +0300"},{"content":"The best part of my stay at the Omni (for a conference held at the hotel) was by far the hotel staff: the front desk clerks were cheerful and efficient, the concierge pleasant and helpful, and the housekeepers responsive to requests. On the other hand, the Omni is both the noisiest and dustiest hotel I have ever stayed in. It apparently is located directly on the hospital route...ambulances screamed by at all hours of the day and night. One night there was a weird drumming (I am was on the 11th floor) that lasted about 90 minutes; during the day there was lots of drilling noise, which presumably will go away once the reno is finished. The upside of the noise was that it provided unexpected entertainment--sitting on the toilet, with a vent directly above, it is possible to hear every single word of the conversations taking place in an adjacent room. An eavesdropper's delight! Aside from the noise, the hotel was dusty--everywhere. In my room; in the conference meetings room; the the bar; in the business center--in short, every facility I used at this hotel needed a thorough cleaning. When I checked into my room, I opened the curtain behind the bed, and to my disgust, it seemed as if every previous tenant of the room had left his or her hand, nose or lip print on the window. It was so gross I asked housekeeping to clean it up--which to their credit they did promptly. What others have said about the weird layout of the rooms was true for me, although it was not a major inconvenience or distraction. It did seem odd, though, that there was no light switch in the bathroom adjacent to the entry door from the bedroom side of the suite. The location of this hotel is superb, and it's fine for what it is--a fair-to-middlin' hotel. It is not four-star and it is not luxe, but it gets the job done.","ratings":{"Service":4.0,"Cleanliness":2.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":5.0},"author":"Judd Brown","date":"2012-04-25 02:33:29 +0300"},{"content":"First of all, although they confirmed adjoining suites, when we checked in, they didn't adjoin. The desk clerk couldn't seem to understand what we were saying. But, eventually, she straightened it out. And the concierge sent us to an excellent restaurant -- but he gave us the wrong directions, causing us to get lost for a half hour or so. But, these were the only problems. The Omni is excellent in all respects. We had nice suites on the 21st floor looking north on the Mag Mile. Outside of the two minor glitches above, it's a great place to stay and I'd do it again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Christiana Vandervort","date":"2012-02-06 04:12:56 +0300"},{"content":"I have stayed at the Omni in Chicago a couple of times and always have a good experience. The rooms are very clean and the bed is oh so comfortable. You can only valet park at a cost of $46 per night as there is no self-parking for the hotel so I would recommend that you not bring a car to the Omni.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":5.0,"Location":5.0},"author":"Flo Russel","date":"2015-05-06 08:32:28 +0300"},{"content":"My husband and I spent the night in Chicago at the Omni Chicago Feb 2, to Feb 3. Excellent stay, beginning with check in. The woman at the Front Desk was very friendly, helpful and fast. Our room was spacious, very clean and with all the amenities. We left for most of the day and when we returned our bed was turned down with little chocolates on our pillows and the hotel robe laying on the bed for our use if we choose. The bed was very comfortable, the pillows were ok. Still, we had a great night sleep. In the morning we ate at their restaurant, they had a breakfast buffet, but we ordered off the menu. Everything was delicious and the wait staff was excellent. We would definately stay at this hotel again. We used Express Checkout and left. Staying in a great hotel can make all the difference in how well you enjoy your mini trips. PS. We saw \"Wicked\", it was excellent!","ratings":{"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Angelita O'Hara","date":"2013-05-18 04:24:29 +0300"},{"content":"The Omni is right in the heart of things and is very upscale. It is an all suite hotel and I had one of the basic ones (called a deluxe king suite I think). I got a good rate for the dates and star level through hotwire so I was a little concerned, but I needn't have been. It is absolutely clean. It is very roomy with deluxe bedding, upscale designed wood, marble and granite everywhere. Plasma TV in the sitting room and another TV in the bedroom, free wifi. It was very roomy. Great Wolfgang Puck coffee in the room. A CD player in the alarm clock. Electronic temp control. Wetbar. I enjoyed the view from the 20th floor. The artwork in the elevator and lobby were probably done in China in a factory to look like real artwork (yuck). I thought the desk people were decent, but I felt there was a general lack of warmth and helpfulness that was so evident in my stay at the Hotel Indigo the night previous. It made me feel less than welcome, so the \"shwank\" was wasted on me. I did like the conveniences. Valet parking is 40.00 a night so ask about self park, it is just around the corner under some shopping mall (I can't for the life of me remember what it was called) for 28.00 a night. It is valet too, just not from right in front of the hotel. Great location if you want to do the shops on Mag Mile. Short bus or cab rid to other downtown sights like the Art Institute or King Tut (Field Museum). I didn't have time to check out the resturants, but there have to be so many really good ones nearby, it's Michigan Ave. There are sirens and other loud street noises as you might expect dowtown, but I was able to sleep with earplugs. This would be a very nice place for a romantic weekend or a business trip.","ratings":{"Service":3.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Winston Conn","date":"2012-05-25 02:49:38 +0300"},{"content":"My sister and I decided to get away for the weekend and meet in Chicago. She had heard great things about the Omni, so we decided to stay there in November 2005. The Omni Chicago is located right on Michigan avenue, which was great, because we could just walk ouside the hotel and immediately enjoy walking the Magnificent Mile. From the moment we pulled our rental car up the hotel, the bell staff were extremely friendly and very helpful. Surprisingly, they were the ones that demonstrated what customer service should be. When we got inside the hotel to check in, we experienced the complete opposite. We patiently waited for someone to acknowledge us. No one else was standing in front of us. This lady behind the desk looked up at us, didn't say a word then continued what she was doing. She could have said, \"I'll be right with you.\" We didn't mind waiting, but some sort of acknowledgement would have been nice. Finally, she looks up, puts out her hand (as if to motion us to come) and still doesn't say a word. I'm surprised she didn't whistle and pet us once we approached the desk. No \"Welcome\" or \"Hello\" or anything! She was downright rude and made us feel like we didn't deserve to be there. (We're in our 20's, are young professionals who were raised with excellent manners, and came dressed nicely--not in anything inappropriate). I guess because we didn't look rich or established to her, we didn't deserve any bit of service. After she checked us in, she gave us our room keys, and again, didn't say a word. She never pointed out where the elevators were, so we had to search for them. That was the only bad experience. The room we had was very nice, chic and modern with warm colors. The view is typical of a city view...lots of buildings. There was a large bedroom, a sitting area with a desk and a moderate sized bathroom. The beds were very comfy. I really liked all the rooms except for the bathroom...it was dim and didn't seem to fit with the room, because it wasn't that nice and looked like any other bathroom at a Holiday Inn. The restaurant is average. However, the room service is excellent and the food delicious...definitely as if we were dining in an upscale restaurant. The desserts were also very good. In summary, it's a great place to stay if you want to be close to all the shops and restaurants on Michigan Avenue. The bell desk staff should teach the front desk staff how to be professional and welcoming. They deserve the highest praise and made up for the rude front desk person.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Service":3.0,"Rooms":4.0},"author":"Dagmar Gaylord","date":"2012-07-08 16:28:22 +0300"},{"content":"staying in chicago is not cheap, so the least you expect is decent service. the omni excels in this respect - everyone was effortlessly competent and friendly. yes, the two stage lift is a bit of a nuisance, but you don't wait long. location is great, particularly if your partner is an Apple addict. comfy bed and, hurrah, plenty of storage in the bathroom - how often have you struggled to find somewhere to balance your washbag? on the downside, the fitness facilities aren't up to much and the wi-fi coverage was patchy. for classy cocktails before dinner, try the bar at the Park Hyatt.","ratings":{"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Service":5.0,"Rooms":4.0},"author":"Titus Wisozk","date":"2014-06-12 17:02:02 +0300"}],"public_likes":["Johnny Connelly","Avery Gleichner","Ena Wolf","Casimer Huels","Karianne Mayert"],"vacancy":true,"description":"Situated on the Aston University grounds, the Conference Aston is a convention centre with an on-site hotel. Hotel guests can enjoy the facilities of the Woodcock Sports Centre across the road, including a full-sized Victorian swimming pool","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}