{"title":"Edinburgh/West","name":"Holiday Inn Edinburgh","address":"132 Corstorphine Road,Edinburgh, EH12 6UA","directions":"Next the Zoo, about 2 miles from the city centre, on 12, 26, 31 and Airlink bus route.","phone":"+44 871 942 9026","tollfree":null,"email":null,"fax":null,"url":"http://www.hiedinburghhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.94278,"lon":-3.26676,"accuracy":"ROOFTOP"},"type":"hotel","id":8709,"country":"United Kingdom","city":"Edinburgh","state":null,"reviews":[{"content":"Loved it!! We stayed at Buena Vista Motor Inn for two nights in June and again in July, at the beginning and end of a round trip in California. And we were more than satisfied. Our room was great, clean and comfortable and the staff - Ken and Bernard in particular - was more than helpful and friendly. It is about 20 minutes walk from the central part of Fisherman's Wharf, cable cars, Alcatraz ferry etc. Sure, the parking lot is small, but it is free and according to the staff they will always be able to fit in a car per room even if it means double parking and leaving the keys at the front desk for them to move the car if necessary.There is a coffee maker in the room to keep you going until breakfast. The breakfast - muffins, pastry, fruit and juice - they serve at this hotel is neither better nor worse than so many other continental breakfasts at motels in California (according to our three weeks of experience). And up the road on the left side of the street is a great place for a freshly cooked breakfast, the Lombard Cafe. And going left maybe six blocks down the street from the hotel is Mel's Diner, a typical American diner with typical diner fare - and the best milk shakes we tasted in California.Buena Vista Motor Inn is highly recommended - we loved our stay there!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Maud Mann","date":"2013-11-10 15:27:44 +0300"},{"content":"Wonderful Hotel; Perfect location If you're looking for fancy, this is not the place but if you want a reasonably priced room convenient to Fisherman's Wharf, this is the place. The room was small but clean. The front desk staff were wonderful. They answered all our questions with a smile. Fisherman's Wharf is within walking distance. There's a Mel's Diner (remember American Graffiti) down the street about 6 blocks. The most we spent on cab fare to get around the city was about $12 dollars. This is a great location and a very clean, friendly motel. I will stay there whenever I am in San Francisco.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Abbie Hettinger","date":"2015-03-16 08:38:48 +0300"},{"content":"hotel pr猫s du centre et du cable car   showReview(14728532, 'full');","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":4.0,"Location":-1.0},"author":"Arnaldo Jones","date":"2014-04-27 08:21:46 +0300"}],"public_likes":["Dariana Gutmann III","Kenyon Ankunding IV","Emiliano Wilderman"],"vacancy":true,"description":"The hotel has a restaurant. It is next door to the zoo, and so don't be surprised if you hear animals at night.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}