{"title":"Paris/9th arrondissement","name":"Hotel George Opera","address":"46, rue Notre Dame de Lorette","directions":"Metro Saint Georges","phone":"+33 1 48 74 03 29","tollfree":null,"email":"hotel.george@astotel.com","fax":"+33 1 45 26 28 14","url":"http://www.astotel.com/uk/hotel-george-opera-paris.php","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.8794,"lon":2.3365,"accuracy":"ROOFTOP"},"type":"hotel","id":21860,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"It was our first trip to Maui, but not to the Hawaiian Islands. I was nervous about booking a place, so I asked around. Many folks recommended the Napili Kai. As you have read in many reviews on this site, people found the rooms to be outdated. I can only review the room that I stayed in, which was in the building called \"Puna II\". It was totally renovated, with op to date appliances and furniture. Everything was new, and it was quite lovely. We enjoyed our room immensely, and it was cleaned neatly every day we were there. We even made our bed, and each day the maid re-made our bed! LOL. Anyway, it was a great room, #240, which was on the second floor, on the corner of the building. It had an incredible view, and since it was on the corner, we got an extra wide view of the ocean from two fronts. Excellent! We really enjoyed sitting out on the large patio, overlooking the beautiful Pacific. We saw whales and a sea turtle not far out to sea from our patio. The pools are right below, so you can go swimming in relative quiet if you want, instead of going to the Pacific. The lounge chairs were rarely used, and we never had problems finding empty ones. The beach is near enough that it is convenient, and far enough where you don't get the noise from the beach crowd. The beach is gorgeous, and the water is so nice and not too cold. Snorkeling was great, but best when you swam to the right side of the beach (west) and went up around the point. It was great out there. Be careful of the reef in the center of the bay as I nearly got stuck on it. I didn't realize it was so high! We did not try any of the restaurants, as we had stopped at Costco at the airport and bought all of our food to cook ourselves which we greatly enjoyed. The restaurants looked good, and the food looked good, but as always in Hawaii, overpriced. The kitchens in the units are fully stocked with everything you will need, so no need to worry about that. There are barbecues below near the pool for everyone to use also. We loved cooking in our kitchen. One of the more beautiful aspects of this hotel is its location which is so lovely. You can walk west from the hotel and walk nearly two miles, right on the beach, past the Four Seasons and see some marvelous sites on the shore. Also if you walk up two more miles there are some great snorkeling beaches off of the 30 highway. There are hardly any people there too. Worth the walk or drive. The only negative thing I have to say about this hotel is that the staff at times seemed unfriendly, like they really didn't like their jobs, or were just in a bad mood. I know it's a job and not many people like their jobs, but you could at least fake it. Especially at the towel cabana, I felt like I was putting them out and \"making them work\", or just annoying them when I asked them to change my towel. Our maid was very friendly however, as was the young lady who checked us in, she was quite personable. Overall, this is a very nice hotel, well worth the price, especially if you stay in the Puna II building. We loved it!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Schuyler Kirlin","date":"2013-05-27 00:25:49 +0300"},{"content":"This place is what I think a Hawaiian vacation should be. It's got two great snorkeling beaches and the best sunsets ever. The only drawbacks are that I wish there was a gas bbq near the Punta bldgs, and I wish there were other places to get your towles besides the beach cabana that was a little bit far from us. I really loved the polynesion feel the place has and will return again as well as reccommend to my friends.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Patience Koelpin","date":"2013-12-03 06:24:37 +0300"},{"content":"We loved staying at Napili Kai. It is such a gem of a location - one of the best on the island. The views, the beach and the amenities offered by hotel are outstanding. We also had the pleasure of meeting with the activiities director, Holland Carter. He was very knowledgable and enthusiatic about all the island has to offer. We have to come back to Napili Kai to do all of the fun things Holland has suggested.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Mrs. Monty Walker","date":"2015-08-18 15:59:06 +0300"},{"content":"My husband's family has been guests at Napili Kai Beach Resort since it was Napili Kai Beach Club. I fell in love 10 years ago when my fiance brought me here to be married on the grounds of the Resort. It is the one place, in our many travels, that I need to return to over and over again. It is home, it is family, it is everything paradise should be. It is not fancy, it is Hawaiian. Stunning grounds, gracious staff that is there year after year and to say it is relaxing is an understatement. This is the only place I have ever left to return home and cried. I cry because it is so special and it will be another year before I can see and feel it again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eli Rutherford","date":"2015-08-14 23:16:29 +0300"},{"content":"Napili Kai Beach Resort just gets better every visit. Wonderful accomodations, excellent food, greatest scenery, beach and snorkeling, friendly people, always consistent service. Great walking, it's no wonder that people return to Napili Kai Beach Resort year after year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Location":5.0,"Rooms":5.0},"author":"Herman Harris","date":"2015-07-26 21:46:55 +0300"}],"public_likes":["Jeanie Rempel","Marlon Christiansen","Micheal O'Keefe","Mr. Claire Watsica","Brandi Nicolas","Billy Tremblay","Kaelyn Rowe","Henderson Nikolaus"],"vacancy":true,"description":"Friendly and English speaking staff. Free Wi-Fi in the rooms.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}