{"title":"San Francisco/Union Square-Financial District","name":"Hotel Vitale","address":"8 Mission St","directions":"at the Embarcadero","phone":"+1 415 278-3700","tollfree":null,"email":"bookvitale@jdvhotels.com","fax":"+1 415 278-3750","url":"http://www.jdvhotels.com/vitale","checkin":null,"checkout":null,"price":"$250–$500","geo":{"lat":37.7937,"lon":-122.3932,"accuracy":"ROOFTOP"},"type":"hotel","id":26225,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed here for 3 nights at the beginning of July. The price was great, the location was perfect for us - very central for walking and 1 block from the subway. The staff were helpful and friendly. The room was clean and modern and very quiet at night so no problem sleeping - it was very very small, but the washroom was an adequate size and all we needed it for was sleeping, so we were very happy with it. I would definitely recommend this hotel and would stay here again.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Vincent Torphy","date":"2012-05-24 21:22:04 +0300"},{"content":"Just spend a long week-end in New-York at the GEM - It's a very nice well located hotel- rooms are on the small side but once you know about it (it's our third stay) you pack accordingly. After I got back, I noticed a small additionnal $8 charge to my credit card that nobody had metionned. I called and and they told me that this was for the safe in the room! $2 per day even if you didn't use it, and that I should read the prints when checking in ! because they mentionned it. Now I realize it's not the first time they do that. It's a stupid charge, never seen that before elsewhere, that is just leaving me with a bad after taste. I told them they should mention this charge to their clients, but they replied I should read !! the prints. The $@!#% with you guys. I have other choice of nice located hotel to go to in New-york city. Respect your clients!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Hellen Kuhlman","date":"2014-07-11 18:05:41 +0300"},{"content":"We've just returned from a 5 night stay at the GEM hotel Chelsea. The location was great, easy to get to all the tourist sights and great for going out in Greenwich Village or the Meatpacking District in the evenings. We arrived after a long delayed journey and were relieved to arrive at the hotel, the lobby is smart and well presented and we had a nice welcome by the man at reception who gave us maps of the city and a quick orientation. The room was small but we were expecting this and as we were planning to be out and about a lot it wasn't really a problem. It was a bit beaten up with marks on the wall and our window faced a wall but it was generally clean. Overall it was pretty good for the price we paid, we got a really good deal on Expedia but there are a couple of small things that could really help make it better. There was no welcome pack etc in the room so we had to ask what time we needed to check out and didn't know about some of the hotel facilities. There was only one robe provided even though there were 2 of us. This was mentioned when we checked in but no reason was given as to why, it didn't really matter as we didn't even use it but it was a bit odd. There was a small bottle of water provided (again only 1) which was in the room when we checked in, we drank it the night we arrived but were never given another one. Again not the end of the world but would have been nice if it had been replenished. The safe was really difficult to use, you had to pay for it and swipe your credit card to open and close it, which could take a while as you had to swipe it at exactly the right speed. None of these things were major problems but they're just small touches that could be easily fixed to make the overall experience a bit better. All in all I would stay there again for the location and the fact that it was a good price. As long as you're not expecting 5 start the GEM hotel is a good bet.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Madisyn Nitzsche","date":"2014-09-16 00:12:26 +0300"},{"content":"This hotel is extremely well situated and is very near (one block) to two different metro stations and several different lines, which makes travelling up or downtown easy. Loads of coffee shops, delis and restaurants within walking distance. The hotel is clean, and linen and towels changed daily if you wish. Front desk staff are courteous. There was some noise from traffic, but I would say this was not intrusive and adds to the NY atmosphere you love in this exciting town! The not-so-good news? The room is compact and the bed is very small - 4' x 6' at the most - ours was also fixed against one wall making it even more of a crush! We had difficulty securing the door to the room, but reported this to the front desk who we trust fixed it in time this for the next guests. That said, I would definitely recommend this hotel as a good one to stay in if you are in town for a short sight-seeing break and you need somewhere clean, safe neighbourhood and well situated.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Robert Windler DVM","date":"2014-05-31 10:32:16 +0300"},{"content":"we booked into the Gem for three nights but on arrival we were stunned by the size of the rooms. They were the tiniest rooms we'd encountered in NY city and for the price - AUS$330 a night including taxes we thought they were expensive. The staff were friendly enough until we said we wanted to change the booking to one night so we could find something of better value and then they were pretty cold. Overall the service was pretty average. Despite the price we couldn't make a cup of tea in the room which is annoying. The location is good however. We ended up finding a bigger place of slightly better quality in Midtown near Times Square for about $60 a night less. Overall I would not recommend this place. In fairness they were quite good about releasing us from the 48 hour cancellation fee and did not charge us for the next night which they were within their rights to do. Had the rooms been a little bigger I think we'd have been happier. Being told somewhat sarcastically by the staff, \"well this is New York\" didn't help matters and set the tone for our stay. I'd have to say we are not nomally critical and that friendly, helpful staff can make a dingy place tolerable. They failed on this front.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":3.0},"author":"Georgiana Jacobi","date":"2012-07-01 01:31:03 +0300"}],"public_likes":["Jettie Moen","Madie Kub"],"vacancy":true,"description":"Great boutique hotel, right on the waterfront, across from the historic Ferry Building. Rooms with city or bay views, rooftop day-spa, and a restaurant and bar with outside terrace seating.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}