{"title":"Los Angeles/Northwest","name":"Holiday Inn Express Downtown West","address":"611 S Westlake Ave","directions":"at 6th St","phone":"+1 213 483-6363","tollfree":"+1 888 465-4329","email":null,"fax":null,"url":"http://www.ihg.com/holidayinnexpress/hotels/us/en/los-angeles/laxwd/hoteldetail","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.058802,"lon":-118.274145,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":35074,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"Stayed here one night - great location for wandering around old san Juan - lots of restaurants and bars nearby. Visited the bodies exhibition which was right next door. Rooms fine but no space in bathroom for anything - no countertop! The most annoying thing was the elevators - need to use room key to get to your floor but didn't work very smoothly and we, and others, had several rides up and down because we couldn't stop at our floors!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Wendy Macejkovic I","date":"2013-07-16 22:44:11 +0300"},{"content":"Stayed at the Sheraton Old San Juan for one night prior to our Carnival cruise on October 8th. This was our second visit to this hotel and we were not disappointed. First of all this Hotel is right across the street from the pier that Carnival sails from. The morning of the cruise you grab your bags walk across the street and you are on the ship. Also, it's location in Old San Juan is perfect to sight see in this beautiful city. We opted to upgrade to a suite for $25.00 additional and WOW, we ended up getting the Governor's Suite. Dining room for 8, beautiful living room with big screen TV, seperate King bedroom, 3 balconies and a great view of one of the forts. What a way to start a trip. The people at the hotel were very helpful with sight seeing tips,and restaurant suggestions. All in all I give this hotel a big thumbs up. Hotel outside could use some new paint.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Thaddeus Ullrich","date":"2014-08-04 07:07:52 +0300"},{"content":"I left my new shirt at the hotel and when I went back to tell them they said it was mysteriously gone. Clearly someone took it. It didn't vanish that fast. I have stayed at Starwood Hotels all over the world and I would never stay here again.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Jerad Kulas","date":"2014-02-05 00:22:14 +0300"},{"content":"Stayed one night before our cruise. Excellent choice under AmX Starwood Rewards Program! Excellent location allowed easy access to Old San Juan. Pleasant staff, well maintained facilities, and clean room. Quick and simple registration and departure.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Elliott Torphy","date":"2014-09-24 11:28:33 +0300"},{"content":"The day staff was extremely helpful and assisted with planning excursions and getting any extras like additional towels or toothpaste. The room was tasteful and clean with a view of the harbor. Each day we didn't use housekeeping, we got coupons for $5 towards a meal at one of the Sheraton Old San Juan's restaurants, which was a nice perk. The location was fabulous. A post office, CVS and a few restaurants were right around the corner and it was a short walk to the forts, additional restaurants and shopping. We received vouchers for breakfast at the hotel, which was another highlight. Made to order omelets, a selection of fruits and breads, hot items like sausage and potatoes, along with pastries and oatmeal rounded out a filling and healthy breakfast. We also visited the rooftop pool and saw fireworks one evening. The gym is open 24/7 and included TVs, water machine and the essentials. During the week, the hotel was quiet and the smokefree casino was not a problem, people there weren't rowdy or loud. We did have loud neighbors one evening, but they turned off the music at midnight, so no problems sleeping. Otherwise, the hotel was about 45-60 minutes from the El Yunque and about 1.5 hours from snorkeling in Farajardo.","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Russel Prosacco","date":"2014-11-02 18:18:55 +0300"}],"public_likes":["Scotty Ziemann DVM"],"vacancy":true,"description":"A block from MacArthur Park.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}