{"title":"Offa's Dyke Path","name":"Llyn Rhys Campsite","address":"Llandegla LL11 3AF","directions":"A5104 south of A525","phone":"+44 1978 790627","tollfree":null,"email":"llynrhyscampsite@live.co.uk","fax":null,"url":"http://www.llynrhyscampsite.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.05575,"lon":-3.19983,"accuracy":"APPROXIMATE"},"type":"hotel","id":21032,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"Seeking a convenient location to Quincy Market and activities, we stayed here on our last night of vacation. The hotel is under construction but they had someone there to guide you where to go at all times. We were able to check in very early. Unfortunately the room we were given was right above the outdoor bar area which was very loud on a Saturday night. We called the front desk around midnight to see how late the bar would be hopping and when we got our bill in the morning, they had comped us half the cost! We were very impressed with the management. The rooms are very comfortable and clean. But the location is the best thing about this hotel (besides the Starbucks in the lobby).","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mrs. Dovie Harber","date":"2012-09-14 16:49:20 +0300"},{"content":"When travelling we usually stay in one of the Marriott family hotels with good experience. However, we found the experience at Marriott Long Wharf below Marriott standards. At time of booking (early June) it mentioned construction was to be finished by mid May 2011. Big surprise to find out at checking in that construction was far from over. First morning 7:10 AM we woke up at the sound of heavy construction machinery... Unacceptable! We were moved to another section of the hotel which was far less noisy, but ..... why put guests in rooms so close to the construction in the first place when other rooms are available??? Besides the construction sounds, the hotel is built in such a manner that the noise from public area below, lobby and/or events areas cannot be blocked from most rooms. That means when in your room you will certainly hear kids running around and doors being shut(throughout the night!). We were 'forced' to enjoy the music of a wedding taking place in the events area and sounds of breakfast taking place in that same area since the restaurant was temporarily under construction. Finally, service is courteous but certainly not friendly or warm. Rooms are spacious, neat and housekeeping is good. Marriott: Yes! Boston Marriott Longwharf: No!!","ratings":{"Cleanliness":5.0,"Sleep Quality":3.0,"Overall":2.0,"Value":2.0,"Service":3.0},"author":"Olga Wunsch","date":"2015-02-04 18:11:05 +0300"},{"content":"My family and I travelled to Boston for spring break, this hotel was a great choice. Step outside and the Boston waterfront, Fanueil Hall and much more is right there. They are doing construction on the lobby areas which did not affect us at all and will be done soon. Lovely pool and hot tub, great views from our room and super nice staff. The price was more than I'd hoped to pay for this trip but all in all, it was worth it and the kids LOVED it (ages 8 and 12).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Keshawn Lockman","date":"2014-10-07 16:57:00 +0300"},{"content":"We have stayed in or near Boston a few times before, but this was our first time at the Long Wharf. We were able to get a decent rate as a Marriott Rewards members - $195/night (although still a little hard to swallow with tax and daily parking fees but it was our five year anniversary). The location was by far one of the better places we have ever stayed in Boston. It was not even a five minute walk to Fanueil Hall/Quincy Market, and the North End was less than 10 minutes away. It was right along the water, which we probably would have taken advantage of more had the weather been nicer, but it was still a beautiful area with plenty to do. We also took advantage of one of the trolley tours which in some ways was like door to door service because the main stop is on the side of the hotel. I would definately return to the Marriott Long Wharf, and think it would be a fabulous place for the kids. Besides the aquarium, and other area attractions, there is a small park next to the hotel that has a small playscape and there is even a carousel just outside the back entrance. I cannot really comment on the service or amenities because we did not use any of the facilities or have a need to call the front desk or house keeping. The only somewhat of a downside is that the hotel does not have an area for free coffee and fruit (not a necessity, just a nice perk) although there was a Starbucks on the lower floor and there is the option to make it in your room. We were not expecting a free breakfast with our stay, so to keep the cost minimal (we splurged on lunch and dinner) we just grabbed bagels at Quincy Market in the morning. Overall, it was a very nice stay, and based on the location alone, I would definately recommend it to anyone with or without children. Our stay was pleasant, our room was clean, the beds were comfortable, there was a big screen TV in the room. In and out, our needs were met. Wish the price could have been slightly lower, but we knew that going into our stay that we could get a place with a lower price and free breakfast just outside of the mainstay. . . but then you lose the ambiance of staying in the city.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Anastacio Kilback","date":"2012-03-18 18:03:56 +0300"},{"content":"We went to Boston to tour the city and stayed here. Overall, this is a nice hotel with a great location. Very close to Quincy Market, NE Aquarium, the waterfront and the Italian section of Boston. Rooms were clean and the pool and gym are excellent. Only complaints are relatively minor...we expect that for the price you would get queen beds instead of twins. Also, service by the bartenders in the restaurant and one of the bellhops did not meet my expectations for a hotel of this calibre. Otherwise, would definitely stay there again due to location and cleanliness of the hotel.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Ms. German Schowalter","date":"2013-04-23 21:48:20 +0300"},{"content":"We chose this hotel because it was close to the attractions we wanted to visit: aquarium, IMAX theater, Quincy Market, etc. We were steps away from the wharf where the cruises launched and the trolley bus tour also departed from the corner in front of the hotel. We stayed for two nights and the room was OK - we had requested two double beds, but were given a King room with a cot. The space was pretty tight with the cot in the room and the bathroom was on the small side. The room was very clean and the beds (and cot) were very comfortable.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Cheyanne Rohan","date":"2012-05-14 20:36:19 +0300"},{"content":"I have stayed at the Marriott Long Wharf several times while in Boston for both business and pleasure. Overall, it is standard Marriott fare in the lobby, lounge, and restaurant. Everything is adequate and the beds are great. However, the hotel does also offer a great view from most rooms and an excellent location for visiting the historic and business areas of downtown Boston. Overall, I recommend this hotel and have chosen it myself for most visits to this fine city.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Celestino O'Conner","date":"2014-12-19 11:08:53 +0300"},{"content":"The Marriot is located right next to the Aquarium, the wharf with all of the different ferries to various places, Fanuel Hall, and the gem of the city, the North End. You can just park your car and walk any where you want, or hop on a shuttle and tour the city. It was nice and clean, quiet even though it is a huge hotel, and very comfortable, even with 4 adults in one room. The bathroom doors were a little odd - it was two small doors that opened out into the room. So they were sort of in the way at times, and not that easy to shut in a hurry. But the view was great and the stay was pleasant. I am looking forward to going back, even though it is pretty pricey to stay ($300 to start), the location is well worth it.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Lukas Murray","date":"2014-08-12 02:51:10 +0300"},{"content":"We were attracted by a recent special which was run by Marriott. We stayed two nights in a room which actually had a view of Long Wharf and the boat docks. It was a quiet, spacious, well-ventilated, comfortable room, clean, with some nice new touches since our previous stay at least four years ago. There’s a nice flat screen TV, and a refrigerator to replace the mini-bar (nice touch). Pillows are a little too soft for our tastes, and I doubled up on mine. The breakfast buffet is as well-equipped as it ever was. As we experienced in the past, check-in was quick and professional and the staff remains friendly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Lisette Hodkiewicz","date":"2013-05-08 01:42:47 +0300"}],"public_likes":["Ms. Destiney Cummings","Jackson Hackett","Laurie Abshire I","Vincent Schimmel","Dallas Rodriguez","Eldora Fahey Sr.","Lilian Thompson","Penelope Blanda"],"vacancy":false,"description":"Has 40 pitches and 4 caravan sites.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}