{"title":"San Diego/La Jolla","name":"Estancia La Jolla Hotel & Spa","address":"9700 N Torrey Pines Rd","directions":null,"phone":"+1 858 550-1000","tollfree":null,"email":null,"fax":null,"url":"http://www.estancialajolla.com","checkin":null,"checkout":null,"price":"$200-350","geo":{"lat":32.88417,"lon":-117.24452,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25196,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I have stayed here on a number of occasions and was really disappointed this time with the unheated pool (advertised as heated) which had considerable vegetation debris in it. The price is right and the rooms are clean (except for grubby carpet) and well furnished. Well situated back from the main 192. Friendly staff. OK for short stay.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Itzel Gorczany","date":"2013-05-17 11:32:07 +0300"},{"content":"We really liked staying here. We had just finished at WDW's Caribbean Resort $129 a night and went on to stay at Sevilla Inn. Yes Sevilla Inn is a timeshare resort and they only very softly tried to encourage you on that subject. But you got lots of freebies, free dinner and karaoke one night. It was a really friendly place and had a nice pool. Very good for only $33 a night. I think I got the idea to stay there from the Fodors guide also. The room was basic but not a lot different from the expensive WDW resort we had just stayed in. Not as flash but way better price. You are not trapped at Sevilla Inn for the food side of things. Which is how we felt at the WDW resort. (trapped into paying exorbitant prices for their food). Sevilla Inn is close to lots of restaurants and food joints.","ratings":{"Overall":4.0},"author":"Delia Dicki","date":"2013-05-27 02:49:49 +0300"},{"content":"I never even stayed at this hotel. Full disclosure. At the time I booked this hotel online, there was a price break for prepaying and no refund for cancellation. OK I do have extenuating circumstances. I had hoped at least to speak to the owner to explain my situation and perhaps mitigate the charge as I am planning to come to Philly at a later date this year. The front desk staff was very helpful but the owner was the only one who could override the charge. I called several times (4) times over the course of a week. Left a message each time. No response. I will not be booking this hotel when I come back to Philadelphia.","ratings":{"Overall":2.0,"Service":1.0},"author":"Rachelle Jakubowski","date":"2012-06-10 05:05:16 +0300"}],"public_likes":["Glenda Conroy","Dejuan Kling"],"vacancy":false,"description":". A rancho style conference and vacation resort located adjacent to the University of California at San Diego.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}