{"title":"San Diego/Point Loma-Ocean Beach","name":"Hostelling International San Diego Point Loma","address":"3790 Udall St","directions":null,"phone":"+1 619 223-4778","tollfree":null,"email":null,"fax":null,"url":"http://www.sandiegohostels.org/pointloma","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.74038,"lon":-117.23055,"accuracy":"APPROXIMATE"},"type":"hotel","id":25324,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I previously stayed at the Marriot in the same neighborhood and was not overly impressed with the service or the room. I selected the Doubletree for this visit based on reviews from other members. Except for the bathroom, which I think was cramped and poorly done with a sliding door, I found the room to be very nice. What impressed me most about this hotel was the service. From check-in all the way through checkout I found everyone in the hotel to be very friendly and accommodating. The most surprising thing was the hotel's response when I asked for a late checkout time the day of my departure. I almost fell over when the person at the front desk didn't hesitate and said \"no problem\" and quickly typed my requested departure time into the computer. In all of the hotels I have stayed, including the expensive, 5 star hotels, I have always had a negative response when asking for some accommodation on departure time. I will return to this hotel again and again (I have a daughter attending SDSU). The only reason I didn't give this hotel an \"excellent\" rating was the bathroom.","ratings":{"Overall":4.0},"author":"Rod Barrows","date":"2014-12-12 13:47:19 +0300"},{"content":"I stayed here October 4-6 for a conference that was in the hotel. TRANSPORTATION The hotel offers a complimentary shuttle from the airport to the hotel. I was told to call the front desk upon arrival to the airport since it takes about 15-30 minutes for the shuttle to arrive. Since the hotel was sold out (due to the conference) the shuttle was very slow. I ended up waiting for an hour for the shuttle. There were others who were waiting but were given a voucher to be used on a taxi to get to the hotel. The trolley stop is about half a block across the street from the hotel. We went to the Gaslamp district (a must see in the evening! Most stores are open til 8pm) for dinner. We had to transfer twice and thankfully had other tourists with us who knew how to get there....otherwise, it might save you the hassle of transfers by taking a taxi. Roundtrip trolley ride cost us each $5. The trolleys only run every half hour in the evenings, so it ended up taking us about 1.5 hours to get back to the hotel (which should normally take about 30 minutes!) Looking back at it, if we had more than 2 people, taking a taxi might've been more time/cost effective. CHECK IN Check in was easy and went smoothly. You get a warm chocolate chip cookie (that was DELICIOUS!!) at the front desk. (you can get them anytime and as many as you'd like). I was staying with a roommate who had put both of our names on the room so that I could check in without her being there. Someone else was checking in the same time I was and didn't do this...she had to contact the roommate and it took her a while to get a hold of her. So be sure to have all names on the room if you're checking in separately. AMMENITIES The gym was recently remodeled and VERY NICE! The equipment was very high quality (precor) and each of the eliptical machines, stationary bicycles and treadmills had their own individual tvs. There's also a large flat screen tv. There's exercise balls, stretchy cords, medicine balls and lots of free weights as well as a weight machine. There's benches and a crunch helper machine. This was the best-stocked gym that I've ever seen in a hotel. The pool and hot tub looked nice although I didn't go in. There's 2 outdoor fire pits that are lit in the evenings. These were nice to sit by (nice furniture too) as the evenings are pretty balmy. Our conference used the large ballroom and most of the individual rooms. The large ballroom was beautiful and very bright. The individual rooms were a little small for some of the workshops and slightly claustraphobic-feeling as there's not windows. The hotel itself was very nice and clean. Service was pretty helpful and friendly overall. FOOD There's a bar and lounge area. My roommate ate their pizza at the bar and she said it was about $9 for a personal vegetarian pizza that tasted pretty fresh. There's also a restaurant-- it looked like they have an omelet bar on weekends. We didn't eat here since we had conference food. The conference food was okay.....nothing to write home about. But I did notice staff replenishing food very quickly. Service was very good and attentive. The hotel is very conveniently located near several restaurants within walking distance. If you walk up the stairs in the lobby, you'll find a little strip mall-like series of shops. There's an educators store, a sports bar, applebees (i think), barne's and noble and some other stores. There's also a movie theater. There's a small cafe that's open for breakfast and lunch. Metrazzano cafe? They have good wraps and sandwiches and some interesting iced teas. Decently priced for $5-6 sandwiches.","ratings":{"Overall":4.0},"author":"Dr. Elna Lakin","date":"2014-05-21 23:48:31 +0300"},{"content":"I have stayed here quite a few times and there is good reason for it. This is a great hotel for the price. Everything is up to date and the rooms are good sized. The bathroom is a fine size, not huge, but it does use a pocket door which does not lock. There is plenty of parking, but it does cost $12 a night which seems a bit much. The hotel is right across from a trolley stop and so it is easy to get around. It also has easy access to the 8 freeway and the 163. There is a little road noise, but it is not very loud at all. Nice pools (yes, there are two).","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Christine Brakus","date":"2015-09-21 21:01:27 +0300"},{"content":"I had a good stay at the Doubletree. It was clean, the beds were comfortable, the staff friendly, parking is FREE (it's not $12 a day). I loved the firepits by the pool at night. My only concern was the noise! It is right by the freeway, so it's quite loud. I slept fine because I am a heavy sleeper, but beware if you're a light sleeper...","ratings":{"Overall":4.0},"author":"Wyman Herman","date":"2015-02-10 10:46:46 +0300"},{"content":"This hotel is honestly in the heart of Pacific Beach. You walk right across the street and your feet touch the sand! It is near hundreds of restaurants, bars and shops. This is a perfect place for a younger family looking to stay in the middle of all the action.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Gertrude Davis","date":"2012-03-15 17:53:35 +0300"}],"public_likes":["Hettie Wyman II","Jack Crona","Breanne Goyette","Nikki Hodkiewicz","Bell Christiansen","Geovanny Boyer","Elissa Farrell"],"vacancy":true,"description":"A friendly and clean hostel, with dorm rooms at $17-19/night and private rooms in the $40 range.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}