{"title":"Vaison-la-Romaine","name":"Hotel Burrhus","address":"2 place Montfort","directions":"down town","phone":"+33 4 90 36 00 11","tollfree":null,"email":"info@burrhus.com","fax":"+33 4 90 36 39 05","url":"http://www.burrhus.com","checkin":null,"checkout":null,"price":"53 to € 93 , breakfast € 9","geo":{"lat":44.2409684,"lon":5.076039300000048,"accuracy":"ROOFTOP"},"type":"hotel","id":35858,"country":"France","city":"Vaison-la-Romaine","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"We stayed at Acacia for 3 nights for our first trip to Puerto Rico. This place is gorgeous! Spanish architecture with multi-levels and walkways between rooms. The director and all of the other staff were so accommodating. They help with anything you need (cabs, places to go, etc) and are on a first name basis. Our king room was a perfect size with a large tv and private bath (all of them have private bathes) and the bed was comfy with soft, light linens. We read reviews about kings being two twins stuck together, but that was not the case. Our room had a private back balcony, but many of them had front balconies overlooking the HUGE hot tub. The tub is amazing to say the least. It's the largest one in San Juan with jets everywhere and two waterfalls. The view from the pool and most balconies is a partial oceanview. The tall tower The hotel is so close to the beach, which is great for walking back easily. Pamela's on the beach is just east (a 10 minute beach walk) where you can eat in the sand. They have outdoor showers to rinse off, towels and cucumber/fruit water available in the lobby, and on the ground level is this delicious restaurant called Niche ... let's just say the food is unbelievable. Best meal in San Juan. Some tips to note to travelers: this is not a cookie cutter resort with all of the amenities. What you get with this place is a cozy, comfy little getaway. It is on the east end of Condado, so a bit away from the happening bars and restaurants and a bit further from Old San Juan. However, its close enough for long walks or short cab rides and is worth the peacefulness, service, food, and beach location! There is a really cool deli (Kasalta - that President Obama visited) and other restaurants to the east that are easy to walk to from Acacia. We highly recommend this place and expect to stay again in the near future.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Jayde Braun","date":"2013-04-02 03:05:34 +0300"},{"content":"You wake up one day and decide to take a trip to Puerto Rico. You surf the internet - you read the reviews - and think \" Well if it is even 75% as good as the reviews, it should be ok\".... Well, I can tell you first hand that the Acacia Seaside Inn is everything I read about and more. The staff - Brenda, Freddy - were so helpful in assisting us with our day trip plans. Brenda's suggestion of a day trip to Vieques to do the Bio-Kayak tour was incredible. She said it was \"the best\" and it was. I fell in love with Vieques Island and the sister property - Inn on the Blue Horizon. Brenda gave us directions for every phase of the trip, from the transportation to the ferry to setting up the Kayak and snorkeling tours for us. Our room on the second level, adjacent to the hot-tub made for some very relaxing evenings after dinner. The Inn is immaculate - from the entry lobby to our room. The hot tub and surrounding area was washed down everyday as well as all tile areas around the Inn. Our room with two double beds was very spacious. Now, let's talk about getting around. The Inn is located in Condado, and we walked almost everywhere. Very safe, as there was always lots of activity and great police presence. When we needed a taxi, the front desk called and it was never more than 4 mintues until the taxi arrived. And of course, the beach is 1/2 block down the street from the Inn and clean and beautiful. We walked down Ashford to shopping, casinos, restaurants and the lovely gem of a spa - Euphoria. If you want the BEST food in San Juan - JUST STAY AT THE ACACIA AND DINE AT - NICHE!!!! We had our breakfast daily of the most lovely fresh fruit and coffee. Dinner - served by the most lovely Donna, was incredible...... Lobster soaked in vanilla and pumpkin risotto.......beef that melts in your mouth.......asparagus/mushroom risotto...... Believe me when I say they are there to take care of you. The wine list was very reasonable and had great selection. And did I mention the LOVELY DONNA????? If you are looking for loud noise, bustling activity, impersonal service, and cookie cutter environment then this is not the place.......BUT should you want to spend your vacation with a wonderful group of people, in a relaxing, clean, well appointed Inn that has access to all the \"night-life\" if you choose, and great hot tub if you don't, then please make a reservation for the Acacia - you will not be sorry. PS: We stayed for 8 nights - so we really got to know the staff and the Inn.....they never changed - from check-in to check-out it was a wonderful choice for my first week long vacation since 2007!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Adeline Pfeffer","date":"2014-09-15 12:34:29 +0300"},{"content":"From the moment we walked into the Acacia, I felt welcomed and relaxed! The beautiful decor made me feel like I was escaping away from the ordinary, everyday experience. After being greeted by Chad, the incredible manager of guest services, we knew that whatever needs we would have while at the Acacia, they would be met. I have never had the desire to \"hang out\" at any hotel where I have stayed on vacation.... until the Acacia!! Great location, top-notch service, out of this world food, and all the comforts of home! Wishing I was there!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Martin Rowe","date":"2012-06-30 03:52:58 +0300"},{"content":"Boyfriend and I missed a flight home leaving us \"stuck\" in San Juan on a rainy afternoon. On gut instinct, booked a room at Wind Chimes hotel which was very nice. Crossed the street for just a snack and walked into Niche, a restaurant shared by sister hotel, Acacia. Chad; parter, concierge and all around hospitality guru, walked us past the most amazing Buda (see pic) and into Niche. We can't say enough about Chef Cristian who effortlessly prepared the biggest, most succulent lobster we've ever tasted. Then, coaxed by the granite, nearly lappool-sized jacuzzi we decided to stay. It's a given that the rooms are more than comfortable. We had the best forced layover we could imagine.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Elva Runte","date":"2014-10-25 00:33:39 +0300"},{"content":"My husband and I are currently vacationing in Puerto Rico. I have a high stress job, and before the summer season gets busy, we thought it would be good to plan a short vacation. We are couple in our 30s from DC, and we love to travel. We take a few trips each year throughout the Caribbean, the U.S. and around the world. Initially, we looked at Acacia because of the amazing reviews, but settled on La Concha Renaissance because of Marriott points and the pools. The Renaissance is nice, but we wish we would have stayed at Acacia. During our trip, we had an opportunity to visit Acacia's restaurant, Niche, for dinner. I've eaten at many upscale restaurants in my time, but this is in my top 20 of dinners. The food was creative and amazing, plus the chef came out to greet us - very nice guy. Chad Siegel - I can't say enough. Chad manages the hotel, and is extremely knowledgeable, nice, and understands the importance of customer service. I work in PR, a very customer-service based business and I don't understand how people don't get it. Although we stayed at the Renaissance, Chad was our concierage. He was extremely patient with us, and took time to answer our questions and provide entertainment and restaurant recommendations, and we were not even staying at the Acacia. Honestly, the concierage at the Renaissance was not as helpful or knowledgeable. Our experience in Puerto Rico would have been miserable if we didn't stop by Niche and talk with Chad. He also took the time to give us a tour of the hotel - absolutely romantic and beautiful. We were bummed because we saw what we were missing. The next time I visit Puerto Rico, I'm staying at Acacia and booking room #307. Acacia - Mike and Catrell thank you for taking such good care of us.","ratings":{"Overall":5.0},"author":"Jeanne Schumm","date":"2013-07-29 08:35:38 +0300"},{"content":"We were most pleasantly surprised by this little gem of a hotel a block from the beach in the Condado section of San Juan. It had a restaurant in the hotel that was intimate and upscale with attentive service. It also had a spa pool that was a wonderful experience after a long day out and about. The owner operator , Chad was there about 16 hours a day and was very amiable, quite knowledgeable about the area and extremely helpful. The hotel was quite clean and well kept. All of the staff were very friendly and accomodating.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Chloe Smitham","date":"2015-07-13 01:21:41 +0300"},{"content":"This was our first time to PR and were not sure what to expect. This hotel was off the tourist area by a few blocks in the neighborhood of Condado. It was quiet, relaxing and everything that we could have asked for and more. There is no doubt in my mind that we will be staying here on our next trip. From the layout of the building to the decor, it was perfect.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Orlo Ruecker","date":"2015-07-15 01:59:59 +0300"},{"content":"Terrific location (steps from the beach), attractive building, NO SERVICE! The hotel desk is not staffed -- if you want anything, you have to walk a block to the sister hotel, At Wind Chimes Inn. I arrived at precisely the time I had given when I made the reservation, and there was no one to be found. I stood with my luggage out in the rain, since all doors were locked and there was no one around. Internet in lobby only worked for brief periods of time.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Bernard Hegmann","date":"2012-05-11 20:22:49 +0300"},{"content":"I did a fair amount of research to find a smaller high-end hotel near the ocean (a block) and central enough to enjoy the restaurants and the general culture. I am happy to report I got both. The front of the house staff Claudio and Palmerra were excellent. Both very professional, genuine and very nice people. The hearts of the people of San Juan are large and that is what makes it such a great place to visit. I like smaller intimate places because you actually get to know the staff first hand and the owner is a lucky man to have these two steering his ship. But wait there's more...the food is fabulous... however you need to cut through the hype and get to the real wonderful Puerto Rican and Caribbean cuisine..it's a family oriented culture and food matters. I am very judgmental when it comes to my food...I want the place clean, I want good service, I want to feel the owner gets what he is doing and wants to deliver consistently. My three hands down favorites were Kasalta's for breakfast every morning one of the local hangouts (they have lunch, dinner and take out as well)...Kasalta's is a gem. Picayo at the art museum is on the fine dining side and is also fabulous...the front of the house Maitre D', Martin is a gifted man when it comes to hospitality and on my second visit Martin introduced us to Chef Wilo Benet who is a force in the cuisine of his country. An engaging chef who cares about delivering fine high end food. Metropol another local down home Puerto Rican eatery was another treasure. The waiter Raffie took a one look at me and told me I had to try the roast pork (I guess he knows his Boston Irish tourist palettes), the engaging staff immediately served up some amazing bread, and Raffi kept the house wine from Spain coming...Raffi brought out a bowl of chopped garlic marinated in olive oil as a sauce for the pig and I was in heaven! A few other mentionable's were Miro, Bebo and the Tapas bar (forget the name) next to Dragon Flies in old San Juan...on the down side Pasteria near the hotel was a bust lots of staff but no service, no one cleaning the tables or cleaning the place...so the floor was strewn with napkins and food. No excuse for that in my opinion... it starts at the top and the owner doesn't get the food service business. I was also disappointed in BuddaThai. El San Juan on Friday and Saturday nites is fun. I also suggest getting up early one morning grabbing a few bottles of water and walking to Old San Juan..its a good hike (5 or so miles)...but will give you a great idea of the area and what is all about. There is a great lagoon right before the bridge. All and all Acacia was exactly what I needed. We both work long hours and I travel a lot so we just wanted to chill and pretty much do nothing except hit the beach, take a bunch of hikes, and check out the local cuisine.","ratings":{"Overall":4.0},"author":"Lavern Schuster","date":"2014-06-08 11:30:14 +0300"}],"public_likes":["Nelda Langworth","Asa Zboncak","Branson Weissnat PhD","Lou Lynch","Ms. Jayce Grimes"],"vacancy":false,"description":"In the city centre, pets allowed.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}