{"title":"San Francisco/Western Addition","name":"Days Inn","address":"465 Grove Street","directions":"between Gough and Octavia","phone":"+1 415 864-4040","tollfree":null,"email":null,"fax":"+1 415 552-4914","url":"http://www.daysinncalifornia.com/html/days-inn-hotels-union-square-san-francisco.asp","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7775,"lon":-122.4239,"accuracy":"APPROXIMATE"},"type":"hotel","id":26261,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Regin hotel is located very near the kallang station, 5-10 minutes walk only. It may be located in the Geylang area but not right into the heart of the \"red light district\". it is nicely situated near the intersection of sim's ave and sim's way. Among the budget hotels, it is the one which is least expensive and I would say that it is a good value for the money. And booking is not so hard, just email the hotel directly and they would do the rest and no credit card is needed, full payment is upon arrival. Although the room is smaller than the picture in the website. But It is relatively clean. They change your towels and linens daily, and the sheets are spotlessly clean and white. you get 2 bottles of drinking water and instant coffee daily. I guess, the next time we go back to singapore, we would stay again at regin hotel. We had a good night sleep after a whole day of walking around and enjoying singapore. Only warning is that when coming from the airport, tell the taxi driver that you are going to sims ave then tell them Regin hotel. We were initially brought to REGENT hotel hehehehe but the taxi driver was very apologetic and gave us a discount so it was okay because we had an initial tour of the city as well. this trip was my third time at singapore and i guess i would be coming back again.","ratings":{"Overall":3.0},"author":"Christ Stracke","date":"2012-11-04 11:54:28 +0300"},{"content":"I've stayed here on several occasions when I have had business in Chicago. It's a really nice place to stay if you're looking for a comfortable, quiet room. The rooms are not large, but they're cute and cozy. There is filtered drinking water and clean bottles available on every floor at no extra charge. The staff are responsive when you call them and there's a restaurant right next door that serves great breakfasts! It's right near the Willis Tower and water taxi if you want to cruise over to the Magnificent Mile.","ratings":{"Location":5.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Mr. Toby Hermann","date":"2012-12-19 11:35:38 +0300"},{"content":"The staff at this hotel can not be beaten. Their advice was excellent, but mostly they were so friendly. The room was a bit small, and had no fridge but that was it. The location was great, and the hotel was in great condition. The staff make this hotel exceptional!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Durward Abernathy","date":"2015-07-06 17:56:21 +0300"},{"content":"I found this trip on this site and I'm glad I did, it was a great choice. The rooms are smallish but comfortable, and since the trip was a Conference, I wasn't going to be here much anyway. Complimentary wireless access makes this an even better deal. The restaurant is OK but not great (room service through them was very unfriendly), but they have a Starbucks next door for breakfast as well. Conveniently located.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Evalyn Cummings","date":"2014-01-10 15:11:27 +0300"},{"content":"stayed in this hotel for 3 nights. room was good size with seperate toilet. clean, comfortable beds. heating worked really well. had to switch it off over night as it was very hot. very small tv in the room with only 2 english chanels. didn't have breakfast as 9e pp was a bit too much. lots of food options near by. took us about 1h to get to the hotel from the airport. metro station 3 min walk. overall really good stay. recommended.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Guido Ziemann","date":"2013-10-15 14:34:33 +0300"},{"content":"This hotel demanded payment up front on a flexible booking. The WiFi did not work on the 4th floor and only intermittently on the 3rd. The staff were not helpful at all about the WiFi problem and huffed when asked to change rooms as I needed to use the WiFi. Breakfast is good value and the rooms are quite new and clean. Situated 2-3 minutes walk from station with restaurants and supermarkets nearby. Walls of rooms so thin can hear even the slightest sniffle from neighbours. Air-conditioning did not work.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":3.0},"author":"Chance Dooley","date":"2015-04-04 10:01:48 +0300"},{"content":"room pasha for 5, very nice, very clean, nice people.. they have a fresh breakfast.. we loved it","ratings":{"Overall":5.0},"author":"Nikko Rau","date":"2014-04-16 18:09:19 +0300"},{"content":"We stayed 3 nights at the Mystic Hotel. It is a nice en welsituated hotel between the blue mosque and the grand bazaar. Both at 5 minutes walking distance. The hotel was also near to a beautifull mosque, the Mehmet Pasa mosque. The room had a great view at the Marmaris sea en was clean, airconditioning and tv. The bathroom was OK. and breakfast was nice (included). The owner was very friendly and helpfull. It was a great place to discover Istanbul!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Jonathon Toy Sr.","date":"2014-12-18 17:08:15 +0300"},{"content":"It was my second stay in Mystic hotel. First time May 2010 we stayed with my friend, second time i was with husband, sister and friend, and everyone liked this hotel!!!! Excellent location - 3min walk to Sultanahmet tram station, Blue Mosque, etc. Very friendly owner Oktay Balkir, can arrange bus tickets, taxi, airpost shuttle, and many options to spent a very good time in beautiful Istanbul. Highly recommend to everyone who needs friendly, clean, good located places to stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ben O'Connell","date":"2012-09-23 09:59:52 +0300"}],"public_likes":["Lawson Carroll","Pearline Nader","Piper Wolff","Mitchel Champlin"],"vacancy":true,"description":"A typical Days Inn with few frills; free breakfast and wireless internet.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}