{"title":"San Francisco/Union Square-Financial District","name":"Mandarin Oriental","address":"222 Sansome St","directions":"at Pine","phone":"+1 415 276-9600","tollfree":null,"email":"mosfo-reservations@mohg.com","fax":"+1 415 433-0289","url":"http://www.mandarinoriental.com/sanfrancisco","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7925,"lon":-122.4006,"accuracy":"ROOFTOP"},"type":"hotel","id":26229,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We had a great 5 days in Istanbul and Osmahan Hotel and Fatih were a big part of that! Great, relaxing place to return to when the hours of walking around Istanbul sights and markets gets too much. Breakfast on the roof-top terrace is really a GREAT way to start the day","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Zoe Schmidt","date":"2015-03-04 20:14:10 +0300"},{"content":"We stayed at the Osmanhan Hotel for 3 nights at the beginning of September 2009. I had read the excellent reviews on Tripadvisor and they had prompted me to book the hotel. The price was reasonable, the location absolutely brilliant (best and prettiest part of the city) and the hotel was immaculately clean. However, what made the hotel OUTSTANDING was the quality of the service. All members of staff were polite, efficient and friendly, but Fatih really was the icing on the cake. He helpfully answered several emails before we travelled and almost felt like a friend by the time we arrived. We have travelled extensively and have received good service on many occasions, but our experience with Fatih went well beyond. He was an absolute delight. Breakfasts were delicious and completely fresh, taken on the delightful roof terrace overlooking the Bosphorus. There are lots of very good restaurants on the street round the corner from the hotel. We found them to be of a very high quality, reasonably priced and service was very good. There are also lots of small mini-markets for water and the hotel is happy for you to buy alcohol to take back to the hotel (there is no bar) which can be drunk in your room or up on the roof terrace. We flew into Sahiba Gocken airport and used the Havas bus as far as Taksim Square, then got a taxi to the Aya Sophia which is just a 5 minute walk from the hotel. The journey took us about 2 hours due to the traffic. However, I would recommend using one of the local travel agents and booking a return minibus shuttle with them. It worked out slightly cheaper but was so much more convenient, picking us up from the hotel and, despite a few pickups on the way, delivered us back to the airport in half the time. All in all, a fabulous stay in a brilliant hotel and I just wished we'd had room in our suitcases to bring Fatih home with us!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Lenore Blick","date":"2014-09-06 06:10:28 +0300"},{"content":"I just left the Osmanhan hotel where I enjoyed two nights with friends. They had come to Istanbul to tour the old city and we found this sweet boutique hotel where the service was excellent, the rooms modern and complete with most amenities--including free wireless and A.C.--and the location for touring was superb. This part of the city is understandably a little noisy, as it is the center of tourism for Istanbul, but where the hotel is located, the noise is not excessive. Breakfast was good, and included a homemade cherry cake baked by the wife of one of the staff. All staff were very helpful, and one even arranged to purchase my train ticket to Ankara. I'd stay here again if I needed to be in the Sultan Ahmet area.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Jovani Aufderhar","date":"2013-03-20 09:58:18 +0300"},{"content":"Stayed at the Jane with my 17 y/o daughter and it was perfect! Easy walk to Buddakan for a wonderful dinner and a short walk to Chelsea Market in the morning for great coffee and breakfast. We loved the decor of the hotel and the front desk. We got a bunk bed room, which was actually smaller than my closet at home. It was TINY! Smaller than a cruise ship room. It was what we were expecting so we were not shocked. It was so small my daughter took a picture and posted it to her Facebook page and got several comments. We had no problem with the shared bathroom, didn't run into anyone else using it. We prefer to stay at inexpensive, clean hotels that are in great neighborhoods because it allows us to travel more often. We also enjoy quirky places with lots of character and try to avoid the big chains whenever possible. In NYC there is so much to do we only use our hotel room for sleep. The Jane bunkbed room is too small for anything but sleeping so if you will spend a lot of time in your room this is not for you.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Johnson Gislason","date":"2014-11-02 16:58:10 +0300"},{"content":"From check in to check out this small hotel offers a great service. Very friendly staff, clean rooms and incredible clean shared bathrooms. The rooms are really small ( the website shows it clearly ) are equiped with AC, heater, Flat Screen TV, DVD, Alarm Clock, confortable bed. The windows could be larger. The hotel smells good and is perfectly kept. Sleepers and a robe are part of the amenities. The showers ( individually separed ) offer shower gel, shampoo and conditioner. The toilets are always white as just cleaned. I stayed for 6 nights paying around USd 120 ( tax included ). The location is great. Close to Chelsea Market and dozens of bars and restaurants of the Meatpacking District ( very fancy ). There is a parking lot right across the street and subway can be reached in a 10 minute walk. A cab ride from Times Square to the Jane costs around USD 14 only. I will definately be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mabel Prosacco","date":"2012-10-10 03:36:59 +0300"}],"public_likes":["Kathryne Bruen","Ms. Jarred Mitchell","Hildegard Gerhold"],"vacancy":true,"description":"A 150 room hotel located on the top eleven floors of the First Interstate Center, the third tallest building in the city of San Francisco. The view from the rooms are exceptional, with floor to ceiling windows and great views.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}