{"title":"Los Angeles/Downtown","name":"The LA Hotel Downtown","address":"333 S Figueroa St","directions":null,"phone":"+1 213 617-1133","tollfree":null,"email":null,"fax":"+1 213 621-1505","url":"http://thelahotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.054884,"lon":-118.255501,"accuracy":"ROOFTOP"},"type":"hotel","id":16633,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We returned from a cruise and stayed one night. We were allowed to check into one of our rooms early, 9 a.m. which made using the facilities much easier. The pool is large and the kids really enjoyed it, there were plenty of lounge chairs around deck of the pool. The only negative was the traffic noise on the highway overpass located near the pool but after a few minutes the kids noise overwhelmed the traffic noise anyway. The hotel was clean and attractive with a small casino, about twice the square footage of our cruise ship casino with more table games though. The full breakfast offered to guests was very enjoyable and if you are a Hilton Honors member you can even skip the long lines. The manager's reception in the afternoon was nice with tap beer, soda and mixed drinks but could have offered more than just popcorn and chips, maybe I'm just picky. The beach is a short two block walk away with an Embassy Suites concessionaire providing beach chairs and umbrellas for guests at the hotel, a very nice touch. Overall a nice but short stay, would have liked to stay longer. We would definitely stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Tyrel Murphy","date":"2012-09-04 03:20:24 +0300"}],"public_likes":["Olin Pouros","Odie Wehner II","Gretchen Becker","Shyanne Adams","Rogelio Rutherford","Amely Jacobs","Miss Trevor Bauch","Bernadette Kiehn","Clotilde Walsh"],"vacancy":true,"description":"Has a small older theater in its basement where you can still see first-run movies for under $8.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}