{"title":"London/South Kensington-Chelsea","name":"Montana Hotel","address":"67/69 Gloucester Rd, SW7 4PG","directions":"2 minutes walk from Gloucester Road tube station","phone":"+44 20 7584-7654","tollfree":null,"email":"info@montanahotel.co.uk","fax":"+44 20 7581-3109","url":"http://www.montanahotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4952,"lon":-0.1827,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16449,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Highest rated cheap hotel in Singapore. This was superb great location, bus stops outside, subway station 5 mins walk. Rooms are tiny, but it is just somewhere to sleep, everything you need at a great price. Resturaunt outside is also very good.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Idell Pfannerstill","date":"2014-06-10 17:46:25 +0300"},{"content":"Very pleasantly surprised by the hotel. Well located and presented, useful information from the reception desk and relatively cheap to boot! You're not going to find huge rooms or tons of wardrobe space for this price but if, like us, you're more interested in exploring the city that staying in and watching the TV (almost as big as the bathroom!) give this place a try.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Alexzander Mertz","date":"2015-02-07 18:04:22 +0300"},{"content":"room was clean and classy though small... I always though u'll get wat u pay for, but was pleasantly surprised. Room was very clean and classy, though small, lots of sunshine coz there's a big glass window. We requested for room with dvd player as well. Service is average, with our request for additional pillows subtly rejected, reason being hotel is running full house. there's a food centre located two bus stops away. Breakfast is charged at 7 dollars a day per person but we were not asked upon check-in, internet access cost $10 a day... you can go across the street for internet usage for a dollar an hrs if I'm not wrong gym and pool are located in 7th storey... lastly thin walls, not for light sleepers. Overall I am very pleased with the hotel room n will certainly go there again.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":4.0},"author":"Bryana Farrell","date":"2012-02-06 06:41:50 +0300"},{"content":"This hotel is nice and clean, and has a cheap restaraunt with yummy food downstairs. The rooms are small but comfortable, although a mini fridge would have been handy. The bathroom is VERY small and the showers have no screen so the toilet and everything gets wet. But for the price and the cleanliness it is very good! The gym is not really a gym, its a treadmill (that I couldn't get to work) a fit ball, and an excersize bike, but at least its something! The pool and area is very nice and has a shower to rinse chlorine off. Staff were friendly and the MRT station is about 10 - 15 min walk away. For those who havent been to Singapore, catch an MRT to Orchard Rd and get off there. Find the Hippo Tours and get a ticket. We only had 2 days in Singapore and the Hippo tours was the best $23 ever spent. They take you to the best spots in the city and you can hop on and off where you like. Also includes a cruise section too! What a beautiful city, make sure you see the sights!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Cornell Trantow","date":"2014-05-03 13:30:40 +0300"},{"content":"We stayed here for a couple of nights at the beginning of the week and then had another night at the end of the week. We were surprised to find out that no rooms have windows - only the superior ones. The rooms were dirty, stank of cigarette smoke (even though you can't smoke in the hotel), and were so small that the 3 suitcases didn't fit. The bathroom is as big as an airplane toilet with tje shower above the toilet. We asked for a room with windows on our last night (5 days away) and were told that they'd do they're best as it's first come first served. Even though we were returning guests and were giving them 5 days notice they didn't care. On the last day we arrived only to be told that they were fully booked so we were put on their other sister hotel down the road and this is when we found out about the windows only in the superior rooms. We were offered free wi-fi for the inconvenience and when we told them that we already had free wi-fi as part of the booking, they just laughed!! Never again. Plus, it was not cheap!","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":2.0,"Rooms":1.0},"author":"Ms. Darren Hintz","date":"2013-01-10 19:55:33 +0300"},{"content":"On a 3 day stopover in Singapore was recommended this hotel by a friend. Very clean room with all modern fittings and furniture. Room was not much bigger than the queen size bed but that was all one person needs. Not much room for leaving cases open but was able to stand it upright at the end of the bed. Kettle and cups and saucers were provided. Wouldnt recommend the instant \"3-in-1\" coffee and tea provided though, but next door there is a small store that sells small jars of coffee. Shampoo,bath gel, hairdryer and towels provided. Flat Screen TV that struggled to get reception on most channels, but there were a couple of good English speaking choices available. My room was at the back and no street noise at all. Shower cubicle IS bathroom, so similar to a number of European hotels I've stayed in, but much cleaner. Loved the late check-out of 1pm as it fitted well with my schedule. I would recommend this hotel to anybody who just wants a modern, clean room and a comfy bed.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Shana Morissette","date":"2014-02-19 07:00:55 +0300"},{"content":"When I checked into the hotel, my hotel room was upgraded and was available as soon as I checked in (I arrived about 4 hours before the \"check-in\" time. The hotel and the room is very clean and trendy, and the location is great, being about a 5-10min walk to the Quincy Market area. In the drawer of the bedside table are earplugs, in case the street noise is too much when you're sleeping. I didn't have a problem with the noise at all, but it wasn't anything bad (can hear loud trucks from time to time). The only thing that I wish was different were the curtains on the window. They're nice, but they're white, so they don't really block out the light from the outside. I'd prefer dark curtains, but I had a great sleep nonetheless! I would definately reccomend this hotel, as it's close to everything, great staff, and beautiful rooms. Next time that I'm in Boston, I will stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Milan Wolff","date":"2015-05-21 04:40:08 +0300"},{"content":"Everything about this hotel was amazing. The front desk was very friendly and helpful. We were given an upgrade which was great! Our room was very nice, and had a wonderful view of Boston. The bathroom had the best skin/hair care products. The hotel restaurant was very nice, and flexible. We had a last minute change of plans and had to reschedule our dinner reservation. They were very nice about it, and we were surprised that they were even able to do it due to the volume of people waiting to eat. Also, breakfast at the restaurant was very yummy, and quick!! We also enjoyed how close we were to a lot of Boston attractions and shopping. It was so easy to just walk out the hotel door and explore the North end. We will definitely be staying at the Ames Boston again!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Marcel Kuphal II","date":"2015-06-28 02:11:09 +0300"},{"content":"The Ames is located in a lovely, preserved, historic \"skyscraper\" from long ago in the perfect location (easy access from the Airport on the Blue Line). The Ames has managed a perfect blend of respect for history and while embracing all that is hip. The rooms are small (as is expected in a major city urban hotel) but thoughtfully laid out and thus don't feel cramped. There is enough room to do a little work or hang out without feeling claustrophobic. Beautiful linens, nice bath amenities - in short a lot of attention to detail that results in a room that is comfortable and chic. Don't miss the restaurant at Ames - Woodward, especially for excellent cocktails. (make sure you ask how it got its name. We were very entertained by a waiter during a quiet perior with the historic scandal!) I am so comfortable with the level of service that I often put clients there. Everyone I have sent there has loved the place. This is my new favorite Boston hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Americo Donnelly","date":"2015-04-02 23:06:52 +0300"}],"public_likes":["Annalise Kshlerin","Otto Rosenbaum","Aidan Hoppe Sr.","Esteban Kuvalis","Arianna Osinski","Quinten Lowe","Millie McLaughlin","Amira Wisoky","Berta Rogahn"],"vacancy":true,"description":"Good standard tourist class accommodation in an excellent area.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}