{"title":"Paris/1st arrondissement","name":"Hôtel Ritz","address":"15 Place Vendôme","directions":"Métro: Pyramides","phone":"+33 1 43 16 30 70","tollfree":null,"email":"resa@ritzparis.com","fax":"+33 1 43 16 36 68","url":"http://www.ritzparis.com/","checkin":null,"checkout":null,"price":"€650-8,500","geo":{"lat":48.8683694,"lon":2.3282338,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21734,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I had the pleasure of visiting the Grand Wailea in early December of 2005, and to call it a revelation would be an understatement. I have been fortunate enough to stay at some excellent island hotels in my lifetime, but the Grand Wailea stands head and shoulders above the others. This hotel had everything that I could have wanted in a beachfront hotel. After a long day of travel, we were greeted by cheerful attendants that leid us as bellmen wisked away our luggage. The front desk was also quite welcome- upgrading us to a deluxe garden room along a quiet wing of the hotel. As the bellman took us to our room, he gave us a great tour of the hotel and we took in the grounds as best we could in the middle of the night. Our room was fantastic, with a huge terrace and an amazing bathroom with whirlpool and stall shower. They say garden view, but in a rare bit of humility (a rare thing in the hotel business), this room had garden, ocean and mountain views. In the morning, we paroused the grounds and my suspicions were confirmed- the inky darkness that we looked out on the previous night was a paradise come morning. I really enjoyed this hotel because of the SCOPE of the hotel. It is a large hotel, but never did we feel cramped or inindated with noise. It had cuisine ranging from a simple breakfast place to get pastries to fine dining- it had pool areas for families AND adults. This hotel had taken into consideration EVERYONE that visited it. Whether you wanted a $10 or a $40 breakfast, whether you wanted to play in the family pool on the slide complex (do it at least once, its that impressive) or slip into the quiet hibiscus pool with a drink and a private cabane waiting for you when you get out, this place was perfect. *****- a wonderful combination in a package that doesnt overwhelm, the Grand Wailea is a keeper, and should be higher on this list of Maui's best hotels. A couple of tips: the water slides close 5pm and there is no shuttle service to anything on the island, so seriously consider renting a car if you wish to leave hotel property.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Tate Wuckert I","date":"2013-08-10 00:20:18 +0300"},{"content":"While I've never felt compelled to review a hotel before, I felt the the expectation of this hotel was far enough from the reality that I had to warn potential visitors. First of all, the room that we received was dingy, in major need of an update, and an enormous disappointment in general. I went downstairs to request an upgrade and they did accommodate us with a room in the concierge tower. The bellhop who took our luggage from the old room to the new explained to us that the room was handicapped accesible and in the area that had not yet been renovated. I got the strong feeling that they try to pass this section of rooms off to people who might otherwise not complain and just accept it - much like a bad table in a restaurant. While the new room was an improvement, it was still not what I expected from this hotel. The room was merely average at this point as far as I was concerned. The next thing that struck me was the clientele. Not a refined bunch to say the least. This was surprisingly a very tatooed, twenty-something, roudy type of crowd. Very small on manners and big on implants. Looked more like spring break in Fort Lauderdale. Staff not too polished either. Last complaint is the food. Mediocre at best. We did have a nice (not spectacular) dinner, however at Humu. If I were to do it again, we would stay at the Four Seasons. Much smaller and less impressive grounds (the reason we chose not to stay there in the first place), but much more refined clientele and staff. More in line with what we were anticipating from Grand Wailea. The beach has nothing on Kannapali - where we went next. Very happy that we only had two nights at Grand Wailea.","ratings":{"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Service":2.0,"Rooms":2.0},"author":"Juliana Rolfson","date":"2014-06-23 07:27:17 +0300"},{"content":"I've not only stayed at the Grand Wailea but I was also a member. I used to stay there almost every year but every time I went, the maintanence of the hotel seemed to be going more and more down-hill. Also, the water in the pools is not heated so if it's not really hot, it gets ridiculously cold. So cold that one year, not one person was in the pool during most of my stay!! The hotel is very beautiful but can get very crowded with conventions and then it becomes overly busy and soon your serene vacation is ruined with kids running around like maniacs. Also, one year, the valet damaged my rental car. Wailea is my favorite area on Maui because it stays dryer. I recommend staying at another hotel in the Wailea area and going over and visiting the Grand Wailea and see if it's for you for a future trip.","ratings":{"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Service":3.0,"Rooms":4.0},"author":"Hulda Von","date":"2014-11-28 13:56:36 +0300"},{"content":"Our family stays at 5 star/apple resorts every year so we have apples to compare with this apple. To put it succinctly......the resort is outrageously pricey and does not provide the services the guests should be entitled to after already paying for overpriced rooms. Examples are the $14 hamburgers (not gourmet) at the pool side and a $26 breakfast buffet that is just so so, paying $120 or more per day for cabanas. ( Shade around the pool is at a premium). Customer service was stretching to make average. The spa was nice, but customer service in the spa and spa shop were surprisingly poor. Guest should not have to pay an $18.00 resort fee. The list goes on. The size of the room for the price was just okay. The bathroom is very nice, except we noticed that there was mold moderate mold in grouting between tiles in shower. The maid service did not clean the room well each day and we were tipping $7-8 each day. To worsen matters, the hotel put a hold of several thousand $$$ on our credit card even though, we had prepaid for our 8 day stay there. This turned out to be a major problem that took up too much of our vacation time to straighten out. In all fairness the manager, in the end gave us about a $500 credit for the inconvenience after I insisted they credit us for one nights stay. This was a compromise. It took them 3 days to get the matter corrected. Then we had smoke from the adjoining room coming through the cracks of the door between the two rooms. I have a serious lung condition and notified the front desk about the cigarette smoking in a non-smoking area. Their solution was to offer to move us to another room. I responded no, we were not going to waste anymore of our vacation time resolving problems they create.....a better solution would be to notify the other guest and ask them to desist from smoking or to move them. Again, poor customer service. In the end they put a air ionizer in our room. Thankfully, we were leaving the next day. What's good about this place? The grounds are stunningly beautiful, a great stretch of beach connected to the resort and the artwork throughout the resort is magnificent! The bathroom area is a plus for size and design. This kind of beauty can be experienced for less $$$ and with staff that treat you like royalty, or at least a valued guest. Hint.....If you do visit this resort, try eating breakfast at the restaurant next door at the Wailea shoppes. It's very good and won't cost you an arm & a leg. Generally speaking, food away from the resort is reasonably priced and I recommend dinner at the golf course up the road. Very nice! We also ate at the Four Seasons. The dinner was was wonderful and the service was perfect!!!!","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Service":2.0},"author":"Louvenia Jewess","date":"2013-02-02 15:32:03 +0300"}],"public_likes":["Isac Torp"],"vacancy":false,"description":"If there is any one hotel in the world which is not merely &quot;putting on&quot; the Ritz it would be this one, whose very name has entered the English language as a generic word for luxury (or the appearance thereof). The Ritz may not in fact be the fanciest hotel in Paris anymore, but it's always in the running. It's 350x the price of a budget room in the neighborhood, but heck, maybe it's your honeymoon.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}