{"title":"Birmingham (England)","name":"Premier Inn Birmingham Broad Street (Brindley Place)","address":"80 Broad Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47567,"lon":-1.91547,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3623,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"We stayed at the Monaco for an all-too rare weekend of shopping and relaxing. So when I first walked in, I was a bit disappointed. The Hotel Monaco has the small rooms of an older hotel and I had hoped to stretch out in a bit more luxury. BUT, the staff and their courteous and prompt attention to detail, and the hotel's location quickly turned me around. Yes, our room was small, but it was clean, the bedding was elegant and comfortable, the shampoo and beauty products were wonderful (after this, I'm going to find them on-line to purchase them), the robes were comfy, and the bar was well-stocked. The Hotel Monaco is in a great location -- steps from shopping, dining, and entertainment on Michigan Avenue and State Street (it's just south of the river). We walked less than a block to dinner at McCormick and Schmick's (we LOVED it); got the bus around the corner to go to the Museum of Science and Industry and a few other places when it was raining; found a few spots nearby for a relaxing drink; and generally found the location to be as convenient as any (we typically stay at the Intercontinental, which is right on Michigan Avenue, but wanted to try something different this stay). Then there's the staff: from the moment we walked in the door, everyone greeted us with a \"hello\" or \"good morning\" or \"good night\" and a smile. The concierge was helpful. The bellhop was helpful and friendly. The first time the woman behind the front desk left her spot as I walked in the lobby and beat me to the elevator to push the buttons for me (both outside the elevator and in), I was impressed; I soon came to expect that kind of simple, extra attentiveness and courtesy from every staff member there. My husband is a very big man (6'4\", 250) and so we typically like our rooms large so he doesn't feel cramped. The Hotel Monaco made up for the small rooms with its very big heart.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Candido DuBuque DVM","date":"2015-03-08 06:22:52 +0300"},{"content":"My wife and I booked a room for four nights on Thanksgiving weekend and I am not suprised that this hotel has sunken in the TA rankings as of late. The location is fine and rooms are quiet enough but we had a few complaints. The biggest problem is that the windows don't open - not even a crack. The recycled air was very dry and made the room a little stuffy. The cleaning service (as mentioned in previous reviews) was not great - bed turndown was inconsistent and parts of the room seemed untouched. There was peeling and scratched wallpaper and the caulking around the bathtub was a little moldy and stained. The reception staff was inconsistent as well. The concierge service wasn't the most professional. Having said all this, I need to say that the rate I recieved from Hotwire was very reasonable. I find it hard to call this hotel substandard because compared with other downtown \"four-star\" establishments in Chicago, it was no different. However, the higher rates one pays when conventions are in town would have left us disappointed. I don't see any reason to choose this Kimpton over, say, the Hotel Intercontinental.","ratings":{"Service":3.0,"Cleanliness":2.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Evans Predovic","date":"2014-08-16 11:59:25 +0300"},{"content":"My power went out during last week's heatwave, so rather than sleep in the bathtub I got a room at the Hotel Monaco on Priceline. I knew of the Monaco, had eaten in the restaurant downstairs, knew the location, etc. I figured that if the room was half as good as the photos looked (and the AC worked) I would be very happy. The room was huge, as was the bathroom. The linens were all top quality. The colors were rich and soothing. It was much better than I expected. It was very convenient for my commute to the suburbs for work, but was right by all the theaters and shopping in downtown. And the AC was fantastic!","ratings":{"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Rooms":5.0,"Location":4.0},"author":"Zetta Bode","date":"2012-10-24 16:58:20 +0300"},{"content":"Stayed at the Monaco for one night on business. I hadn't stayed at a Kimpton property before and was pleasantly surprised. Extremely friendly check-in staff, and comfortable lobby made for a homey feel. Interesting room decor. Greatly enjoyed dinner at the attached South Water Kitchen restaurant. Will stay here again.","ratings":{"Overall":4.0},"author":"Dr. Loyal Kiehn","date":"2013-10-06 23:36:08 +0300"}],"public_likes":["Virgil Reynolds","Katherine Schoen","Margarita Lubowitz","Connie Mayert","Maurice Mann I"],"vacancy":true,"description":"The Premier Inn at Brindley Place is the chain's most up-to-date property, with a marked difference in fittings over the other ones in town.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}