{"title":"London/South Kensington-Chelsea","name":"Kensington West","address":"25 Matheson Road, W14 8SN","directions":"tube: West Kensington","phone":"+44 20 7602-9954","tollfree":null,"email":"stay@kensingtonwest.org","fax":"+44 20 7371-1338","url":"http://www.kensingtonwest.org/","checkin":null,"checkout":null,"price":"From £65","geo":{"lat":51.4934,"lon":-0.2058,"accuracy":"ROOFTOP"},"type":"hotel","id":16442,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Lovely, modern hotel located one block from Termini rail station. Professional, helpful staff. Stylish, clean rooms that are well-maintained. Breakfast buffet is a wonderful extra...so many choices. Front desk made some spot-on restaurant recommendations. For a slight splurge, hotel can arrange a private car for you.....not much more than a taxi. The neighborhood is in transition, but we always felt safe. You can't go wrong with this hotel.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Eulah Maggio","date":"2012-06-23 20:09:55 +0300"},{"content":"This is a very smart modern hotel and good value for the money located in a quiet area close to the Termini train station. The staff are all very polite and efficient. In a previous review I had read a complaint about possible noise from the tram line that runs outside the hotel, so I made sure we got a room at the back. This was very quiet and luxuriously appointed with a lovely large bathroom with a bath. The breakfast was very good indeed with a good selection of fruits breads pastries juices and cereals. The scrambled egg and bacon did not look so nice though but the rest was great. There are some nice reasonably priced restaurants near the hotel. I found the hotel to be a little far from the centre to walk so we got taxis everywhere. You can get a train from the airport but we didn’t want the humping of cases on and off the train and through the station. (You are too close to get a taxi from the station just one block down from Termini) So it would have been lugging cases down the street to the hotel. We decided to get a taxi from Fumicino airport. This is fixed rate of 40 Euros which is not bad for the convenience. You have to get a ticket from a desk just before you go out the door of the airport to make sure you get the 40 Euro fixed rate, otherwise the taxi will be on the meter. The Hotel can arrange a luxury car back to the airport for 45 Euro which we took on departure. Impressions of Rome: Visit the main attractions about two in the afternoon to avoid the queues. We only queued for 15 mins at St Peters and the same at the Colliseum. The Vatican Museum we walked straight in. You may as well give the Trevi fountain a miss as it’s just a horde of tourists. The Sistine chapel was fantastic and the highlight of our stay. Be sure to read up all about the painting on the ceiling before you go to truly appreciate it.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Dr. Zakary VonRueden","date":"2013-02-17 16:54:54 +0300"},{"content":"White, shiny, and sparkly is the way I would describe this hotel. It was the chosen hotel for Rome by our Insight Tour and I can see why. It was very comfy and definitely a 4 star. Looks like just a doorway from outside but wow when you enter and then enter your room...wow! Would definitely recommend it. Close walking distance to so much history too!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Selmer Romaguera","date":"2013-08-11 03:33:12 +0300"},{"content":"Brand new hotel (opened spring 2010). Huge rooms with lots of amenities. Huge bathrooms. Silent rooms, excellent bed and good choise of pillows. High ceilings in both. Reminiscent of the 19th century Grand Terminal hotel's. Great location: 2 minutes walk to Termini train and bus stations to everywhere in Rome or Italy. Room with one extra bed (good one) for a child still have space to move around. Very good breakfast.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Jewell Runolfsdottir","date":"2012-06-15 13:52:26 +0300"},{"content":"WE have stay ther 5 nights with my wife and little children. Location, breakfast is ver good. Hotel was clean.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Omari DuBuque","date":"2012-02-22 10:56:30 +0300"},{"content":"The staff were excellent, they do not have tea/coffee making facilities in the rooms but my aunt asked could she have it and they brought one up no problem. The room wasn't very big but we werent in it that much so was fine. The bathroom was lovely. The heating in the room was very high and was hard to work. The location was excellent, Termini station was right around the corner and the metro system was great. You can also walk everywhere here, we walked to Trevi Fountain, which on the map was at the opposite end but only took 25 minutes but was nice weather. The breakfast was excellent, buffet style with a wide variety. The restaurant also served food but it was expensive. This hotel was expensive but we got a good deal on a comparison website and that is why we chose it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":5.0,"Location":4.0},"author":"Devin West","date":"2013-05-22 06:14:18 +0300"},{"content":"Our family highly recommends this hotel. - Excellent location: literally across the street from the train station - Very modern and clean rooms - Excellent breakfast selection and efficient staff even though it could get very, very busy in the morning - Knowledgeable and helpful front desk staff, e.g., when asked for a restaurant recommendation on our last day, we were directed to 'Alfredo's' --> little did we know that this is from the famed 'Fettucine Alfredo' fame!, gave us bus directions accurately, etc. - Forgot to put my 2 kids in the reservation, but they were still kind enough to upgrade the room!! so we were pretty happy with that... - They have some promo rates with internet so try to get that as i had to pay extra for wifi","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Filiberto Ratke Jr.","date":"2012-11-14 06:02:36 +0300"},{"content":"Booked with Una corporate to stay in three of their properties (Florence, Rome, Venice) while touring Italy with my wife and 18 year old son. Got a nice discount. However when I checked in at the Rome property I was given a very small room which with my son's roll away bed was simply impossible. Returned to the desk and was told nothing could be done went back to the room and tried to rearrange the furniture and it was still not going to work. Returned to front desk and told the rather cold and abrupt clerk that the room was unacceptable period--I was a corporate reservation and requested to speak to the manager on duty. This lady didn't speak English but took one look at the reservation and directed the supercilious desk clerk to put us in a nice two room suite which was great! Thank you very much. The biggest issue most people will have with the hotel is the location--about two blocks from the train station. Not a high rent neighborhood. In fact I watched a homeless guy sit in a doorway across the street for three days and nights. At the historic baths a few blocks away I saw the mobile health service van giving the homeless Heroin addicts their \"treatments\". However, I never felt uncomfortable walking the local streets even after dark and there are some reasonable eateries just around the corner. Being installed in a suite probably skews my review...there was some street noise at night and there is full time security personnel in the lobby to keep out the riff raff but I found it comfortable and convenient with a nice free breakfast. My wife didn't care for the location but even she felt the room was nice--especially with the three of us in it. I'd stay again--she says I should find a better located B&B sort of place.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Golden Dicki","date":"2014-07-17 23:43:52 +0300"}],"public_likes":["Mrs. Broderick Spinka","Finn Murphy","Torrey Koss","Karianne Lang","Thomas McKenzie","Bailee Steuber DDS","Breanna Schuppe","Laverne Walker"],"vacancy":false,"description":"Refurbished 2 star hotel offering 24 hour reception, wireless internet, and flat screen TVs.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}