{"title":"Birmingham (England)","name":"Hyatt Regency Birmingham","address":"2 Bridge St","directions":"in the city centre","phone":"+44 121 643-1234","tollfree":null,"email":null,"fax":null,"url":"http://birmingham.regency.hyatt.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47803,"lon":-1.90921,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3642,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Nice Hilton with friendly staff, had booked a regular king room and got upgraded to a 2 room parlor king upon arrival","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Dayna Thompson","date":"2015-01-20 07:41:43 +0300"},{"content":"I liked where the hotel is situated-right in the heart of Chicago. One thing I really appreciated was the fact that there is parking available that is easily accessible from the hotel. Although expensive ($38/day), for me, it was worth it.The hotel looks magnificent!The staff was friendly and professional. Besides the bedroom being very spacious and clean, there was nothing special there. The bed was comfortable and they do need to upgrade their TVs .The bathroom was small and I think they could have done a better job by adding a soaking tub. I hated the fact that they charge for internet access.($15/hr if you're in your room; I think it's less if you're in the lobby) but I guess it's because of the clientele they get which I noticed was more of businessmen. So if you are like me, traveling across country and just need to check on some stuff for few minutes, there's a Starbucks right down the street with free wi-fi.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Carolyn Huel","date":"2012-09-10 04:19:48 +0300"}],"public_likes":["Berneice Ferry","Elenora Bauch","Alba Morar","Eduardo Maggio Sr.","Nina Hayes","Conner Reichel","Fay Schumm"],"vacancy":true,"description":"Linked directly to the International Convention Centre (ICC) and is 5 minutes from the National Indoor Arena (NIA).","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}