{"title":"Liverpool","name":"The Liner","address":"Lord Nelson St","directions":"Just next to Lime Street station","phone":"+44 151 709-7050","tollfree":null,"email":"reservations@theliner.co.uk","fax":"+44 151 707-0352","url":"http://www.theliner.co.uk/","checkin":"2PM","checkout":"11AM","price":"£70 to £150","geo":{"lat":53.40808,"lon":-2.97601,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15912,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"my fiance and I and another couple stayed at this hotel 2 days prior to a cruise then one more night after our cruise. I looked at all the reviews and had a pretty good idea of what to expect. I am happy to say that this place well exceeded my expectations. The cab ride from the airport was short, about 5 minutes. The cost is pre-determined, about $20 for 4 people with luggage. Upon arrival to the hotel, we found that only one of our rooms were ready and had to wait for a couple of hours for the other one. The front desk was very accommodating. They offered a temporary room so we could change into swimsuits and use the pool/beach while we waited. Once we had our rooms, we were very pleased. Although we only had a street view from our balcony, the rooms were large and comfortable, with a huge bed, lots of space and had a nice sitting area. I can't say enough about the pool area. It was beautiful. I called my family back home and told them I found paradise!! The pool area was awesome with ample lounge chairs. Every spot is a good spot with good blend of sun and shade. (It was hot hot hot in November, so a little shade was welcome) The pool was the perfect temperature and was large enough to have a little corner of the pool to yourself without bumping into everyone else. There was a waterfall at one end that was a lot of fun to splash around. There is a boardwalk with a bar cafe that separates the pool from the beach. Although the beach isn't the best I've seen, it's still the ocean and loved having the option. There were a few tables of vendors selling jewelry and trinkets, not pushy at all and in fact I had to work my way thru the crowd of people around the tables to take a look for myself. The bad...restaurants were ridiculously expensive. We paid $10 for two cups of coffee to go and the breakfast was around $17 per person. There are a few restaurants in the area, but you mostly need to go to Old San Juan or elsewhere to get much of a variety. A cab ride is around $15-18, although we were able to bargain with the cabbies a little. You can also take a bus for around $1.25. Tip.. there is a large grocery store about 4 blocks from the hotel. We loaded up on soft drinks, snacks and rum to take back to the hotel. We also found a great mexican restaurant/sports bar with good food and TV's all around to watch every football game playing that day. All in all, I loved this place and can't wait to go back.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Demarco Wolf","date":"2012-05-20 10:07:47 +0300"},{"content":"We stayed at the Intercontinental for one night pre-cruise. The Good: We got a great deal on this hotel so it was hard to pass up. The room was nice, clean and bed bug free. I even checked the mattress by removing the sheets and inspecting the seems of the mattress and there was no evidence of bed bugs. Also, the pool area was really nice, but we didn't get to use it because of the weather. The Location: The hotel is in an area where there isn't a lot of local restaurants to eat at and is a little shadey in the evening. The costs of taxis back and forth to Old San Juan ($20 each way) and to the Pan American Pier ($15 each way) really added to the cost of our stay. The Awful: As has been previously mentioned, DO NOT have breakfast in the hotel. There was a torrential downpour the morning we were there, so we decided to eat in the hotel. The cold breakfast ($17) consists of cereal, fruit and store bought mini-pastries. The larger hot breakfast ($22) includes the cheese and cold meats as well as some egg and sausage. In my experience a continental, cold buffet includes the meat and cheeses, so we were surprised when we were charged $22 each for the breakfast we had. Also the service to get coffee and juice was terrible. I never got the milk I asked for for my coffee, I ended up having to go to the buffet for it. Finally when we checked out they asked how our stay was, I said the room was fine, but that the breakfast service was terrible and all I got was a smile and \"that's good\" If you're looking for a good deal and don't plan on going to Old San Juan to eat, then this hotel would be a good option, but please go to the Mi Casita restaurant across the street for breakfast, even in the pouring rain!","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":2.0,"Rooms":4.0},"author":"Jaquan Klein","date":"2015-01-18 00:21:48 +0300"},{"content":"So I read up on tons of reviews on here before going to San Juan, and here's my experience. Having never been to Puerto Rico, I was surprised at the poverty. The area around the hotel wasn't bad, but also wasn't great. The roads were torn up, traffic was horrible, and the businesses were seedy! People would pull over and park ANYWHERE - in the middle of the road, blocking an entire lane, etc. We booked our trip through CheapCaribbean and got a great deal. It said we would get a free room upgrade with our booking from a Deluxe Pool/Garden.....and the next upgrade is Ocean View. Upon check-in, I asked for our oceanfront room and was told that the free upgrade is only for a city view room. I showed him the paper that said otherwise, and after some arguing back and forth the check-in assistant agreed and upgraded us to an oceanview room at no charge (as we were supposed to be). The room was gorgeous. Room 908 (9th floor). The view of the ocean was amazing. You could tell that the rooms were a bit older but had been upgraded. Newer paint, flatscreen TV, refrigerator, etc. Some people on here complained about a smell - everything smelled fine to me. The only thing that the room was lacking was a microwave. And yes - as others said, the refrigerators get TOO cold and sometimes freeze your food and drinks. Overall I'd give the room an 8.5 out of 10. I have heard others complain about \"bed bugs.\" We did have a lot of bites on our legs, but we also visited the rainforest and walked on the beach at night so I can't say if these bites came from the ROOM or from being outside. Either way, it wasn't a huge deal to me. I didn't see a single bug in the hotel or in our room, and everything seemed very nice and clean. As others stated, housekeeping didn't replenish towels. We called down to the lobby and they sent some up immediately. We visited the casino one night. It's nice and small and out of the way. I actually won $80 on the penny and nickel machines! Towards the back of the casino where you redeem your winnings, it looked like it needed some updating (gaps in walls, etc.) We didn't eat at the hotel - there are plenty of other places to eat for cheaper. Church's Chicken, Denny's, Burger King, etc. I'm a picky eater so it was nice to have a wide variety of food around you within walking distance. If you rent a car (we did for the entire time), beware! Ha. The drivers there are HORRID. It seemed like every other car had a burnt out tail light, and they would swerve in front of you like speed demons. It takes some getting used to. You'll see trucks pulled over int he middle of the road, and you have to go around them. The cops do NOT care what people do on the road or where they park from what it seemed. I also saw many police vehicles with their lights on....casually driving down the road. I think they turned their lights on simply to get around some of the traffic. We did use the \"business center\" at the hotel to print our boarding passes. They offer free wi-fi in the rooms, but if you need to print anything you need to use one of their computers. I was charged $5 for 10 minutes of internet usage, and $1 per page in black and white. OUTRAGEOUS! We did NOT get charged any \"resort fees,\" but you DO have to pay $16 a day for self parking. Seems expensive, but what can you do. The parking in this area is just HORRENDOUS - nowhere near enough parking. Upon checkout, everything went smoothly. We paid $55 in parking fees (Mon afternoon until Fri at 12 noon). Keep in mind that we did travel in mid-October (off season), which was GOOD. Less crowds! The weather was fantastic. The rain showers last maybe 15 minutes, and then it's back to bright sunny weather! One thing to mention - it is SO HUMID IN PUERTO RICO! Not a single breeze, just HOT AND HUMID. We were dripping sweat from walking only 15 minutes in Old San Juan. Be prepared! There are many Walgreen's on the island, but the one close to the Intercontinental is HIGH PRICED. Expect to pay double what you do at a Walgreen's in the States. We stopped at another Walgreens in Old San Juan that had much better prices. If it's close to the tourist hotels, chances are it's overpriced! For anyone else going, you MUST go to Flamenco Beach on Culebra. GORGEOUS. The best beach in the world. It's a $2.50 ferry ride from Fajardo (an hour from the Intercontinental), and $2.50 back. The snorkeling is phenomenal, and the beach is out of this world. We also saw the rainforest and Old San Juan, but Culebra was the highlight of our trip. If your goal is to see a great beach and snorkel......Culebra is for you! Overall - if you can get a good deal, it's a very nice hotel. Not perfect, but definitely not bad like some people have claimed. I paid $1100 for roundtrip flights for 2 out of Minneapolis and my free oceanfront room upgrade, including tax. That boiled down to about $100 a night for an oceanfront view, which is normally $250 a night. The Intercontinental was a great choice given the price we paid. I'd easily rate it a 9 out of 10. Not perfect, but definitely a very nice hotel. Very convenient location, and excellent pool (which is open 24 hours!) If you can get a good price, it's definitely worth staying here!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Giovanni Christiansen PhD","date":"2013-11-21 08:56:51 +0300"}],"public_likes":["Darby Jacobson DVM","Jovany Gorczany"],"vacancy":true,"description":"A rather good hotel, well located.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}