{"title":"San Francisco/Union Square-Financial District","name":"Hilton San Francisco Financial District","address":"750 Kearny St","directions":"between Washington St and Clay St","phone":"+1 415 483-1498","tollfree":null,"email":null,"fax":"+1 415 765-7891","url":"http://www.sanfranciscohiltonhotel.com/","checkin":"3PM","checkout":"12PM","price":"$209-$409","geo":{"lat":37.7951,"lon":-122.4042,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26220,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Being used to staying in a timeshare/condo type unit in the Kissimmee area I was a little leary about a stay at a traditional hotel/motel type unit with what seemed like a really low room rate for the area. From the moment I Entered the lobby of champions at check in until the time I left I was very impressed with the rooms, amenities, and customer service of the staff. I was very impressed with all champions had to offer from the business center, buffet style restaurant/bar, two pools (one heated), laundry facilities, work out room, grill/picnic area, and rooms which were well maintained. Also, having well maintained soccer fields, softball/baseball fields, and basketball courts is I'm sure a definite plus for traveling sports teams. I was very satisfied with my week there and enjoyed the proximity to restaurants, shopping areas, and Disney parks. The one and only thing I would change would be increase the amount of complimentary shuttle runs to Disney parks","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Jake Abshire","date":"2012-09-12 12:03:57 +0300"},{"content":"We wanted a pool side room on the 1st floor by the covered pool. One was not immediately available but we were told to come back after noon. There was still not one available. We asked the next day and a different front desk person (this time male not female) said one was not available but \"let's see what I can do\". He did his computer thing and switches some things around and we got a great ground floor room by the pool. So, sometimes it is not the hotel but who is at the desk that counts. We stayed 14 days and found the staff very friendly and helpful (except for the 1st female desk person we encountered). We stayed around the hotel for 4 of the 14 days and just used the pool which felt like a warm to hot bath. The spa was great and the one time it was not very hot they fixed it within the hour. We used the laundry twice and it was not very expensive with quite a few machines. We did not have to wait either time. Yes we could complain about the noise outside, but that was just kids having fun and if we wanted quiet we would not have chosen a room by the pool. We could complain about them closing down the pool when the bacteria count got to high but they treated it and reopened by the next morning and this is better than making us sick from the pool. I read the reviews before we left and found most of the complaints had no validity. You can not blame the hotel for the weather or guests noise or attitude or behavior. So all I can say is all the staff were friendly and most were helpful. The rooms were clean, the towels were fluffy. The price was certainly right. The hotel is not fancy but neither is the price and from my point of view we got much more than we paid for.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kennedi Welch","date":"2012-05-25 15:16:40 +0300"},{"content":"The tub was dirty when I arrived at the hotel. The water was not working properly. There was a pungent smell in the room. They came and cleaned the tub later on.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Georgianna Cronin","date":"2015-05-26 12:53:58 +0300"},{"content":"The most recent of several week or more stays at this hotel. Ownership has changed since first visit in 1984 when it was the Regency. Most recently Howard Johnson's and now Champions World Resort. I have returned with my family which now includes two granddaughters in 2003, 2006, 2007, and now 2010. Have been extremely pleased with the accommodations each time. The rooms and bathrooms are large and super clean. Beds comfortable. The grounds beautifully landscaped with palm trees and shrubs, etc. Location close to Disney (about 3 miles) but far enough to be in a quiet area. Plenty of fine restaurants, stores, and other attractions nearby. We will definitely stay here on our next visit to Florida. The room rates are just right for people looking for reasonable accommodations. The staff friendly and helpful. Can't wait to get back.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Shawn Sipes","date":"2015-02-24 08:27:09 +0300"},{"content":"We have just arrived back from a 2 week holiday in Kissimmee, Orlando, USA. We stayed at Champions World Resort (FORMERLY HOWARD JOHNSON MAINGATE WEST ) for our FIFTH time and yet again we had a wonderful holiday there, the rooms are massive and very very clean the staff are very attentive and are extremely helpful, there is a TV provided at no cost to help you with what’s on in Kissimmee and the surrounding area, the bed are comfortable and changed daily , we were provided with a fridge, Microwave and coffee maker which included a daily supply of ground coffee & sugar, the bathrooms are a really good size and good quality towels, shampoo ,soap and moisturising cream provided daily , there is a safe provided in every room and accessed by a personal code for security, the rooms are serviced everyday and kept to a very high standard, right from the start of checking in to checking out we were looked after, nothing is too much trouble for the staff or management. The pools and pool areas are cleaned daily and towels are provided at poolside. We didn’t eat at the hotel, so cannot comment on the food but did hear other guest compliment the food and the service, we used the bar on a few occasions and the staff are very friendly and provide good service and ice cold beer, a special thank you to the night manager and Jenny Vazquez for all their help and assistance during our stay, you went above your expected duties, “THANK YOU “ We would definitely recommend a stay at Champions World Resort as it is excellent all round value for money and you are guaranteed superb first class accommodation.","ratings":{"Overall":5.0},"author":"Sylvester Kerluke","date":"2012-02-10 15:17:42 +0300"},{"content":"The internet pictures and information can be very deceiving. The beds were extremely uncomfortable (HARD) , the AC did not cool the room at night when you were sleeping. I was sweating and we had no WI FI all weekend because it was down and they wanted to charge me $.38 per minute to use their internet. The buffet was $8.50 per adult and they do nto tell you that until after you have eaten. A total rip off.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Brennan Dietrich","date":"2013-11-01 17:56:08 +0300"},{"content":"Spots of mold in room & bathroom. Wear sandals IN the room, carpet is filthy. Mattresses old, sheets scratchy (cheap & threadbare). Bar is unattractive & very basic, garishly & brightly lit. In Orlando, you can a whole lot better than this place, for the same money. Avoid this place !","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Marty Gerhold","date":"2015-01-17 23:31:26 +0300"}],"public_likes":["Lisandro Kihn","Mr. Arne Gutkowski","Nasir Carter","Rogers Shields","Ambrose Mueller","Randi Gislason","Demarco Beer"],"vacancy":false,"description":"Situated at the nexus of Chinatown, North Beach and the Financial District, this 27 story hotel has some stunning views over the city and of San Francisco Bay.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}