{"title":"Hollywood","name":"Saharan Motor Hotel","address":"7212 W Sunset Blvd","directions":null,"phone":"+1 323 874-6700","tollfree":null,"email":null,"fax":null,"url":"http://www.saharanhotel.com","checkin":null,"checkout":null,"price":"$100+","geo":{"lat":34.097737,"lon":-118.347453,"accuracy":"ROOFTOP"},"type":"hotel","id":11790,"country":"United States","city":"West Hollywood","state":"California","reviews":[{"content":"I'm a wheelchaired patron and I found this hotel uniquely accessable given it's size and age. I have personally written to the ADA commenting on how well they caitered to my needs. The rates were reasonable, and the retro atmosphere kept me amused between the nights.","ratings":{"Overall":5.0},"author":"Jerel Rutherford","date":"2014-08-16 11:04:00 +0300"},{"content":"I've stayed at some run down places all over the world, but this place takes the cake. First off it is a brothel, and filled with meth/crack heads. I have no idea how this place passes any inspections. I was going to a couple of shows at the Congress theater, and this place is the closest place to it, so I thought I'd try it out even though the reviews were bad. When we first walked in we had to talk to a guy behind a window and pay, then we were buzzed though another door where we had to go up stairs battling crack heads on the way up. When I got to my room I looked around and found out that I was sharing a bathroom with the room next door, which had some shady charactars in it. I would have never trusted my belongings in my room with only a plywood door between us. Then I sat on the bed and realized it was covered in plastic sheets under the covers. I looked at the plastic sheets and they were plastic wrap with duct tape. The sheets were also full of awsome yellow stains. Luckily we were given a refund and did not have to stay, otherwise I would probably not have been able to written this because I would have been kidnapped and sold into a lifetime of male erotic sexual slavery.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Location":4.0,"Rooms":1.0},"author":"Tyson Beatty","date":"2012-03-13 13:27:13 +0300"},{"content":"How can you book a hotel in advance, regardless of reviews, if they refuse to take reservations? This may be a great deal, but it's reduced to an as-available basis on the day you want to stay there. How stupid is that?","ratings":{"Overall":1.0},"author":"Dr. Lia Harris","date":"2013-03-06 17:01:21 +0300"},{"content":"Staff was actually nice. Location is great. But it really does end there, sadly. Roaches and Bedbugs are both present, luckily I was not bitten but I saw them. Bed was clean when I got there minus some stains on the sheets. I don't want to know what they were. But housekeeping did not come once after that for a week. It was quiet enough for the area and no problems but unless you can not afford anything better you might want to avoid this one until they take care of the bugs and clean it up a bit more. I've stayed in the past a few times and a few roaches I can deal with. But I won't be staying again because of the bedbugs.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Mrs. Candida Koepp","date":"2015-08-16 01:08:10 +0300"},{"content":"I stayed in a new refurbished building owned by the rex it was 4 doors down it was good value although i did not make it to breakfast on the 2 nights i stayed here","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Rosendo Bergnaum","date":"2014-07-06 23:27:07 +0300"},{"content":"We have just returned from a recent stay in the Apostrophe Hotel and it was fantastic. Before choosing the Apostrophe Hotel we had read all the reviews and as most were really good we thought we would take a chance on booking it. It was even better than we had expected. The customer service we experienced from ALL of the staff was superb. Help from the front desk was forthcoming 24/7 (re metro stops, directions, opening hours, places to eat etc etc). Location is great. Rer and metro stops only a few minutes walk away. The room was very clean and comfortable. The only thing we would have liked was a kettle. However this was not a problem as the staff at the front desk were very wiling to boil water for us at any stage day or night to make our own cup of tea. Well done to the Apostrophe staff you are setting a standard of service that all hotels should aspire to.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tyra Schaden","date":"2015-05-06 13:40:43 +0300"},{"content":"I have now stayed twice at the Apostrophe Hotel. And both times have been really good experiences. Yes, the rooms are relatively small - it is Paris after all - but the interior is utilized very well and the location of the hotel is second to none. However, the strongest selling point for the hotel is the excellent service. You really feel at home in these surroundings. If there is anything the staff can do to help you, they will. I can only give the strongest recommendations for this hotel after my stays.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Anna Romaguera","date":"2012-12-02 02:38:21 +0300"},{"content":"Blessed with a funky interior apostrophe has an excellent level of service and a great location, close to cafes/restaurants and a small walk or metro ride into any of the Paris sights. Only thing is that the rooms were not very soundproof.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Magnolia Parisian MD","date":"2014-03-08 00:55:53 +0300"},{"content":"Everything about this hotel was perfect. The location (quiet and yet central), the super friendly staff, the lovely clean rooms and the amazing shower!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Peter Hermiston","date":"2013-03-26 05:54:59 +0300"}],"public_likes":[],"vacancy":false,"description":"The Saharan Motor Hotel features deluxe rooms and suites, luxury amenities and excellent service.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}