{"title":"Birmingham (England)","name":"Hatters Birmingham","address":"92-95 Livery Street","directions":null,"phone":"+44 121 236 4031","tollfree":null,"email":null,"fax":null,"url":"http://www.hattersgroup.com/birmingham","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48633,"lon":-1.90446,"accuracy":"APPROXIMATE"},"type":"hotel","id":3606,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"I booked two rooms for Saturday so my wife and I could take our two young children and her parents to see the windows at Macy's. The hotel is clean, the location is great, the rooms were nice (shower heads and pressure not so much), but both of our rooms had horribly cold water in the shower in the morning. I showered at around 7am and was fine. My wife in our room and my in-laws in their room tried to shower between 8-9 am and got tepid at best, icy at worst, and all temperatures in between. I called the front desk and asked if something was wrong. She said no one had complained that morning, and she sent the maintenance man up right away. He arrived promptly, told us he gets that call a lot and it's because we were on the 13th floor (the first floor of rooms in the building evidently) and \"the hot water comes from the roof, so you just need to try later\". Try later? You are a Hilton property right? He was very polite, and I believe I understand how gravity works, but it's ridiculous to have a hotel where you KNOW some of your guests are going to have cold water if they take a shower at peak usage, e.g. 8-9 in the morning. I went down to the front desk and she said \"No one has complained this morning.\" I said maybe they haven't this morning, but you can't tell me they've never complained at all, and she admitted that she does get that call from time to time. I told her I had the same hotel booked for three nights this coming week and I needed to cancel and move to another Hilton property. She moved me to the top floor so it shouldn't be a problem... for me anyway. Apologies to the poor schmucks on the bottom floors that day.... Long story short... really nice place, nice little pool that's warm for the kiddos, and a great location, just get a top floor or don't plan on a nice hot shower on a late December Chicago morning... yikes.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Bart Simonis PhD","date":"2013-12-18 22:51:08 +0300"},{"content":"We stayed at the Hilton Garden Inn for 5 nights. No line at check in and we valeted our car, checked in and was in our room within 10 minutes of pulling up to the covered entrance. We had our room serviced every day, we had fresh towels for 3 people every day, we had coffee and sugar packets every day. The room wasn't small to us, however, we just spent a week on the Carnival Destiny with the same 3 people, including an 18 year old 6'5\" boy. Now that was small! The beds are unbelievably comfortably, weird looking but comfy. We didn't buy anything from the little room at the front desk cuz it was pricey but did go to the Jewel/Osco grocery store that was around the corner. We thought the restaurant was a little pricey so we went elsewhere to eat. The valet parking was always ready for us and our car was always delivered promptly. They even gave us quicker directions to the Field Museum then we were going to use. It is so convenient to everything you don't need a car to get around. There are even movie theaters just down the street. Easy access from I90 both coming into the city and leaving the city. Didn't have any trouble checking out and my bill exactly matched the quote I received when I made on-line reservations.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jarred Wisoky","date":"2013-12-10 06:03:36 +0300"},{"content":"Great hotel with a wonderful restaurant. Good location with easy access to rail transportation. Only problem was trying to connect my Apple computer to the free Wi-Fi. They transferred me to a help desk who walked me through the process. It only worked for a few minutes and I called again. Same thing so I gave up..... seems this problem happens all the time at this hotel. Hopefully they will get this fixed soon as the rest of the hotel experience was wonderful.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Freeman Hane","date":"2012-05-30 23:36:24 +0300"},{"content":"Hotel is just steps away from the Red Line \"L\" so you can get around easily if you don't want to walk, drive or cab it. Very clean hotel, good water pressure, friendly & accommodating staff, nice bed & pillows (but the top sheet and pillow cases felt like they'd been starched!), temp. in room perfect & can be adjusted. Didn't try Weber Grill but it looked inviting for a drink and a quick meal. 2 computers are on 12th floor (need room key to access the room), so you can check email &/or print out your boarding passes. Hotel is near a lot of great shopping, Pops for Champagne is around the corner & only wish we had gone there. Mary's Cafe is good for breakfast & is abt. 4 blocks away. If we can get as good a rate as we did this time, I'm pretty sure we'll stay here again when we visit Chicago.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Neoma Purdy","date":"2012-02-05 11:55:53 +0300"},{"content":"This hotel is perfect location..Only a block or so from Magnificent Mile ( Michigan Ave).. Train Subway is right in front of the hotel,,took trains to Wrigley Field, Cellular Field and to the theater district to see Jersey Boyzz....Parking is a little expensive $44 per day with in and out priviliges but you are in the city and not much of a choice..The on-soite restaurant Weber Grill has good food , plus you are surrounded by great restaurants and shopping all around...Indoor pool made my little one happy , although the ventilation is horrible in the pool area, the chlorine smell and lack of cool air was made it difficult to stay long in the pool area for us...The rooms are modern, clean, so no complaints there..If we were to return to this part of Chicago I would stay here again and have no problem recommending it to others..","ratings":{"Overall":4.0},"author":"Susanna Johnson","date":"2014-11-23 17:41:30 +0300"}],"public_likes":["Caden Schinner","Elnora Morar","Willis Kunde","Isobel Jones","Annamae Hyatt"],"vacancy":true,"description":"Jewellery Quarter. Less than a 10 minute walk to the centre, Hatters Birmingham have upped the norm in hostel accommodation boasting all ensuite rooms and, finally, after eight long months of waiting (yet advertising that it was there) they've got a common room. Beds start from £14.50 and includes bed linen & a free light breakfast which is served all day","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}