{"title":"Glossop","name":"Avondale Guest House","address":"28 Woodhead Road","directions":null,"phone":"+44 1457 853132","tollfree":null,"email":null,"fax":null,"url":"http://www.avondale-guesthouse.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.449979,"lon":-1.945284,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":10160,"country":"United Kingdom","city":"Glossop","state":null,"reviews":[{"content":"I tagged along on my husband's work trip (not expensed) and had a great time. I think we made the perfect choice. PROS: 1. Location is fantastic. If you head out the back entrance you are a block from Bourbon street, yet when you return home you feel a world away, which is fantastic when you see how seedy some elements along Bourbon street are (FYI I felt safe the entire trip and walked around on my own). 2. Rooms, I thought they were great. Our bed was comfy, our room was well decorated. The bathroom, though not huge, was tasteful, and separate door for comode from the rest of the bathroom, which I liked. 3. Service, the conceirge was helpful, when I asked for guidance on two occasions I got knowledgeable, professional advice, without the condescending air some concierges have. Bellhop was friendly and helpful. I like turn down service, bring me little chocolates and bedside slippers and I'm a happy camper. Check in & check out were a breeze. 4. Crowd, pretty upscale people (I know, snobby, but New Orleans is a mixed bag my friends--part of the charm but nice to have a break from the \"charming\"). I saw a few NBA players from Houston in the lobby...funny how they stand out. 5. Cost, we found the rates for our dates more than affordable, given the caliber of the hotel 6. Gym, it's pretty darn nice for a hotel, they have the cardio room with individual TVs on the machines, a weight room, and a Yoga stretch room with weights, medicine balls and cool yoga mats. I spent like an hour doing yoga by myself, uninterrupted. fun. CONS: 1. Noise, our room faced Canal street and I didn't hear regular traffic but the first night I heard several sets of sirens from emergency vehicles. My husband never woke, and I didn't hear it subsequent nights. Perhaps a courtyard room would be quiter. 2. Pool, only indoor lap pool and jacuzzi. For such a hot climate, a nice pool scene could be fun. Tips 1. We traveled in January. I'm from San Diego and packed for San Diego winter. It was 75 degrees and 97% humidity. I made use of the Shops at Canal (Athropologie, Saks 5th Avenue, Banana Republic, Ann Taylor...I missed you JCREW coming FEb 2012). I wish I had brought one warm weather outfit \"Just in case\"...learn from my mistake. 2. Men bring sports coats, for restaurants like Galatoire's and Commander's Palace, where you'll stick out without one. (By the way, we enjoyed Galatoire's, Commander's Palace was disappointing to us). 3. St Charles Streetcar $1.25 one way, or $3 all day pass, need exact change, the pick up stop at Lady Footlocker on Canal about a block away. I had a Garden District walking tour in the travel book from the library and it gave history on homes in the area (ie Ann Rice's former home, Jefferson Davis' home, etc). Great city to visit. Happy Travels","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Miss Evan Cartwright","date":"2012-07-03 16:28:15 +0300"},{"content":"I lived in New Orleans while completing my residency at Ochsner, but this was prior to The Ritz coming into existence there. A very close friend recommended that I stay there several years ago. Now I will change my dates of travel if it is booked. Even when it had been months since I had stayed in The Club section, the staff remembered me personally. This is true from the valet to the bartenders in the main hotel. It isn't like I'm there every week. Usually I will travel to N'awlins 2 to 3 times a year. Yet, I am remembered by name.Can't think of anything I'd change except lobby is a bit too cold for my thinned out transplanted Floridian blood. I have stayed in multiple bed and breakfasts and multiple star hotels to dumps over the years in New Orleans. No place can come close to the Ritz!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Greyson Stroman","date":"2014-02-14 23:16:00 +0300"},{"content":"Stunning- beautiful renovation and exquisite chandeliers. Must stay when you're in new Orleans.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Stephany Torphy","date":"2012-03-16 08:23:49 +0300"},{"content":"Stayed for three nights in a suite on bed and breakfast rate.Staff all extremely friendly and helpful from the moment we drove in to the parking area.My wife left her phone in the car and after calling the desk it was in the room within five minutes.The suite according to the bell boy was freshly decorated and it certainly was a very nice room with a large lounge area, a huge bathroom and a very comfortable bed.The room was serviced twice a day and the maids made sure we had plenty of bathroom supplies etc. The concierge desk was very helpful with maps and directions etc. The breakfast was excellent each morning, although we did have to wait one morning for 5 minutes while they made a table up.For a large hotel the breakfast area not very big. I never did understand the breakfast charging although they tried to explain it to me twice, I'd paid for b & b but a small charge was made each morning for breakfast. I guess there must be a limit and we went over it.Anyway the food was plentiful,freshly cooked and very good.Try the New Orleans hash!! When I got home about two weeks later I had been charged for Room bar items to my credit card which we had not had. I never buy things from hotel room bars,too expensive. Anyway after I contacted the hotel billing department this charge was refunded to my card with no argument. A very nice three days in a great city, thank you we will return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Davion Bruen","date":"2013-04-02 03:55:34 +0300"},{"content":"I’ve stayed in most of the hotels in New Orleans and I must say that the Ritz-Carlton is among the best. The only negative is that I once had to wait an hour passed check-in for my room to be available, had I not had other guests with me that night, I guess I would have been expected to stay in the lobby or courtyard, which wouldn’t have been much of a problem because the courtyard is great, and in their defense, it was a busy weekend. Other visits to the hotel have made up for my one negative experience. Rooms are decent sized, clean with nice bedding, and the Davenport Lounge is a great place to grab a drink. I recommend this hotel for locals and tourist alike.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Ernie Pfannerstill MD","date":"2014-10-04 10:25:59 +0300"},{"content":"My wife and I have been to New Orleans about 12 times in the past 12 years. Often we stay at \"just a hotel\"! That might be a Marriott, a Sheraton or a Courtyard but the Ritz was an experience. From the check in at the reception desk the staff only wants their guests to be pleased. Housekeeping was great and the room was furnished and decorated like a home away from home. Howard at the front door was always there and had a smile on his face. Jerry at the Valet was always available to talk to , ask and answer a question and wish you a great day. The club services and the staff was completely outstandingly outstanding. The food, the drink, the selection, the quality the people, the services were phenomenal! I travel and have been on the road in hotels around 70 days year to date this year alone and I will tell you that nothing I have ever experienced with the exception of the Four Seasons Hotel has come close! Thank you to the staff, the management, the Club team and everyone for making this an absolutely, positively stay and experience to remember!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jamil Rowe","date":"2012-07-10 11:49:35 +0300"},{"content":"Beautiful hotel and, as always, lovely rooms. m bistro is wonderful- hats off to the chef! However, the concierge service is terrible. Multiple calls in prior to our stay with a return call. Finally, when I was able to get someone on the phone, the concierge, Ryan, was rude and seemed irratated. Not what you expect from The Ritz, unfortunately.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Bell Hagenes","date":"2014-11-01 18:57:49 +0300"}],"public_likes":["Dulce Turcotte","Vivien Bahringer","Marlin Robel","Norma Effertz","Ora Fisher"],"vacancy":true,"description":"Mobile: +44 7784 764969","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}