{"title":"Wales Coast Path","name":"West Usk Lighthouse","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.westusklighthouse.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.540677,"lon":-2.994854,"accuracy":"APPROXIMATE"},"type":"hotel","id":40093,"country":"United Kingdom","city":"Newport","state":null,"reviews":[{"content":"Recently stayed at the Hotel Dana and had a excellent experience. Location is great and every staff member we dealt with was professional, courteous and very helpful. The rooms are very comfortable(stayed a Serene Rain King or something along those lines-it was the one around 335 SqF) and it had all the amenities I needed and the perfect amount of space. I have stayed in many of the boutique and regular hotels in the Magnificent Mile area and I would rank this among the best in terms of hospitality and quality. When I was looking at this hotel a few mentioned that they could hear neighboring rooms and the walls were thin. I never had this issue nor did it seem that way at all. I would not hesitate to stay here again. The hotel also has a nice bar on the first floor and a great rooftop lounge (both indoor and out and open year round) that during the week is not too busy and a nice stop for a drink.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Laron Braun DDS","date":"2012-02-05 09:26:44 +0300"},{"content":"This hotel has a very modern, young vibe. Our room was large with a living room, bedroom and bathroom with a walk-in shower. The bathroom was all tile, 2 shower heads and 2 benches. We had 2 balconies with a great view of the city. The night-club upstairs was hip and seemed to be the in-place to be. Everything was within walking distance for us (we love to walk). Michigan Ave 3 blocks away. Lots of shopping, restaurants, all within a few minutes.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Derek Roob","date":"2012-06-22 05:17:20 +0300"},{"content":"A last-minute booking in downtown Chicago on Halloween weekend... Never having before been to Chicago, and not knowing my State St. from my LaSalle Ave... Without a clue as to the relative distances between things in the downtown area... This tale isn't starting out so good, is it? So I took a gamble on a highly-rated, glowingly-reviewed, but perfectly-priced downtown Chicago almost-boutique property, the Dana (pronounced \"day-nah\"), and let the Fates have their way with me. This time they were most kind. Too kind, in fact. In a word? The Dana is CRUSHING!!! That's what the experience was like. Everything began from the moment I arrived... Seeing as I'd booked so late after my local contact dropped the ball on my hotel reservations, the order hadn't even cleared Expedia.ca's queue (I ordered off the Canadian site, seeing as I'm based in Toronto) when Frederick came through in the clutch -- one call to Admin, he had me sorted out lickety-split. And I thought I'd be waiting for at least 20 mins. No vacancies given the Halloween weekend? Nope...rather than shunt me off to some out-of-the-way silly room facing a brick wall or nestled in a noisy alleyway (read my review of my last hotel stay in Cascais, Portugal)...I was treated like arriving royalty. I was given a top-floor room with a majestic Chicago-style skyscraper view facing north in a sumptuously-appointed suite with all the fixings, the majority of which I regrettably didn't use, but were available to me if needed. All manner of drinks and snacks were *already* available for the taking as I stepped in (no phone call to room service), so for those of you who don't like venturing out into the urban wilderness to fetch victuals or groceries...it's a snap. Only thing I feel terrible about is the fact that I came alone, and had business to attend to in town. Definitely the next time I have occasion to be in Chicago, I'll be bringing company and enjoying all of the Dana's cute little charms. Seeing as it was a birthday trip, Romeo on concierge duty was uber-helpful in suggesting jazz venues for my birthday evening jaunt -- even offering me a drink on-the-house -- and his cab directions were spot-on. Romeo has a knack for remembering everyone's name and as you pass through the lobby, the Dana Front Office guys and gals are always quick to share a laugh or a kind word with you as they address you by name, which makes all the difference when staying at some of the medium-priced hotels. You don't want to ever be treated like a number and that was never the case during my stay. Bonus! Checking out? Breeze! I had an insanely early checkout time (five-ish in the a.m.), and Lindsay realized that I was in a rush to get to O'Hare/ORD for my morning cross-border flight back north. He noticed that I was getting a bit jittery and antsy, seeing as he was serving an arriving guest just as I was about to dance on out of Dodge, within two keystrokes he had my invoice printed and my cash deposit back to me. #FTW!!! Bottom line: while I didn't get a chance to use all the facilities to their maximum -- pity, I know, given the high quality of this place and the fact that the Dana seems like a place tailor-made for fun -- it's an all-star hotel. I even made a short video of the bathroom area to show my friends that such a thing actually exists, and that I wasn't making it all up. Added feature: there's even a nightclub on the top floor -- with some pretty stylish attractive guests (yes!) who were streaming through the patron-only exclusive elevator that spirits them skyward -- though I didn't have time to party there but makes me want to get back to Chicago ASAP just to sample it. That shower is heavenly -- I won't describe it and ruin your surprise (nor will I forget it), but it's worth every dollar you'll spend and newlyweds, couples, or businessmen enjoying a little extra-curricular fun away from home will appreciate the look, and, er...feel of it. And that king-sized bed? I didn't even realize what hit me as I woke up most mornings, and those were the nights I wasn't enjoying a few beers! Unless you've got family in Chicago and they'd be insulted that you're not staying with them during your visit, stay at the Dana and be happy. Very happy. I was and plan to be again...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Roxane Heathcote","date":"2014-01-04 17:18:21 +0300"}],"public_likes":["Mrs. Brandon Maggio","Howard Will I"],"vacancy":true,"description":"Built in 1821, now a hotel.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}