{"title":"Santa Monica","name":"The Huntley","address":"1111 Second St","directions":null,"phone":"+1 310-394-5454","tollfree":null,"email":null,"fax":null,"url":"http://www.thehuntleyhotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.01871,"lon":-118.50113,"accuracy":"ROOFTOP"},"type":"hotel","id":26496,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"We stayed at this hotel for one night before our long haul plane trip home and it was very comfortable and well set up. It is not super deluxe but it is clean and very comfortable. Service was very good and the steak house is well set up (massive meals though). Bar in restaurant area was friendly and service was quick and efficient. Staff were very friendly and approachable and we asked for scales to weigh our luggage and they were brought up promptly. For what most people would use this hotel for - stopover and/or being close to the airport we found it met all our needs. Hallway decor is a bit tired, but the rooms were fine. Neutral tones and unfussy decor. We are fussy about our lodgings and we really could not complain about this hotel. The red trolley bus that takes you to Manhattan Beach and some shopping precincts is just across the road and only costs $5 per ticket which you can purchase on bus. Airport shuttles come every 15-20 mins and are free. If you are looking for a character filled hotel with special touches, then this probably will not be for you, but for good value overnight or weekend stays close to the airport we have stayed in far worse. We would stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Clemens Parker","date":"2014-05-08 14:55:53 +0300"},{"content":"Stayed for one night after an evening flight to LAX. Shuttle to the hotel was fairly regular (about a 10 min wait). Bit of a queue checking in, but we finally got our room. Room and en-suite were reasonably spacious and quiet but had a musty smell. No doubt, we could have asked for another room, but we decided to live with it. Staff at the bar were friendly and efficient that evening. The following morning I had a quick work out in the well equippped gym (it was nearly full at 5.30 a.m. -these west coast people take their health seriously). After the work out, we were served a great breakfast by staff who were just a good as the previous evening. On leaving, the concierge quickly called up a taxi to take us on our way.","ratings":{"Location":3.0,"Overall":3.0,"Value":3.0,"Service":4.0,"Rooms":3.0},"author":"Priscilla Cummings","date":"2012-06-04 03:37:31 +0300"},{"content":"Great airport hotel and value for price. I commonly stay here and at another Starwood property. They were updating the lounge area during my last stay and looking forward to the addition. Hot tub was not quite hot enough but hopefully easy to rectify.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Adolfo Wiegand","date":"2014-04-06 09:00:04 +0300"},{"content":"Not worthy of the Westin name. I should have listened to the warnings in the prior reviews. Don't make the mistake I made. Sheraton gateway down the road much much better","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Esmeralda Upton","date":"2013-11-24 06:48:11 +0300"},{"content":"I love this hotel. I always feel like a VIP. You're met at your car, luggage taken care of and valet is great value. The lobby is beautiful and the concierge is always available to assist with ANYTHING. If you're a newby to LA they can assist you in finding tours that pick up at the door and return you after your tour. The pool area is beautiful and the jacuzzi needs some TLC but I dealt. The heavenly beds are truly heavenly and the free toiletries are good, soap was great (the simple things). I would recommend this hotel to anyone wanting to stay in luxury for a fantastic price.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Amy Paucek","date":"2012-02-11 13:36:30 +0300"},{"content":"My family stayed at the Westin Los Angeles Airport in early June as we arrived into LAX on a late flight and our stay was excellent. The check-in process was easy and the staff was more than eager to help with all of our luggage and getting us into our room. The room was very clean and the beds were very comfortable. This was my first time to travel out to LA with my young children and the staff at the Westin Hotel did a great job making my boys feel welcomed. Since I was traveling with two young boys, I thought it would be great to have a view of the planes taking off and landing outside of the hotel window. I specifically requested a high floor with a view of the airport and that is what I received. I will say that being so close to the airport and in line with the flight path, one would think that the jet engine noise would prevent a great night's rest, well I was wrong. The rooms are insulated very well from the noise, so you would see planes landing, but you could barely hear them, which was great for my wife and I. I would recommend this hotel to everyone. Thank you Westin LAX for a great place to stay.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ally Kunze","date":"2012-10-15 04:40:08 +0300"},{"content":"comfortable and clean. Got a good nights sleep. Restaurant excellent. Evening meal very good and breakfast of limited choice but well presented. Service fast and good.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Coty Trantow","date":"2013-02-19 08:36:29 +0300"},{"content":"There are two reasons why I always choose this hotel when I'm on a short transit trip to Los Angeles: 1. It is conveniently located near airport and rental cars - you can take a free shuttle from airport and you literally walk to rental cars - the closest office (Fox, Payless and a few others) is just across the street. 2. You can stay here on a very cheap SPG points rate - just need 3K points. As all my business expenses are coming out of my own pocket, I have to sometimes stay on points and this is the perfect place to spend them. Other than that it is a consistent mid-range hotel geared towards business traveler and airline crews. The only inconsistent thing is parking charges - I still cannot figure out why sometimes they charge for parking and sometimes not. Some of the rooms can be noisy due to airport proximity, but overall sound isolation is quite good. If you have SPG status, there is an executive lounge that even serves some kind of breakfast, but I was leaving early so cannot comment on the quality or quantity.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Anabelle Harvey","date":"2012-06-28 13:28:46 +0300"}],"public_likes":["Dr. Amy Monahan","Dr. Claudine Dare","Arely Cormier","Harley Price","Erling Beahan","Rickey Will DDS","Leanna Johns","Katlyn Predovic"],"vacancy":true,"description":"A luxury hotel featuring a business center, fitness facilities, concierge service, and fine dining at The Penthouse.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}