{"title":"Chippenham","name":"Number 35 (B&B)","address":"35 Marshfield Road, Chippenham, SN15 1JT","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi. At the roundabout, take the 1st exit continuing straight onto ''Malmesbury Road(B4158)'' for 0.2 mi. Turn right onto ''Hardenhuish Lane(B4528)'' for 0.8 mi. At the roundabout, take the 1st exit left onto ''Bristol Road(A420)'', B&B will be on the left after 0.5 mi. Turn right opposite into ''Audley Road'', and immediately left into ''West End Social Club'' car park (please ask at reception for a permit to display in your car)","phone":"+44 1249 660691 or +44 7968 374763","tollfree":null,"email":"info@numberthirtyfive.co.uk","fax":null,"url":"http://www.numberthirtyfive.co.uk/","checkin":"5.15pm weekdays, 4pm weekend","checkout":null,"price":"Rooms from £75 per night with a £15 reduction for single occupancy, includes full English Breakfast","geo":{"lat":51.4631001,"lon":-2.1237651,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5842,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"Everything about this hotel was great except for 2 things.......They do not have ESPN. Being a football fan, I was unable to watch Dallas play on Monday night. Also they do not have TNT...which had the Heat v celtics game. The wireless would not work at night both nights i was there, but they do have free computer access in the lobby which was a life save As a sports fan the hotel is 1 star. As a business traveler the hotel is 5 Star","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Dr. Berenice Ritchie","date":"2014-09-12 23:31:54 +0300"},{"content":"With in walking distance of a nice mall, an Argentina Bakery, and a few other businesses. Pool was open. Staff was friendly. On the down side there was something dirty-looking in the bed the first night we got there. We followed the instructions on the \"save water\" brochure that is becoming common in hotels to indicate the sheets should be changed. They weren't. We asked and they did change them but we had to do a lot of explaining about why we wanted it done etc. The shower was luke warm but never got truly warm. The complimentary non-alcoholic mojitos and cookies in the lobby each day was a nice touch.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":5.0,"Location":4.0,"Rooms":3.0},"author":"Ivy Cummings","date":"2013-10-12 07:04:18 +0300"}],"public_likes":["Alexane Trantow I"],"vacancy":false,"description":"Number 35 is an elegant, late Victorian house. The recent refurbishment has made the most of the period features but has given a 21st Century feel, with free WiFi throughout the house. All of the rooms are equipped with a flat screen digital TV, DVD player, hairdryer and hospitality tray with tea, instant and decaffeinated coffee, hot chocolate, mineral water, biscuits and chocolate. En-suite shower rooms with electric showers, under floor heating, heated towel rails and a range of complimentary quality toiletries. Bathrobes, slippers and extra towels available","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}