{"title":"Wikivoyage:Listings","name":"Hotel Eldorado","address":"rue des Dames 18","directions":"17th, metro: Place de Clichy","phone":"+33 1 4522 3521","tollfree":null,"email":"eldoradohotel@wanadoo.fr","fax":"+33 1 4387 2597","url":"http://www.eldoradohotel.fr","checkin":null,"checkout":null,"price":"€23-39 sgl, €49-79 dbl","geo":{"lat":48.88487,"lon":2.32478,"accuracy":"APPROXIMATE"},"type":"hotel","id":34195,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We stay here for three days before our cruise. We were excited to be back at this hotel but to our surprise we were very disappointed. The grounds were not like they were when we stayed here before. The food quality wasn't superb like before. The room we stayed in on the 5th floor, ocean front had many red ants that bit us up. It was horrible. We complained about this situation and the management didn't even care. What happened to this wonderful place!!!","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Ludie Walter","date":"2012-06-03 19:58:26 +0300"},{"content":"The hotel itself is a pretty standard \"Western Hotel Chain\" 4 star. Everything was good, so I'll just mention the problems/suggestions. When my girlfriend and I arrived Tuesday night at 7pm our room wasn't ready, so in response they offered us \"free drinks at the bar while we wait\", so we thought that was appropriate given check-in is 4pm. Finally at 8:30pm, our room was ready. Our room had a partial Ocean view, facing east 15th floor. The balcony view was great but the problem was that the bathroom was sooo small! I mean I have stayed at hotels with closets bigger than that! We learned to live with it though. The room itself was small too - I have stayed at hotels with bathrooms larger than that room, lol. We booked a deal for $150/night while the published rate was $300/night. I'd be pretty pissed if I'd have paid that for the room that we had. The other problem was with housekeeping. We stayed 9 nights, and they didn't change our sheets the entire time! I knew this because the first night my girlfriend's makeup smudged on the sheets and it was still there when we checked out. We only ate at the beach bar and the food was pretty good, maybe a little overpriced, but not by much. In the end, we found that it was actually a great hotel for just relaxing by the beach all day, which caused us to simply forgive the hotel for its obvious issues.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Eda Dooley","date":"2014-04-29 06:43:38 +0300"},{"content":"The Marriott was a great place to stay in Puerto Rico, the staff were very friendly and helpful, and the facilities were lovely. My only disappointments were that the room was musty and nothing would dry, even when the AC was on. It is unpleasant to have to put on a damp bathing suit the next morning! Also, the spa facilities were a disappointment - I tried to schedule a pedicure, but there was very limited availability for services, so I had to go without. I also wish the hot tub was bigger - it was often full of folks, and so unavailable to me.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Raymond King","date":"2013-08-27 23:49:20 +0300"},{"content":"Hotel location excellent for eating, shopping,and short taxi ride to Old San Juan. The hotel staff was the most accommodating, helpful group of personnel I have ever seen in 1 hotel at the same time. Friendly \"good mornings\" like we were old friends. Definite return trip in the future.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Courtney Konopelski","date":"2012-07-04 13:50:16 +0300"}],"public_likes":["Amelie Beatty Sr.","Dr. Sister Kuphal","Jeffrey Williamson","Maymie Padberg"],"vacancy":false,"description":"The Eldorado, a former ''maison de rendez-vous'', was once home to the kept women of the 19th century bourgeois. Now a very cute ''no'' star hotel, its charm more than makes up for what it lacks in amenities (who needs a TV in Paris anyway?). The  staff are super friendly, the décor is garage sale chic, and there's a lovely courtyard that fills with neighbourhood hipsters on warm evenings. It also has a very good location and you can easily avoid the noise of Pigalle or Montmartre's high prices, but they're within stumble distance if you decide to explore. For early risers breakfast (€5, until 10:00) is served in the attached restaurant/bar. Some English spoken, especially for those who pet the cat sprawled across the reception desk.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}