{"title":"Farnborough","name":"The Aviator Hotel","address":"55 Farnborough Road","directions":null,"phone":"+44 1252 555890","tollfree":null,"email":null,"fax":null,"url":"http://www.aviatorbytag.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.278736,"lon":-0.75482,"accuracy":"APPROXIMATE"},"type":"hotel","id":9084,"country":"United Kingdom","city":"Farnborough","state":null,"reviews":[{"content":"This place is not what was described on the internet listing or what I was told over the telephone. I was a single traveler staying for several days to enjoy horseracing at Del Mar. The hotel looks nice, but the service is terrible. I was told over the phone that I could get a free schuttle to the track, but in the morning I was told those are \"only for wedding parties.\" My room was nice. I was able to see the same dirt on the carpet every morning of my stay. I guess they don't vacuum. I ordered room service and it never came, twice! The female bartender was just nasty. I understand you need to talk to your friend on your cell, but could you get me the drink first? I also read that there would be cookies. Never saw any of them. When I checked out, I told the hotel clerk that my stay was terrible, he offered me a free night at the hotel. Why would I want to stay? There is a Hampton and a Marriott across the street. I don't know if they are any better, but I would consider them first next year when I visit Del Mar.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":3.0},"author":"Jayde Green","date":"2014-08-27 12:34:39 +0300"},{"content":"Priceline (name your own price) $65 bucks. Can't beat that deal in San Diego. Stayed at this hotel Sunday and Monday for Labor Day weekend '08. Loved the pool area. It had a large main pool, nice size spa, and a kiddie pool for the children. Customer service was unbeatable!!! Free convenient parking (which is always nice in San Diego). Room service was offered until 11PM and was delivered very quickly. Amazing \"Sweet Dream\" bed!!! Lots of towels in bathroom. Pretty much a great hotel for the price I paid. I noticed that the hotel was very pet friendly for those of you taking your little doggies. Would stay here again on business.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Jeramie Goodwin","date":"2014-08-04 15:27:28 +0300"},{"content":"Great deal in December. I have never stayed at a Doubletree before, and frankly, I was a bit afraid! (Fairmont and Ritz, yes, but what is a Doubletree?) It was great. Free Parking. Great cookie w/ check in. Great location. Beds were decent. Not 5 star, but really comfortable. Rooms were clean. Maid service wonderful. No, we didn't have the beds turned down in the late afternoon, nor were bathrobes provided, but it was a delightful cheap and cheerful vacation, and I would do it again in a heartbeat! I actually liked the fact you could \"do your thing\" at the hotel without having to interface w/ alot of employees~ A great stay and I will not hesitate to book there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Buck Hartmann","date":"2015-04-20 15:17:20 +0300"},{"content":"Very Neat, Family operated Motel with all you need to have a vacation in San Diego, CA. One needs to rent a Car in San Diego any way for having an all inclusive vacation. Rooms are small but clean. Located closed to Marina, view is good and excellent seafood restaurant on a walking distance. Mitches Seafood was my favorite. Vey inexpensive. Morning coffee, Juice,fruit, yogurt and muffins available for breakfast. We had plumbing problem in our room which was propel fixed.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Maryam Parisian","date":"2013-09-25 20:24:43 +0300"},{"content":"Drove to the Dolphin from the San Diego Airport in 10 minutes! We arrived later in the evening and were happy to have our keys handed to us almost as we walked in. The rooms are small, but VERY CLEAN. Great linens. Breakfast is served in the small courtyard and consists of muffins, yogurt, juice, bananas, and coffee. Just right! The staff and owners make you feel at home and are extremely helpful. Will definately come back. Best budget motel we have stayed in.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Haleigh Kreiger","date":"2013-12-07 14:09:42 +0300"},{"content":"First off I want to make clear, this is a Basic, affordable Motel. With that said I want to rave about my Stay! I found this Motel off of Trip Advisor and all the great reviews. They are not wrong and this is why- My Dad, Son and I reserved two rooms. They were clean beyond belief. They have a wonderful little patio set up for breakfast in the mornings. The Family that owns the place actually work it. The Father shows up in the morning, giving out hot apple pie and visiting with guests While the continental breakfast is being done. The son is there as well and extremely helpful with tips about the area. On one of our days we wanted to go to an IN & OUT BURGER due to my son wanted to try it and the staff Thomas found one for us and gave us a GPS to use. On our day before we were to leave another great staff member did our boarding passes while we were at the San Diego Zoo. I would love to do a shout out to Steve and Thomas. We were in town to do the Midway Museum and this little motel made my Dad feel at home. It is in a great location surrounded by much higher price property's but I can assure you, this will be your place of choice in Point Loma from your first stay on......","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Rickie Gislason","date":"2014-07-13 02:43:42 +0300"},{"content":"We so enjoyed our stay at the Dolphin Motel near Shelter Island, SanDiego! We have been visiting SD for over 4 years and have stayed in many hotels from Oceanside to Sanysidro, from o the bigger chains to the little trendy ones down in the Gaslamp district, to the highrises by the harbor, and we have to say that The Dolphin was just perfect for our needs. We love traveling around the area and so most of the time we spend in a hotel is to sleep and take a shower, well we had just what we needed and it was clean, efficient and just right. The folks there are so nice and very helpful. We arrived in SD around 9 AM and our room was all ready for us to take a nap after traveling all night. That in itself was a very pleasant surprise. And that it is located right in the middle of all of the boat action, yacht clubs, we were delighted. We decided to use public transit, so the bus stop was right there, and it was easy to connect with the trolley as well. We have rented cars before while visiting, but because it was so easy to get around using transit, we loved staying there at the Dolphin. We weren't at all disturbed by noise from the street, but if you have a problem with that, just use ear plugs, but truthfully the white noise from the air unit took care of that. The rooms are small, but adequate and the shower is great, no shortage on anything. Wifi, anything that you may need, and breakfast outside in the courtyard. Everyone was so nice, not a grumpy one in the bunch. Where have you been all our lives , Dolphin, we will be staying there again probably next summer. Do not hesitate to stay at the Dolphin, of course if you would rather spend a lot of money go elsewhere. We love the Dolphin and hope all reads this as a total 100% recommendation.I do think that this is one for quieter people, they don't allow loud parties so be mindful of that.There are places in the area for partying, just call a cab to get home. Or do like us and walk. One highlight for us was the trip to Pt Loma lighthouse, just walk down the street and catch the bus, it is a beautiful place. Thanks Dolphin!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Raymond Stiedemann","date":"2012-10-11 16:32:02 +0300"},{"content":"I was doubious about staying at the Dolphin. The main thing that changed my mind was not just that it is one of the most affordable motels in San Diego, but that it's proprietor takes the time to read all these reviews and actually responds to many of them. That is the mark of someone who truely cares about his business. My husband and I stayed at the Dolphin for 5 days towards the end of October. Although the weather was disappointing the Dolphin was not. The building itself is an older building but it is very well maintained. Yes, the rooms are small, but the bed is very comfortable and the room was very clean and everything in it worked great - especially the shower (great water pressure!). A continental style breakfast was provided every morning in the courtyard - coffee, juice, bananas, yogurt, muffins, McDonalds apple pies,etc. We never had a problem finding parking. The staff was very friendly and attentive to our needs. Even before we arrived for our stay, we were notified that the motel and surrounding area would be out of power the night we were to arrive. Jess provided us with a flashlight when we arrived. It is so rare to find people who actually enjoy thier job. Well, it was obvious that these folks do. I think the friendly and relaxed atmosphere that the staff creates, causes thier patrons to be more friendly as well. Whenever, we'd pass through the courtyard, other patrons would say hello or good morning. You're lucky if other people even look at you in public these days! My only advice to future patrons would be to be ready for thin walls. The folks next to us were not especially loud, but we could hear them talking pretty clearly through the walls. We turned the AC/Heat unit in the room on \"fan\" and that helped alot. So, if you are a light sleeper bring earplugs or turn on that fan. Otherwise, the other patrons were very respectful of the \"9pm-9am quiet time.\" Thank you to the Dolphin for running such an affordable and pleasant establishment! We'll definitely stay here again if we ever travel to SD again. ~M. Walsh","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Katelyn Abbott","date":"2013-04-27 04:54:43 +0300"},{"content":"We booked a room at the Dolphin Motel based on their Tripadvisor reviews and we were not disappointed. My husband and I were in Carlsbad visiting my sister but we needed a room in San Diego because we were flying out of the San Diego airport very early in the morning. I wanted to get a room near the airport without paying downtown prices. The motel was great. The rooms are small and sparse but VERY clean. The motel is right across the street from the harbor and within walking distance of several nice restaurants. The staff was very nice and gave us some wonderful advise on where to go and what to see in San Diego (our last day in town). I would definitely stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jenifer Cormier","date":"2012-11-17 22:58:05 +0300"}],"public_likes":["Tianna Russel","Danielle Wintheiser","Jaquan Larson","Shayna Hodkiewicz","Mckenzie Hand"],"vacancy":false,"description":"Farnborough Road. A four-star &quot;luxury&quot; hotel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}