{"title":"Birmingham (England)","name":"Holiday Inn Express Birmingham-Snow Hill","address":"1 Snow Hill Plaza","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48483,"lon":-1.89842,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3612,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"There's not much more to say about the Hotel Burnham, but we love it just like the rest of the reviewers here. I think it's a great value for the location and everything else about the hotel. Service was great. The only downside was rooms don't have coffeemakers....however, when I asked one was sent to our room immediately. Restaurant was great for dinner and breakfast. This has become \"our\" hotel in Chicago. Oh, you can't beat location on blue line of subway, which takes you right to OHare.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0},"author":"Magdalen Kilback","date":"2015-06-21 21:06:09 +0300"},{"content":"Great boutique hotel - we've stayed here before several times and loved it. HOWEVER, they're building across the street, which isn't the big problem, although a bit noisy. The big problem is the city of Chicago is doing street repair in the middle of the night. We were there the weekend of April 20, 2007 and at midnight the jack-hammers were still pounding. When I managed to fall asleep, at 1:30 am, I was woken by the noise again. It went on all night. Since we were staying the weekend - management moved us to another Kimpton hotel, but what a hassle. Again - great hotel, but wait before you go. We heard from one hotel employee this has been going on for a while and is going to continue...for a year! Go only if you can sleep through anything.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":1.0,"Value":1.0,"Rooms":5.0,"Location":5.0},"author":"Florine Blick","date":"2012-12-21 02:44:09 +0300"},{"content":"We spent a night here while in the area visiting family over Christmas, and had our dog with us. The Kimpton group, which owns this hotel, was always pet friendly when we had stayed at their other properties, and were just as much so here. Our dog is a 55 lb Shepherd mix, not a little lap dog, and that didn't phase them either. If you aren't into travelling with your pets, however, this place is still a gem. And as an aside, I didn't see anyone else there with their pets during our stay, so I would doubt the place is overrun with them for people who don't like animals. They also had us on a pet-friendly floor - so presumably you could also make sure you were on a floor without animals if you had allergies or something. The pet friendly rooms did not smell wierd or have anything wrong with them, they seemed just like all their other rooms - just, presumably, away from people who didn't want to be by animals! The location is fantastic - you could walk to all the great downtown spots from here, and you are smack in the middle of the theatre district. The rooms are small - but have very high ceilings and practically floor to ceiling windows, so they feel much larger than they are. Nicely decorated, that is the Kimpton hotel \"thing\" - all their properties are funky, boutique, edgy but always comfortable. Great bed at the Burnham, which I have luckily also had when staying at other properties of theirs. We didn't eat at the restaurant because we had other plans for our meals while there, but it was always full of people and the menu looked appealing. Staff was very friendly, even when our dog woofed at those wearing hats (she's a Shepherd mix, what else can I say?) and helpful (with directions and similar). We paid $152 + tax and valet parking - and again I think this is one of the best values for the money in downtown Chicago. We have stayed at a number of downtown hotels over the years - and (with or without our dog), this is definitely a hotel we would come back to next time.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Rene Halvorson","date":"2014-05-28 00:50:50 +0300"},{"content":"Was booked into this hotel as others were full and was pleasantly surprised. Have been told this was an old speakeasy and retains some of its charm, though it is hidden away behind an unassuming front. Antique elevators add some character to the hotel. Staff was attentive and generally very good. Room was very small for the price, but perhaps expected for Chicago. Location also great in bustlng area -- across from Marshall Fields, and a few blocks from tourist area on Michigan Avenue. A bit pricey, but met expectations for a hotel of this price range.","ratings":{"Overall":4.0},"author":"Philip Becker","date":"2013-01-15 19:44:50 +0300"}],"public_likes":["Miss Irma Hauck","Mozelle Muller PhD","Delpha Olson"],"vacancy":true,"description":"The tall tower with 224 rooms has relatively large common areas and everything expected of a Holiday Inn Express, including free WiFi and breakfast included in the room price. It replaces the older property which now became the ibis Styles.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}