{"title":"San Francisco/Union Square-Financial District","name":"Omni San Francisco Hotel","address":"500 California St","directions":"at Montgomery","phone":"+1 415 677-9494","tollfree":null,"email":null,"fax":"+1 415 273-3038","url":"http://www.omnihotels.com/hotels/default.asp?h_id=62","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.793,"lon":-122.4031,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26232,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I loved the Bowery and also the Maritime and I was excited to stay here. I stayed in a Captain's room. It was a profound disappointment. There were quite a few things I didn't like: - The window to the room are prison sized - The mattress is uncomfortable - The power off thing makes it very uncomfortable in the room on a hot day. - The housekeeping staff gave me 2 shampoos but no shower gel. When I asked for that to be fixed I was brought up 2 conditioners. okay.... - The TV signal seemed really off. Not that I spend much time watching TV in NY but it was kind of annoying. - The bar downstairs was 'closed for a private party'. Apparently this happens often. Also there aren't always cabs outside as the hotel is pretty out of the way.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":2.0,"Value":2.0,"Service":2.0},"author":"Nayeli Jaskolski","date":"2015-05-17 04:10:08 +0300"},{"content":"The Jane suited me perfectly. All I wanted was a room to crash and store my shopping as I wasn't planning to spend a lot of time in my room. It was tiny but plenty of storage which was designed creatively. Cafe Gitane downstairs served fabulous food and the citron presse was DELICIOUS! Each time I left and returned, I was greeted with in a friendly manner and on the whole, I was extremely pleased with my stay. Will I return? $@!#%, yes! I read some of the negative comments but I honestly think the reviewer's expectations may have been somewhat unrealistic. That said, my friend arrived and had to book the Captain's room as the hotel was fully booked. I found it roomy and spacious, with a fantastic view. The air-conditioning worked and the room was truly well-lit. Not sure if the reviewer was simply being somewhat \"high-maintainence\" .","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Haskell Schmitt","date":"2013-04-25 10:54:00 +0300"},{"content":"I stayed at the Jane for a little under a week. It was my first trip to NYC and I knew I didn't have a lot of time or money to spare in my short visit, so it was the perfect call. Located in a great neighborhood just a few short blocks walk (not even a hassle despite the cold) from the 8th and 14th station, everything about this place was great. The staff were beyond helpful. I made a rookie traveller mistake in regards to my credit card and they were incredibly patient throughout the entire thing. They helped me with questions when I had them & were always friendly. Yes, the rooms are small. European travellers are used to this sort of thing, it's close to the common size of many rooms overseas. But you're in NYC. The last thing you should be doing is spending your time in your room! The beds are comfortable and the temp was perfect if I just opened my window a tiny crack. I showed up during the big bedbug scare and had no problems whatsoever. My room was clean as were the bathrooms. I'm planning a trip back in a few months. This trip I have a good deal more money to spent, but even after spending time looking at all the other hotel options out there? I think I'm going to stick with the Jane. Maybe get a captain's just to see the difference, but no matter what room I end up in I know I'm getting a great value & unique experience for my dollars.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Micah Lehner","date":"2012-05-31 01:22:05 +0300"},{"content":"After experiencing The Jane last August, with it's pros and 'Heads-Up!', I returned for the Xmas season. PROS: Once again, the facilities are lovely; rooms cozy; staff pleasant. HEADS-UP: We were on the fifth floor this time, ...yet the noise from the bar/lounge, 5 floors down, could be heard throughout the night. Furthermore, upon returning to the hotel for the evening around 10ish, we fancied a drink in the \"bar/lounge of our hotel.\" We were denied and told that there was a \"private function.\" Wha? on a Saturday night?? So EARLY in the evening??? This is NEW YORK, where I've recently lived for the past 3 years, ....\"\"\"\"Private Functions\"\"\"\" for \"\"\"kool people\"\"\" don't start until well after MIDNIGHT!!!!!! (Being told you can't experience the Bar/Lounge of your OWN hotel is a bit off-putting!). Lastly, if you desire peace and quiet, request a room on the interior of the building. Rooms that face Jane Street, such as (roughly) odd number rooms (Floors -1)(-2)(-3)(-4)(-533-549) [we were in 543A] face Jane Street AND 'highway-esque' West St (along the river), are noisy because the A/C unit acts as a quasi 'hole' in the window, as if the window is open, and all the traffic noise just pours right through. I'm 30-something, ....maybe 20-somethings can sleep through anything, like I remember I used to! Other than that on this winter's experience, novel place! Come all, but just prepare!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":3.0},"author":"Alycia Mueller Jr.","date":"2012-07-16 12:59:12 +0300"}],"public_likes":["Rolando Connelly","Camron Marvin","Horace Price","Werner Gulgowski"],"vacancy":false,"description":"A luxury hotel with marble floors and wood paneling in the lobby and very nice rooms.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}