{"title":"San Diego/La Jolla","name":"Residence Inn La Jolla","address":"8901 Gilman Dr","directions":null,"phone":"+1 858 587-1770","tollfree":null,"email":null,"fax":null,"url":"http://www.marriott.com/hotels/travel/lajca-residence-inn-san-diego-la-jolla/","checkin":null,"checkout":null,"price":"$250-280","geo":{"lat":32.86955,"lon":-117.2376,"accuracy":"ROOFTOP"},"type":"hotel","id":25201,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Stayed in this hotel twice in the last 2 weeks. First time, absolutely wonderful - Hilton Honor Diamond reward in room, awesome fitness center and the staff could not be any nicer. Second stay, no Hilton Honor reward given in room and the fitness room was a mess - told the front desk that it needed to be tended to - the second day, the room was even more of a mess - oh well... The fitness center, even with the mess, is 100% better than most of the fitness rooms in other hotels. Would definately stay here again - travel each week for business and if all that is wrong is as described above - and all for $99 bucks a night - then count me in.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":3.0},"author":"Santa Cummerata","date":"2014-01-23 22:56:09 +0300"},{"content":"This was our second stay at this property and we again were not disappointed. We found the staff to be nice and generally helpful. The breakfast buffet is very good with lots of fresh fruit and hot food. The only complaint is that the pool area needs washed down and I had to call for more towels on two occasions. Otherwise, I think this property is a good find for almost anyone staying in the airport area.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Lea Sauer","date":"2012-04-11 00:34:23 +0300"},{"content":"Needed to stay in this area, as it is close to family. Several other hotels (resorts) in this area were $200-$300 a night. We got a suite room for in the $80 range. A regular room was in the $50 range. The suite is definately worth the price as the room is huge with a couch, several chairs, desk, bar area, etc. The bathroom was plenty big too. Everything was clean. If you reserve online, make sure you request a pool side view. The other side of the building is just parking lot, and not much to look at. The front desk person said they went through a major rennovation this year and are going to do the outside next year (2012). The staff were all very friendly. The breakfast in the morning was good. Nothing super fancy or crazy, but they had eggs, sausage, home fries, warm oatmeal, make your own waffles, etc. The pool area and jacuzzi were good. They even had towels out there. The airport shuttle was wonderful and very timely. Occassionally we could hear a plane way off in the distance, but overall it was very quiet. Not sure if we just didn't have anyone around us, but it was incredibly quiet. I am sure that someone who is extremely picky would find things wrong with this place. It is kind of set on a corner by a gas station right off the freeway. So, it's not in a 'fluffy' location, but it is nice, it's clean and we never once felt unsafe. Considering what people had to pay close to this location, I'll take this hotel any day.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nikki Kutch","date":"2014-01-24 02:00:48 +0300"},{"content":"We spent the last two nights of our 16-day Western vacation at this hotel and I wish we could have spent the ENTIRE vacation there! It was a great hotel at a good price. It was everything you would expect of a Hampton Inn: great breakfast, clean and comfortable rooms, good parking, friendly employees, everything... There is no nearby restaurant, but they operate a free shuttle service to restaurants and shopping centers upon request. I wish we could have moved this motel to every place we visited during our vacation!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jakayla Hickle","date":"2015-07-08 06:00:02 +0300"},{"content":"We stayed at the Hampton Inn and took advantage of their airport shuttle. We checked in at the hotel, took our rental car back to the airport, and then called the Hotel to come and pick us up. If you are unfamiliar with the Phoenix Airport and their transportation to rental cars, take our word for it. It's cumbersome and crowded. The shuttle from the Hampton runs 24 hours a day and takes about ten minutes to get to or from the airport. The hotel is clean and the staff is very friendly. There is an English pub attached to the hotel which has an extensive beer list and a decent menu. If you're more in the mood for quick food, there's a DelTaco nearby. The beds are extremely comfortable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":3.0},"author":"Domenico Marks","date":"2015-07-14 04:08:48 +0300"}],"public_likes":["Dorothea McKenzie","Elwin Corwin","Lew Jewess","Ms. Fay Koepp","Jacinthe Hartmann Jr.","Ulices Gulgowski Jr.","Thad Murray"],"vacancy":false,"description":"A very pleasant suite-style hotel. It is in a quiet area of La Jolla, very close to the University of California at San Diego.  The rooms are spacious, with full kitchens. It includes a pool and hot tubs located close to the rooms. There are BBQ grills in the small common patio between the buildings. Within walking distance there is a nice shopping center with several restaurants and grocery stores. Free high speed internet access.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}