{"title":"Santa Monica Mountains National Recreation Area","name":"Thornehill Broome Beach Campground","address":null,"directions":"10 Miles north of Sycamore Cove campground on Pacific Coast Highway (California Route 1)","phone":"+1 818 880-0363","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$35, $225 to reserve larger group campground.","geo":{"lat":34.0856,"lon":-119.03678,"accuracy":"APPROXIMATE"},"type":"hotel","id":37592,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"Friendly staff and nice size rooms but the building is a little run down. Also the lobby and other street level access is not wheelchair accessible from the elevator. The elevator opens on its own level and you have to walk up or down stairs to get out of the hotel. Strange set up. It was difficult getting a cab from in front of the hotel. It seemed a little expensive for the odler style rooms and building. One good note-it is attached to a Seattle's Best Coffee and across the street from a great Italian restaurant.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Rose Schiller","date":"2014-01-14 09:18:30 +0300"},{"content":"Had an excellent stay here! The rooms were clean and cozy. The bed was super comfy (I am a huge critic on hotel room beds, I hate when they aren't comfy). Free wifi was a super plus! The front desk was helpful and kind. When we asked for a late checkout they were quick to accept our request. The location of the hotel is phenomenal, super close to all shopping, Pike Place market, good restaurants and many more great attractions! There is a coffee shop in the hotel as well! I highly recommend this hotel!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ruthie Aufderhar","date":"2013-01-30 09:27:59 +0300"},{"content":"This was our second time staying here, So I already knew the location was great and a good value. This time with our booking we had the hosted wine reception with our package, and it was amazing! The host Roberto was so welcoming, friendly and knowledgeable about the city. He even ran across the street and got a newspaper for us!!!!!! He went above and beyond, and the wine was great. Yes the rooms are a bit smaller but the bed was comfortable! The location is great, you can walk to everything! and there's some great restaurants nearby. When we checked out, the Valet literally ran to go get our car! We will definitely be staying here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Larissa Friesen","date":"2015-04-25 18:55:38 +0300"},{"content":"Knowing nothing about Seattle, I checked on Trip Advisor for a well-located and not too expensive hotel. Overall, the reviews were very good and the location which is of utmost importance to us seemed excellent. It actually surpassed our expectations although the room was abit small. However, Seattle has so much to do that we were rarely in the room except to sleep. The staff could not have been nicer, the room was quiet and we were right across the street from the amazing library with buses (free from 6 AM to 7 PM) all around us. But since we are big walkers, we rarely took buses except occasionally since the hills are pretty steep getting back from the Waterfront. And the very elegant Fairmont was just one block away so this is in one of the finest neighborhoods in downtown Seattle.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Bret Stamm","date":"2012-01-17 12:14:57 +0300"},{"content":"I stayed only one night in a Superior Queen room with one of the hotel's \"Hot Escape\" rates, August 2011. I was in Seattle, sadly only for one night, to meet my sister in law and niece who were coming to visit from Munich. I must say the hotel was perfectly fine. The front desk staff were superb; nice, friendly and professional (typical of Pacific Northwest people). We were in different rooms types on separate reservations but were accomodated on the same floor of the hotel. The room was great, looking out on Spring Street. It was a little careworn, but very clean and the bed, built in drawers and other furniture was in good condition. The hotel was obviously older and had lots of interesting places to put things. The bathrobes in the closet are always a nice touch. The bathroom was very nice, on the small side, but well appointed (shower/tub combo was great). I don't need a huge bathroom, since it is only used for a very limited number of necessities; however there was plenty of shelf space to put toiletries, etc. on. We didn't use the inhouse restaurant, but did have a lite breakfast in the Seattle's Best Coffee shop in the hotel. The hotel's location is wonderful!!!! We parked the car (using the self park option in the garage right next door) and didn't need it at all for the day and a half we were in Seattle. You can walk everywhere, so convenient to everything. Slept well the one night as the bed was comfortable and check out the following day was easy. We stored our bags for much of the day without a hitch. I would stay again next visit to Seattle, location, rate and comfort were all A+.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Garnet Batz","date":"2012-06-08 19:21:06 +0300"},{"content":"Great centrale location, in middle of everything, great staff absolutely friendly and helping, a good 3 stars hotel. But room are hobbits-style, they r nice but very very small, first of all bathrooms. The worst? Breakfast. It's in close cafè: u receive a single pastry and a drink, just enough to go to have breakfast... elsewhere","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Miss Giovanny Morar","date":"2013-11-10 16:00:47 +0300"},{"content":"Not sure why folks are so down on this place. Our room was very clean, nicely appointed. Yes, the rooms are a bit small, but if you are doing more than sleeping in your hotel room while you visit Seattle, there's something wrong with you. ;) I would recommend this hotel to anyone looking for a reasonably priced hotel, conveniently located.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Javon Dooley Sr.","date":"2013-02-16 06:40:26 +0300"},{"content":"If you need to stay in Seattle downtown for couple of night and your travel funds is limited - you can try to choose this one. However, beware of some specific points you will face: 1. If you don't mind dust everywhere including bathroom shelves - stay here; 2. If you don't mind brick wall in 10 ft distance from your window - stay here; 3. If you dont mind paper walls and enjoy listening your neighbors - stay here. However, the staff is extremely friendly. I suppose, they have to be friendly in any hotel, haven't they?","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Wallace Schuppe","date":"2013-05-15 22:41:01 +0300"},{"content":"One of my favorite things about staying at this particular hotel is that it isn't pricey and the location is great. It's literally a block or two away from the station (I took the Link Rail from Sea/Tac to Downtown in 30 minutes for only $2.50). It's a short 5 to 8 minute walk to Pike Place, a MUST SEE if you're going to be in Seattle for any reason. The location is also perfect if you're wanting to go to nice restaurants and close to several interesting bars. It is also a 8 to 10 minute walk to the two malls: Westlake Center and Pacific Place. As I spent most of the time in Seattle wandering around and taking in the sites, I was only in my hotel room late at night and in the early morning. The hotel was fairly nice, it wasn't dirty or gross, but it wasn't like I was expecting anything too luxurious and I wasn't disappointed. The only real complaint I have about the place is that the rooms get a bit too hot and stuffy. The weather outside was nice and cool and the temperature in the room was the opposite. The first night, I turned on the a/c thinking it would cool some while I slept, but I woke up several times because it was hot and had to sleep without a blanket. I was able to open the window a few inches, and even left it open the entire day while I was out, but the room's temperature was still a little uncomfortable. Other than that, the staff was really friendly. I asked someone at the front desk about good bars and restaurants to go to and he provided me with a map and circled all his favorite places. His suggestions were wonderful!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Faye Fadel","date":"2015-05-28 22:43:12 +0300"}],"public_likes":["Syble McCullough","Titus Kozey","Dr. Cary Oga","Mayra VonRueden","Kari Huel","Claudia Gottlieb","Herbert Pagac","Nicolas Boyle","Lexus Crist Jr."],"vacancy":true,"description":"A drive-in primitive campground near the western terminus of the Backbone trail. Accessible from PCH.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}