{"title":"Pismo Beach","name":"Quality Inn Monarch Shores","address":"230 Five Cities Dr","directions":"Off of 101 Fwy.","phone":"+1 805 773-1841","tollfree":null,"email":null,"fax":null,"url":"http://www.monarchshores.com","checkin":"3PM","checkout":"11AM","price":"$89.00","geo":{"lat":35.137664,"lon":-120.629988,"accuracy":"ROOFTOP"},"type":"hotel","id":22456,"country":"United States","city":"Pismo Beach","state":"California","reviews":[{"content":"This hotel is in a fantastic location, close to the subway, central park and surrounded by great little dinners and restaurants. We stayed for 7 days and it was the perfect base for our first trip to New York. The room was spotlessly clean and the much comented on elevator was not a problem. The staff were friendly and helpful and a special mention to 'Landry' who was particulary helpful. I only have one problem, the beds were terrible. If you like a firm bed then its not a problem but if you are like us, then the beds were extremely uncomfortable. We did request a thick mattress cover to soften the bedc but couldn't be accomodated. Overall this hotel is great value for money in a peaceful location and we would stay again if the bed situation changed.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":2.0,"Rooms":5.0,"Location":5.0},"author":"Idell Blanda","date":"2014-04-08 01:57:03 +0300"},{"content":"The rooms are small but fine for two people. The fridge and the microwave are a nice added bonus. This was our first visit to New York and the location of the subways and the buses were a nice feature. The staff was very friendly and helpful. We stayed in a room with a double bed and a shared bath. Was not to sure about the shared bath but I think that we were the only ones that used the bathroom. It was always clean and stocked. We stayed on the third floor and had no view other than the other buildings but we were not in the room much and didn't care about the view because we were always out and about in the city. The lift always seemed to be mentioned a lot in the other reviews but we had no issues with it at all. Out wait times were releatively short and the hotel was very busy the whole seven days that we were there. I would definately recommend this hotel to anyone who is a first time visitor and wants to keep the cost down. My wife and I were very impressed. Also if you have special requests be sure and e-mail them. My wife has knee problems and we requested a stay on the lowest floor possible and even though we did not book the room thru the hotel (AARP Expedia) our request was acknowledged.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Faye Olson","date":"2012-09-18 07:50:00 +0300"},{"content":"For the past few years I had been staying at their partner hotel 20 blocks south on Broadway. Everything was fine. The decor was very attractive, the room was very comfortable with good storage space; you don't have to live out of your suitcase. The room had a good size refrig, micro and ironing board and iron. I thing that it would be nice if they upgraded the towels. The washcloths were like sand paper","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Scottie Armstrong","date":"2012-04-29 07:28:29 +0300"},{"content":"We were really impressed with the hotel - the room was PERFECT for us - 4 \"girls\" (Mum, one teenager and two 22 year olds) - roomy and clean. The guys on the reception were really friendly and helpful. The diner right next door was perfect for breakfast. The location was brilliant because it was only 2 stops on the express subway into Times Square (about 10 minutes)and the subway was right opposite the hotel. Also the hotel was a 5 minutes walk away from Central park. Loved it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Lucio Runolfsson","date":"2015-11-28 14:01:52 +0300"},{"content":"Just arrive back from 6 nights. We had a larger room (4 persons - 2 double beds) than we had reserve (1 double). So we had more than enough space. I think they really have a good cleaning staff, because the rooms are really clean. The location is super it is a small 10 min. walk to the park or the hudson. We went to see Times Square and i think it is crazy to stay there! The neighbourhood of the hotel is i think quit expensive. It is thank god not full with hotels. Broadway is busy but if you take a side street than you are in a quite people living neighbourhood. With metro (2 and 3 are really fast) you are so in a other place of the city.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Amir Buckridge","date":"2012-11-26 03:38:53 +0300"},{"content":"Stayed here two nights on business. Room was large, clean, well-appointed, and quiet. Nice bathroom with new fixtures. Wireless internet, flat screen tv, small coffee maker. Front desk staff very helpful. Junior Suite for $100 a night was simply a steal.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Joana Kling","date":"2015-09-21 12:51:47 +0300"},{"content":"After the hotel that we normally stay in jacked up their rates $200 more dollars a night - I decided to look elsewhere. I booked this hotel through a \"Trip Advisor Deal.\" I got the room for $113 plus tax - which is a total bargain in the city. I expected the accomodations could be marginal for that price. We were pleasantly surprised to find completely remodeled rooms with new bathrooms. We stayed on the second floor and had a mini fridge and private bathroom. The front desk staff was super friendly. While the UW side is not exactly the most happening part of town - the hotel was conveniently located next to the Subway. We left our luggage in the lockers on the first floor when we checked out. It was nice to know our belongings were locked up and safe while we finished our siteseeing ($5 for 24 hours). Will definately say here again. BTW - the breakfasts at the 24 hour Key West diner (next door) were cheap and very good.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":4.0},"author":"Nelson Ankunding","date":"2014-02-14 13:46:22 +0300"}],"public_likes":["Dr. Sedrick Ortiz","Candace Weimann","Abdullah Lang","Lea Conn","Joannie Kirlin","Mr. Mustafa Ullrich","Miss Travis Upton","Boyd Terry","Vivienne Mitchell"],"vacancy":true,"description":"Amenities include high quality furnishings, heated swimming pool, complimentary wireless internet access, free deluxe Continental breakfast, microwaves, refrigerators, coffee makers, irons, hair dryers and satellite TV in every room.  100% non-smoking.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}