{"title":"Keswick","name":"Keswick Youth Hostel","address":"Station Road, CA12 5LH","directions":null,"phone":"+44 870 770 5894","tollfree":null,"email":null,"fax":null,"url":"http://www.yha.org.uk/hostel/keswick","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.6019,"lon":-3.1344,"accuracy":"APPROXIMATE"},"type":"hotel","id":13701,"country":"United Kingdom","city":"Keswick","state":null,"reviews":[{"content":"Room was just ok. Staff at front desk were very rude. Me and my lady ate at the Moni Mi Gabi and the food was average & overpriced. The service there stunk too. Our waiter never smiled and neglected us. I left a whopping and well-deserved 50 cents tip. Nice lookin' hotel/casino, but if I was the hotel manager, I'd re-staff the place. 2 thumbs down.","ratings":{"Service":1.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":3.0,"Location":3.0},"author":"Lucio Robel","date":"2012-12-17 09:26:51 +0300"},{"content":"We generally stay at the Flamingo but wanted to try a different hotel this year. Overall we liked it. Check in: The line was extremely long and I thought we would be there forever but they handled it quite well and we were through in about 25 mins. The person at the front desk was nice and helpful and even though it was early we got our room right away. The Room: We had a room on the 23rd floor that overlooked the pool, the Eiffel Tower and the Bellagio fountains, very nice. The room itself was clean however the sheets were a little worn to the point there were some holes in them. The bathroom was a nice size, larger than most. The Pool: The pool gets plenty of sun, we were in the sun by 10:30 a.m. Doesn't seem to get very crowded which was nice. But by most Vegas pool standards, it was a bit quiet. And here is the part of the hotel I didn't like...the drinks at the pool were expensive. I got a large (but not that large) Bloody Mary and it was $18. Later I took that cup to have some ice put in it and they want to charge you $1.50 for ice. Never heard of such a thing and I hate being nickle & dimed. If I'm paying to stay at the hotel and paying $18 for a drink I feel I should be able to get ice without having to pay for it. This totally turned me off of this hotel. I have never stayed anywhere where you had to pay for ice. If seemed to be a general complaint of most people around the pool. Some people were going to the ice machines on the floors and coming out with ice in a bag. The food at the pool restaurant was okay but the service was horrendous. The waitress could barely speak English and seemed to have trouble understanding it, she had to bring someone over to help her. And the service there was very slow.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":2.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Demarcus Bashirian","date":"2012-05-29 17:06:11 +0300"},{"content":"First night on the strip, vert noisy moved to a mountainview room, much better and the room was alot larger, rate less than strip view. Also, we had dinner at Mon Am Gabi, the salmon was very salty, not worth the money and the steak was overdone, my husband order medium rare and the steak came out a second time medium.","ratings":{"Overall":2.0},"author":"Flavio Ebert","date":"2014-11-01 06:30:53 +0300"},{"content":"We found Paris a great hotel at a great price. Certainly there are cheaper but you can't beat the location. Our room didn't have a spectacular view (we checked in a little early), but the room itself was very clean and very big. The bathroom was great: again, big and clean. Safe didn't work and tv had problems (fixed shortly after problem reported) but we're low-maintenance travelers so it didn't diminish the experience of Paris. Restaurants were, as expected for the area of the Strip, quite pricey but still great. Pool was very nice: great music and good pool-side drink service.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Marcella Waters","date":"2014-10-11 18:49:36 +0300"},{"content":"I was in LV for a bachelorette party and we were in comp'ed rooms at the Paris so I obviously can't complain about the nightly rate! The rooms overall are okay but the beds and bedding desperately need updating. The mattresses are uncomfortable with zero padding between the sheets and the top of the mattress. The linens are so bleached that they are rough to the touch. We also were stuck in a smoking room (awful!) and although they came to spray twice it did not help. The smell permeates everything!","ratings":{"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Shanon Kuvalis","date":"2012-08-30 12:57:58 +0300"}],"public_likes":["Mr. Muhammad Oga","Hosea Hudson","Trisha Hills"],"vacancy":true,"description":"In a nice setting in the town by the river.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}