{"title":"San Francisco/Chinatown-North Beach","name":"The Orchard Garden Hotel","address":"466 Bush St","directions":"between Grant Ave and Kearny St","phone":"+1 415 399-9807","tollfree":null,"email":null,"fax":"+1 415 393-9917","url":"http://www.theorchardgardenhotel.com/","checkin":"3PM","checkout":"12PM","price":"$200-$309","geo":{"lat":37.7908,"lon":-122.4052,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25509,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I was pleasantly surprised by how good this hotel was considering the price we paid! The location cannot be beaten - right on Union Square with the cable car on the doorstep. It allowed us to easily explaore all of San Fran. While the rooms are small (as most are in America) they were modern and comfortable - partcularly the pillows and linen which were of an excellent quality. We had breakfast in the restaurant one morning and it was good. The staff were friendly and we loved the cookies provided in reception each day. All in all this is a great hotel for a great price - don't expect Hilton or Marriott standard but for a third of the price this absolutely does the trick. If I am ever in San Fran again I would definitely stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Gerardo Harvey","date":"2014-08-19 04:32:22 +0300"},{"content":"My second visit to San Francisco and still like it. We picked this hotel because of the good reviews here and its very reasonable price. Cable car is at the doorstep and there are numerous great restaurants and shopping outlets nearby. We did not eat at the Hotel, though the menu looked good. Instead we have had breakfast twice at Boudin 5-minute walk down the street at Macy's and dinner at Sears Fine Food next door. Both are absolutely fantastic. The hotel room is really small, though very clean and comfortable. We were given a room on the low floor (3rd or 4th) but we could not hear anything from the street (with windows opened). The bathroom is tiny and what came out from the shower head were nothing more than water powders. You certainly need patience, esp if you have long hair. Pretty understandable though for old buildings. The free in-room WiFi was great. For its price and convenience I would stay there again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Brenna Koelpin","date":"2013-06-29 21:35:26 +0300"},{"content":"My husband called the hotel when we changed planes in Las Vegas, and asked their advice re which restaurant we should choose for dinner that evening. They helped us make a good choice and they called and made us a dinner reservation. My luggage didn't make our connecting flight, but when we returned to the hotel that evening, my suitcase had been delivered and hotel staff put it in our room -- it was waiting for me there instead of downstairs at the front desk. Front desk was professional, helpful and competent. Soda, water and snacks were available for a reasonable price, and there were ice machines on every floor. The hotel feels classy and refined, with lots of brass and glass. Classic and tastefully understated decor. I rearranged the chairs in the room to give us a little more space -- but everyone says the rooms in SF are always tiny. Our room was small but not tiny. The bed was very comfortable. I didn't realize that they didn't have king beds, but the queen room we had (for a very reasonable price) was more than adequate. Great mattress and pillows. We didn't feel cramped. We are average sized people. If you are larger, you could request room with two twin beds and possibly put them together for a king? The bathroom was small, but very nice, and had a HUGE tub (no jets). They provided bath salts and I took advantage of a nice hot bath after we returned from walking all over SF for most of the day. No A/C, but we didn't need it. You can request a high or low floor, and you can request a \"quiet\" room. We were on the 10th floor on the back. It was perfect. We had a great view and no noise from the busy street on the front. This hotel is on the cable car line which runs up and down Powell Street. Very convenient. Just walk outside and there is a cable car stop -- you're on your way. The breakfast offered in this hotel was outstanding. Lots of great choices. I had New Orleans Eggs Benedict -- fantastic and fresh! Good coffee and service. Affordable and reasonable. Next door to Sears Inn, which has great swedish pancakes. Easy to get a cab to and from this hotel -- cabbies knew where our hotel was just by providing the name. I can't think of anything negative about this hotel. A great place to stay: great room, happy environment, very convenient location, safe area, close to great restaurants, stores and nightlife. All at a very reasonable price. You don't need to go through all the blind bidding on Priceline.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Sandrine Kautzer","date":"2012-02-26 00:30:53 +0300"},{"content":"So we gave this hotel every chance to redeem themselves. When we approached the front desk about bed bug bites that appeared after a single night's stay it was clear that it was not the first time they had dealt with this problem. They turned the room upside down, and gave us another room for the evening....we had no choice but to stay there. When we looked at the bed bug website - the financial district in San Fran basically had one big red blotch over it and seemingly every hotel had dealt with it. As for this place the higher level front desk person had close to zero customer service skills, and the manager never came to speak with us. I would absolutely tell anyone looking for a hotel in San Francisco to carefully research the area and the specific hotel. We had to dry clean or wash everything in hot water when we got home - vacuum all bags and put as much as possible in a hot dryer...it was a nightmare. Plus bites took a couple of weeks to heal. We choose this hotel for the location and price...but got what we paid for....especially bad service.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Rosendo Senger","date":"2012-11-11 02:10:52 +0300"}],"public_likes":["Fatima Stehr","Kathlyn Schroeder","Immanuel Johnson","Brigitte Satterfield","Justen Hegmann","Alexandrea Goyette","Mrs. Caesar Herzog"],"vacancy":true,"description":"A stylish eco-friendly hotel, claiming to be San Francisco's &quot;greenest&quot; hotel, this lodging gets almost universally good reviews.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}