{"title":"Sebastopol","name":"Sturgeon's Steam Powered Saw Mill","alt":"Sturgeon's Saw Mill","address":"2150 Green Hill Rd","directions":"Hwy 116 North, right on Occidental Rd, right on Green Hill Rd","phone":null,"tollfree":null,"email":null,"url":"http://www.sturgeonsmill.com","hours":"runs 4 weekends each year, check schedule on web site","image":null,"price":"donation requested $25 per person","content":"Sturgeon’s mill is a fully operational steam powered lumber mill that gets fired up four times a year to cut logs into lumber and show how these lumber mills operated. All of the original hand tools, equipment, steam engines, rolling stock and book keeping records are preserved in a Redwood canyon not changed since the 1930’s. A team of volunteers runs the mill and docents show and explain everything. There are four steam engines that perform various tasks.  The main engine that powers the Joshua Hendy head rig is a Atlas Steam Engine. It was manufactured in Indianapolis, Indiana in the last part of the 19th century. It is a double acting steam engine, meaning it gets power on both ends of the stroke. Steam will push the piston to the left and then open an exhaust value, relieving pressure on that side. Steam then pushes the piston to the right completing the cycle and then beginning again. The Erie engine has a 6&quot; bore and 12&quot; stroke funning at about 400 rpm and powers the Klamath 4 saw edger. At the edger is a small engine called a Soule (Soo-Lay) powering the feed rollers pushing lumber through the saws. The Erie engine is a little under powered and is referred to as &quot;Old Gutless&quot;. The last engine powers the trim saw. It is a small engine with a 5&quot; bore and 7&quot; stroke running about 400 rpm. When the mill was built in 1923, the engine was mounted on a redwood stump. The old stump not being as solid as it once was has been replaced by a concrete footing and a large timber securely mounted to it, but traces of the old stump can still be seen.  All the steam needed to run the engine comes from the Atlas boiler. This boiler is fueled by diesel and with the price of fuel these days; it is the biggest operating expense at the mill.","geo":{"lat":38.41453,"lon":-122.90053,"accuracy":"ROOFTOP"},"activity":"see","type":"landmark","id":26854,"country":"United States","city":"Sebastopol","state":"California"}