{"title":"Paris/4th arrondissement","name":"Hôtel de Ville","alt":"Town Hall","address":"Place de la Hôtel de Ville","directions":"Metro: Hôtel de Ville","phone":null,"tollfree":null,"email":null,"url":null,"hours":null,"image":null,"price":null,"content":"Many feel that this, Paris' town hall, is one of the loveliest buildings in the city. You might not get that from the front view, but try watching the light change on its roofs and towers during sunset from one of the cafés on the Ile de St. Louis, the '''Lutece''' for instance. Alternatively, go to the top floor of the Bazar de l'Hôtel de Ville (BHV) department store opposite, on rue de Rivoli and walk up a flight of stairs to the roof terrace (terrasse), from which there is a dramatic view of both the roof of the Hôtel de Ville and the immediate surroundings and river. The present Hôtel de Ville replaced the 16th century original which was burned down during the Commune in 1871. A pastiche of its predecessor, but on a far larger scale, it was designed by the architects Ballu and Deperthes, chosen after a competition, and was mostly completed by 1882. The building is lavishly, and some would say heavy-handedly, decorated both inside and out, and finished in an arrestingly white stone, similar to that used for the even more eye-catching Sacre-Coeur basilica. The statue on the garden wall on the south side is of Etienne Marcel, the most famous holder of the post of &quot;prevôt des marchands&quot; (provost of merchants) which pre-dated the office of mayor. Marcel came to a sticky end, lynched in 1358 by an angry mob after trying to assert the city's powers a little too energetically. The current mayor, Bertrand Delanoë, a socialist and the city's first openly gay leader, shares some of Marcel's ambition and almost shared his fate. He was stabbed in the building in 2002 during the first all-night, city-wide Sleepless Night (Nuit Blanche) festival when the long inaccessible building's doors were thrown open to the public. But Delanoe recovered and has not lost his zeal for access, later converting the mayor's sumptuous private apartments into a crèche for the children of municipal workers. The Hôtel de Ville was for many years the private fiefdom of Jacques Chirac, France's president before Sarkozy, and was the site of a scandal centring on both illegal jobs given to Chirac's party members and an immense entertainment budget. General de Gaulle greeted the crowds from a front window in 1944 when Paris was liberated from the Germans and Robespierre was shot in the jaw and arrested in the original building in 1794. Admirers of Hôtel de Ville's architecture will want to know that Ballu also built the Church of La Trinité in the 9th arrondissement and the belfry of the town hall of the 1st arrondissement, opposite the Louvre's east façade. Ballu also restored the Tour St Jacques (see below), which has recently been uncovered after restoration work lasting over a decade.","geo":{"lat":48.856389,"lon":2.352222,"accuracy":"ROOFTOP"},"activity":"see","type":"landmark","id":21753,"country":"France","city":"Paris","state":"Île-de-France"}