{"title":"Avignon","name":"Le Pont Saint-Benezet","alt":"Le Pont d'Avignon","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"url":null,"hours":null,"image":"https://en.wikivoyage.org/wiki/File:Pont d avignon.jpg","price":null,"content":"'''Le Pont Saint-Benezet''' is a ruined bridge not far from the Palais des Papes. The bridge was built in the Middle Ages - before the arrival of the Papacy - perhaps partly to allow the local bishop to cross the river to Villeneuve-lès-Avignon, where the church authorities had installed themselves because of Avignon's then-infamous dirt and lawlessness. The legend of the bridge's building is that a local shepherd, Benezet (a dialect form of Benedict) was inspired by angels to build a bridge. When his appeals to the town authorities proved fruitless, he picked up a vast block of stone and hurled it into the river, to be the bridge's foundation stone. Convinced by this demonstration of divine will, the bridge was swiftly built. The poor shepherd boy was canonised, and his chapel remains on the surviving portion of the bridge. If the bridge was divinely inspired, the Deity must have quickly changed his mind, because before long the bridge became unsafe and, following numerous floods, mostly derelict. Originally, the bridge had 22 arches, reaching across to the tower of Philippe le Bel via the mid-stream île de la Barthelasse. Only 4 of the 22 arches now remain. A multilingual audio tour of the bridge explains some of the local history. The well-known song &quot;Sur '''[http://www.travel-avignon.info/pont_d_avignon.html Le Pont D'Avignon]'''&quot; (on the bridge at Avignon) refers to the bridge. The bridge itself is far too narrow for dancing or festivals - the original text of the song was &quot;Sous (under) le pont d'Avignon&quot;, referring to the festivals and entertainments staged on the île de la Barthelasse. The current version was popularised by a 19th-century operetta, whose librettist clearly assumed that 'sous le pont d'Avignon' would have meant in the river.","geo":{"lat":43.95358575219919,"lon":4.805168587627122,"accuracy":"RANGE_INTERPOLATED"},"activity":"see","type":"landmark","id":1349,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","image_direct_url":"https://upload.wikimedia.org/wikipedia/commons/a/aa/Pont_d_avignon.jpg"}