{"title":"Fontainebleau","name":"Forêt de Fontainebleau","alt":"Fontainebleau Forest","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"url":null,"hours":null,"image":null,"price":null,"content":"An important forest area of 25,000 ha. with an altitude ranging from 42 m to 144 m. Each year, millions of visitors come to walk (13 million in 2006). 40,000 years ago, nomadic populations were established near the forest. Around the year 1000, the forest was composed of a series of enclaves that shared little lords and wealthy landowners . For the kings of France, the forest had indeed many uses including hunting and a military interest. In 1400, Charles VI ordered the first amendment of the forest. Under Francis I, the forest consisted of only 13 365 ha but the Kings expanded it through acquisitions and forfeitures. It was at this time the management of the forest and administration took shape and was kept until the Revolution. At the time of Louis XIV, less than 20% of the area was forested. Colbert launched a new reformation in 1664 replanting the sites. The king then traverses the forest each year in the fall for hunting. In 1716, after the terrible winter of 1709, a new forest management was enacted: 6000 ha were planted with deciduous trees, but this was an almost total failure. A new development was revived in 1750. In 1786, a shy introduction of Scots pine is attempted. In 1750, around 90 km from the forest is bounded by 1050 terminals still visible today. After the Revolution, after many deep cuts and proliferation of game misconduct hunting Napoleon in 1807 reformed the forest administration and the castle. In 1830, the planting of 6,000 ha of other pine angered artists who seek inspiration in the forest. In 1839, Claude-François Denecourt released its first guide forest walks and trails the first landscape in 1842 In 1849 the railway arrived at Fontainebleau, which will allow Parisians to visit Fontainebleau by day trips . In 1861 was created the first artistic reserve 1097 ha. It is the first nature reserve in the world, even before the creation of Yellowstone National Park in the United States. In 1953, the first biological reserves were created.","geo":{"lat":48.416667,"lon":2.666667,"accuracy":"ROOFTOP"},"activity":"see","type":"landmark","id":9287,"country":"France","city":"Fontainebleau","state":"Île-de-France"}