{"title":"San Francisco/Union Square-Financial District","name":"Hotel des Arts","address":"447 Bush St","directions":"between Grant Ave and Kearny St","phone":"+1 415 956-4322","tollfree":null,"email":"reservations@sfhoteldesarts.com","fax":"+1 415 956-0399","url":"http://www.sfhoteldesarts.com/index.php","checkin":"3PM","checkout":"12PM","price":"$69-$149","geo":{"lat":37.7905,"lon":-122.4049,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26216,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"This was the worst hotel experience my husband and I have ever had. The check-in took an inordinate amount of time; they said someone would help me with my bags while my husband went to park the car - no one ever came. We dropped our stuff in the room quickly because we wanted to explore the Fortress, did not return until much later, exhausted. It wasn't until we returned that we realized we were in a room that must have been used for prostitution - since I found a half-empty liquor bottle, price tag for negligee, disposable razor in the bathroom.....Not to mention no phone, no remote. My husband was already asleep when I discovered all of this, so we stayed the night. What they called a \"balcony\" was just a metal rail outside the windows. The Plaza below was noisy all night and the trash removal truck came at 4:00 am with VERY LOUD commotion. When I told the front desk the next day what the situation was, they said \"You weren't supposed to have that room\" - that was it. I called Howard Johnson corporate when I returned to US Mainland and filed a complaint, but never got a response. It was disgusting.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Kevon Lueilwitz","date":"2014-01-12 13:30:17 +0300"},{"content":"The room we had included no windows, so we did have noiseless sleep. The coffee maker was broken and the toilet overflowed the first time we used it. The night manager came up to plunge it with some success. I attempted to take a picture of the room but it was too small to take a meaningful shot. Other things like the light next to the bed and tv remote were also broken. This hotel was a new low in terms of maintenance issues. They gave us a complementary muffin and coffee breakfast because of all the problems. The restaurant would be only for snacks. I heard from other travelers that there are other hotels nearby which cost about the same but had much better rooms and service.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":1.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":3.0},"author":"Marilyne Batz II","date":"2012-05-15 03:40:14 +0300"},{"content":"I brought my family to Florida for March Break 2012..the five yr old Granddaughter was going to see her Princess's and other Disney Characters. We reserved our PoolSide Room on-line and got confirmed and three days later also got room verification by telephone. We have stayed at Champions Resort in the past and when in the Kissimmee area of Florida, we wouldn't stay anywhere else but Champions Resort. Upon arrival we were greeted with a smile by the desk clerk who had just finished with a lineup of people checking in and she handled everything very well. Our room was as would be expected and advertised clean and orderly. We enjoyed the use of the three swimming pools and the hot tub. We enjoyed quiet evenings taking walks around the Champion property and its plain to see they are constantly trying to upgrade and make their facility traveler and vacationer friendly. Their was no loud music nor rowdy goings on and sleep came easy every night! The room/bathroom was cleaned and beds made daily and the folks what did the rooms always had a smile and were very friendly. The gentleman that took care of securing the pools every evening a big hats off to you sir I do not remember your name sadly but allowing us to enjoy the hot tub a short time longer after hours was very kind of you it sure helped after a day of beating the streets sightseeing:) To the two ladies on the desk midweek THANK YOU for taking the time to print us out the Tidal Charts for Coco Beach, it was a wonderfdul day and the granddaughter found some awesome shells during low tide and she wants to come back to look for the sea glass you told her about! The whole six days we stayed at Champions resort we had no complaints or any reason for complaints...The Owners and the Department Heads should be quite proud of their Staff and their Resort....we have told all our friends and family that if they are planning a trip to Kissimmee that they should stay at Champions Resort. We will be planning another family vacation as the family enjoys the Kissimmee Area and we wouldn't dream of not including Champions Resort into our vacation plans! We arrived 3/10/2012 departed 3/16/2012 THANK YOU CHAPIONS RESORT from the BEAM FAMILY!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lauretta Blick","date":"2012-01-14 02:35:06 +0300"},{"content":"This hotel was old and dirty. I really didn't feel like sleeping in the bed; the sheets and floors were dirty! My daughter got bit by a poisonous spider while sleeping (went to the Dr. to verify it and get antibiotics). We will never return.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Zula Hammes","date":"2014-05-24 03:01:22 +0300"}],"public_likes":["Boris Lubowitz"],"vacancy":true,"description":"The hotel displays the work of contemporary local artists.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}