{"title":"Mendocino","name":"Dennen's Victorian Farmhouse","address":"7001 North Highway 1","directions":"Little River","phone":"+1 707 937-0697","tollfree":"+1-800-264-4723","email":"innkeeper@victorianfarmhouse.com","fax":null,"url":"http://www.victorianfarmhouse.com/","checkin":null,"checkout":null,"price":"$149-289","geo":{"lat":39.262514,"lon":-123.783662,"accuracy":"APPROXIMATE"},"type":"hotel","id":17932,"country":"United States","city":"Little River","state":"California","reviews":[{"content":"I would recommend this hotel to anyone, great location and staff!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Otha Greenfelder","date":"2015-07-01 02:11:05 +0300"},{"content":"We stayed for three nights and had problems parking everytime we returned to the hotel. When there is a parking space it is next to impossible to get out or you are in danger of someone else hitting your car. They say to park at your own risk. On the street parking is available at $1.25 per hour between 8 am and 6 pm Mon - Sat. Free on Sunday. Or you can park in one of the local pay lots for $9.00 per day or more. Everything else about this hotel was great. Our room with the King bed was bigger than the ones with the 2 queens. The Breakfasts provided were excelent. The kids loved the pool and workout center. So if you choose this hotel, please come prepared to deal with the parking.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":3.0,"Rooms":3.0},"author":"Angelo Oga","date":"2012-01-10 12:35:29 +0300"},{"content":"Stayed here for 2 nights at the end of August. The location is good if you are visiting the Seattle Center (Space Needle, EMP, monorail) and you are just a short bus ride (stops right out front) into downtown and Pike Place Market. We had one of the larger rooms on the 5th floor. While it was nice to have more space, not sure it was worth the extra money. The carpet was in need of a good cleaning or replaced. I would not walk barefoot on it. The bed was ok. The bathroom looked like it had been updated not long ago. We did find ants in the room on our last night but did not bother to complain since it was getting late and we would be checking out early in the morning. The breakfast was your typical free hotel breakfast, nothing fancy but was very crowded. The pool & hottub were great to have and to pass a couple of hours in the evening since it was raining during our stay. We found the front desk staff to be very helpful and answered all our questions. We didn't have any issues with noise coming from the busy street below but that might be because we were on the top floor. Would we stay here again, maybe if we could get a better price and they did some updating.","ratings":{"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Tod Heidenreich","date":"2015-06-16 09:06:59 +0300"},{"content":"We stayed here for about 4 days. It is not a terrible hotel, however, things need an upgrade badly. The best thing about this hotel is free parking and location. I would only recommend this hotel to people who are on a budget and want a decent location, and who are spending most of their time out of the room.","ratings":{"Overall":3.0},"author":"Bernardo Klocko","date":"2014-10-24 04:08:32 +0300"},{"content":"We spent two nights at The Quality Inn Suites before heading north toward the San Juan Islands. I chose it because it was close to Seattle Center. Our stay was pleasant, nothing fantastic. We had the King Select Suite 2. The pool was nice and the breakfast was good but the rest of the hotel was mediocre. We could tell that they did a lot of renovations to the bathrooms which was nice but the jacuzzi handle was broken so I had to call maintenance. The beds were old and a bit saggy but I could tell they were trying to keep things updated. Just not quite there yet. The hilarity was when we were ready to check out and we realized our 2-year old son had locked himself in the bedroom. He was fine (finally allowed to do what he wanted to do without us telling him no) but I think it took maintenance longer to come unlock the door than it did for them to come fix the tub handle. But, that might be b/c I was more anxious about getting the door open than having a nice bath. All in all, I probably would not stay here again. If I had gotten the room at a cheaper rate, perhaps, but not at the full price.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":3.0,"Overall":3.0,"Value":2.0,"Rooms":3.0,"Location":2.0},"author":"Kobe Bins","date":"2014-04-01 22:48:54 +0300"},{"content":"My husband and I spent 4 nights in March, 2012, at this downtown Seattle hotel. Location was perfect! Close to Pikes Market, across the street from a movie theater and Cheesecake Factory, and lots of shopping (Forever 21, American Eagle, Macy's, Ross, Nike, etc). We took the bus to Discovery Park and the Ballard Locks. Took the ferry to Bainbridge Island. I only have three minor complaints: we had requested a king bed, but was given two doubles; the Concierge wasn't too familiar with the public transportation; and housekeeping failed to remove the previous ocuupants black panties left in the bathroom. However, these complaints are not deal-breakers. I would definitely stay here again!","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Gunner Marks","date":"2013-12-12 18:13:57 +0300"},{"content":"I recently checkout of the Sheraton Hotel located at 1400 6th Ave Seattle, WA. I I checked into the hotel(room 723) on March 12 after my check in was complete and I was about to walk away I was handed a letter stating that the hotel will not have water from 10am - 2pm that day. At this point I find it extremely rude to give this to me after I have checked in as an oh by the way type of approach this information should have been presented before I completed check in. At 4pm on March 12 I tried to take a shower but when I turned the facet to the hot water it was extremely cold. I turned the facet to the cold water section thinking maybe the streams where crossed during the outage but that to was cold. I ended up using the warm section but this was lukewarm at best. I chalked it up to maybe the water system just needed time to get warmer since the outage. I went about my night. During the night I kept hearing a loud metal clinking noise which I believe was coming from the heating system. This loud noise happened every 15-20 minute needless to say I did not sleep. On the morning of March 13 I went to take a shower after my night of no sleep. I turned the water to hot and it was still flowing as ice cold water. I tried the cold section again and it too was ice cold. I once again took a lukewarm shower. I went to the desk to check out around 7:45 when asked about my stay I told the \"trainee\" who was completing my check out about the noise and water situation. She apologized for the issues and I asked for the number to your corporate office she did not know where it was and told me to wait for the other woman to come back. I waited and when the other front desk worker came back as there was another guest waiting she helped that person first before assisting her trainee. She was very dismissive and handed the trainee a business card that was for the Seattle location when I had asked for the corporate office. I pointed this out to the trainee and again she tried to talk to the person training her. I waited for five minutes but needed to leave to get to work as the other person working the desk was obviously trying to avoid having a conversation with me. I find this behavior along with the conditions of your hotel to be completely disgusting. I have staying in hostels that have running hot water this is something that is a basic utility.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Miss Annamarie Donnelly","date":"2013-02-09 15:51:56 +0300"}],"public_likes":["Miss Lacy McLaughlin","Layla Moore","Mrs. Cale Ryan","Mrs. Vivien Senger","Liana Hettinger","Jamel Walker","Kacie Gulgowski"],"vacancy":true,"description":"Offers rooms, suites and a private cottage featuring in-room breakfast.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}