{"title":"Birmingham (England)","name":"Swallow Plough & Harrow Hotel","address":"135 Hagley Rd, Edgbaston","directions":null,"phone":"+44 121 454-4111","tollfree":null,"email":"gm.plough@crerarmgmt.com","fax":null,"url":"http://www.swallow-hotels.com/hotels/the-plough-harrow-hotel","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47224,"lon":-1.92752,"accuracy":"APPROXIMATE"},"type":"hotel","id":3638,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"We booked the Palmer House on Priceline for the nights of Sept 25 and 26 2011. Our request of 2 beds and non-smoking room was submitted to the hotel and we were assured every effort would be made. We arrived approx 2.30pm and were told the room would be ready in an hour. 5pm came and went and still no room. In fact, we were put in an 'Apollo' room which is a huge suite, like a living soom, with seperate bed ROOMS doored on each end--which were locked as they were each booked; hence no beds. It was at least another hour to procure 3 rollaway beds as well as track down our checked in luggage. The beds were sleepable once we stripped the furniture of it's cushions and placed them to serve as box springs. 2 beds arrived with no pillows or blankets. Suffice to say all of our Saturday afternoon/evening was spent trying to make a 5 star hotel room inhabitable. We were given a $50 food credit and explaination about them being totally booked for our trouble, but one night of bad beds, tiny bathroom and no mirrors to dress in front of was more than enough. By the time the dust settled we found that no food was available in the hotel--only drinks in vending machines. So I was sent across the street to a 7Eleven in the rain to gather sundries for my kids. We were assured of getting a 'real' room the next day which thankfully we did first thing in the morning. We lugged everything to a floor above and thankfully had 2 beds and a long mirror. The beds and bedding were fabulous. I likened the first night to staying in a museum and sleeping in the warehouse. A year ago we stayed at the Chicago Hilton and everything about that hotel was head and shoulders over our experience here. The bed and bath shop in the Palmer just off Monroe is a saving grace, however. Wonderful staff and products that contributed to my restraint of hostage taking. Breakfast buffet, which is a traditionally sumptious affair, was markedly disappointing both in quality and selection. I got the impression that this hotel has been tripping over dusty laurels for decades. I LOVE the classic old glamour of hotels but this stay illustrated a lack of cohesion. Chicago Hilton seems to know what makes a 5 star truly that. Palmer House seems to spend the most energy remembering when it was--which in my book knocks it down to a 3.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Charlie Hilpert","date":"2015-09-10 01:58:31 +0300"},{"content":"Stayed 2 nights for business because other choices with a shuttle bus to my conference were sold out. I was glad I requested a high floor, away from elevator because I would have been extremely upset to be in a room near the noisy train. Room was clean and bedding was nice, although as others have pointed out, the tiny bathroom was annoying. I didn't mind having an old tv but the lack of available coffee and the rip-off fee for wired internet was more than disappointing. Who wants to sit at a hotel room desk after a long day at work? never again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Alfredo Goldner","date":"2013-01-16 06:16:03 +0300"},{"content":"Really small bed. Smelled like an ash tray. Waited over an hour for a new room. Next time I'll pass.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":1.0},"author":"Randall Jenkins","date":"2015-10-14 15:23:20 +0300"},{"content":"We are VIP Gold HH members and Hilton Vacation Club owners, so we expect a lot when we stay with Hilton. We were not dissapointed with our last stay at the Hilton Palmer House in Chicago. We knew it was going to be a very busy weekend with the last holiday of the summer and the jazz festival in town but we went anyway. We took advantage of the prepaid stay with the breakfast buffet and felt the price was very reasonable. We automatically got the upgrade to the suite and had full benefits of the executive level amenities. We were very happy with both the service we recieved and the food we were served. We like the parking arrangement with the garage next door and the friendly help from the bell hops. We enjoyed a newly renovated room with excellent internet serivce and more than friendly room service. I think we called them 4 times with request in just one day and they came through with everything from wine openers to extra sheets for the rollaway. We really liked the old world charm of this hotel but it was not too over the top. Location is prefect to explore Chicago. We have young kids and we like the way they cater to families with children. You don't have to worry about what others are thinking because they all seem to have kids too. Nothing worse than going somewhere and have people act like you shouldn't have brought your kids. We make sure our kids don't bother people too, so that helps. Thanks Pamler House staff for a great Labor Day weekend.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Ms. Linwood Hodkiewicz","date":"2013-11-15 15:59:30 +0300"},{"content":"This hotel far exceeded our expectations as part of the Hilton brand. It's a beautiful historic building with a lovely interior. The lobby is stunning. We were on the Executive level, and found the rooms to be really nice and fitting for the building. Our standard room had two separate his and hers bathrooms! The rooms are not super slick or super posh, but perfectly fine for someone who is out working or touring all day. We found the beds to be really comfortable. And we enjoyed the free beverages and business center on the executive level. We would consider staying here again because it was hassle free, friendly and the location was absolutely perfect for getting everywhere we needed to be. it's just two blocks from the blue line that goes to the airport.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Service":4.0},"author":"Barry Bode","date":"2015-11-15 05:03:32 +0300"},{"content":"We stayed here labor day weekend for 3 night and didnt have any complaints- Check in was quick and we were able to get into our room at 12:30. We had a renovated room on the 8th floor. The room was fairly large and the bed was super-comfy. We didnt have any problems getting elevators our entire stay. Starbucks in the lobby was great and the lobby bar was beautiful. Friendly employees and central to everything we wanted to see on our visit! Not to mention we got a great deal on priceline for the room!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Wilhelm Rolfson","date":"2014-08-24 16:19:00 +0300"},{"content":"Beautiful surroundings is not all a hotel needs to be a good hotel. Housekeeping was bad (6-night stay). Little things about our stay causes me not to recommend this hotel if you want an all round good stay. From bad bar service to bad housekeeping to food not in par with price this Hilton is not our favorite. Although one good thing is they had plenty of elevators so you never had to wait long for one.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":3.0,"Value":2.0,"Service":2.0},"author":"Junius Hoeger","date":"2013-06-28 08:52:43 +0300"},{"content":"This is a gorgeous hotel, the lobby is one of the nicest I've ever been in and I travel for work a lot. We had two reservations, one on Hilton points and one we paid the room rate for. They combined the two and actually gave us a package rate for the paid nights stay. The room was beautiful, the staff were very friendly and helpful. We will be making this our home in Chicago for any future stays!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Cristina Beahan","date":"2013-06-19 03:48:13 +0300"},{"content":"I was charged twice for parking. I had trouble getting that settled during check out because I had to wait multiple times for the right person to take care of double charges. I am a Diamond member, the wait for Hhonors line was terrible since no one was at the reception desk. I had trouble getting to the manager on-site; she blew me off by me telling to wait even more once she came to the front desk. So I just left. Also, the password for WiFi was useless, there was no WiFi signal on my floor. The elevator didn't work on the ground floor; I had to go to the 1st floor to catch the elevator. Overall, it was an inconvenient stay.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":1.0,"Value":3.0,"Service":1.0},"author":"Bertha Osinski","date":"2014-10-23 00:25:58 +0300"}],"public_likes":["Ladarius Langworth","Clark Lesch","Wilbert Yundt III"],"vacancy":false,"description":"Near the International Convention Centre, National Indoor Arena and the Bull Ring Shopping Centre.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}