{"title":"York","name":"The Royal York Hotel","address":"Station Road","directions":null,"phone":"+44 (0)1904 653 681","tollfree":null,"email":"royalyork.reservations@principal-hayley.com","fax":null,"url":"http://www.hotelroyalyork.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.958378,"lon":-1.091604,"accuracy":"APPROXIMATE"},"type":"hotel","id":33861,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"Thought the location would be SO convenient for a short visit to Epcot & the Magic Kingdom. First we went around in circles trying to find the place (give us directions already!) Then I forgot how much of a pain it was to switch trains for the Epcot trip. At least they ran frequently and were not full. the monorail to MK runs in only one direction, so it can be a long trip TO MK, but just one stop back. Should have tried to walk, but it was 90 degrees already! Surprised at how many problems we had with the rooms. With Disney marketing to parents with young children I thought they would be focused on safety, but wow! were we surprised! First of all, all 3 doors to the balconies were unlocked when we checked into our room on the 11th floor! So glad I was a paranoid grandma and checked them. And yes, the football shaped table in the bedroom was as unstable as previously noted - I pressed on the top and it started to fall over! We kept it shoved up against the wall and never let the children near it! there is also a tall floor lamp in the living room that they could have easily pulled over on top of themselves! Who designed this??????? The clock radio in one bedroom couldn't be reset, there was an annoying beeping in the kitchen that I couldn't track down - it was the dishwasher (that's a new one on me!). And of course, everything except the rooms is across in the original Contemporary building. It's also noisy from the fireworks and the electrical pagent - not nice if you are a toddler (or a tired grandparent) and 10 PM is WAY past your bedtime! But what really got me was that I asked about a late checkout (so we could give the baby a nap) when I moved our reservation to the tower and was told it was noted on the reservation, but to ask again at check-in, where I was told it was noted and sent to houskeeping, but the next morning were were told that \"there is never late check out at the villas!\" We really felt snookered. So we won't be staying there again.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Summer Murphy","date":"2015-05-19 16:04:12 +0300"},{"content":"#1 if you are going to the Magic Kingdom this is the BEST location you can find. It was GREAT. #2 It SHOULD be a great resort. We have stayed at 4 other disney vacation club resorts and there were great. Everyone in our party was VERY impressed. #3 The rooms are set up to comfortably fit a group by putting a full 3rd bathroom in a 2 bedroom condo and I believe a 2nd bathroom in the 1 bedroom units. Now the bad. The service is HORRIBLE. We felt like the ugly step children of the contemporary. Unlike the other DVC resorts you don't have your own front desk, etc We got off the magic express and walked over to the bay lake towers with our luggage only to find out we had to walk back to the contemporary. How did we find this our because a security guard finally told us in a very rude \"you idiot tone\" when we finally got him to speak to us. They were rude at the contemporary when we checked in. I got a fed ex package from work when I was there and they wouldn't bring it to my room but told me I would have to walk over to the contemporary......it just went on and on. The only internet was in the masterbedroom. Of course NOT the room I was staying in. AND it didn't work! The repairman had to come 3 times to get it to work and every day it wouldn't work unless I called the service and got them to reset it. WHAT a PAIN! Anyway, I would recommend this place but Disney needs to make some improvements in staff.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Paige Johns","date":"2015-12-16 20:25:27 +0300"},{"content":"Just returned from a week stay during this Thanksgiving break. There were six adult family members and one teenage family member. We had a 2 Bedroom suite so we used the foldout couch for myself and spouse. We slept very comfortably on the foldout sofa--never waking till the morning. There were 3 full bathrooms. A completely furnished kitchen and groceries for breakfast which I had pre-ordered and were delivered ontime by Garden Grocer made everything perfect. The stackable washer and dryer finished all the conveniences any large group could possibly need. Never underestimate monorail proximity--it was great to not have to wait at all hardly for the arrival of the next monorail We had a lake view and it was beautiful to see in the morning when we woke up. Expensive without the free dining now being offered but we were celebrating and it was worth every penny to make it the trip of a lifetime because it was all of that and more....","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Elise Metz DVM","date":"2015-05-20 17:31:56 +0300"}],"public_likes":["Raphaelle Olson","Derrick Watsica"],"vacancy":true,"description":"is located next to the station and is the largest hotel in York as well as one of the most prestigious. Has a nice but expensive restaurant overlooking the Minster - great for an evening meal. Also has a Bar, Swimming Pool and Gym. Always ask at reception if you hear any noise from function rooms. To be safe ask for a high-floor room.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}