{"title":"Saint-Lô","name":"Château de Canisy","address":"6-8 Rue de Kergorlay","directions":null,"phone":"+33 6 8021 6073","tollfree":null,"email":"sales@chateaudecanisy.com","fax":null,"url":"http://www.chateaudecanisy.com/","checkin":"12:00","checkout":"14:00","price":"€300","geo":{"lat":49.07961,"lon":-1.17111,"accuracy":"APPROXIMATE"},"type":"hotel","id":39979,"country":"France","city":"Canisy","state":"Basse-Normandie","reviews":[{"content":"I didn't really enjoy my stay here, the rooms are dated and the hotel is very busy. There is a Ruby Tuesday nearby, we dined there, food was good.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":3.0},"author":"Jaylin Steuber V","date":"2012-08-11 02:39:19 +0300"},{"content":"Yuck! What a dump! Dirty, filthy and smelly halls and rooms. They had a security guard patrolling the hotel, which did not give me a warm fuzzy about my safety. Very basic and boring rooms. I couldn't handle staying there. They did have high speed wireless internet and, in all fairness, they are renovating: Perhaps it will be much nicer in a few months.","ratings":{"Cleanliness":1.0,"Overall":1.0,"Rooms":1.0,"Value":2.0},"author":"Armando Carroll","date":"2014-09-22 10:31:48 +0300"},{"content":"Checked in around midnight for one night stay in August 2011. Room was freezing cold with air conditioning that would not stop. Staff member came and supposedly \"fixed\" it. Woke up at 3:30am with room at 87 degrees and hot air pouring out. Another staff member came and said first staff member did not fix it right - duh! Room took well over an hour to cool off because even once AC came on fan would only run on low. All this on top of hotel under construction and staff very pokey. Would never return period.","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Lonzo Wehner","date":"2015-08-08 13:31:01 +0300"},{"content":"Stayed May 15th. Khalil at front desk very helpful, courteous. Dined at Trophies Lounge. Good value for the money. Food was tasty. Not much atmosphere when we were there; one large group by itself and 2 solo drinkers. Rooms were very nice; bed very comfortable. No noise from adjacent room or hallways. Based on past reviews I had asked to be away from the center atrium. Definitely away from things; you have to travel about 20 minutes to get anyswhere. Hard to reach, even with Mapquest but worth the trip.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":3.0,"Rooms":4.0},"author":"Christopher Rohan","date":"2014-09-11 08:26:39 +0300"},{"content":"This hotel is very freshly renovated so our room was beautiful and cozy. The hotel staff is pretty friendly and their shuttle service will take you to the airport and the nearby train stop, which we utilized many times. There is nothing exciting in walking distance, but the train will take you downtown in about 15 minutes and costs a few dollars each way. We went downtown every day to shop and eat at fabulous restaurants. If you are looking for a comfortable hotel located away from the downtown life, this is a good choice.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Fanny Marvin","date":"2013-04-30 13:31:00 +0300"},{"content":"Central but quiet at night. Close to the beach (passes for 3 different beach clubs). Very confortable bed and well equiped bedrooms. Excellent breakfast on the nice rooftop terrace. Always smiling staff ready to help at any time.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Guillermo Windler","date":"2013-12-07 22:33:18 +0300"},{"content":"Don't get me wrong, this place it's clean, new and would be a great value. The only problem they have, is that the walls are too thin, you can hear everything that happens around the hotel (People talking in the next room, the construction workers from across the street and even the cleaning ladies yapping in the hallway) All those noises woke us up at 8 in the morning, so if you don't mind being awake at that time, or going to sleep after the restaurants nearby closes, this is your place.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":5.0,"Location":4.0},"author":"Nedra Schiller","date":"2015-08-28 19:07:01 +0300"}],"public_likes":["Clay Connelly","Mrs. Fletcher Hahn","Alena Heaney","Anya Dach I"],"vacancy":false,"description":"Romantic chateau","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}