{"title":"Paris/17th arrondissement","name":"Hotel Elysées Parc Monceau","address":"38, rue Cardinet","directions":null,"phone":"+33 1 47 63 88 60","tollfree":null,"email":null,"fax":null,"url":"http://hotel-elysees-parc-monceau.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.88229,"lon":2.30504,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21669,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We stayed at the hotel recently. The staff is just wonderful and very helping. Specially Kathy at the front desk and Gonzales in the restaurant. As a gold member we got free breakfast, a big buffet for 2. It is a close walk to monorail and the strip. Be aware that depending on where you want to go on strip, it might be a long walk or require a taxi. Rooms are very nice. I will recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Kaci Ondricka","date":"2014-01-05 00:30:29 +0300"},{"content":"I really enjoyed this hotel. Nice room, no Las Vegas casino BS - convenient desk, parking, nice breakfast. But unfortunately I discovered that the maids washed my water glasses in the sink. I cannot stand this. It is disgusting to think that the same person who is cleaning your toilet and bathtub is washing your dishes in the sink - without dishwashing liquid or hot water. It is just gross. So I will not return here. Management was non-responsive to this issue.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Dr. Lorna Kutch","date":"2015-04-27 08:46:16 +0300"},{"content":"If your trip to Vegas is more about business than sin-city style debauchery, you might like the straight forward approach of this small hotel. Well it's small for Vegas anyway. This means you don't have to walk through a smoky casino and you can make it from the entry to your room in under 2 minutes. The gym was open 24 hrs and was well appointed. Bed very comfortable with high quality linens. The room in general was spacious and well appointed. I found the staff to be extremely friendly and they started to recognize me by the second day. If you are after a real las Vegas strip experience with a lot of exotic features, uber luxury, glitz and glamour, this is not it. I was in Vegas for an event at the convention center (a 2 minute walk away) and was exhausted at the end of each day. I happily retreated to this quiet space. The restaurant was, again, not exotic but very good with more than decent selections and reasonably priced. When I had a bit more time to explore, Encore, Wynn and fashion show mall were easy walking distance. I found it to be a relief not to have to stay in a busy, noisy, huge hotel while working. Would definitely go again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Jeffry Rogahn","date":"2012-07-10 14:01:12 +0300"},{"content":"The staff actually denied one of my companions entry into the elevators. They demanded her ID and when she said it was in the room they wouldn't go with her to get it. She slept on the lobby couch and the manager thought that it was funny. She was a registered guest. This was the single worst experience I have ever had and I stay at alot of hotels. Never the Marriott again.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Lucius Hauck","date":"2012-08-02 08:24:58 +0300"},{"content":"Stayed at this location for one night. Nothing fancy, your average \"airport\" type hotel. I wouldn't recommend staying here if you are looking to visit the strip, too far to walk... but it is close enough to the Convention Center that if that is the only reason you are there, well I guess it's not a bad place to stay.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":3.0},"author":"Kathlyn Stehr","date":"2014-01-08 02:10:46 +0300"},{"content":"We stayed for 2 nights in late September. The hotel is non-smoking with no gaming. The rooms were extremely clean, good amenities, great bathrooms, very comfortable. Great bed. The staff was excellant and tried to meet our every need. The front desk staff was friendly, outgoing and always smiling. No long lines at check in or check out. We enjoyed coming back at night to a quiet environment and being able to get away from the smoke filled casinos. The only problem was that the breakfast restauarnt on Saturday morning was very crowded and the hotel did not have sufficient staff to handle the customers. Our waitress was still pleasant and did her best. We have a child who just moved to this area. I would absolutely stay at this hotel again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":3.0},"author":"Cydney Bauch","date":"2015-06-28 02:31:37 +0300"},{"content":"Definitely not the worst, but not the best either. Between the dogs barking underneath us, and the knock-down drag-out fight going on most of the night, it was NOT a restful stay. However, the staff was great and very accommodating.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Haskell Krajcik","date":"2013-10-19 06:41:32 +0300"}],"public_likes":["Bethel Bahringer","Kolby Kassulke IV","Tre Monahan","Shanel Runolfsson","Shawn Stokes","Demario Senger"],"vacancy":true,"description":"Three star charm in an outstanding residential district, just around the corner from Parc Monceau.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}