{"title":"Chippenham","name":"Lucknam Park Hotel","address":"Colerne, Chippenham SN14 8AZ","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi. At the roundabout, take the 2nd exit onto ''West Cepen Way(A350)'', continue to follow ''A350'', go through 2 roundabouts for 1.0 mile. At the roundabout, take the 4th exit onto ''Bristol Road(A420)'', continue to follow ''A420'' for 4.9 mile. At ''Ford'' turn left toward ''Colerne'' for 1.5 mile. Sign for hotel entrance on right","phone":"+44 1225 742777","tollfree":null,"email":null,"fax":null,"url":"http://www.lucknampark.co.uk/","checkin":"2pm","checkout":"10am","price":"Rooms from £275.00 (Cheapest online rate)","geo":{"lat":51.454393,"lon":-2.2568643,"accuracy":"APPROXIMATE"},"type":"hotel","id":5847,"country":"United Kingdom","city":"Colerne","state":null,"reviews":[{"content":"I spent one night here while on a business trip. The hotel is close to many key locations such as the convention center. The hotel staff in general was super nice and knowledgeable. The front desk graciously upgrade me to a suite with killer views of the water. The room came with 2 large TV's - one in front of the bed and another in front of the couch. The room had plenty of room to set up a mini office and the internet connection was fast. I would definitely stay at this hotel again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lillian Casper","date":"2015-06-16 04:49:29 +0300"},{"content":"My husband an I arrived at the hotel on Sunday, September fourth about 1 hour before check in. We parked in one of the 2 spaces they have out front. I went in to let them know we were here understanding that a room would probably not be ready. When I entered the small lobby and walked up to the desk the young lady behind the desk did not even say hi nothing she just looked up at me. I informed her of our stay and she told me there were no rooms ready. I said okay and asked about having our car parked and if we needed to access the car during our stay could we. She could not tell me where they parked the car and said they could only get it for us and it would take 15 to 20 minutes to get the car. We took our luggage out of the car and John (the only nice person) took our car to the unknown lot. We thought we would just wait in the lobby till our room was ready. After waiting only a few minutes Matt the manager called us to the desk to let us know a room was ready. We went to the room which had a maintenance man fixing a light fixture in the bathroom and a drilling noise that made the walls shake. I went back to the lobby to ask about a room without drilling and possibly not a maintenance man. The same young lady, Julia, was at the desk and told me there were no rooms without the drilling available for our stay. I asked to speak to Matt the manager. She told me to go back to the room and he would call. A few minutes later Matt called and said there were no rooms that did not have the drilling and not to worry as it only goes from 10 am to 5 pm. I told him we would leave then and he said fine to go ahead and leave as he could not help us. There were no apologies and no attempts to solve the problem.No I am sorry let's try and work this out. He just told us to leave. We gathered all our stuff, went downstairs and I told them how unhappy I was and that the room was not ready that there was someone in the room fixing a light. He could not have cared less and we left. We went a few blocks down the street to the Inter Continental Hotel and we were in a bigger, beautiful and cheaper room in 15 minutes. This was a birthday getaway for my husband and I which I mentioned at the Griffon and got no response. The Inter Continental sent up a lovely pastry selection with Happy Birthday wishes! What a difference in customer service and quality.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":2.0,"Location":3.0,"Rooms":1.0},"author":"Anastacio Kozey","date":"2014-07-21 13:31:36 +0300"},{"content":"We stayed at the Griffon for the sole purpose of going to a day Giants game at AT&T Park. The hotel is a great option for walking to the ballpark, strolling along the bay and trips to the ferry building. My husband, 5 year old son and I stayed in a King room. The room was on the smaller size, but most in SF are the same. There was a nice window seat that was a great place to sit and read. The hotel staff was extremly friendly and very helpful.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Marlene Rowe DVM","date":"2013-11-03 12:43:50 +0300"}],"public_likes":["Madelynn Terry","Dortha Schumm","Kaley Armstrong","Kenya Kuhlman","Rene Heller","Rhett Jacobson","Guy Dare"],"vacancy":false,"description":"A 5 star hotel and spa set in the Wiltshire countryside near the city of Bath. The hotel offers numerous activities including an equestrian centre and has a Michelin Star restaurant","alias":"Lucknam Park Hotel & Spa","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}