{"title":"Santa Monica","name":"Casa del Mar","address":"1910 Ocean Way","directions":null,"phone":"+1 310 581-5533","tollfree":"+1-800-898-6999","email":"reservations@hotelcasadelmar.com","fax":"+1 310-581-5503","url":"http://www.hotelcasadelmar.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.00639,"lon":-118.49113,"accuracy":"ROOFTOP"},"type":"hotel","id":26494,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"We stayed at the Westin for 2 nights when arriving in LA. The hotel is large and rooms are well appointed. The staff are very helpful and accommodating. We did several day trips and didn't have a chance to eat / have a a drink at the hotel. We had a view of the airport and thought it would be noisy but it wasn't. Great price for it's location.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Dr. Damaris Pfeffer","date":"2015-02-03 08:02:30 +0300"},{"content":"Overall a very nice experience for this event I attended. Hotel staff knowledgeable & very friendly. Room was very nice to stay in. Hotel was very clean everywhere. I did however have a little problem with the Water temperature in the shower.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Tia Streich","date":"2014-03-07 01:55:20 +0300"},{"content":"We stayed one night - late check in - but the bar is open till mid night and can get food - the bar staff were great and the food was pretty good too. Room was OK - over looking the runway but we didn't have a problem with noise - it did the trick - so if you are wanting a one night stopover with free shuttle 10 minutes from LAX this ticks the boxes.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Alexie Gottlieb","date":"2013-05-31 20:13:21 +0300"},{"content":"I gave great reviews on my first stay and was greatly disappointed with my recent stay. There were numerous issues, but I'll just focus on the main ones here. 1) The check-in staff was efficient but not friendly or smiling and also failed to look into my inquiry when she said she would take care of it after checking us in. 2) We reserved and pre-paid for a room with a King-sized bed and got a surprise when we entered the room and found that it was a double bed. After calling, we were then told that there were no rooms with a King or Queen-sized bed available due to a pipe-bursting problem. If the check-in staff had been more professional, we should have been notified of the hotel's problem and given options right away instead of having to discover it for ourselves. 3) One phone was broken, and Line 1 on the other phone was broken. The ethernet cable was missing. The room did not look well-kept. 4) Upon our request, we finally were moved to a different room with a double bed that looked more decent, although there was a seemingly open and used soap at the sink and the phone handset was not working the next morning. Why I gave a rating of 3 instead of 2: On the positive side, I would like to commend Salvador for being upbeat and helpful when moving us to a different room and Gerald for handling our issues promptly and professionally. We did receive the hotel credit as told. The staff had been polite at all times. I am hopeful that these issues will be resolved or prevented for the future.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Tanya Fahey","date":"2014-12-14 16:55:13 +0300"}],"public_likes":["Miss Abelardo Mitchell","Leon Kuhic"],"vacancy":false,"description":"One of the only hotels in Santa Monica that is directly on the Beach and has prices that reflect this rare amenity. Share pools, spas, etc. with Shutters.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}