{"title":"Old Hunstanton and Hunstanton","name":"Magazine Wood B&B","address":"Peddars Way, Sedgeford, Hunstanton","directions":"Sedgeford is signposted at Lavender Corner on the main road into Hunstanton","phone":"+44 1485 570422","tollfree":null,"email":null,"fax":null,"url":"http://www.magazinewood.co.uk","checkin":"3PM","checkout":"11AM","price":"£40","geo":{"lat":52.90256,"lon":0.55932,"accuracy":"ROOFTOP"},"type":"hotel","id":21181,"country":"United Kingdom","city":"Norfolk","state":null,"reviews":[{"content":"There were many benefits to this hotel- suites (good for putting small children to bed before parents), shuttle (with VERY courteous, thoughtful drivers- though you have to schedule everything in advance), GREAT housekeeping staff (the best I've ever had in a hotel), nice view of the river (and the traffic next to it). The downsides were- The pool was COLD, and the hottub was cool. The restaurants were VERY expensive ($20/person for the breakfast buffet- we ended up buying peanutbutter and yogurt for our room instead), the parking was $35/day, Internet was $10/day (we didn't indulge), the bathroom didn't have a fan and the closest T stop was a 15 minute walk, over some rough sidewalk terrain (hard with the stroller) and if there was anything going on downstairs in the conference area you could hear it in your livingroom, along with all the doors on the floor slamming shut. The concierge was always very helpful. The frontdesk amended the bill quickly when we were overcharged compared to the rate we booked over the phone. The shuttle was a nice way to get into town, though we found trying to schedule our returns too difficult and just took the subway and walked. Overall, we had a good time and it served its purpose of a good home-base for a long weekend away.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":2.0},"author":"Mrs. Layne Gulgowski","date":"2012-08-01 15:24:45 +0300"},{"content":"-- Basic hotel -- feels like it is used a lot -- feels a bit like an airport hotel - Restaurant staff were EXTREMELY friendly - Perhaps a bit too busy at times-- two glasses stayed outside my door for two days -- they were there when I checked in! To their credit, when I let them know -- they were gone in 20 minutes.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Zola Bradtke","date":"2014-08-28 16:48:11 +0300"},{"content":"As Marketing Manager for a major corporation, I cover the New England territory and stay frequently in local Boston area Hilton hotels. I stayed at the Doubletree Boston in early April 2010 for business reasons - this was my first stay at this particular location. From the moment I entered the lobby and went to the front desk, I experienced the BEST (and I mean BEST) customer service that I have experienced in a long time. The front desk personnel were helpful and friendly, and went out of their way to make me feel welcome. Knowing that my family and I were planning to come back for a few days in late April to college hunt as we live in a nearby state, I cancelled reservations at a competitors hotel, and booked again at this location for a stay from April 22nd - 24th. Once again, the customer service was AMAZING!. Now, for the important part....the room was clean (not exceptional - could have been a bit better), however, it was cozy, the view was incredible, the beds were super comfortable, and everyone who helped us was AWESOME. DJ at the front desk - *****, Frederick the Concierge, *****, Delmy, Housekeeping,*****, Ty - Engineering/Maintenance, *****. This hotel is doing something very right and I applaud the General Manager of this property for giving some leeway to the staff to offer the little extras that make the guest feel important and welcome. In a day and age where we have too many choices, I can assure you, this location will be my first choice for both business and personal travel to Boston. Lastly, the breakfast buffet was excellent, and the shuttle to Boston was super convenient. I hope that the staff at this hotel continues to treat guests in the same manner, as this is noticed, and so important more than ever today!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Melisa Swaniawski","date":"2013-08-18 19:30:38 +0300"},{"content":"and Warm Cookies too. really nice breakfast buffet - can get a package to include it - made to order omelettes and pancakes. Dinner was awful - raw prime rib, cold soup - don;t eat in restaurant but breakfast very nice with great views. Ask for room with river view. Can get free parking in a package - ask for it. Front desk vewry nice. TVS in living room and bedroom didn;t work. Heat in bedroom didn;t work. But free coffee in room and Starbucks for charge in lobby. Very nice bed - comfy. Really in Cambridge - not really in Boston. Not a good location for Freedom Trail - have to take a car or bus to tourist things.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Brant Waters","date":"2014-09-13 16:24:55 +0300"},{"content":"The room was spacious enough and had a great view of the Charles River. The service was excellent. The concierge made great recommendations for nearby dining. The only negative things I have to say is that the location is a bit odd for sightseeing although the shuttle is convenient enough or you can walk to the T (try to avoid driving into downtown Boston if you can unless you want to pay an arm and a leg for parking). The other thing is the value for the room itself is good but then I had the feeling of being \"nickel and dimed\" to death. I had to pay extra for the parking, I had to pay for internet service, breakfast was not included (most of the suites hotel I stay at have a breakfast bar). That sort of thing. But all in all a very pleasant stay and I would recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Reece Ferry IV","date":"2013-04-09 20:11:40 +0300"},{"content":"I have stayed at the Doubletree Suites Boston fairly often. In my most recent review I alluded to the encroaching ravages of age in the hotel. (In me too, but that is another matter!) The hotel has been refurbished and refreshed: microwaves have been added and furnishings updated. The location is still a matter of taste. It is 0.9 miles to the nearest T stop at Central Square, but I do not mind the walk. They still charge for on-site parking, which seems incredibly petty. They still charge for private internet, but the free public internet does reach virtually all of the rooms, and is adequate as long as you are not downloading files, etc. Once you cut through some of the penurious policies of the hotel, it is clean and spacious with a pleasant staff and comfortable suites that are often quite affordable by Boston standards. It is helpful if you like to walk!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":2.0,"Rooms":4.0},"author":"Nyasia Adams","date":"2013-09-02 06:50:47 +0300"},{"content":"My husband and I drove from Vermont to see a Red Sox game, and spent one night at the Doubletree Guest Suites. We booked the room on Priceline and were pleased at getting such a good rate. When we arrived at the hotel and went up to our room, we found a beautiful 2-room suite with TWIN BEDS in the bedroom. Priceline had given us no indication of this, of course. Well, this wasn't what we had in mind. I called the front desk, and a very pleasant young man listened to my story. He could not have been more helpful. \"I've seen that with Priceline reservations, people don't know what type of room they're bidding on. You'll want a different room, of course... let me see what I can find for you... I have a room with a king bed on the 6th floor. Would that be all right?\" Goodness, yes, I replied; what will the extra charge be? \"Oh, no extra charge, ma'am, we're happy to accommodate you.\" Rarely do I see this level of service when I travel. What a pleasure! The hotel itself is beautiful, with a center atrium, 14 floors, glass elevators... beautiful views from the room of rowers sculling on the Charles River in the morning. The hotel's shuttle brought us to within a 15-minute walk of Fenway Park, which was very helpful. The suite itself was roomy, spotless, with plenty of room to sleep, work, relax, snack. Big screen TV in living area, second TV in bedroom. Mini fridge, microwave and coffee maker were very welcome. My ONLY quibble with this hotel, and many others -- in this day and internet age, it's silly to charge ($10/day?) for high-speed internet. It would be like charging for telephone or TV 30 years ago. Lesser hotels all over the country offer internet/WiFi for free; it's time for the Doubletree (and the Boston Four Seasons, for heaven's sake) to do the same. In any case, this hotel would make a wonderful base from which to explore Boston.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Holly Metz","date":"2014-04-27 06:11:26 +0300"},{"content":"My husband and I went to Boston to see a jazz show at Sculler's Jazz Club. The jazz club is located in this hotel so we decided to stay there. We arrived around 1pm and our room was not ready but they held our luggage and we had lunch in the restaurant. The suite was on the 8th floor and was very well laid out and we enjoyed it. There is a separate bedroom and living/dining room and they are separated by the bathroom and fridge/microwave area. All the suites look out on to the center atrium area and it is a bit noisy but not enough to disturb your sleep. The jazz shows were excellent and we bought the dinner and show package for one of the shows and it was a good value. It was a 3 course meal with an excellent choice for dinner and then great seats for the show.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Rooms":4.0,"Location":3.0},"author":"Ben Jacobs","date":"2015-12-23 16:36:45 +0300"},{"content":"It is hard to find good service these days, but the staff at the Doubletree was fabulous. I stayed there with my family, including two children, for four nights and was pleasantly surprised by their warmth and hospitality. The suite is perfect for families. And the cookies were delicious!","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Mae Ritchie","date":"2012-02-16 23:37:53 +0300"}],"public_likes":["Genesis Franecki","Mr. Golda Terry","Joseph Leuschke","Esperanza Beatty","Myron Conn","Salvador Rempel","Jacey Abernathy"],"vacancy":false,"description":"Bed and breakfast overlooking the North Norfolk coast. Set in 3 acres of park and woodland looking over the coast from the village of Sedgeford.  Villages such as  Burnham Market, Brancaster, Thornham and Holme are a few minutes drive away.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}