{"title":"San Francisco/Civic Center-Tenderloin","name":"Civic Center Hotel","address":"20 12th St","directions":"between Franklin St and Van Ness Ave, just one block west of the Van Ness MUNI station","phone":"+1 415 861-2373","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"Single occupancy with a shared bath: $150/week. Add 14% tax for the first 4 weeks and a one time $15 key deposit","geo":{"lat":37.774,"lon":-122.42,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25593,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed at the Chancellor hotel at the Union Square from 21st to the 29th of Aug, for a conference at the Grand Hyatt and we really enjoyed it. Check in : Easy and a friendly. We had requested a refrigerator in the room (based on one of the TA reviews… it really was very useful) Room: Really comfortable for two people. The walk-in closet really expanded the space so that you could store your suitcases and not bump into anything. We had asked for the topmost floor overlooking the Union square, based on TA reviews and were glad for the choice. We weren't bothered by traffic or noise, and in fact found the music filtering in every evening from the Union square really charming. The sound of the cable cars and fire engines wasn't bad enough to disturb our sleep. Bathroom: Slightly on the smaller size, but big enough when we used it one at a time. Wished we had used the comfortable bath-tub (and the rubber duck). Lobby : The hotel lobby is intimate and cosy enough that you welcome coming back after a cool and tiring day. The freshly baked cookies with different types baked everyday (chocolate chip, raisin etc), coffee and apples were appreciated. Infact after the first day, when we had Starbucks, we didn't really feel the need to have any coffee elsewhere. ( I usually obsess over my coffee, and I really liked it). Location: (I hate saying \"location, location, location, location) Great. Just right next to Union square, a hop across to cafes, diners, small bistros, delis, a cable car stop right across, and very convenient for our conference also- just a block across. Staff: Rory, Steve, and the other guys at the reception- very helpful. Any question we had, use of the business center to print our boarding cards, picking up a Fedex for us and calling us up when it came- very helpful. Luques Filling breakfast with cheerful staff (especially Nancy). We had breakfast a day before the conference and it was really good. Bacon usually is too salty to eat, but even an occasional non-vegetarian like me enjoyed it. My wife had the veggie menu and felt her breakfast was ok. Smell: I know somebody had mentioned some smell in the lobby. I didn't really notice any smell except the nice smell of popcorn. There was however some funny smell in the passage outside our room. Just a minor point, and not really a big issue, as the room was comfortable, (non smelly) and the location cant be beaten. Would we come back here- Yes! in a heartbeat.. Just loved San Francisco, and the convenience and homely feel of the Chancellor had a lot to do with it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Burdette Bauch","date":"2015-12-12 04:45:31 +0300"},{"content":"Booked as part of a road trip, we arrived by car and had valet parking, although slightly more than parking ourselves it was well worth the extra to just unload and get our room. Friendly front of house staff informed us about the free cookies, fruit etc in lobby and our cases were taken up to our room. Rooms are clean, and have all the necessities, including free wifi. Some have mentioned size as an issue, but coming from the U.K. we felt it was good for a boutique hotel in a city. Bathrooms are old fashioned (vintage !)but the deep baths are fab to soak in. Dinner at Sears next door recommended. One point to mention was the really informative and helpful female bartender - a font of knowledge about bars and eating in the area. Will visit again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Bernadine Mann","date":"2014-03-05 12:16:54 +0300"},{"content":"WOW! My wife and I continue to be astounded by The Chancellor Hotel. We stayed at this property from September 4 - 10, having stayed here previously during July of 2007. The entire hotel staff, from the reception desk folks to the bellmen, the concierge, the maintenance personnel, the housekeeping staff and the wait staff and bartenders in Luques, everyone was wonderful. This hotel is beyond words. To our surprise at check-in, we had been upgraded to a suite on the top (15th) floor of the hotel, overlooking Powell Street and Union Square. What a terrific view and location. We thoroughly enjoyed the expansive two room suite, complete with two televisions, two full baths, a large walk-in closet and personal safe. (Thanks Wes for the upgrade and special recognition of our celebrations.) We ate breakfast each morning in Luques Restaurant, attached to the hotel. This was not only convenient, but also provided us with a great start to each day with a fantastic assortment of delicious food. From Brioche French Toast to Praline Pancakes to out-of-this-world omelets, our breakfasts were delightful and very filling. On several occasions, we had the opportunity to imbibe at Luques Bar. Their Mud Slide Martinis and White Russians were fantastic! As many previous reviewers have indicated, the location of The Chancellor can't be beat. We were able to use public transporation to get anywhere and everywhere we wanted to go. The close proximity of the cable cars and Muni rail system really made getting around San Francisco quite easy. While there, being big baseball fans, my wife and I were able to attend two SF Giants games, taking advantage of the Chancellor Hotel SF Giants baseball package promotion. The field level seats provided by the hotel were fantastic. Rest assured that we are telling all of our friends and family back home in North Carolina that there is only one place to consider staying while visiting in San Francisco. The Chancellor Hotel can't be beat! You will be wasting your time if you look elsewhere.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Doyle Windler","date":"2015-08-26 02:55:09 +0300"},{"content":"I stayed at the Chancellor for three nights in August and had a wonderful stay. All the reviews on here are right; the Chancellor is a charming boutique hotel in Union Square. I arrived early and was able to check in right away. The lobby is inviting and part of the charm. There is always coffee and cookies/fruit available in the lobby. The little bar is perfect for drinks and they have a great happy hour as well. The restaurant has excellent food and is very well priced, especially for a hotel. One thing I noticed was the hotel does not gauge prices. Everything is priced right, from the bar to the restaurant to the in room amenities offered. The room was perfect, just as the website described. I couldn’t have asked for a better room. My room was on the 9th floor with a view of Union Square. The bed is extremely comfortable and they offer a free pillow menu, which was a big plus. The room also had a small work desk and 2 separate chairs with a small round table. There was plenty of space to put your things. I also loved the walk in closet, plenty of room to store the luggage etc. The bathroom was well stocked and had a nice deep soaking tub. The windows opened to allow fresh air and the ceiling fan made sleeping very comfortable. Wes and his staff do an amazing job. Everyone I came into contact was genuinely friendly and would always say hello. The location can’t be beat and I would recommend the Chancellor to anyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Brycen Bednar","date":"2014-06-02 15:38:51 +0300"},{"content":"Stayed at the Chancellor for 6 nights. It's location is ideal for seeing the city. You are right on Union Square and are close to all public transportation options. The onsite restaurant was a good option for breakfast and we found it better than a few of the breakfast spots within a few blocks of the hotel (Sears, Lori's Diner). The room was clean and a good size for two people. Our room was on the front of the hotel and there was a bit of noise from Powell Street but the hotel was nice enough to provide a white noise machine. This made sleeping very easy. I'd stay here again in a heartbeat - excellent location, great value and great staff.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Crystel Reinger","date":"2013-01-23 01:48:11 +0300"},{"content":"This hotel is just excellent!! Location is perfect, the rooms were nice and clean. And the hotel staff is so friendly and helpful. I was really impressed about how service minded they were! My friends and I stayed for 4 nights and had nothing to complain about. I will definately book Chancellor for my next stay in SF!:)","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Eldora White","date":"2015-12-24 00:58:36 +0300"},{"content":"A location that can't be beaten in SF. Staying for four nights we upgraded to one of the hotels two suites which were right at the top of the hotel and therefore pretty quite. Staff great from check in to check out and were a mine of information. Room service was very good and the free bottle of wine on arrival as it was my wifes birthday was very nice. One note of caution the hotel does not have Air con which was fine for us but may be of concern to some.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Rosamond Paucek","date":"2012-04-12 10:57:28 +0300"}],"public_likes":["Cameron Friesen","Elvera Torp","Friedrich Quigley"],"vacancy":false,"description":"Furnished rooms with a sink in each room (no televisions). Only metered street parking is available at the hotel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}