{"title":"Yosemite National Park","name":"Camp 4","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$5 per person per night","geo":{"lat":37.741667,"lon":-119.6025,"accuracy":"ROOFTOP"},"type":"hotel","id":33890,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"Horrendous experience Nothing positive to state about my stay @ Punta Cana Hotel Resort- The room was dirty and smelly- Bed linen and towels were repulsive--Believe it or not was laying on a hammock and was sprayed with insecticide all over-- and was told by workers not to worry that they were merely spraying bugs and that this was customarily done daily @ 6 PM- There was only a very small part of the beach that one could bathe in- the rest was dirty and dangerous--No life guard on duty!! you swim @ your own risk!!!--Food was High School cafeteria quality and overly-overly priced- Nice ocean view but did not compensate all other aggravations- will never go back to this resort and would not recommend anyone to go there.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Dr. Dudley Brekke","date":"2012-08-11 12:43:27 +0300"},{"content":"5 star prices for 1 star service! I just spent two months in this place, from June 26th to August 23rd (for work), and can't say too many good things about this place. I named my experience here A beautiful nightmare. I'll start by mentioning that I was robbed during my first week there. Someone stole my Ipod, digital camera, leatherman tool, and all my computer recovery cd's from my room. Of course I reported the incident but they did nothing to reimburse my loss. About 5 weeks later my cell phone grew legs and walked out of my room as well. So the lesson learned here is USE THE SAFE! The food, I had diarrhea for 6 weeks! Should I say anymore?Cold showers, leaky rooms, doors don't lock, a/c doen't work, floors are extremely slippery when wet (but they are pretty), and the service is painstakingly slow. Oh did I mention the food sucks! The breakfast at La Cana is good only because of the view of the ocean as you enjoy waiting 15 minutes for your coffee, dinner at La Choza is pleasant as long as the tractor isn't out a 8:30 pm dragging sand while you try to enjoy the ocean breeze, and the menu at La Yola is appetizing as long as you have plenty of cash! The menu at Francos Pizza has got to go, because if Dominican food is what you want, it won't be here, in fact it won't be anywhere in this resort. You won't even hear any local music, there was simply no culture in this resort. I might was well have stayed at La Quinta in Central Florida! Oh, l can't forget to mention the night club, the one that has only 1 employee dancing waiting for the guests that never arrive. The crickets in the garden were having a better time rubbing their hind legs.It seemed the only time guests stayed here is when a flight got stuck or was overbooked so they threw them all into this place. Hmmm.........Other than the fact that the location is very nice, I would never want to stay at this over priced motel ever again. There are just too many deficiencies to point out, the best part of my stay here was riding the catamaran, swimming in the springs, and going to the spa. The place is in dire need of maintenance and new management, it has potential, just not right now.","ratings":{"Service":1.0,"Business service":2.0,"Cleanliness":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":1.0},"author":"Mr. Anna Nikolaus","date":"2012-09-28 06:44:48 +0300"},{"content":"Fantastic! Excellent! Flawless! During our Feb 10-17th stay we were in paradise. The resort was stunning, staff beyond friendly and helpful and the food was fantastic. A big thank you to Raul  Alexander - you were both so wonderfully helpful  kind! Our kids (5  3) had a blast in the kid's club. A big hug to Marlene at the kids club - you were great!We are looking forward to returning next year! Thank you!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Keegan Jakubowski","date":"2015-03-18 12:25:10 +0300"},{"content":"Good Vacation- Depends on What You Want! July 28- Aug 4, 2006We just returned from Punta Cana Yesterday. We are 2 professionals with teens aged 13 and 15.We travel to a different destination each year for summer vacation and picked this resort because we wanted a 2 bedroom beach villa, that was close to airport. (Didn't want to take all day to get to LA Romana) The resort is beautiful, as was our beach villa. There were 2 very private rooms, but we were unable to enjoy our open air living room due to mosquitos, and they were also a problem at nite in the rooms. We brought 3 cans of bug spray and used all 3.The food at the lunch and evening restaurants was excellent, but there were problems with the buffet. (I am not a buffet person).The butter was rancid, even after I brought it to their attention. The milk was not cold enough for teens to drink, and bugs again were an issue for me.The beaches were beautiful, but I thought too much sea weed. The kids were not affected, and we all loved using the kayaks, hobie cat, and wind surfers. They took us out snorkeling, and that was also fun. ($24.00 per person/hour for snorkeling)Beach bar service was limited in that the beach waiter left at 3:00 and the beach bar closed at 4:00.( We stayed on the beach till 5:30)Deep Sea Fishing was beautiful, but quite rough. We took Meclizine prior and I highly recommend that approach. Only caught a baracuda, but saw beautiful dolphins. ($125.00 per person/ half day)Trip to Saona- DONT DO IT! The resort services failed to tell uswe had to leave before breakfast (or room service available), and that the trip took 3 hours there, and 3 hours to return. (Very long trip for 2 hungry teens) The catamaran to Saona was great but basically a booze cruise. They had Coke, but no bottled water even for purchase, and after what we had brought was gone- that was a problem. Food on Saona not great. We cancelled both horse back riding, and Bavarro Runners trips. No one wanted to leave the resort again. ($85.00/person to Saona)Golf course was spectacular, but water only available at the turn. Bring 5-6 bottles when you set out. (There is no drink cart that comes around)Absolutely no activities for teens outside of the water sports. In the evening the fooseball, ping pong and pool were not available. During the day there was no organized soccer, beach volleyball, etc. One nite there was a Latin Dance show, otherwise- nothing else. If your kids only want to read or watch HBO, that would be great. (ours are more active) We tried to take the games in the beach activities center out for the evening, but that was not permissible.There was nothing written in English that gave you all the information you needed- like restaurant times, available activities, a resort map, an island map, possible excursions with costs, daily activities, etc. I realize that not speaking Spanish, and going to a Spanish speaking country is my problem, however had everything been written in English, it would have saved me a lot of time and effort. We enjoyed our family time together, and thought the resort was beautiful, but had some expectations that were not met. We would have enjoyed a relaxing week had my husband and I been alone, but it was not what we had hoped for entertaining our kids.For the above reasons, we would not return. If you are traveling there or plan to I would be happy to provide you with any information I can- email me : merlot59@yahoo.com","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Elian Schuppe","date":"2014-12-31 12:15:00 +0300"},{"content":"A terrible experience, will never return again This is the hotel that definitely does not live up to their rating and price. I have seen others' reviews on this resort. All the good things they mentioned should be expected for this so-called 4-star resort. I had such a terrible experience. I suppoesed to stay there for 5 days, but couldn't stay any longer after 4 days, so we checked out a day ealier. There are too many bad things to list here. Let me just give you some examples. First, it took us about 1 hour to check-in. 1 HOUR!!! And there was like one person in front of me. I don't know what kind of working pace they are on. The package we got was all-inclusive. And later we were wondering what kind of all-inclusive is that: breakfast and dinner, and we have to pay for drinks! WOW. ALL-INCLuSIVE!!! Here comes an even better one, the first day we checked in, we wanted to reserve a table for the restaurant, and they said it was full. Hmmm, ALL-INCLUSIVE again! So we ended up in the buffet restaurant. The second night we got to the restaurant, we got seated and all other regular routines. Now the real thing start: we are only allowed to order one item out of each categories: appetizer, soup, main course, and dessert. It's ok, we can take that. After the appetizer, it took about 30 MINUTES to get to the soup, then, it took another 45 minutes to the main course. And over there was not bust at all. Maybe totally 1/3 of the seats were full. And there are many waiters and waitresses walking around. Our waiter particularlly seem dont care what we want. I dont care how fancy the restaurant, it won't need to take 2-and-half hours to finish a dinner, and totally 4 dishes. after we got the main course, it took us 5 minutes to finish and run out right-away. Look at the word: RUN! We just can't wait to get out. There are just too many bad things. And one incident has already taken me so long to write about it. Overall, I don't have a good experience, I would not suggest any one going there, and will never return again.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":2.0,"Rooms":3.0,"Location":-1.0},"author":"Dillon Hudson","date":"2012-02-16 06:29:57 +0300"},{"content":"I look forward to my next visit My girlfriend and I stayed Jan 18th -20th. As always we read reviews and took the ones written into consideration. We are airline employees and understand that, a person will have a bad view of a vacation if it starts off bad. We loved it. and as far as the food we never got sick. It is the non potable water which makes a person sick. The food was good and plentiful. I didnt have any issues with my charges. I will return","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Miss Elva O'Connell","date":"2012-11-18 16:32:34 +0300"},{"content":"What to expect at Puntacana Resort We went to this resort 8/17-8/22. We called the resort a few days before and asked that they pick us up at the airport ($35), which was very nice. When we arrived they had a big sign with our name on it and we waited in no lines. She pretty much did everything for us. It was about a 10 minute drive to the resort. The resort was nice and secluded(knowing some Spanish is highly recommended). The first room we had was $@!#% (deluxe standard). It smelled and it was hard to explain it to the housekeeper and at guest services. The housekeeper sprayed some awful spray in the room to cover it up. When the head housekeeper walked in she was coughing so badly she understood the problem and let them know about the room. I went in other rooms and they smelled the same. They offered to give me a different room the next day, but i'm sure it would smell as well. I ended up upgrading (for extra money of course) to a junior suite, which was very nice. The food was average. Nothing was horrible, maybe just questionable (octopus was in some dish). La Cana the main buffet was never crowded. At times I wondered how many people were really at the resort it was so quiet. My husband did have the runs for a couple days. Based off of this website I brought some tums and imodium so he was ok. Franco's Pizzaria was the best place that we ate. The beach was beautiful. The wind never stopped blowing. There was topless sunbathing, but not a big deal. You never have to worry about getting a chair. Like I said, you wonder how many people are at the resort at times, because nothing is ever crowded and it is almost always quiet. We went horseback riding on the beach ($40- for two people). Nice but they give you hardly no instruction or tips about riding. There is no nightlife. There was a show one night, which was entertaining (a band, some native dansing, and flame blowing). The disco was usually empty. Most people were Europeans or Latino. Very few Americans.A good list of things to bring with you are magazines (they are $8.00 in the resort shop), medication (tums, imodium, pepto, tylenol, itch creme for bug bites), plastic bottles of water and soda ($2.50 at the resort and not included in the buffet), snacks (candy bars/chips are very over priced at the shop and mini-bar), and lots of singles for tips. Everything we found was overpriced in general. Bike rental-$15 per person/per day. ATV-$110 for two people. Maybe i'm just cheap. Oh yeah, at the airport we paid $6 for two regular sized sodas.With all that said, have fun.........I did, but I doubt I will go back any time soon.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":2.0,"Rooms":3.0,"Location":-1.0},"author":"Ibrahim Gibson","date":"2015-08-30 23:30:52 +0300"},{"content":"Good value, little to do other than golf       3000 bldg from balcony","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mr. Jena Marquardt","date":"2013-02-21 08:10:45 +0300"},{"content":"Wonderful Experience My partner and I just returned from 4 glorious days at the Punta Cana Resort and Club. We arrived at the beautiful International Airport via USAirways, and made it through customs in about 5 minutes, and paid a $10.00 dollar arrival tax. Since we did not check luggage, we quickly made our way to the taxi stand outside, and had our pick of eager drivers, all dressed well and groomed, with clean autos. Take one in the beige/sand color as they are official. After a quick ride to the Hotel, about 10 minutes at best, we were quickly checked in and taken to our room by golf cart. The room was a king over looking some gardens with huge palms with the aqua blue Ocean beyond. The room had a safe, and the A/C worked great, at times almost to cold. Well appointed with a spacious bath, and plenty of towels, very clean. Nonsmoking is offered.I would suggest that you rent a golf cart for your stay, $30.00 per day, well worth it, as the resort is huge and beautiful. We spent our first day at the main beach, and had our pick of chairs and location as it is off season in the summer months. Dinner and breakfast was included, and both are buffets in a giant open air Resturant the La Cana, it was a different theme every night, and the food wonderful. Rather large variety of fruits, salads, meats, breads, and Island specials. Service was excellent! We never once had a upset tummy, and we at times drank the water. Bottled water is only a dollar, and fresh ones are brought to your room every morning, Ice can be had at the pool bar.We spent our second day at the marina pool and had it to our selves all day. Very quiet. In addition we tried the Marina Resturant La Yola for lunch it is in a lovely setting with great food but a bit pricy. $45.00 for lunch, we had pasta. We found the Grill at the Golf Club to be a better lunch place, priced about $20.00 and a georgous setting, the pool there we had all to our selves on the third day. The beach was a bit rocky at the Club house but the water was beautiful, and the view magnificent. I must say we had no issues with this resort at all, perhaps because it was off season, sometimes to many people can spoil the experience. The staff was great, and if you can speak just a few words of spanish you will get by fine. The other guests were mostly couples, French, English, German, and Spanish. Also, there were gay couples who seemed relaxed and welcome. I saw only a few kids, there is a kiddie pool and small playground. But the Resort didn't seem to cater to kids, European women do sun bath topless, everyone seemed to be discreet, and mature about it. Do not make this an issue for you not to visit Punta Cana Resort.Since this was our first land resort experience, as we often cruise on Celebrity Cruises, and had high expectations, we could not have been happier. The only negative was a few bugs at sunset so take some bug spray, only a problem one night when the ocean breeze was clam. American dollars are welcome, I would suggest taking several ones for tipping. The big plus was the fresh water lagoon, sooooo cool. The locals use it in the afternoon, so get there in the morning, and take aqua shoes, as the rocks are slippery. The water is as clear as glass and refreshing. A small gift shop offered suntan lotion, snacks, and small gifts.........Have a great time, and enjoy your self. We will go back to Punta Cana Resort and Club, for all those people who had a bad experience, give then another try. You can spend more and get more else where, but you don't have to.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"London Rolfson IV","date":"2015-05-12 06:24:30 +0300"}],"public_likes":["Ena Rau","Jackie Windler","Kathryn Beier","Mrs. Zachariah O'Connell","Hadley Skiles","Vanessa Hermann IV","Odessa Schultz","Jaden Bauch"],"vacancy":true,"description":"This walk-in campground is in Yosemite Valley, open year-round, and offers 35 sites on a first-come, first-served basis.  All sites are tent only.  Note that with six people assigned to every site this isn't the quietest of campgrounds, so light sleepers may want to bring earplugs.  Campground is world famous among the rock climbing community and as such can be EXTREMELY popular during the peak season.  Prospective campers can expect to see people waiting in line for sites as early as four o'clock in the morning.  As of 2011 all campers wishing to stay at Camp 4 need to hold their own place in line.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}