{"title":"Sonoma","name":"Ledson Hotel","address":"480 1st St East","directions":"East side of the Sonoma Plaza","phone":"+1 707 996-9779","tollfree":null,"email":"info@ledsonhotel.com","fax":null,"url":"http://www.ledsonhotel.com/","checkin":null,"checkout":null,"price":"$350-$395","geo":{"lat":38.29243,"lon":-122.45647,"accuracy":"APPROXIMATE"},"type":"hotel","id":27824,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"Excellent Crest Hotel Suites Just returned from this hotel and we found it to be really good. We had booked separate single rooms and were pleasantly surprised by the cleanliness and standard of the room. The bathroom was very clean and more than adequate, beds were queen size (we had paid extra for single occupancy). Slight downside was the noisy a/c unit. The staff are very friendly and the small restaurant/cafe is really excellent for breakfast or lunch - Samantha and Virginia in there were particularly pleasant  helpful. It's a relatively small hotel with 60 + rooms with a small pool and it is located only 5 mins walk from the beach and right amongst the Lincoln Road shops/bars/restaurants.It depends what you are looking for - we were 2, 50+ yr old blokes looking for good accommodation close to the beach, bars etc., and were very happy with the hotel and it's staff. It will suit any age group other than I would say families with small kids wanting to hang around a hotel with a large pool.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Mayra Ziemann","date":"2015-09-16 09:19:55 +0300"},{"content":"Perfect Stay I have no complaints about the Crest Hotel. Location was great and everything was within walking didtance. Rooms were nicley sized and the staff were very friendly. I would absolutley recommend this hotel and I will plan on staying here again!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Reyes Kertzmann","date":"2012-05-20 23:56:10 +0300"},{"content":"What a DIVE! The best thing I can say about this hotel is that it was pretty centrally located. Reading the other descriptions, I wonder how this could be the same hotel we stayed in. There were six of us at this hotel for four nights. We had three separate rooms. The first day we watched a roach walk along the hallway to our rooms. The beds were NOT good (as someone mentioned). They squeaked, and were thin, and soft. The rooms were exceedingly small, and the bathrooms even smaller. Only one person could fit in our bathroom at one time. The shower was so small that there was no way to even bendover in it. The bathroom was very simply remodeled with tile and a new sink..But the faucet was so close to the back of the sink, that it was hard to wash one's hands. The noise level from the restaurant next door..or whatever that was..kept us up at night. In one of the other rooms that two of our group was staying in, they could hear cats crying outside. at night. There is one very, very small elevator that sometimes didn't work. The staff working there seemed nice. That was a plus. tHowever, we all couldn't get over just how cheap the rooms were. Even the towels were small and rough. The outside of the hotel looks fine, and the lobby is okay too, but the rooms are the worst we've ever stayed in. This should not be rated as a three star. If this is what three stars are like in Miami Beach, , I hate to see what a two star would be like! As to the hotel being called a Suite Hotel, none of us could figure how they can get away with that title. The rooms were way to small to fit anything but a bed and a very small table. There was a decent closet in the room. I usually do not write reviews, but I just felt I had to let people know about this one! If you don't care about anything but just having a place to sleep, this hotel would be okay..But the rooms are really not up to what one would expect in a three star hotel.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Salma Beahan","date":"2015-02-23 01:21:06 +0300"},{"content":"Its cheap...but not that bad. I was unsure about staying in this hotel, due to all the dicy reviews, but i booked it anyway and I am still glad I did.Myself and two girlfriends from San Francsico stayed here from Aug 17-22nd 2005. And I admit we were a little dissapointed. One, the rooms are very small. And when you have to share it with 2 girls that take at least and hour each to get ready..its even smaller. Other than that it was fine.but you can't beat the location, right in the middle of everything and close to the beach.The pool was a [-] hole, leaves and whatnot in it. But you are less than 2 blocks from the beach so who cares. The Albion next to the Crest was beautiful and had a great pool (it was our second choice and I do wish we went with it instead, but oh well) so if you want a nice pool and fair price stay there. We also had all if not the same troubles that are listed on this site...read below to see how we deal with it and you'll have a good time at the crest.I can see how some people had trouble with the desk help. We are from SF, and have a different level of expectation when it comes to customer service not to mention vibe. But people, this is Miami and every single person there from the homeless to the yuppies has an attitude so you just have to deal with it. Diffuse the situation like we did. Chat it up with the desk people and be friendly and flirt to anyone whome you may want something from later. We did and found out a lot about them. Like the fact that there are only 3 of them (from Brazil) and they work 12 hour shifts 6 days a week and sometimes seven. I don't know how the labor laws work in FL but that would fly here in Ca. We were able to get extra towels, check out later at 2:00 PM (and only because the hotel was not ful), get directions, and basicaly made a temporary friend behind the desk who could hook us up. Yes, there were only sheets on the bed, but we asked for blankets and got them. True, the bar and cafe (which we never went to anyway) has weird hours, but there is a whole damn city to eat and get drinks at.All in all it is moderetly priced for Sobe. But the location is killer!! If you are goin with you family and need extra attention and high expectations, don't stay there. If you are young, fun, and going to have a crazy time (like us) then stay at the crest.PS. The Crest was also in my opinion gay friendly. With a few cute Brazilian gay boys behind the desk. So fella's if your gaydar is going off throw a smile and a wink around...like so often in life..it will get you far!","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":3.0,"Rooms":2.0,"Location":-1.0},"author":"Kacey Marks DVM","date":"2015-10-20 13:35:13 +0300"}],"public_likes":["Aiden Kozey","Lavern Becker","Michaela Dare","Zion Wisoky","Jacklyn Mueller","Kristina Reilly","Pattie Beer","Kylie Goldner","Philip Heaney"],"vacancy":true,"description":"Classy inn located on the Plaza with six rooms. Whirlpool tubs in each room and private balconies. Ledson is owned by a wine country family - you can taste the families wines in the tasting room and restaurant on the ground floor. Free internet, and discounts for wine club members on rooms.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}