{"title":"San Francisco/Fisherman's Wharf","name":"Wharf Inn","address":"2601 Mason St","directions":"at Beach St","phone":"+1 415 673-7411","tollfree":null,"email":"info@wharfinn.com","fax":"+1 415 776-2181","url":"http://www.wharfinn.com/","checkin":"3PM","checkout":"11AM","price":"$160-$195","geo":{"lat":37.8078,"lon":-122.4143,"accuracy":"APPROXIMATE"},"type":"hotel","id":25666,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I booked a one night stay here on Nov. 21. I was in much need of some R & R. My job is stressful (I'm a teacher), and my family can be stressful too. So I ran away for a day before Thanksgiving. Once you step through the glass doors, you are transported to another era. The front desk woman was very friendly, as was the bell person (at check-in and out). I recommend the parking valet because it's much easier. I had called a couple days before to request a room away from the elevators. I was given a nice room in the back on the 12th floor. It was a good size and comfortable. I kept forgetting to step up into the bathroom and I thought it was a little small. But the shower pressure was great and the tub was deep. If I had time, I would have soaked in the tub. In the morning, there was the basic hum of the city, but nothing major. Maybe on the Powell St. side, it was noisier, but that's the charm of San Francisco. The staff is incredibly nice. It's in a great location and the cookies and coffee in the lobby are an added treat. Also, this was the first hotel that I've been to that offered an umbrella to use in case of rain. I will be staying here again, and again, in the future. I've stayed at several other hotels in the Union Square area, but never walked away thinking I'd return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Doyle Moore","date":"2015-12-10 06:20:43 +0300"},{"content":"Firstly, we would like to thank Wes Tyler for his generosity and excellent customer service during our honeymoon stay at The Chancellor. We stayed at The Chancellor for 4 nights in early October and booked through an British Travel Agent. When I advised Mr Tyler that it was our honeymoon, without hesitation he upgraded our room to a suite and 'threw in' a Romantic Package aswell (as detailed on the website). The room was of good size and the room was cleaned promptly on a daily basis. We had no problem with any frustrating noises - just the sound of the bustling San Francisco streets below. As other reviews have mentioned, the hotel is ideally located on Union Square, with great access to the whole of San Francisco via various modes of transport. Also good restaurants within walking distance - in all directions ! The coffee and cookies within the reception area, are a lovely touch, which we enjoyed....maybe too often ! We would have no hesitation in recommending this hotel to friends/family - indeed we already have. If you are wanting 5* luxury within a large corporate chain, Hilton, Radisson, etc - this is not the hotel for you. However, if you want a hotel which has a \"family feel\", friendly staff, great location, excellent value for money and provided excellent customer service - I wouldn't look any further than The Chancellor Hotel on Union Square. A credit to San Francisco.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Leila Murazik","date":"2015-02-17 06:39:21 +0300"},{"content":"The Chancellor was exactly as described on tripadvisor.com (and the main reason we booked it). It was very good value for the money (we reserved the park and breakfast package) the rooms were clean and confortable and the staff was professional and curtious. The parking for the hotel was located around the corner and it was too much of a hassle to park (however, a car is not needed while you are in SF) The hotel restaurant was a little pricey, but afterall, this is San Francisco. A recommended restaurant is the Marine Memorial restaurant around the corner on about the 12 floor...you get a great meal, a wonderful view of the SF skyline and almost no one is there (many people believe it is a private club, which it is not) We would definitely stay here again and look forward to visiting this incredible city again in the near future.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Alisa Price","date":"2015-05-27 17:03:01 +0300"},{"content":"The place just keeps getting better and better. We were a bit exhausted from a long drive, and we were ready to get checked into our hotel. We made our way into a nice lobby with friendly staff and complementary cookies. There were lots of other little touches in the room that will leave a lasting impression but I will leave that for you to discover. It is nice old style city hotel with the benefit of some modern conveniences such as movies on demand and wireless internet in the rooms. I suppose the rooms are a bit small, but we had a big closet in our room with luggage holders, so we never felt cramped at all. The breakfast is very good. We spent five nights and had breakfast five mornings. We were on the 10th floor, so maybe we were above a bit of the city noise that others have complained about, but we found it to be very quiet. If you like the idea of a hotel with some character in a great central location, I highly recommend the Chancellor Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Brady Frami DDS","date":"2015-06-05 20:56:58 +0300"},{"content":"We just visited on July 13th and 14th (wife and I). The Chancellor gets such great reviews here on TA that I will dig deep to find some criticism. Sorry, could not find anything to complain about. Great location, Great value, Cosy room, Great staff,. Even the other guests all seemed nice. I left one morning at 4:45 and the Doorman was very cheery ( I suspect all the Doorman are cheery in their sharp looking suits as compared to the outfit the Sir Francis Drake guy has to wear across the street) I will only stay at the Chancellor when in Union Square.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Marina Bashirian","date":"2014-08-02 02:25:20 +0300"},{"content":"Before going I had read all the reviews posted on the site and I am glad everything they say is true. It is definitely worth staying at the Chancellor. Everyone is really helpful and nice. I tried several SF hotels and this is the only one I'll go back to.","ratings":{"Overall":5.0},"author":"Francisca Okuneva","date":"2013-04-21 10:29:24 +0300"},{"content":"The hotel is really confortable, and quiet , though it is centally located on Union square netx to Border library. The people working in the hotel is really excellent. Tip: If you rent a car, buy room with parking valet, because it is really difficult to park in this area and it is very expensive. (if you are car-less the cable car stop is just in the front of the hotel. From our room on 15th floor we had an amazing view toward union square. The room standard is really high:you can have free up to 15 kind of pillow, radio clock, iron, iron table, cable tv, and wireless internet access, and moreover a small gum duck for bathing :)","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Lavina Kuvalis","date":"2015-02-06 05:01:06 +0300"},{"content":"I enjoyed the hotel and I enjoy the management responses to the critical responses here on tripadvisor just as much. Everything at the hotel was delightful, the flowers in the lobby included.","ratings":{"Overall":5.0},"author":"Faustino Erdman Jr.","date":"2014-10-03 06:01:53 +0300"}],"public_likes":["Herminia Kilback","Curt Kuphal","Mozelle Koch","Tania Nikolaus","Adaline Kutch"],"vacancy":true,"description":"Small, friendly, and in the heart of Fisherman's Wharf. It has free parking.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}