{"title":"Bishop","name":"Vagabond Inn Bishop","address":"1030 N. Main Street","directions":null,"phone":"+1 760-873-6351","tollfree":null,"email":null,"fax":null,"url":"http://www.vagabondinn.com/Hotels/Bishop-CA/Overview/331","checkin":"3PM","checkout":"11AM","price":null,"geo":{"lat":37.371877,"lon":-118.394972,"accuracy":"APPROXIMATE"},"type":"hotel","id":3714,"country":"United States","city":"Bishop","state":"California","reviews":[{"content":"Ladies and gentleman serving ladies and gentleman. The staff are absolutely great here, from bellhop, the front desk to catering staff. They actually care about customer service, it was a refreshing change to experience. I was at the Ritz for 3 nights - the room service was great both at breakfast and dinner. One morning the waiter spilt my apple juice and I have never experienced such a heartfelt apology - not a drop had got on me just on the table & floor. I had last minute drinks for 20 people in the lobby bar and the staff were very attentive and quickly organised a space for us. Couldn't fault them. The location is great right on the Magnificent Mile above the water tower shoppping mall and within striking distance of all the usual shopping suspects from Ralph Lauren and J Crew to Louis Vuitton. And only a block and a half to the shore. Great value for money, if I need to go back to Chicago I'll happily stay at the Ritz Carlton.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Fabian Mitchell","date":"2013-07-21 00:20:50 +0300"},{"content":"This hotel is so perfectly located in Chicago on a beautiful tree-lined street. Easy access to popular neighborhoods as well as nearby to trains and buses. The staff at this hotel was friendly and accomodating and very much cater to the needs of their guests. The hotel is rather business-centric, so it might not be the best option for a family on vacation.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ward Gibson","date":"2012-05-18 00:51:15 +0300"},{"content":"My fiance and I have stayed at the Sutton Place twice when visiting Chicago. The location is ideal - walking distance to several restaurants, bars, coffee shops, and the magnificent mile shopping. The hotel staff is impeccable - the rooms are nice and clean - we even got upgraded (promptly) to a corner room that had two walls of floor to ceiling windows when we had issues with our heater not turning off on our last visit. I have and will continue to recommend this hotel to people who are looking for a hotel in a good location that is also a good value (for Chicago).","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Jabari Hettinger","date":"2015-08-11 09:30:08 +0300"},{"content":"My girlfriends and I have been visiting Chicago for 10 years. Every year we try a new hotel. This year we stayed at The Sutton Place and all agreed it was the best location ever! We had 2 rooms that were Lake View. The rooms had very large windows and we could actually lay on our very comfortable beds and see the sailboats on Lake Michigan. It is on the corner of Rush street, so all we had to do was walk a few minutes and have restaurants at our finger tips. All of which were fantastic. We were able to block off the hallway with a door so that we could walk back and forth between our two rooms. It was the most perfect spot, close to Magnificent Mile and just about anything you could want. We would definitely stay there again!","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Genevieve Langworth","date":"2012-03-30 07:37:44 +0300"}],"public_likes":["Rory Larkin","Barry Grady","Gregoria Thompson","Hallie Daugherty","Dr. Jordane Boehm","Edwina Rempel"],"vacancy":true,"description":"Large pool, jacuzzi, barbeque areas, free Continental breakfast, free Wi-Fi, guest laundry.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}