{"title":"San Francisco/Golden Gate","name":"Chelsea Motor Inn","address":"2095 Lombard St","directions":"at Fillmore St","phone":"+1 415 563-5600","tollfree":null,"email":"Reservations@ChelseaMotorInn.com","fax":"+1 415 567-6475","url":"http://www.chelseamotorinn.com/","checkin":"3PM","checkout":"noon","price":"$77-$145","geo":{"lat":37.7996,"lon":-122.4357,"accuracy":"ROOFTOP"},"type":"hotel","id":25800,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Although we were only in Boston for 2 nights, this inn was such a great find. Very quiet location, but only a block away from shopping, restaurants and the light rail station. Our suite had a spacious and comfortable lounge and kitchen area which enabled us to spread out and relax at the end of the day. Very close to the Southwest Corridor Path, which is lovely for a stroll.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dusty Davis","date":"2015-02-12 07:42:58 +0300"},{"content":"What great place. Looked like an upscale apartment that was just renovated by a swanky yet classy decorator. Clean, quiet and the front desk staff were the epitomy of top notch customer service. After staying in various B&B's thorugh out the week, I felt llike I was being rewarded with chic and styllish accomodations. Next time, we will stay with you the entire time . Thank you.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Glen Gleason","date":"2014-05-04 17:11:01 +0300"},{"content":"We were traveling with 7 family members and wanted a memorable stay in Boston. Wouldn't stay anywhere else. Our rooms had efficiency kitchens - the larger room had a full refrigerator and 2 element stove. Rooms are well-appointed, comfortable and roomy. The hotel is 1 short block from the prudential stop on the subway green line - about 4-5 stops from the MFA and the Boston Common (opposite directions). Hotel is about 3 blocks from the Train station and across the street from a large mall with a number of restaurant chains (e.g. cheesecake factory) as well as a Shaw's grocery store. There is a 7-eleven and drycleaners steps from the hotel. Great stay.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tyshawn Luettgen PhD","date":"2012-05-12 11:44:39 +0300"},{"content":"My husband and I checked in around 8 p.m. and as we were getting situated, we saw a huge roach scurry across the room towards the bed. When I called the receptionist for assistance, she was dumbfounded. There were no other rooms available. I called neighboring hotels for availability but their prices were too high. We slept that night hoping the roach wouldn't crawl into our bed. Other issues: you could hear footsteps from the floor above, as well as their TV. The housekeeping showed up late, the towel bar on the bathroom door was broken, and the room generally felt dirty.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Ms. Isai Crist","date":"2012-07-02 17:00:15 +0300"},{"content":"I recently spent a night at the Inn, a second visit after a two year hiatus. I want to report that the hotel is just as nice as I remembered. The room was really attractive and spacious, the bed was super comfy, and the shower is huge. Since this was a quick trip I didn't use the fitness center or the kitchen facilities (though friends of mine had family come through in early fall and said they loved the convenience of cooking meals in the suite) but it was nice to see that everything appeared as clean and fresh as it had two years ago. I needed directions to my destination but didn't have a printer (and no, my phone is not so \"smart') so I asked the person on site for help. Not only did he print out the information, he also researched and printed out an alternate route that he thought might be more helpful. Very nice, very considerate. I will definitely return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Devante Torp","date":"2014-09-28 06:52:14 +0300"}],"public_likes":["Pascale Corwin","Trevor Kunde","Xander Mohr","Tillman Weissnat","Loy Marks","Gerson Kuhlman"],"vacancy":false,"description":"Features an English Tudor style building with an antique roof. Clean, good quality rooms at a reasonable price. Nothing too special, but it is centrally located.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}