{"title":"Paris/8th arrondissement","name":"Four Seasons Hotel George V","address":"31, av George V","directions":null,"phone":"+33 1 49 52 70 00","tollfree":null,"email":null,"fax":"+33 1 49 52 70 100","url":"http://fourseasons.com/paris/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86877,"lon":2.30069,"accuracy":"APPROXIMATE"},"type":"hotel","id":21843,"country":"France","city":"Paris-8E-Arrondissement","state":"Île-de-France","reviews":[{"content":"The reception we got from Rudy the front desk supervisor was awfull. He made us wait for a long time, because they had a double reservation. We were given a room where you could not sit on the balcony because of the noise from their laundrette. The pool area is tiny and offers no shade. No hospitality room to take a shower when you have a late flight: you may use the cold shower at the pool and carry your wet clothes with you or pay US$ 120 when you want to stay in your room a couple of hours longer than checkout time. We found this hotel definitely not worth the money.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Location":2.0,"Rooms":4.0},"author":"Anissa Pfannerstill","date":"2012-04-27 19:59:47 +0300"},{"content":"The Maui Coast is easy to get to and roomy, with a large lobby and nice, good-sized rooms. They were comfortable and clean. This is not a resort, but definitely well-appointed. The pool deck seemed appealing, though we went snorkeling during our brief stay so didn't have the energy to take advantage of it. The location is good too, in Kihei only a few minutes' drive from all manner of shopping, dining, etc. They did have a notice that they were remodeling and there might be some noise between 11 and 3 during the day, but as we had plans and were out of the building, it didn't detract any from our stay.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Tyra Kunde","date":"2015-06-11 02:01:44 +0300"},{"content":"Not business traveler friendly. Rooms need major upgrades from the carpet to beds to the drapes...etc. My room was on the second floor and faced the side parking lot. People getting out of their cars could totally see in my room as I'm resting on my bed unless I close the drapes! There was a dingy smell but I think the hotel is just old and dirty. I would not go back.","ratings":{"Overall":2.0},"author":"Derek Cartwright II","date":"2012-07-31 10:20:39 +0300"},{"content":"I stayed at the Maui Coast Hotel for the Thanksgiving long weekend. Upon checking in very late at night the desk agent assigned a room on the first floor but advised me to check back the next morning to get a room higher up in the hotel. After checking back the next morning I was given a room on the third floor (reservation was for an ocean view room and I never got one but since I was only paying $150 per night I couldn't really complain). TIP: odd numbered rooms or rooms on the top three floors have ocean views... no ocean view from the first or third floor on the even numbered side of the hotel. The grounds of the hotel were clean and attractive. I never swam in the pool but it appeared to be a nice set up. The rooms were a bit dated and the air conditioning was loud. The bathroom was clean but very very small... and it had the most annoying shower curtain that was short and would blow into the shower while showering... when I tried to correct this I ended up flooding the floor... no winning with that! I found the hotel to be quite quiet given the fact that it was booked solid. Free internet in the lobby and free parking were a nice bonus as was the mini refrigerator in the room. The hotel is situated across from the beach in busy Kihei but since it is set back from the road it was quite quiet. I ate breakfast one morning in the hotel restaurant and it was okay, service was friendly but slow. Would I recommend this hotel to a friend, probably not as I would recommend a condo instead (a condo is a must if you are traveling with children). However, if you needed a place to stay for one or two nights then this is an okay choice.","ratings":{"Service":3.0,"Cleanliness":2.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":3.0},"author":"Alysha Lynch","date":"2014-06-18 22:07:20 +0300"},{"content":"Me and my family were supposed to stay at the Maui Coast Hotel for 8 nights but we only stayed one. Being four adult women crammed together in a double bed and a sleeping couch is not my idea of a vacation! Even though the staff tried their best we chose to move after the first night. Coming all the way from Europe I expect more from a hotel in Maui. It was poorly situated between buildings with no sight of anything green (except of course for Haleakala in the background) and you had to cross a road to get to the beach. I know of other much nicer and better hotels in the same pricerange placed on the beach near Lahaina, where the view is a whole lot better!","ratings":{"Service":4.0,"Cleanliness":2.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":1.0},"author":"Leonardo Ratke","date":"2015-12-12 21:53:50 +0300"},{"content":"The dinning room food is very good, That is where it stops. All the wait staff but one male waiter who was very friendly, and prompt with our order ( he server our first breakfast ) were terrible. The female bartender was nice, and even corrected our drink order, after over hearing what we told the waiter we wanted but when he repeated our order to her he mixed it up. One waitress actuallty huffed when she came to our table and was abrupt with us. When I asked her are you ok she said we are short staffed AGAIN and we have been busy all morning. Poor girl never did smile.( she had 4 tables ) But the hotel was nice, and the pool bar area is beautiful with live music that is soothing, not loud or rowdy. Nice place to stay, just eat else where. Our stay was fron Aug. 24-26. Then we stayed else where till Sept. 3.","ratings":{"Service":1.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":2.0,"Value":2.0,"Rooms":4.0,"Location":5.0},"author":"Bernardo Goldner DDS","date":"2013-06-12 00:13:43 +0300"}],"public_likes":["Frederik Price DVM","Jasen Pfannerstill","Aubrey Beer","Joanne Heaney","Lawson Oga","Hattie Wisozk","Alyce Hoeger"],"vacancy":true,"description":"Steps from the Champs-Elysées, with private terraces that command all Paris.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}