{"title":"Ford and Etal","name":"The Estate House","address":"Ford Village, TD15 2PX","directions":null,"phone":"+44 1890 820 668","tollfree":null,"email":null,"fax":null,"url":"http://www.theestatehouse.info/","checkin":null,"checkout":null,"price":"From £45","geo":{"lat":55.6301,"lon":-2.0864,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":9336,"country":"United Kingdom","city":"Ford","state":null,"reviews":[{"content":"We stayed at Orange Lake Resort March 24-29, 2012. I was a little skeptical about staying somewhere that was 40 miles from the ocean and also about all of the stuff I had read regarding the high pressure timeshare pitch, but had an overall great experience. Our room: POSITIVE: I booked our room through booking.com and received a significant price discount for paying in advance. We had a studio (2 queens, pullout couch and efficiency kitchen with table). It was a perfect set-up for our family. The beds were comfy, we had plenty of linens to get us thru the 4 days and the room was clean. We were centrally located and could easily access our car or the pool or the front desk from our room. Our room: NEGATIVE: Although I had requested that we be placed at River Island, our room was actually at the West Village - directly behind the check-in area. Thru booking.com, I was not made aware that the room type we requested was not available at River Island. Also, I had been lead to believe each room room a washer & dryer but in our building, they were actually down the hall - we were given enough laundry soap for 4 or 5 loads and we did not need coins to operate the machines. Time Share Experience: Upon check in, I firmly declined the $20 free gift to the woman who approached me. Additionally, we unplugged the phone in the hotel room and were not asked again to attend any timeshare presentations. My advice is to be polite but firm with your \"no\"...and trash the $20 certificate...FREE is a 4 letter word. Pool & Surroundings: The pool at the West Village was super nice. There were plenty of towels and chairs. At River Island, our friends got up early to break the rules and reserve chairs. There were signs that stated that reserving chairs was not permitted but there was nobody enforcing it. In fact, the only thing that was strictly enforced were the $9 per day lazy river blue tubes! Everyone had their own cooler packed with food & drink & cocktails and after 5 days the only person I saw get in trouble were people without armbands that were riding on tubes in the lazy river...they literally have a hook that they grab them from people with in 2 different stops around the river. We took advantage of the 2 for $4 domestic draft beers for happy hour and our friends took advantage of the $14.95 refillable soft drink container. Our kids liked the virgin daquiris with the $3 refills. Dining: We ate a Breezes one night and Pisan's pizza place. They were both average...the kids meals are all under $5.99 and I found the adult items to be reasonably priced. We went to Publix and got yummy Boars Head sandwiches a couple of times and we also kept breakfast & lunch stuff in our room. Other: None of us were a big fan of people smoking at the pool. It seemed like there were people smoking everywhere. Additionally, at the end of our hotel hall was an exit to outside and people stood outside that door and smoked so we had to walk thru it on our way to the pool. I even saw an employee standing there...we stayed at the Renaissance @ Sea World earlier in the week and they had a no-smoking policy in the pool area...that was super. My only other complaint was that the hotel rooms were super nice, but the hallway still had dingy ceiling tiles and the stairwells (by ashtray) and area by the stairwell entrances at West Village were dirty...they needed to be swept & painted. Overall a 4/5 experience.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Miss Theresia Morissette","date":"2014-04-25 05:18:51 +0300"},{"content":"We just returned from a 2 night stay in a 2 br villa in the North Village of Orange Lake Resort. It was a little overwhelming driving into the resort because it is so huge & there are so much housing. Many of the areas have single story housing complexes, which you park directly in front of and it easy for loading & unloading the car. The villa was very nice with big rooms & bathrooms. We traveled with 2 kids, ages 11 and 2.The lagoon pool is good for toddlers because it has a kiddie pool, zero entry pool, and fountain area. That pool area also has a small slide, basketball goal in the pool, volleyball net, and arcade area for the older kids. The river pool has a lazy river, zero entry pool, 2 slides, and also was right next to the mini golf, huge inflattable slide, rock climbing, & bungie trampoline. We will return. If you have a citicard you can use your CitiCash to get discounted rates. Avoid the timeshare sales pitch by telling them that you already heard the pitch when you booked the room over the phone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Margie Gerhold","date":"2013-03-25 18:43:19 +0300"},{"content":"After reading the bad reviews I was a little skeptical about this place but I'm glad I went with my gut instincts and stayed here. I wish I could say our trip went without a hitch but feel I must mention that the first villa they put us in wreaked of smoke (4022 West Village) however all it took was a call to the front desk and we were moved to unit 4285. They sent a van to help us since it was almost ten o'clock at night. We stayed 5 nights six days in a two bedroom villa in the West Village and loved every minute of it! Villa was very spacious for My husband and I plus my sister and our two year old. Two bedrooms and two full huge baths. Kitchen was outfitted nicely with washer and dryer large pantry, dishwasher and everything you need to cook all your meals there. It really was a home away from home. They provided dishwasher detergent (3 loads) clothes detergent 3 loads (so nice not to have to do a weeks worth of washes at home!) Also there was toilet paper and tissues as well as dishtowels stocked in each bathroom and kitchen. Beds were very comfortable as well as furnishings, must say again the furnishings in this unit were a little nicer in quality and age. Bathrooms and closets were more than adequate. Resort was spectacular the River Island area was gorgeous and lots to do for the whole family. Fees were not outrageous and I could see staying on resort the whole time however the Disney parks are no more than 20 minutes away. We did Hollywood studios (15 minutes) and Magic Kingdom (20 minutes with parking and all). We dined at the River Island Grilling Company and had a great meal great service and the food was reasonable. Also did the sunset celebration at the West Village Clubhouse restaurant more casual and also very good. No problems with any smell other than smoke in the first room, no issues with their sales pitch for the vacation club, I declined they still gave me my $20 resort coupon (which we didn't use), no issues with the cleanliness or comfort of the room. My only negative would be that there is only one way in and out which sometimes you have to wait for either at the gate and also you have to drive quite a bit to get to the other places of interest, pools bars restaurants in the resort but there was plenty of parking and we never had a issue.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hadley Little","date":"2015-11-19 08:51:40 +0300"},{"content":"We opened the door to our 3 Bedroom/3Bathroom Villa and said \"WOW\"...It's a luxury apartment, clean and we had everything we needed to enjoy our week stay with our family. The property is beautiful, the restaurants are superb.They have 3 shuttle buses to take you around the property. When we checked in, the time share appointment people greeted us with offers; when we hesitated to take a time share (no obligation) tour.They sweeten the pot to $100 for only a 90 minute tour. We took the tour, what 90 minutes? It was 3 hours of sales pitching and they worked us over with 4 people. Beware - They have a hard time taking NO for an answer. Other than this and some Internet connections problems for our iPad. We enjoyed our stay very much. We highly recommend this Country Club Resort.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Lolita Schulist","date":"2012-07-02 07:58:59 +0300"},{"content":"This was a relaxing and fantastic vacation, after we escaped the sales staff once and for all. I made a mistake the first day in being too kind and that was a big mistake. I approached the check in desk and began the process of getting our keys. After the brief check in was finished, they directed me over to another counter where they showed me all these discounts I could get if I took a tour of the property. Whenever someone tells you they want 45 minutes of your time, RUN. The 45 minutes tour took over 3 hours - all with a 14 month old crying baby. I realize they are there to sell you a vacation rental but to put us through 4 or 5 people who hold you captive after saying NO over and over was really annoying. After that horrid experience was over, we had a wonderful vacation. We stayed in a 3 bedroom villa which was perfect for a family of 5. It was clean and very comfortable. It was safe to go for walks around the resort but we needed to hop in the car for a 4 minute drive to the main waterpark area because we had 3 small kids in tow. The pools were fun and not overly crowded even though we were there at March break. The poolside bars and restaurants were very reasonably priced and we relaxed in the warm sun while sipping on our drinks. We would definitely stay there again and will know to avoid any discount tickets offered. That's the only reason I didn't give it a 5 star rating.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Amara Weissnat","date":"2012-05-14 08:35:17 +0300"},{"content":"We stayed in #2476, a 2 BR, 2 BA villa in West Village. Although we are Holiday Inn Club members, our home base is at a different location. This was our first visit to Orange Lake, and we loved the well-maintained, spacious grounds and the privacy of a roomy villa. Our reservation was for 2 weeks, but I could have stayed longer. West Village is perfect for retirees wanting to escape cold, northern winters. The villas are ground level and parking for the car is just a few steps from the front door. The villa seemed to be older but appeared to be recently refurbished. Maintenance requests were handled promptly. The kitchen is well-equipped with a full-size range, refrigerator, microwave, dishwasher, and washer/dryer. There are cabinets for food storage above the laundry area. Paper products are provided, along with coffee for the first morning. Sliding glass doors led to the rear patio from both the living room and the master bedroom. The bathrooms are small, but all other rooms are large. A heated pool was a short walk away. The pool and hot tub enclosure held an ample supply of lounge chairs and tables with umbrellas. The pool towels are small but adequate. There are 2 more pools near the West Village Clubhouse about a 15-minute walk from the villa. If you want an even larger pool complex, you can take the shuttle to the beautiful River Island. North Village and East Village have pools, also. This resort is huge. We wasted the first few days at this wonderful resort trying to find fault with the place. Why? We attended a “member update” on the morning after our arrival. It was not a good experience. We chose not to accept their proposal and left the meeting with bitter feelings. I recommend that the sales presentation be scheduled for later in the visit, after you have an opportunity to enjoy some of what the resort has to offer.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Chet Hermiston","date":"2012-12-26 07:49:58 +0300"},{"content":"We are owners at Orange Lake and have stayed here numerous times. We just returned last night from our vacation and are disappointed in our stay. At check-in we were given the opportunity to sign up for an owners update meeting, we understood that this was a sales pitch to try and convince us to switch our week into their points system. We were told it was an hour long meeting, but having sat through these before we understood that most likely it would go longer. The salesman who came over to help us was named Randall. He explained that he was not an employee of Orange Lake but instead contracted out to talk to individuals like us, who had a timeshare that was paid for in full but had not yet moved their week to points. He assured us that we would not have anyone else come over to talk to us because we were \"veterans\" of this process and therefore he would be taking care of everything. It is amazing how kind the sales team are as they are attempting to sell to you, and how quickly it changes once they realize you are not going to purchase anything. After his pitch, my husband and I said that we weren't interested in purchasing anything. Randall then had to take a call from his wife, and sent in someone else to offer us a new deal. It was such a scam! I told the next person that we were not interested in changing anything right now, once again this person became rude to us. I told him that one reason we will not put in anymore money to Orange Lake was because how rude they became during the presentation. Yesterday as we were packing up ready to go, my brother could not find his camera, we lifted the mattress up to look for it and saw this HUGE wad of dark black body hair lying on the box spring. I can't even begin to say how disgusting that was, to know that it had been there the whole week. My husband mentioned it to someone as he checked out and they said \"oh ok\", no one seemed to care. As current owners I am not sure if we will return to Orange Lake. I do know we won't be purchasing any upgrades to our current plan because of some of the experiences we have had at Orange Lake.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":3.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Mr. Anderson Rosenbaum","date":"2015-11-06 07:11:45 +0300"}],"public_likes":["Agustin Dickinson"],"vacancy":true,"description":"3 room guesthouse","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}