{"title":"Sonoma","name":"El Dorado Hotel","address":"405 First St. W.","directions":"on the Square","phone":"+1 707-996-3030","tollfree":null,"email":"guestservices@eldoradosonoma.com","fax":null,"url":"http://www.eldoradosonoma.com/","checkin":null,"checkout":null,"price":"$145-$300","geo":{"lat":38.293543,"lon":-122.45887,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":27820,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"This is one of the worst Marriott properties I have ever visited. The location is excellent for access to Coconut Grove. If you are visting to party at Cocowalk and will simply be walking back to your room and passing out, this place serves its purpose. The only reason I gave this property 2 stars was due to the gated parking, without that I would have had a totally sleepiness night. The rooms are tired, worn down, and the bed (a double) sleeps awful. The exterior is just gross. Rundown, shady characters, and a complete lack of maintenance. The walls are PAPER THIN. I was awoken by a party going on next door at 5am and could literally hear every word of the conversation as if I was in the room with them. The staff is apathetic and unbecoming of any other Marriott property. I'm not one to complain about hotels, check my reviews, but unless you get a FANTASTIC deal, or are a broke spring breaker or college student, you can do better.","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":2.0,"Value":2.0,"Service":2.0},"author":"Amiya Ankunding","date":"2012-11-29 22:28:03 +0300"},{"content":"This suite was definitely in need of renovating. In living room, the carpet needed a good vacuuming and cleaning. The furniture needs to be reupholstered or at the very least, cleaned. I can take old if it is clean !!! The suite had the musty smell of an unkept room Noise of traffic and sirens during the day and night was a problem. Especially at night if you are a light sleeper.. It was great having a kitchenette in the suite, The breakfast provided downstairs was good. Their staff was friendly and very accommodating. I realize this is an older building, but if the other suites are like this one, it is obvious that this inn is on the decline, It could be improved greatly with some attention to thorough cleaning and/or updating the suites. At present, I could not recommend this inn.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":3.0},"author":"Carlo Lehner","date":"2015-01-17 17:53:36 +0300"}],"public_likes":["Elmira Morissette","Garnet Walter"],"vacancy":true,"description":"Centrally located, the El Dorado Hotel is the most high end overnight property on the Square. Very modern rooms (27 in total) with free wifi, coffee/tea, and you even get your own reusable water bottle for your stay. A super hip solar-heated pool overlooks the restaurant and will make you feel like a star while those dining watch you sunbath.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}