{"title":"Derby","name":"Mickleover Court Hotel","address":"Etwall Road","directions":null,"phone":"+44 1332 521234","tollfree":null,"email":null,"fax":null,"url":"http://www.menzieshotels.co.uk/hotels/midlands/derby-mickleover-court/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.901551,"lon":-1.55071,"accuracy":"APPROXIMATE"},"type":"hotel","id":7770,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"This was probably the smallest room I stayed in on my recent California trip but proves that size isn't everything. They crammed a lot into the spotless room - desk, armchairs, small table as well as a nice flat screen TV - but it never actually felt cramped in the room. Huge closet as well. Bathroom did feel a little bit cramped and the shower head was only about 5'5\"\" but these were minor things in the grand scheme of things. Location is ideal, staff were excellent and the off-site parking is only a block away. Pretty good value for the location too - the parking package was decent value too, given the cost of parking around there. I've stayed there before and if ever back in San Francisco will certainly stay there again. My only real gripe - and it's a general one rather than too specific to the Chancellor - is that when you are paying that amount for a room (any room), I always feel you should get breakfast included. You do get a 10% voucher for one breakfast but that's nothing really. Maybe it's just me. Still 5 stars, though.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Aileen Heathcote","date":"2014-06-19 13:49:14 +0300"},{"content":"Stayed here for several nights while attending a business conference. Location is awesome - right in the center of town. The nightly rate was very affordable, especially in light of the conference in town and the location. Rooms were very clean, though small (expected in a downtown hotel). We did get a little bit of street noise in our room, but it was very minor and did not disrupt our stay at all. Beds were comfortable, and the pillow menu was a very nice touch. Would not hesitate to stay again, for either business or leisure. NOTE: There is no air conditioning in the rooms. The hotel is very up front with this on their website and in person. Given the weather in SF, this is generally not a problem, and the ceiling fan and window (which opens) alleviates most cooling needs. Again, did not detract from our stay in any way.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Aimee Nicolas","date":"2014-11-22 18:53:40 +0300"},{"content":"Just back from an amazing trip...stayed at this fab little hotel tucked in beside Union Square in the heart of San Francisco, chose it because of the great reviews i had read and DEFFO was not dissapointed..rooms are spotless and bed real comfy and had no problem sleeping even tho buzy streets round about...staff were helpfull and they have a great wee booth in the hallway where you can get tickets for any trips or tram passes and the lady is real helpfull....take a shuttle bus from the airport as it will leave you right at the door..also tram stop is right outside hotel....fab fab fab...hope someday to be back at this lovely hotel....x","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vena Haag","date":"2014-05-31 11:06:53 +0300"},{"content":"Chancellor Hotel is a very nice hotel. Since I was on a business trip, what I mostly appreciated was the fact that the rooms where comfortable and quiet and the bed was very cozy. You will truly be well rested after staying here. That the hotel has good internet was also helpful on a business trip and had a good location.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Micah O'Keefe","date":"2013-07-20 19:20:07 +0300"},{"content":"We stayed at the Chancellor Hotel on Union Square and had such a great experience! It was clean and the staff was absolutely wonderful...definitely would stay there again! It is small but keep in mind this is a hotel that was built 100 years ago...they just didn't expect the room sizes that we have nowadays. It was perfectly fine for me and the hubs but then again we spent very little time in our room. The location was perfect...we enjoyed shopping on Union Square and catching the trolley was easy when it was running. We did purchase passports (7 day tickets for the public transportation) but noticed no one really looked at them. We ended up walking ALOT or taking a taxi when we didn't want to walk. Sears Fine Foods is right next door to the hotel and that was our favorite breakfast place!! Get up early though cuz they fill up fast! The staff at the Chancellor was wonderful...very professional. They were also very kind and left a bottle of Jasmine tea and a nice picture frame for us as a special little touch.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Linnea Dickinson","date":"2012-01-12 08:57:22 +0300"},{"content":"Just what we needed! Great location, easy walk for us seniors to Union Square, Westfield Mall (be sure to sample the Bristol market there), and anything else you might need. Cable car to Fishermans wharf and Ghiardelli Square is right out the front door. Excellent bellman service, very nice low-key lobby, not as overwhelmingly ornate as some others nearby, but nice, and properly staffed. Free coffee and tea and cookies 24/7 in lobby area. Two very nice and quick elevators. This is an old hotel but rooms have been remodeled in recent years and we were very pleased. Ours had a large closet, very good bed, decent TV and usual amenities. Room service and maid service was excellent. Free business center in lobby. The hotel has a feeling of dignity about it, and clearly works to exceed expectations. A good value and we will definitely come back anytime we visit SF.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mireya Lakin II","date":"2015-11-28 15:03:29 +0300"},{"content":"We received great customer service! The location was perfect! Cable car runs in front of the hotel. There are so many stores and restaurants around it. Will definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Alexandro Auer","date":"2013-08-13 19:37:05 +0300"},{"content":"Stay here every year when we go to SF for shopping/sightseeing. Excellent location within walking distance of best stores, cable car line, and short walk to get the trolley. Hotel staff is very friendly and helpful. Restaurant is OK, but not fabulous. A little pricey for the quantity of food and sometimes the service is not as attentive as it could be. In other words, go across the street to Starbucks and have a bagel and coffee, or next door to Sears for the little pancakes.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Rocky Torp","date":"2015-09-22 21:35:20 +0300"}],"public_likes":["Art Rolfson Jr.","Sage Kozey","Ricardo Kling","Annabell Schoen","Dominique Wiza","Cristina Medhurst","Orlo Wilderman"],"vacancy":false,"description":"Menzies Hotel","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}