{"title":"Sonoma","name":"The Sonoma Hotel","address":"110 West Spain Street","directions":"Northwest corner of Sonoma Plaza","phone":null,"tollfree":"+1-800-468-6016","email":"sonomahotel@aol.com","fax":"+1 707-996-7014","url":"http://www.sonomahotel.com","checkin":null,"checkout":null,"price":"$99-248","geo":{"lat":38.29391,"lon":-122.45893,"accuracy":"APPROXIMATE"},"type":"hotel","id":27822,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"The biggest advantage was the kitchen in every suite. This was particularly important for me as I preferred to cook something after eating lots of restaurant food. The fact that the room also had laundry facilities helped immensely as I have been travelling for last couple of weeks and did not really get a chance to do the laundry.","ratings":{"Overall":3.0},"author":"Viola Mante","date":"2014-01-28 19:58:15 +0300"},{"content":"I must admit after reading the other reviews I was a bit hesitant to book my stay, but my group had already made reservations. We were heading on a cruise t and we needed an affordable place to stay that was nearby to the port. As we arrived, we were greeted by an extremely helpful staff that assisted with all of our luggage. We arrived an hour before check-in time, and our rooms were ready for us. As we headed to our rooms, we were required to swipe a key in order to call the elevator for security reasons (this made me feel very safe since only tenants and guests carry the access card). We reserved a two bedroom suite and as we went into the rooms, we were extremely impressed at the size of the suite and how tastefully decorated it was. It's actually an apartment with a full size kitchen, living area and a balcony with ocean view. We decided to have breakfast at the hotel restaurant and they had a great buffet set-up at an affordable price. I was pleased with my stay and would definitely recommend this hotel. We travel to Miami every year and would enjoy staying again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Gabe Miller","date":"2015-08-15 19:56:21 +0300"},{"content":"Our family stayed at the fortune house for a day prior to going on a cruise. We had four different rooms... The first room which was our room was ok compared to the other rooms. Besides the old couch we had no tv's in the bedrooms and the toliets in the bathrooms did not work. We called the front desk to have someone fix them but no one ever came. Luckily we were able to use the bathrooms in our families room. It was an inconvience but we managed.The layout of the room was spacious and the view was nice. BUT...as you go up floors and we saw our other family rooms there rooms was much better. Hardwood floors, flat screen tv's in each room, CD playe, marble counters. Very nice room. So my recommendation is to make sure you verify the type of room you are getting prior to staying there. Parking is an extra cost per night so be prepared for parking because there is no parking around the hotel. The restuarant food was gross and make sure that you verify that breakfast is included in your stay (if you chose to eat there). There is also nothing around the hotel but more hotels and office business.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":3.0},"author":"Adolph Hintz","date":"2013-04-29 09:24:24 +0300"}],"public_likes":["Reid Cruickshank","Keaton Robel","Jamarcus McCullough"],"vacancy":true,"description":"A historic hotel with 16 rooms and suites located on the Plaza. A classic B&B feel with antiques and French country furniture. Guests receive complimentary wine in the evening, and dinner can be enjoyed downstairs at the girl and the fig. Can get noisy at night as the bars close.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}