{"title":"San Francisco/SoMa","name":"Best Western Americania","address":"121 7th St","directions":"between Minna and Natoma","phone":"+1 415 626-0200","tollfree":"+1-800-444-5816","email":"Reservations@haiyihotelca.com","fax":"+1 415 863-2529","url":"http://book.bestwestern.com/bestwestern/productInfo.do?propertyCode=05106","checkin":null,"checkout":null,"price":"$149–$169","geo":{"lat":37.7788,"lon":-122.4101,"accuracy":"ROOFTOP"},"type":"hotel","id":26019,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Brand new hotel, very modern, quiet, great food, great room. LOVED IT !!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Cathy O'Kon V","date":"2013-05-04 16:14:20 +0300"},{"content":"Everything you'd expect in a new Westin property. Perfect for business travel, even though it is about a 10 min taxi ride from downtown or for a couples getaway. Service was personable. Rooms are brand new and fresh. The hotel is so comfortable and pleasant. Excellent room service for breakfast. Get the yogurt parfait and fruit platter-- heavenly. Bathrooms are modern and clean. Go now before more people find out that it has opened!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":3.0,"Rooms":5.0},"author":"Kim King","date":"2014-02-15 18:01:36 +0300"},{"content":"Stayed there for three nights in early August. Everyone there was very helpful and the hotel is located in a very convenient location in Montreal. It is a brand new hotel and is somewhat trendy and well designed. Several problems came up over our stay. First there weren't refrigerators in every room. We order one from the front desk but they were all taken. They put us on a waiting list but we never received a fridge. Also the wireless internet was broken on our floor. We couldn't find any do not disturb signs and were constantly being bothered by the cleaning staff. While there is a pool in the building it is rather small. The heater for the pool was broken during our stay and the general pool area is not all that nice. I wouldn't stay at this hotel again unless I was 100% certain all of these problems were fixed.","ratings":{"Overall":2.0},"author":"Salma Ullrich","date":"2015-01-22 15:31:03 +0300"},{"content":"A friend and I have been to Montreal a number of times and had previously stayed at the W (great but a little too clubby with rooms built for couples) and the St. Paul (aims high but pretentious and feels a little beat up). When we saw the brand new Westin was open, we figured it would be the perfect place as Westins are usually cool and the hotel was in a great location. Anyway, we arrived in Montreal and pulled up to a very ugly driveway and were greeted with a very visible front and center overflowing trash can by the valet station. That was a terrible first impression. The lobby was stark, barren and plain and they were three hours late getting us our room -- sitting around a lobby is no way to start a vacation. The rooms and hallways were corporate and plain, really surprising for a new hotel. And the towels were so brand new that there were fuzzies over all our clothes and in our hair every day. Ultimately, if you need a clean place to stay with very comfortable beds, the Westin is great. If you want a hotel you'll remember, forget it. It feels like no thought or style was put into this hotel. Just blah and generic, like out of a movie that satirizes corporate generic hotels. Again, this is really surprising for a brand new hotel from Westin. You'd expect they'd put more thought and effort into this property. Oh well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Location":4.0,"Rooms":3.0},"author":"Ms. Fernando Lemke","date":"2012-06-18 07:33:00 +0300"},{"content":"A very budget and basic hotel, there are no added extras - unless you want to purchase them. One towel per person, a bed, shower, toilet and television, even a window in the room costs more. We stayed here for 4 nights, solely for the location's convenience; being a 5 minute walk from Hyde Park, around the corner from Paddington Station and with supermarkets, cafes and other stores all located nearby. After reading the reviews on TripAdvisor prior to our stay, we paid the extra amount per night for the 'Room with Window' and were exceptionally glad that we did. The rooms are very small and without that extra light it would only seem smaller. We were on the 3rd floor, and there was still quite a lot of noise coming from the street and through the walls - low voices, people packing in the mornings, buses outside - so definitely ask for a higher room if it is available. That said, there are no elevators in this building, so it will mean carrying your luggage up several flights of stairs. This hotel was fine for our short stay (4 nights, but any longer would have been too long), and is probably not a problem if you're relatively tidy, and prepared for budget & basic.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Kendra Padberg","date":"2015-08-12 06:54:02 +0300"},{"content":"I've never stayed in an Easyhotel and I won't be again. Though the hotel was in a good location that was only thing going for it! I stayed on the ground floor and could hear the bus dropping off and picking up passengers every 5 minutes. The room was pokey and couldn't swing a cat. The room consisted of a bed and that was it, not even any accessories to put your bits and pieces on the side. When the lights were turned off you still had a glow from the emergency lighting!","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Adonis Frami","date":"2012-02-22 02:35:43 +0300"},{"content":"I made several bookings with easyHotel for this summer, and ended up having to cancel two of them. When I went online to cancel the bookings, I was told I would have to pay a cancellation fee. NOWHERE on that page did it say that no refunds were given - that my account would merely be credited. I will admit it mentioned in Terms and Conditions that in case of a cancellation, a refund would be given, but easyHotel never said that a refund would not be given under any circumstances. What a horrible policy - be advised!","ratings":{"Overall":1.0},"author":"Marquis Rutherford","date":"2015-01-31 19:51:44 +0300"},{"content":"I thought this hotel was great for what I was looking for. I was up at dawn and didn't make it back until way after dark. If all you need is a place to sleep and shower then this place is perfect. The guys at the desk were great and very helpful with anything I needed. I would stay there again in a heartbeat!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Rigoberto Nader","date":"2014-02-04 20:57:51 +0300"},{"content":"good thing about his hotel is the location every thing else is a $@!#% starting from receptionist to room quality and cleaness.Not worth it.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Makenna Goyette","date":"2014-08-23 04:24:12 +0300"}],"public_likes":[],"vacancy":true,"description":"Chain motel with a few more amenities than the typical Best Western; outdoor swimming pool, internet access, cafe on-site, pet friendly.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}