{"title":"Avignon","name":"Hotel Danieli","address":"Rue de la République","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hoteldanieli-avignon.com/","checkin":null,"checkout":null,"price":"€80 per night for a double during the summer, more expensive during the Festival d'Avignon.","geo":{"lat":43.947573074485724,"lon":4.805948760440515,"accuracy":"ROOFTOP"},"type":"hotel","id":1361,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"We returned to the Eldorado for the first time in 20 years last summer. Rarely do things stay the same but this place has. The staff were helpful and friendly, the accommodation is good value and the beach to our mind is one of the best in the world. This is the place to go to relax. The complex is quiet and low key. The pools may be basic but how often can you go to a place and get a whole pool to yourself. The units are spacious and airy, yes they do vary in quality so do your research. The only area of improvement could have been a really thorough cleaning of our unit half way through our stay. As we were there 17 days the bathroom mirrors and sinks could have done with a really thorough clean, same with the kitchen. Having said that I could have asked and I am confident it would have been done, the housekeeping did a great job of keeping us well supplied with towels and amenities. We recommend using the farmers markets for fresh produce and the 'Fish Market' north of the Eldorado in a strip mall just past 'Times\" supermarket. Goofy Foot surf school in Lahainia did a great job getting this family surfing for the first time and we would do it again. The snorkeling at Black Rock closest to the cabana (not the Sheraton side) is good and not crowded, we often saw turtles. Gazebos near Napilli beach is great for breakfast but get there early or you will be waiting a long time. Special thanks to Ruby and MaryAnn who helped with our bookings and were always so kind and helpful. We will undoubtedly be back again. Williams family (Portland OR)","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Zetta Larson","date":"2015-06-27 22:59:14 +0300"},{"content":"Was pleased with our stay at the Eldorado. As has been pointed out before, there is variability among the units, so some may be better or worse than ours. We reserved a studio via Orbitz which was a good size, approx. 700 sf. Room was clean, furniture and appliances were in decent shape (not new, but not old either). Dishes and utensils were provided and were decent. As for the location, I find the \"15 minute walk to the beach\" claims to be a bit exaggerated. It's more like a 5-minute walk to the beach. It's not any different than walks to the beach from your room at one of the mega-resort type hotels (the ones with lots of buildings, long hallways, waits for elevators, and strategic paths meandering past shops and concessions). The golf course is between the rooms and the ocean, so the walk is not in a straight line, which may make it feel longer, but it is literally 5 minutes max. The beach was nice and pretty open. Great for sitting or laying out, though there is much better snorkeling next door at the Sheraton (which is signed as a public beach). Nobody said anything to us when we brought our Outrigger towels through the Sheraton grounds to the beach to snorkel. It's probably about a 10-minute walk from your Eldorado room to the Sheraton beach. What was annoying was that the Eldorado has a number of nickel-and-dime fees. Fees for making toll-free calls, fees for in-room coffee (first one per stay is free, additional is extra), charges for laundry detergent (again, first bottle per stay is free, additional is extra). There was even a charge to use the safe, and if you declined it, they asked you to sign a release form at checkin. This doesn't exactly give the visitor a warm-and-fuzzy on arrival. If it were up to me, I'd rather they comp the coffee and safe, and charge for detergent. That would bring them in line with normal hotel standards. The Internet was free, though, which was nice (and fast). It is with a cable, though, not wifi. There's a Safeway and Longs in town, just a few miles down the street to pick up anything you need, along with several dining options. Overall, we were pleased with the value for the money and would definitely stay here again.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Payton Kautzer","date":"2014-07-03 09:19:00 +0300"},{"content":"We had to stay in Ka'anapali area for business and picked the Outrigger because this chain had always provided excellent condo accomodations in the past and the Maui Eldorado was no exception. We had a 1 bedroom partial ocean view unit that had recently been upgraded, full tile floor, big furnished lanai and everything we needed to feel at home for a few days. The garage parking seemed safe and secure, but the one caution would be this property did not seem handicap friendly (access to most units involved steps or a steep walkway up or down). I had worried about traffic noise as the complex is just downhill from the highway but it was quiet, quiet, quiet! We used the pool deck grills 2 nights and had the whole area and it's ocean view to ourselves. It was an easy walk down to the beach or shopping and restaurants at Whaler's Village, and next door to Round Table Pizza and C'J's Deli for quick meals.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Ellen Quigley","date":"2012-09-13 04:19:22 +0300"},{"content":"We've stayed at several condo's over the years, some nicer, some with better beach access, but we've decided that the Maui Eldorado offers the best combination for the cost. We love the Cabana and not having to drag towels, chairs, etc. is great. Its a short walk to the Whaler's Village Complex and there's a free shuttle we used everyday to haul our \"gifts\" back to our unit. I had no problem with parking and asked for the local papers delivered each morning. No problem. House keeping did a fine job and very friendly. As for the BBQ's, our unit, J210 (studio) had its own and we used it every other night. Check in/out was quick and painless. There is a small convience store next to the lobby which we found priced a little more than the Safeway (5 minutes away) but great for the forgotten bottle of wine or sixpack or whatever. Our unit, J210 was great! Really nice walk-in shower with optional overhead shower head. Free wireless. comfy bed. A/C which we didn't need. All-in-all. Great time was had. Highly recommend the morning whale watch with the Gemini outfit.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Keara Heaney","date":"2012-11-28 16:21:18 +0300"}],"public_likes":["Mr. Tierra Gislason"],"vacancy":false,"description":"very centrally with air conditioning and a good breakfast.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}