{"title":"Santa Monica Mountains National Recreation Area","name":"Danielson Multi-Use Area","address":null,"directions":"4.8 Miles from Sycamore Cove, 3.3 miles from Satwiwa on Sycamore Canyon Trail","phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10","geo":{"lat":34.125217,"lon":-118.994318,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":37594,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"First of all, the room was so small. I expected it to be cozy, and properly equipped, but it was neither. There was no table to eat at.. just a desk. In-room meals had to be eaten on the bed, or over one's lap. The staff graciously upgraded my family to a \"King-Size Suite\" which just consisted of a larger bed.. (which in turn made the room even smaller). The Bedding was stained, the staff didn't clean the room until I personally requested it.. TERRIBLE SERVICE! My husband and I opted for valet service, and for the extra charge, I think it would have been better to have just self-parked. Why in the world would a guest at a hotel have to pay to park there?! The staff did NOT help us with our bags, even though we obviously had our hands full, there was no ramp so all luggage had to be transported manually. The elevator took at least 5 minutes to get to the floor, and its button didn't work half the time. The doors on the elevator nearly crushed me, as they do not have safety sensors.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":1.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Giles Monahan","date":"2015-06-22 22:07:37 +0300"},{"content":"great location to downtown Seattle,shopping,good restaurants.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Roxane Lang","date":"2012-11-22 02:13:48 +0300"},{"content":"My Fiance and I arrived in Seattle for along weekend. We were able to take the light rail from the airport which stopped only 2 short blocks from the hotel. We received a friendly greeting from the doorman and front desk clerk and had an easy check-in. The rooms are clean and the bed was very comfortable. If you like a large room however, this is not the hotel for you as they are quite small with little bathroom space. Otherwise this is a great place to stay. We will stay there again the next time we visit Seattle.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ansel VonRueden","date":"2014-11-29 13:06:06 +0300"},{"content":"This hotel room is average in every respect. From the front desk personnel, to the room itself it's all just okay. If you're looking for something special or memorable this is NOT the place for you! (i'd suggest you spend an extra $40 dollars and stay somewhere plush like the Pan Pacific) But if your objective is an affordable, safe, clean hotel room, without the frills, the Executive Hotel Pacific may be just the place for you.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Ladarius Crooks","date":"2015-09-29 01:52:00 +0300"},{"content":"A friend and I stayed at this hotel for two nights and it was nothing like the photos online at the hotel's website-very deceiving. The carpeting in the main entryway of the hotel is filthy; the complimentary apples stale. We had to try three different rooms as each reeked of smoke, and the desk clerk did not care about the fact that my friend and I are both allergic to smoke. The room we stayed in was filthy-wallpaper dirty and peeling off in every corner, mildew, an air vent that was half out of the ceiling and caked with dirt and grime (has to be a code violation). Our power went out both mornings. When we asked the desk clerk to speak to a manager, or asst. manager, we were told both weren't available until after our stay was over. I have stayed in many hotels in Europe and even the Middle East and Thailand and have never had such a terrible experience! I felt like I needed a shower after staying there!","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Nigel Mante","date":"2012-07-08 04:09:03 +0300"},{"content":"Staff were very friendly and helpful. Room was very clean and quiet. Perfect central downtown location. Wonderful walk to shopping and attractions. Good value. Only one mark against ...bathrooms are teeny tiny.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Arch Reichert","date":"2015-04-28 08:24:24 +0300"},{"content":"My cousin and I stayed at the Executive her first night in Seattle, and we both loved it. The beds were comfy, room was clean, and the AC kept the room at a nice, cool temperature for a fitful sleep. The decor has an Art Nouveau feel to it, which might be a bit off-putting to people who prefer more contemporary surroundings. If you appreciate the (somewhat) unusual, you will enjoy your stay here. Staff were friendly and attentive. Location is excellent and close to Pike Place Market without being too close. Aside from typical hotel noises (neighbors opening and closing their doors as they left), we did not have to deal with anything annoying or distracting. My only complaint was the slowness of the internet speed, annoying but not a deal-breaker for me. I would definitely stay there again with out of town visitors.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Adalberto Strosin","date":"2014-01-25 13:57:37 +0300"},{"content":"I found this hotel to be a pretty decent place to stay in downtown Seattle. It was clean, the staff was friendly and the location is absolutely unbeatable. There's a small workout room, it was OK. I especially liked that the hotel is so centralized and close to everything - the stadiums, Pike Place Market, downtown shopping and restaurants, Belltown, nightclubs. We had a room facing over 4th Avenue and it was very quiet at night. However, the hotel is older and not especially fancy. The rooms are small and showing their age, but it was certainly clean. If decor and opulence is a priority, you could opt for the W or Hotel Monaco, which are on the same block -- and probably 2 to 3 times more expensive. For the price and convenience, however, it's a good deal.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Terence Witting","date":"2013-06-30 03:57:01 +0300"},{"content":"We spent two nights and three days in Seattle at the Executive Pacific. WE found the rooms small, but clean and comfortable. Considering the downtown location, we thought it was very good value. The hotel is withing reasonable walkign distance to all the downtown attractions, inculding staduims, Pike Place, Pioneer Square and the waterfront. There is lots of shopping close by and plenty of restaurants for any taste. We took advantage of the hotel's valet parking whilw we were there and unfortunately our vehicle was broken into. The staff handled the situation very professionally, making sure the broken glass was vaccuumed out and comping our room. Despite the problem we left well satisfied","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Grace Ankunding","date":"2012-12-20 13:24:11 +0300"}],"public_likes":["Nyasia Fritsch","Hoyt Borer"],"vacancy":false,"description":"A small hike-in campground along the Backbone Trail, approximately half-way between the Pacifc Ocean and Newbury Park","alias":"Danielson Ranch","pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}