{"title":"Los Angeles/Downtown","name":"Millennium Biltmore","address":"506 S Grand Ave","directions":null,"phone":"+1 213 624-1011","tollfree":null,"email":null,"fax":null,"url":"http://www.millenniumhotels.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.049757,"lon":-118.254042,"accuracy":"APPROXIMATE"},"type":"hotel","id":16637,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We stayed at this hotel before a cruise and made a reservation for another hotel for our post cruise because Embassy did not have availability. Well when we checked into the \"other\" hotel to simply relax and enjoy our last days of vacation, we were checked into dirty rooms, yes more than one and not just dirty, beds made but the sheets had not been changed from the previous guest we were moved to another room and found the same problem. We called Embassy to check if there were available rooms and thank the good lord above they had a room for us. We checked out of the dirty run down hotel and happily waited for a clean room at the Embassy Suites. We had dinner and had the pleasure of being served by the loviest woman that had such gracious and hospitible skills and made us feel welcomed. Later in our room a knock at the door, room service delivering a beautiful plate of sliced fruit with a large bow and an apology for the inconvenience that we had experienced....At Another Hotel!....This was perfect and such a classy touch on what already measured up to be one great hotel. The front desk staff was top notch and I look forward to our next trip to Puerto Rico and another stay at the Embassy Suites Hotel. Thank you for everything...See you again soon!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Cristal Moore","date":"2015-08-05 03:38:34 +0300"},{"content":"We stayed here on a Sat night last June. It is about 1/2 mile and 10 minute taxi ride from the San Juan airport. First off I will mention that the hotel is nice and very clean. It has an attractive lobby and pool (you are near the airport but the noise of landing jets really isn't an issue). However this hotel is not without problems. The hotel does offer free internet access (as mentioned on their website) and there are three free interent kiosks near the check in desk. However, at least one of them was always out of order and the other two were constantly being used. My biggest complaint with the hotel is their handling of crowds. As mentioned we stayed there on a Saturday evening and the hotel was extremely crowded. The receptionist informed us that Saturdays are always busy because the \"pre-cruise\" crowd. (Apparently, a good number of customers stay in this hotel one night prior to their sailing date.) While the managers reception and cooked to order breakfast have always been some of the best things about the Embassy Suites we've stayed at - these are poorly handled at this one. First off the manager's reception. This hotel has a rule that there is a 2 drink maximum per bar visit. This is a problem if you have small children and your spouse has to stay with them while you wait in line for the drinks. The bar tender told me that I could come back for additional drinks, but the line was long and the wait was about 20 minutes. Also, the drinks are served in small palstic cups which don't tend to last very long. I think that, with additional bar tenders and a little more efficiency (larger cups??) the wait time could be drastically reduced. The same thing happened at breakfast. Very long lines (especailly if you wanted cooked to order foods). The wait was again about 20 minutes and finding a place to eat was a challenge. Finally, we asked for late check out on Sunday morning. Being an Hilton Honors member I've never been denied this request. However, this time I was. After having to prod for a reason why this request wasn't honored, the management finally told me that they had another large group checking in and needed to get all of the rooms ready. They did offer to store my luggage but we needed to do laundry so that wasn't much help. We tend to stay at Embassy Suites when we travel. While I might go back to this one, it was the most disappointing of all of the Embassy Suites properties that we've stayed at.","ratings":{"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Service":2.0,"Rooms":4.0},"author":"Gilda Nolan","date":"2013-01-07 19:02:05 +0300"},{"content":"My family stayed here on Jan 25, 2005. It's funny reading the previous reviews because we had a very different impression of the hotel. I found it to be clean, comfortable and quiet. Yes, there is maintenance being done, but the workers are very careful and warn you if you are approaching a freshly painted area. The beds are fine, the sofa bed is a bit uncomfortable and for one night was acceptable. The breakfasts were fine. Great coffee. The nightly manager party was fun with fruity drinks, and standard junk food of chips, pretzels, party mix and popcorn. The pool was lovely, I can't figure out what people were complaining about. I didn't see any missing tiles and I made a point of searching it out. One traveler said the pool area looked like a hurricane hit it. I can't figure that out either it was simply beautiful. Yes, you can hear the planes either taking off or landing depending on the direction of the wind. After awhile you get use to the sound and you don't notice the aircraft noise. The sounds of the kids screaming and yelling drown the noise out. I don't mind the sound of the kids, I simply put on my headphones and listen to music. It's not as bad as previous reviews write and I consider myself very sensitive to unnecessary noise. The beach is exactly 3 blocks away. One long block and two short. If you have very young kids, this might pose a logistical problem because you need to carry your towels/junk and hold onto kids. I have kids 14, 12,9, so it was no problem. Yes,one of the streets is a highly trafficed street and there is no traffic light. But if you enter the crosswalk the cars did stop for us. No, I wouldn't let the kids do this by themselves. I just don't trust them or the drivers. We walked to the beach and went banana boating which can be found in front of the ESJ hotel. At the same time other kids are on the beach and my kids made instant friends. This worked out well for us. The beach is public and you can rent the chairs for $3-$4 per chair depending where you stop. In front of the ESJ hotel the chairs are $3. This place is good for a short stay and the hotel is designed for business travelers. As we saw mostly flight attendants and business people. If you like the hustle and bustle of San Juan this a decent place. If you are looking for a peaceful surrounding and limited night life you should stay a resort such as the Hyatt in Dorado. The hotel staff is very accomodating and helpful.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Ms. Alec Cassin","date":"2012-02-05 08:14:00 +0300"},{"content":"I stayed at the Embassy suites with my family. I was overall satisfied with our stay there. The staff was very helpful and the room was kept clean. Initially I was put off by the fact that our room had lots of ANTS. The staff was quick to move us to a different suite when we complained about the infestation. So I wasn't a happy camper when we first arrived. I also couldn't believe that a suite which would sleep 4 of us only had 4 drawers and a tiny closet. The drawers were small. But you know what? by the evening of our first day there we forgot all about that other stuff and enjoyed the managers reception-which is free drinks and snacks. The hotel is also conveniently located off the main road which has many souvenir shops,restaurants and a small supermarket. The best place to get puerto rican food inexpensively is La Casita which is in the shopping center near the hotel. I've also stayed at the Intercontinental hotel in the past. These two hotels are 2 that I would recomment. The advantage the Intercontinental Hotel has is that it is right on the beach. The beach is about 2 blocks from the Embassy Suites and easily accessible off the main road . Again overall I was a satisfied guest.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Service":4.0,"Rooms":3.0},"author":"Newell Ritchie II","date":"2013-06-20 20:27:00 +0300"},{"content":"After days, looking for a good place to stay during one night... we chose \"El pedregal\" because it has good reviews on this site and the Marriott Courtyard was fully booked. First of all, the entrance looks like a cheap entrance of a motel, the facilities overall are ok. The pool was clean and refreshing, but the pool bar wasn't open until 6pm and the restaurant too! The restaurant opens just two times during the day: for expensive breakfast (8am) and dinner (6pm). THE ROOM WAS HORRIFYING! Stains everywhere, small tv with poor signal and 8 channels maximum, no decoration at all, uncomfortable mattress, flat pillows, awful bathroom, Hot water! But there's no way to control it so be prepared for a nice burn. DO NOT BELIEVE ANY OFFERS OF THE WEBSITE! they supposedly include breakfast and dinner but all they give you is a $10 coupon and you'll be notified at the restaurant about that scam. Exercise area? haha... not at all!!! At least the service was good. It's better to keep this place as a secret.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":1.0,"Location":2.0},"author":"Zachariah Hermiston","date":"2012-11-12 01:33:54 +0300"}],"public_likes":["Ransom Grant","Mr. Declan Streich"],"vacancy":true,"description":"The grand-daddy of all downtown hotels, with its gorgeous lobby and fancy restaurants.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}