{"title":"Devil's Bridge","name":"Hafod Hotel","address":"Devil's Bridge, Aberystwyth, SY23 3JL","directions":null,"phone":"+44 1970 890232","tollfree":null,"email":"info@thehafodhotel.co.uk","fax":null,"url":"http://thehafodhotel.wordpress.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.376962,"lon":-3.851025,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":34956,"country":"United Kingdom","city":"Ceredigion","state":null,"reviews":[{"content":"This hotel may look nice but the management is less then 1 star. They are the worst and completely unsympathetic ... Anyone pls free free to email if u have questions.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":5.0,"Rooms":1.0},"author":"Luciano Bergstrom II","date":"2013-08-09 10:54:28 +0300"},{"content":"We're currently at the hotel. Booked a week long trip. The main areas of the hotel, like the entrance to the hotel, lobby, and pool areas are nice. They are what one would expect of an Intercontinental hotel and the price per night they charge. The room we got is not good. We are not in a recently renovated room. The carpet is very worn and old looking. Bathroom is very small. It's hard with us having our kids here. Very old TV (old CRT). The fridge (which is nice to have) is rusted in various parts. The website says all the categories of rooms have DVD players. Well, our room does not have one. Everything is just very old. Not what I expect for the cost. Also, we keep getting only 2 bath towels even though they know that we have 4 people in the room. They are quick to deliver towels when we call. I have been pleased with the service. The pool areas are nice. The waterfalls are a nice touch and the kids really like the pool. There are plenty of chairs and umbrellas. Isla Verde beach is right off the property. This was one of the main reasons we booked at this hotel. That being said, we're a bit disappointed with the beach. There's a noticeable amount of trash. As others have said, there is a good amount of grass/seaweed that washes ashore. The water is not what I consider clear, and the color isn't what you see in pictures of the Caribbean. Each wave brings in a lot of sand. It's no where near the type of beach and water you find in places like Provo in the Turks & Caicos islands. Back to the hotel, the staff was great getting us beach chairs. Umbrellas can be rented for $10/day at the beach (free at the pool). The area is nice in that there are plenty of places to walk to and grab a bite. But overall, we would not stay here again because of the rooms.","ratings":{"Cleanliness":2.0,"Sleep Quality":3.0,"Overall":2.0,"Value":1.0,"Service":4.0},"author":"Ms. Leonard Schneider","date":"2015-02-19 19:27:10 +0300"},{"content":"Ok, so I am a local came to stay one night because huracane Irene took out our electricity in our home, no air, no tv, no water you could imagine so we decided to hop down to the isla verde district everything was booked but to our lovely surprise we found availability in the intercontinental. At $367.00 per night plus $25.00 for valet parking I'm thinking VIP baby but when we check in the room to our surprise the air wasn't working, no cable, room looked a bit outdated, look, I'll let the cable situation pass and even the air because they did fix it after 30 min. But I don't get the over $300.00 dlr tag price for such a small room that looks outdated. When I go to the USA I can stay in one of this small hotels for less then half the price and does rooms are pimped. I think this hotel is over rated, over priced if you are going to chrage me almost $400 dlr a night with taxes I would expect too feel really good as soon as I come into that room and I didn't feel that magic that makes your eyes drop when you enter a really nice room sorry guys but I got to call it as it is. At does prices Turist and or local deserve better.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":3.0,"Value":1.0,"Service":3.0},"author":"Mortimer Fahey","date":"2014-02-13 18:54:30 +0300"},{"content":"My family and I have stayed at another hotel in SJ. The InterContinental has nice facilities outside near the pool area. But we got off to a bad start when at check in the room wasnt ready and we were given a temporary key to use a room for 30 minutes for my family of four (including a 5 and 3 year old) to change clothes in 30 mins - a minute more and we were informed we would be charged 150 USD for use of the temporary room. Not very classy to say the least. Ive stayed at hotels all over the world and never heard of that one. But the worst was the room itself. Do NOT STAY ON THE CITY SIDE - the rooms are wet humid and moldy. The carpets are disgusting. I do not think that it can be healthy. When I asked a woman at the front desk about the wetness in the room she said it was the \"rainy season\". Yet we've been in SJ during the rainy season just last and managed to have dry rooms. Others who stayed on the sunny side - beach side - didnt have this problem. Also for an intercon surprised they do not have a DVD player or IPAD doc etc which is kind standard nowdays. The breakfasts are good and I suggest if it is not part of your package just pay for the buffet rather than a la carte - as your a la carte eggs and coffee will end of costing about the same anyway (according to others). The pool is nice and my kids loved it. Very happy the casino is off to the side and not so prominent. But the downside was the room. I dreaded returning to it each evening. Also the fan in the bathroom didnt work well so the steam from the shower had no where to go. Concierge was nice and helpful.","ratings":{"Cleanliness":2.0,"Sleep Quality":3.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Mr. Joanne Predovic","date":"2012-08-04 20:03:55 +0300"}],"public_likes":[],"vacancy":true,"description":"Historic hotel originally built as a hunting lodge in 1700's, over looking the Devil's Bridge Falls. Offers accommodation, tea rooms, restaurant and bar for guests, visitors and locals.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}