{"title":"San Francisco/Haight","name":"Metro Hotel","address":"319 Divisadero Street","directions":null,"phone":"+1 415 861-5364","tollfree":null,"email":"info@metrohotelsf.com","fax":"+1 415 863-1970","url":"http://www.metrohotelsf.com/","checkin":"2PM-Midnight","checkout":"12PM","price":"$76-$130","geo":{"lat":37.7724,"lon":-122.4375,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25864,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"They must have just been sold to another company - doing remodeling work so much extra confusion going on. The shuttle service helps a ton - and be ready to walk to the good stuff.... I guess you could take a cab - but the traffic is out of control in Vegas. WAY too many tourist and each brings their own style of driving to the roads. The main busses are nice and easy to handle. The \"resort\" is not much of a resort as you might imagine.... kind of your run of the mill TIMESHARES - where again you get what you pay for basically. Would NOT rush back... but if you want to save money for the shows and to gamble this place works - - - but so does the Motel 8!!!","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":2.0},"author":"Theron Vandervort V","date":"2012-10-07 08:23:51 +0300"},{"content":"stayed for a week in november and it was great. shuttles run downtown and to the strip. u r not pressured by salesmen and the concierge was good for any info needed. great place to vacation","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Larry Goldner","date":"2014-05-21 22:59:05 +0300"},{"content":"I booked this resort on the strength of reviews (somehow, it actually got an 8.7 out of 10!) and the fact that there were TWO king sized beds. We were traveling with my Brother-in-law and his wife, and they insisted on a king, and we thought a condo with kitchen might serve us well. There were others that found what we did- but all the propaganda claimed this resort had been totally renovated, so I chose to believe \"shabby\" and \"outdated\" were behind this place. We checked in just after midnight. I hoped upon hope that we would have a remodeled condo. Not so lucky. As others have mentioned... NO ELEVATOR. We were placed in #7 (there are MANY buildings) on the third floor. All the buildings look alike. I hoped that meant \"remodeled\". NOT. The furniture was green vinyl with huge rips in the upholstery. The cabinetry was 1970ish laminate with rose colored, tired Formica countertops. The carpet was dirty in appearance and shabby. The mattresses hadn't been replaced in a LONG while. For 4 nights, I slept at a 22 degree slant, rolling to the middle of the bed. One of the towels I used had (what appeared to be) dirty footprints. The gas pilot light in the fireplace was on all the time and REALLY noisy. The Contact paper in the cupboards was all peeling. I could go on. You get the picture. Sure, the location is nice. Couple blocks off the strip, easy to park, no death march to the ends of mile long hotel corridors. But again, luck of the draw. Our condo faced the parking lot. We had a great view of the rental car from our balcony, The bedroom window didn't stay open for long... folks arguing in the parking lot woke us up. Busses dropping off inebriated guests after dark made it real difficult to sleep. I felt mislead by webpages stating this place had been fully remodeled. Had I known there was a risk of getting the shabby room we got, I would have spent a few more bucks and gone somewhere else. We don't ever plan on returning to the Desert Club (Summer Bay) Resort.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":4.0},"author":"Laurie Davis","date":"2012-04-20 00:22:33 +0300"},{"content":"We ended our vaction here in Vegas and we miss it a lot!!! It was the best place ever!!! From the moment we checked inn till the check out, everything was good organised. We stayed in a 1 bedroom appartement and had housekeeping everyday... The pools were very good maintained with pooltowels as much as you liked!!! If you wanted to do a BBQ, there were BBQ at the property. We would highly recommend this to everyone and when we come back to Vegas this will be our first choice!!! Thanks for the pleasant stay... Serge en Saskia Segers from Belgium P.S. we were also at desert rose resort which was also good because it had free breakfast but even that could not convince us ... desert club resort is super!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Celine Will","date":"2012-01-28 23:03:38 +0300"},{"content":"We did not look for a typical Strip style of stay in Vegas. What we needed is a comfortable place to survive after really long flight and drive to Vegas. This hotel actually made it. We were given (as a free upgrade!) the apartment 201 in the 8th house. The apartment is nothing less but great: a studio with the kitchen and a fireplace; a huge bath, and a very nice bedroom with the main thing - a comfy bed. Did not use the pools/jakuzzi in the hotel because we had no time, but these options are a plus. What you have to keep in mind: it's a 10-15 mins walk from the Strip. You can use taxi, free shuttles or walk (as we actually did). Also, it seems not to have own meal options/restaurant.","ratings":{"Location":4.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":4.0},"author":"Dusty Wehner","date":"2012-05-04 22:31:26 +0300"}],"public_likes":["Jayde Conn","Gideon Lowe Sr.","Else Lemke","Annamarie Mosciski","Estelle Hessel"],"vacancy":false,"description":"A reasonably priced hotel at the corner of Page and Divisadero Streets, one block north of Haight Street. The rooms are quite basic, but functional, clean, and quite inexpensive for the central city. There is an excellent French restaurant downstairs, with outdoor dining and weekend brunch. Rooms directly over Divisadero Street can be quite loud on the weekends.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}