{"title":"London/Hammersmith and Fulham","name":"The Ville's B&B","address":"39 Brookville Road, SW6 7BH","directions":"tube: Parsons Green","phone":"+44 20 7381-2093","tollfree":null,"email":null,"fax":null,"url":"http://www.thevillesbedandbreakfast.co.uk","checkin":null,"checkout":null,"price":"From £80","geo":{"lat":51.4794,"lon":-0.2063,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16178,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Excellent Beach We just came back last night from out trip. We had a great time! Vacations are what you make of it. When you go to a foreign country, do not expect the same culture/food/luxuries that you would get at home. I am surprised at some of the reviews here, very surprised. If you were a Philadelphia native  went to California, would you complain that you could not find a Cheesesteak there? No. Accept the fact that each county is different. The food is different, the service is different. We are very spoiled here.Beaches were incredible. We walked up  down, found the beach at the Bambu the best, very lush  tropical.Rooms were fine, we had everything we needed. Had to borrow a converter for my hairdryer, no big deal. The outlets were very odd, so either borrow a hairdryer from the desk or a converter. Refreshments were refilled every other day. Rooms were cleaned every single day. We did leave the maid little gifts, she took great care of us.We stayed in block 21, it was very, very quiet, with an upstairs balcony.Food - we did not starve, there was food 24/7. I did get a little bored at breakfast, but I usually only eat a yougurt.There were so many choices. There was Mexican night, Caribbean night. We ate at both the StreakHouse  the Medittranean. They were both excellent. My husband ate goat one evening, he said it was tasty! There is an endless supply of American food: fries, pizza, hamburgers, hotdogs, etc. You will never be hungry.You can make your dinner reservations in the moring for that day. Go early. There is plenty of drinking water available, do not drink the tap water.Animation/Entertainment - Get involved! That is the way to have fun! They leave you alone if you want peace, but it is more fun to participate.The shows at night were cheesy, but we had a good laugh about it.Pool - Very good, large swim-up bar, jacuzzi we had fun there, the water games were hysterical. Beach - Oh my, the most excellent beach I have ever seen. It is hard to believe it is the Atlantic Ocean, it is so beautiful. We sat there for hours reading, sleeping. By the way, women walk abound without their top. It is an European thing.Watersports - do it! Take a paddle boat, it is fun. We tried everything.Tours - We did the Outback Safari - So interesting. If you are visiting another country, you should get to know the people  the history. We were so well informed. Jose' was out tour guide, he was very smart and courteous. We toured a coffee plantation, a schhol, a small home and a lovely ranch for lunch. The beach was the best part. I suggest doing that early in your trip, so you will be more understanding of your surroundings  culture.Staff - So friendly, the remember you  give you a handshake  a hug every day. Give the bartenders a $1.00 and they are your friend for life. Even the little towel guy, he was so happy, every single day, standing there in the balzing sun, handing out towels. He deserves respect, we fell in love with him, so sweet.Language - Ok, here was my biggest barrier, thank God my husband speeks Spanish. They speak 4 different languages there: Spanish, German, French, English. English is very hard for them. Study up a little on simple phrases. Know hello, thank you, Good evening, it goes a long way.There are a lot of people visioting from Germany, it is very big to visit this resort. They have thier own Travel Agent in the hotel. They are very friendly. Kids - the staff pays extra special attention to the, We were kicking ourselves that we left ours home. Angela was with them from 10:00 am until 9:00 pm. She was great. Kids were treated as guests. They all seemed to be having fun.Suggestions - *Hit the beach first, pool chairs free up around 3:00.*Bring floats for the ocean.*Bring lots of cash for shopping, small bils for tips. It is an unwritten rule here to tip your maid a 1.00 every day, or leave gifts. Tip your bartender at night, he will make your drinks so powerful. Tip the towel guy at the end of your trip, I tought he was going to cry when we handed him 2.00.*Bring pepto, aspirin  immodium. I have the weakest stomach in the world. For the most part I was ok. Overindulgence will get you every time.*Bring lots of sunscreen, we went through 3 bottles. Have a great tan too.*See your travel agent in the beginning of the week. If you can't find him/her at the lobby, go to the bookshelf there  finf the tour/travel company book. Your agent  phone number will be in that book. Call them*Phone cards to not work in the Dominican Republic. don't bother buying one.*Keep your cash safe. Nerver use your Visa/Check Card or ATM card. Use cash or a secure credit card with fraud protection.*Do not buy the cigars at the hotel  on the beach. They are FAKE. If you want cigars, see your tour/travel agent. Tell her you want to go to Don Lucas cigars. They pick you up  bring you back for free. My husband said the cigars are excellent. The man in charge there speaks English, they are freindly  you can smoke one for free B4 you buy.*$10.00 per person tourist fee when entering the country from USA. Bring cash for that.*PArty Thursday night on Caribbean street, do not miss that.*Beach BBQ on Saturday - good food, lots of rum punch. Dancing - right abound 11:30 that starts behind the ppol bar on the beach.*Get a massage on the beach. $30.00 for over 30 miuntes. Best relaxing massage you will ever have.Hope this helps, you may email me if you have any questions about RIU BAMBU!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Audrey Altenwerth","date":"2015-07-28 05:09:30 +0300"},{"content":"Travel Agent's Review !! March 2004 I can highly recommend the Riu Bambu, right from the hotel's facilities, the food, the entertainment, the friendly staff that will do anything to keep you happy, to a very comfortable room. The grounds are spectacular, palms everywhere and very well tendered. The beach is out of this world, and I personally feel the beaches were better than Negril in Jamaica...... If only the wind had not been so strong. A good tip is to take lots of small notes in US$'s. They are great for tips and for using in the shop. They never seemed to have any change. Lastly I would just like to commend the hotel on the effort they go to to put on the Theme evenings (in the restaurant)and barbecues on the beach. Plus the staff were so friendly and accommodating. You really do notice the difference coming back to Gatwick and everyone is so sullen !!! If you are planning a trip to Bavaro, spoil yourself and stay in either the Riu Bambu or the Riu Palace Macao !!! I now have no hesitation in recommending these hotels to my clients. We travelled with Thomson's and they were brilliant.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Isaac Kemmer","date":"2012-04-10 16:25:26 +0300"},{"content":"Beautiful beach and resort My boyfriend and I stayed at the RIU Bambu from March 7th-14th. The resort and beach were really beautiful. The staff were very friendly. The food was good although we both got sick for a couple days - nothing Immodium AD couldn't cure. It did not stop us from enjoying our stay or the food. We did 2 excursions - Jungle Safari and Maranarium. We had heard good things about the Jungle Safari but were not that impressed - it's a long day sitting in the back of a truck. You do get to see more of the country and boogie boarding at the beach at the end of the day was fun. The Maranarium is cool. You can swim with nurse sharks and sting rays and it is just a 1/2 day trip which is nice. We did feel a bit young at RIU - the average age of guests was probably mid 40's. If you want to just relax and unwind I would recommend this resort.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Brendan Yost","date":"2013-08-05 02:05:34 +0300"},{"content":"Beautiful resort and weather My husband and I just returned from staying 7 days at the Rui Bambu. We have stayed at a Rui resort before and was not disappointed again this time. The Resort was beautiful and the beaches were wonderful. There were many, many palm trees to sit under for shade. We never had a hard time looking for lounge chairs on the beach. However, it was hard to find chairs by the pool later in the afternoon. The Bambu is one of the nicest out of the whole complex and people from other Rui's tend to migrate there, so it tends to get a little crowded. The service was great and the food at the buffet was really good. We ate at the Steak House one evening and it was really good also. As stated in other reviews, take your own wash cloth. They don't give you any. They have many vendors that come in to sell their wares. If you go to buy anything from the vendors, offer them 1/3 of what they are asking. They sell a lot of jewelry with a stone called Larimar. You have to watch because some vendors sell fakes. If it's a real stone you can hold a lighter under it and it won't turn brown. If it turns brown, it's plastic. I ask one vendor in the complex if the earrings were real and he took my husband's lighter and showed me. He was real nice about it. If they won't do it, then don't buy from them. The best way to make phone calls to back home is to use a pre-paid phone card. You dial 9 for an outside line and then dial the access code (800-872-2881) to get ATT access. Then you just follow your pre-paid card's directions. The resort will charge you a connection fee of 50 pesos (for each call) which is under $2.00 US money. DON'T use your credit card to call. It costs $20.00 for the first 3 minutes. We had trouble with our phone the first night and our remote for the tv didn't work. One phone call and everything was taken care of right away. We went on the Party Barge excursion and if I had to do it again, I wouldn't go. We snorkled a little and there was a lot of dancing and plenty to drink. I had fun but felt it wasn't worth $54. a piece to go. All in all we had a wonderful time and met some really nice people that we will stay in touch with. The one thing I didn't like, which had nothing to do with the resort, is that unless you go on an excursion you don't get out of the Rui Complex. You can walk down the beach (either way) to a flea market but that's it. We have stayed a couple times in Playa Del Carmen, Mexico and I'm a little spoiled because you can walk or ride downtown to shop/eat or take the ferry across to Cozemel. We talked to a couple people that was staying at the Rui Palace and they took a taxi in town while in Punta Cana. They stated it was pretty scary. However, while taking the bus through town, we saw tourists on bikes and walking around. I would have enjoyed getting outside the resort area more, however I wouldn't pass up another trip to Punta Cana!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Gabriella Blick","date":"2013-01-10 10:09:24 +0300"}],"public_likes":["Davon Jones DDS","Gilda Morissette","Johnny Konopelski","Adriel Pagac","Sierra Wolf","Malachi Fahey","Anabel Waters"],"vacancy":true,"description":"In the friendly area with fashionable restaurants, cafes, pubs and antique shops","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}