{"title":"Death Valley National Park","name":"Furnace Creek Ranch","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.furnacecreekresort.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":36.60624,"lon":-117.1467,"accuracy":"ROOFTOP"},"type":"hotel","id":7385,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"spent 5 nights here at Easter with my 76 yr old mother in room 227 (very large double room with wonderful external balcony - our request to people watch) while the carpets may be a bit worn, the room had charm and was well stocked with towels and toiletries. extras like a daily continental breakfast, newspaper, a refridgerator (none of which the Ramada Bourbon gave for a higher price) were appreciated. not a chain hotel - felt cozy. the pool, tho small is lovely. perhaps the bar opens up later in the season. you can walk everywhere from here - several times a day. would definitely stay here again having seen the competition. was very comfortable. only drawback no wifi.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Edward Hilll","date":"2015-02-04 21:33:24 +0300"},{"content":"Great little hotel in the middle of everything in the French Quarter. Perfect if you're looking for an authentic French Quarter place to stay. Miss Donna made it a place to remember.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dulce Schumm","date":"2013-11-30 19:10:57 +0300"},{"content":"Stayed one night and hated it. Bell man was great and courtyard is beautiful. We were even fine with the room size due to its historic nature. But, we weren't expecting holes in the bathroom wall, peeling wallpaper, a bed that smelled like a mixture of BO and mildew, and a carpet too disgusting to walk bare foot on. Add hearing the people next door like they are in the room and you have a recipe for an unhappy customer. We were booked for three nights for our wedding anniversary and asked if we could cancel in the morning (we would pay for one night) and were told to wait for the manager in the morning and that \"it's a historic hotel\" in response to our complaints. Duh! That's why we wanted to stay here, because it IS a historic hotel. And how about a real solution to our problems or I'm sorry it's not for you, sir. But we didn't think it would be this bad. I blame false advertising on this and hope we can leave without paying for another night.Â","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Julian Ullrich","date":"2013-08-04 13:23:18 +0300"},{"content":"We had our booking made for us at one of the many Visitor's centres, not realising that this was the weekend of THE huge football match and the whole New Orleans area was going wild! When I sopke from the centre to the fron t desk, I realised that the Old Southern Hospitality attitude was sadly lacking in Robert, the chap with whom I spoke. This was verified upon meeting him - the TV programme he never took his eyes away from , was obviously of more importance to him than our booking. Because of the lack of accommodation in the hotel, we were warned that our room was windowless - and less said about it the better although I will say that it was contained in an annex room that opened directly onto the street. as we, and one poor dear lady, found to her cost! The weather was qppalling and the only area for breakfast was outside in the inner courtyard which would be charming in the sunlight but quite disasterous in the middle of a rainstorm. The breakfast woman was less than helpful, considering we had no idea what we were supposed to do in these circumstances and her attitude was aggessive and offensive. In spite of breakfast being included, we only ate there once more when we were assured she wasn't on duty! Confrontation is the last thing you need on your yearly holiday. It was with some relief, therefore, that the front desk rota changed, and we met Lillian - a pure joy of a lady, who smoothed things out for us, transferred us to a far better room with balcony, as soon as it was available and proffered local advice on where to go and what to eat. We found the cleaning staff to be happy and chatty but they are not the Public face of the Chateau hotel, after all. All in all , the Chateau suffers from lack of obvious management structure, a lack of management interest and a sense of hostile hospitality, apart from the exception of the dear lady in Reception.. The owner needs to shake the whole place up, spend money on repairing curtains that don't close properly, unstick windows that are painted up and won't open, damp that affects the bathrooms and certainly advise the staff that smoking in public areas is just not on.with the type of guests who would pay the kind of money the Chateau demands.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Location":5.0,"Rooms":2.0},"author":"Monserrat Koch","date":"2014-04-12 05:16:56 +0300"},{"content":"The worst hotel in america! My wife and I have done a lot of traveling around the world and when we stayed at the Chateau for a wedding weekend it was comparable to the worst hostel situation you can imagine. An unfriendly and uncooperative desk staff lent itself to several confrontations after first being put into a smokers room, with a leaking ceiling with five foot water puddle on the floor, and sinks that didn't drain. The second room had stained sheets and a window that would not close. Finaly in our third room we found peace for the night. On the second night some friends came to town and discovered a mouse in the bathroom. When we reported it to the front desk, they acted as if it was not a big deal and didn't offer to move our room. I called to discuss some sort of dicount on the stay and was given nothing for our incovenience. In addition, the cost was perplexing, at $169/night this place deserves no ones business.","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":2.0},"author":"Shanna Dach","date":"2013-01-22 11:03:25 +0300"},{"content":"The Chateau Motor Hotel was wonderful. It is a quaint little Inn. We stayed in room 223 and loved it. The room was a little small and the shower was tiny, but the bed was the best, very comfortable. We had a balcony with chairs to sit out on and a small bistro table. The hotel is close to everything, yet a few blocks from Burbon St. so the noise is not bad. I would recommend it to family and friends. The hotel seems more aimed toward adults and older youth. Not very kid friendly. The staff was wonderful, true southern hospitality!","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Lukas Rowe","date":"2014-05-01 22:32:55 +0300"}],"public_likes":["Tina Sanford","Ms. Werner Kassulke","Ryan Brekke","Cyril Borer","Hattie Smitham","Waldo Lynch"],"vacancy":true,"description":"Located in Furnace Creek, this establishment is the ranch style ''family oriented'' version of the above Inn with 224 rooms and rates ranging from $105 to $174 depending on the season and type of room. 760-786-2345","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}