{"title":"Santa Monica","name":"Shutters","address":"1 Pico Blvd","directions":null,"phone":"+1 310 458-0030","tollfree":"+1-800-334-9000","email":null,"fax":"+1 310 899-1652","url":"http://www.shuttersonthebeach.com","checkin":null,"checkout":null,"price":"$450+","geo":{"lat":34.00673,"lon":-118.49165,"accuracy":"APPROXIMATE"},"type":"hotel","id":26501,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"When we first got to the hotel the lobby looked really nice. When we checked in we were told that they were sold out of rooms with king size beds, so even though that is what I had requested, that all they had were 2 double beds. When we got to the room it stunk, the carpet was stained, that bedspreads were really worn, there was mold in the bathroom, and the furniture was in horrible shape. I called the front desk to request to be moved and they told me they didn't have anything else, and that we could call back tomorrow and ask. They ended up moving us the next day and this room was SO much better, I can't believe the two rooms were in the same hotel. The trip went smoothly until we received our bill the last morning. We had been charged for 2 movies we hadn't ordered, and were charged $2.00 to call the front desk the first night. The man at the front desk was very nice and removed all the charges. I wouldn't stay here again. I recommend it to people who maybe have a long layover, as long as you can get into a room on the 10th floor or above. The first room was dirty, the waiters at the restaurant were rude, they charge you $22 a day for parking, and it's not in a very convenient location for anything but the airport. Spend $100 more and get a room closer to downtown or the beach, you'll spend that much extra for parking anyway.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Location":1.0,"Rooms":2.0},"author":"Oren Kohler","date":"2012-03-30 06:22:13 +0300"},{"content":"We have stayed in a few different Westin hotels in past trips. Most were very good. But this Westin hotel's bed seems on the soft side, not the typical \"heavenly\" comfortable ones. Room size, bathroom, lighting are all fine. There was no complimentary water bottle or chocolate before bed time:-) There was shuttle service from airport that we waited for 30 minutes. There is not much to do near the hotel. The function rooms and services are fine. The per night cost is lower compare with other Westin. It may be good for a temporary stop before catching a flight.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Wanda Ferry","date":"2013-03-14 20:05:30 +0300"},{"content":"Large room. Lots of jet noise and pool party noise until midnight from the airline crews that where staying there and drinking up a storm. Bed good, but not heavenly. Other furniture worn and outdated. Since it was cheap and I was coming in from Australia, I was ok with the stay. And it only cost 75 cents to go up to the Santa Monica Promenade on the Big Blue, but other hoetels are closer and nicer. Local calls $1.50 each. I had a great stay at the Hilton for the same $69 rate, and a $59 rate at the almost as good, but better placed Raddison, so I'd pass on the Westin unless I couldn't get a great rate somewhere else.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":5.0,"Location":4.0,"Rooms":3.0},"author":"Kristopher Feil","date":"2014-07-16 17:23:56 +0300"},{"content":"This was my second trip to Westin LAX in 12 months and it is basically the same. If you pay Hotwire/Priceline pricing the place is very satisfactory (we paid less than $60 per night this trip) and is comfortable, clean and cordial. The rooms are a little dated but at the price it is okay. No flat screen tv is weird for a '4' star room. Plastic cups and thin towels were also stingy for a Westin. The people at the hotel were great and made our trip and the pool, if you get there really, really early is a good place to hang out. This was a really good place for us to use as a base to get around LA and enjoyed the trip. Just know that it is not really a high-quality Westin (as most are) but it is a decent place to stay for a cheap price.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Zelma Ebert I","date":"2015-09-17 23:45:26 +0300"}],"public_likes":["Elta Luettgen","Allene Ryan","Ila Dooley"],"vacancy":true,"description":"One of the only hotels in Santa Monica that is directly on the beach. Share pools, spas, etc. with Casa del Mar.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}