{"title":"Paso Robles","name":"La Bellasera Hotel & Suites","address":"206 Alexa Court","directions":"just off of Theatre Drive","phone":"+1 805-238-2834","tollfree":null,"email":null,"fax":"+1 805-238-2826","url":"http://www.labellasera.com","checkin":"3PM","checkout":"Noon","price":null,"geo":{"lat":35.588495,"lon":-120.697531,"accuracy":"ROOFTOP"},"type":"hotel","id":21889,"country":"United States","city":"Paso Robles","state":"California","reviews":[{"content":"This hotel is the best in Maui hands down! Before booking a trip with this hotel, I was debating between Ritz-Carlton, Four Seasons and Grand Wailea. I chose Ritz because of its overall value and my familiarity with the Ritz Carlton tradition of elegance and opulence. I was never wrong in choosing this hotel. I booked an ocean view Residential Suite and it was fantastic! I strongly recommend this hotel OVER Four Seasons and Grand Wailea, especially if you are a couple with no kids travelling. I visited Four Seasons and Grand Wailea but was never impressed! The pool in Ritz Carlton is way better than Four Seasons and even the beach in Ritz is great. Ritz Carlton is close to other beaches, among others is the Kapalua beach which is a great snorkeling site. Forget booking a trip to molokini or lanai, try this beach instead and you will save money and motion sickness (it was a bit wavy when we went there). The hotel offers free shuttle to Kapalua beach which is great for snorkeling. You could rent snorkel gear right there and charge it to your room account at Ritz (bring your room key). The Ritz Carlton is also next to a Catholic church with a shortcut right from the hotel free parking area, making it appear that the church belongs to the resort. In front of the resort is a store offering breakfast and lunch and this is very cheap place with great food, if you don't want to pay the $30/person buffet breakfast at the hotel. Other reviews mentioned the hotel location being windy; well, it was a breeze, not too windy which was actually good because it refreshes you; not sticky or humid. I visited the four seasons beach and it was more wavy for my taste than the beach in front of Ritz Carlton! It also didn't rain much when I was there. Kapalua area, where the hotel is, is secluded and ideal for honeymooners, lovers and those who want privacy. I saw some couple with kids, but not much. Overall, I love Ritz Carlton! The place has a sushi bar, lounge, the famous Banyan Tree restaurant, a beach restaurant, etc. YOU WILL NEVER GO WRONG WITH THIS HOTEL, FOR THIS IS THE BEST IN MAUI, hands down!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hans Turcotte","date":"2015-03-29 22:14:23 +0300"},{"content":"Was part of a major conference here for 6 nights. My Department was one of the \"sponsors\" of the conference. First the good: - Great meeting rooms and meeting staff - Very nice ( but not Great) hotel rooms. Extremely clean with great service at least twice a day. - We hosted a cabana by the pool one afternoon with Mango Ice tea, soda, water and Hawaiian Shave Ice. Other conference sponsors had Cabanas with specialty tropical cocktails. Excellent service by the staff - event was a big success. - Grounds are fantastic: multi-pool complex or walk (or ride) down a gently sloping hill to a well kept ocean beach with decent (but not huge) waves and a picturesque sandy beach. Excellent golf courses very nearby. - Fitness center was also good - free weights, weight machines and many treadmills, and several bikes, although 5 of the 6 elliptical/cross-trainers were not 100% functional at any given time ( no music or TV, no elevation, etc.). Now the bad: - We hosted a diner for about 35 people at the 5 star Banyan Tree restaurant on-site. We had selected a pre-set menu with the restaurant staff ahead of time. During the function, the waitstaff, on their own, decided to add an item (surf & turf) that was not agreed to and was priced above anything we agreed to. Additionally we ordered the \" wine by the bottle as it is used\" option. We witnessed the waitstaff filling wine glasses in front of children, empty seats,etc. We had three tables of about 12 people at each in one room. Service timing was weird: table 1 got their appetizers , then 15 minutes later table 2, then 15 minutes later table three - and the same for salads and the entrees. At the end of the night after their unecessary, continuous wine-pouring, we probably left 3 bottles of expensive wine in glasses on the table. Finally the bill got messed up. The amounts the restaurant charged on our receipts were lower than the amounts they had put on my Mastercard ( I had to call Mastercard several times). We did finally get everything resolved satisfactorily over the next two days with the help of the Ritz Accounting Dept. If I had to do this again, I would make it very clear that only the items on the pre-set menu were to be offered; let the guests order wine or drinks by the glass; and make sure I had an extra $10,000 in my credit-line to pay for the meal. Or better still go somewhere else ( i.e. Merriman's). Overall, the Banyan Tree experience was a negative and suprising ( for the Ritz) 2-day blot on an otherwise excellent conference and hotel experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Arno Lebsack","date":"2012-03-02 14:54:31 +0300"},{"content":"My husband and I celebrated our anniversary and 4th of July in Maui. The Ritz is so beautiful. Despite the misc. complaints, I stayed there anyway. I am so glad I did. The resort is so beautiful, breathtaking and elegant. We were greeted so nicely by all the staff and even received a hawaiian necklace upon check in. We had an ocean view suite and saw the beautiful sunrise every morning from our balcony. The resort is very big but the beach is just a 5 minute walk from the main pool area. The beach is very private as you only see guests of the Ritz. The concierge was so helpful and booked all of our events that were first class, all we had to do was show up. I do have to advise you that the ocean view was a side view but it was still beautiful. I believe they also have ocean front rooms available. They played live soothing music in the lounge area. Tips: Grab your breakfast and lunch at the store on the resort and save your money for a nice dinner. Dinner on the resort can be pricey but it's expected when staying at the Ritz. Last but not least, I read about the wind and was somewhat apprehensive. It is a little windy but most of the island is, because of the trade winds. There's a reason why it is the surfing capital! The wind is a nice warm breeze, don't worry you will enjoy it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Burnice DuBuque","date":"2012-04-08 17:38:41 +0300"},{"content":"If you're going to a Ritz, don't be expecting to save cash. Honeymooners delight. Awesome breakfast buffet for $30 (they'll even make you anything off the menu you ask for!). We were upgraded to a suite - enough room to entertain 8! One drawback - dining on the property was pricey and we had to drive down to Lahaina for cheaper eats (~20 mins). PERFECT for couples!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Devyn Shanahan","date":"2012-02-09 18:40:26 +0300"},{"content":"We chose this hotel because we wanted to experience one of the nicer hotels on the island and we got a good rate ($322/night) when we stayed. Most of the reviews we read on trip advisor are very accurate. Upon check in they upgraded us to an ocean view room even though we only paid for the basic room. Most of the rooms their have only a limited ocean view due to the layout of the hotel. The service at the hotel was very good from the Valet, Front Desk, and most Servers. The grounds are very nice and the Ocean view from the pools are unbelievable. The hotel is about a 3 minute walk to the beach so do not expect to be right on the beach like some other places but the walk is quick and they even provide a golf cart ride free of charge for you if you prefer. The rooms were very nice and the maid service was up to parr. Like other reviews stated the pool deck can be very windy but in Hawaii even a strong wind is not that cold. There was a few times where we had to wait longer than expected to get drinks in the outside pool bar area and they were not even that busy but other than that all of our service experiences were great. Kevin at the Terrace was great! The hotel is for the most part by itself so there are only a few places to walk to but if you do decide to stay here you should definitely go to \"The Gazebo\" for breakfast and get the macadamia and banana nut pancakes. Also even better than that is \"The PIneapple Grill\" Best restaurant I have ever been to. The pineapple upside down cake is a great desert and the fish and steaks there are great. Overall I really enjoyed this hotel. The only negative I have is that even though we got a good rate I forgot that the food ($20 omelet) drinks ($12 Pina Colada) and activities (my girlfriend paid $15 for a yoga class) would still be pricey but I guess that is what you should expect at the Ritz or any other five star resort. This and the 4 Seasons are the only 2 Five Star resorts on Maui. Please do not hesitate to contact me if you have any questions because I am just like you and like to do my research before I commit to spending my vacation and money at a place.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Bennett Satterfield","date":"2014-03-07 20:31:34 +0300"},{"content":"My family and I just got back from our stay at the Ritz, and we are already missing it. We expected wind and rain at the location, and were not dissapointed. Rain and wind came, and went. The rain last 10- 15 minutes, then it's sunny and beautiful. The location is quite upscale and was very accomodating towards my 2 year old daughter, We stayed on the club level ocean view room, and was very pleased. The view from the room was GREAT. We left the door open the whole time to experience the clean air and the sound of the waves rock us to sleep and wake us in the morning. My 2 year old daughter loves the pool and the guest around the facility were super nice to her. The concierge service on the Club level room was superb. She accommodated all our needs and provided great tips on what to do around Maui. Drinks and food were plenty as the staff constantly asked if we needed more drinks or warm milk for my daughter. The guests there were very friendly, well at least the ones on the Club level room. There were some who were uptight, but overall, good people. Made some good friends there. You will not be disppointed staying at the Club Level room as well as the Ritz. I'll try to upload some pics soon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alexandra Ruecker","date":"2015-06-11 12:05:41 +0300"},{"content":"Loved our stay at the Ritz! I was a bit worried about the \"overcast & rain\" that many people have mentioned, but we luckily didn't have any less-than-perfect weather. This resort is beautiful, quiet, and first class all the way. Exactly what I expected from the name. The grounds are perfectly maintained , the fitness center is well-equipped, and the rooms were very comfortable. I got the best massage I have ever had & I also loved the steam room at the spa. There is DT Fleming beach that you can walk to from the pool area down the hillside. It is secluded and not crowded at all. You can also take a longer walk (or the shuttle) to Kapalua Bay for a busier beach & great snorkeling. We did both snorkeling & scuba diving at Kapalua Bay & there were plenty of turtles & other sea creatures to entertain us. We ate at Kai in the hotel, but found Sansei right down the road to be much better for sushi. We had remarkable beach front dinners in Kaanapali & Lahaina at Leilani's & Pacific 'O. Great food at Roy's too, (although there is no view here), and of course, Mama's Fish House in Paia. Mama's has THE best views of anywhere on the island, it is really spectacular! It's a great place to go for lunch rather than dinner, as there isn't a sunset view. We went on our last day in Maui on our way to the airport. We also did some awesome scuba diving with Lahaina Divers & thought they were great. We dove Lanai & had an awesome experience. Also did a Trilogy catamaran scuba trip to Molokini Crater & had a great time. I would also recommend that if you are going to rent a car, use the \"name your price\" option on priceline.com! I did a low-ball bid of $23/day for a convertible & got that price :) The only thing I didn't love about the Ritz was the layout of the buildings. The resort is built on an angle into the cliff side and is a little confusing to navigate due to the incline. For example, what is the 4th floor on one end of the building is the 1st floor on the other end. Just takes some getting used to, but I'll admit I got lost more than a few times ;) I would certainly stay at the Ritz Kapalua again, it was really spectacular overall. A real gem!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Bernadine Muller","date":"2014-09-10 04:35:36 +0300"}],"public_likes":[],"vacancy":true,"description":"A luxury boutique hotel that is also the home of the popular Enoteca Restaurant & Lounge.  The hotel offers well appointed/over-sized guest rooms and suites that are provided with every amenity expected of a fine hotel.  Spa, concierge and evening turndown services are available along with an exercise room, outdoor pool, whirlpool and meeting facilities for up to 150.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}