{"title":"San Francisco/Golden Gate","name":"Travelodge Golden Gate","address":"2230 Lombard St","directions":"between Greenwich St and Steiner St","phone":"+1 415 922-3900","tollfree":null,"email":"Travelodge2230@Gmail.com","fax":"+1 415 921-4795","url":"http://www.travelodge.com/Travelodge/control/Booking/property_info?propertyId=09598&brandInfo=TL","checkin":"2PM","checkout":"11AM","price":"$90 year round","geo":{"lat":37.7998,"lon":-122.4383,"accuracy":"APPROXIMATE"},"type":"hotel","id":25798,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"From the moment we arrived, via private water taxi (well worth the €100), we were very well looked after. We booked a superior room - 406 - (with Grand Canal view), it was well appointed, if compact. The bathroom (shower only) looked amazing, but ... unfortunately on our first morning the shower cascaded across the floor, soaking everything. However, the receptionist redeemed the hotel by swiftly moving us into a junior suite - 402- on the same floor. Huge room, fab bathroom & 15ft high windows with panoramic views of the Grand Canal. Breakfast is excellent - a huge selection of hot and cold dishes, fresh fruit, pastries, good coffee and Prosecco too. The waiting staff were charming and attentive. If you take the treghetto (50 cent gondola that ferries you across the Grand Canal - unless it's raining!), two minutes from the hotel, you can walk to St Mark's Square in 5 minutes. I would highly recommend this hotel, great location, staff and building.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Eliza Carter","date":"2015-12-24 17:05:08 +0300"},{"content":"We recently stayed at the Centurion for one night only. The location of the hotel is perfect and the interiors beautiful. The choice at breakfast was excellent. One of us was ill on the day we were due to leave and the hotel very kindly allowed us to stay in the room until departing that evening without charge. Everyone at the reception was particularly helpful and we will definitely stay there again at some time in the future.","ratings":{"Overall":5.0},"author":"Shyann Howe","date":"2012-01-18 23:57:25 +0300"},{"content":"We stayed at the Centurion Palace for 2 nights with our 7 year old daughter at the end of June. We decided to splash out on a suite with Grand Canal view and a separate standard room for our daughter, booked through the SINA hotels website at the introductory rate. I had called to check the two rooms would be close to each other, and was assured that they would be 'face to face'. When we arrived by water taxi from the airport, I was slightly disappointed to see that the hotel was clearly undergoing maintenance - the manhole cover in the courtyard was up, with hazard barriers around it, and there was an alarming smell of sewage. Workmen had erected a workbench in the corner of the courtyard and were busy sawing up pipes with a circular saw (rather noisy!). In the passageway to the restaurant, the bar was covered in clear plastic as there was clearly work in that area too. Not a great way to start, though the reception staff were very welcoming and the reception area is stunning. We were then shown to our rooms on the fourth floor Again, the maintenance issues were very clear, as there was a bucket on the floor by the lift and the skirting board of the passageway had been removed - we asked what the problem was and were told that there were some issues with the air conditioning. The suite was stunning, with full length windows overlooking the Grand Canal, 2 small balconies (don't think you could sit out on them - standing room only!!!) and a mezzanine sleeping area. Slightly strange decoration but very luxurious. Bathroom was upstairs behind the bed in the sleeping area - a small bath with shower in it, single sink and separate toilet room (with no sink) on the other side of the bed. Very attractive, but unfortunately the gold leaf finish has really suffered from contact with water in places. You can see why when you start the shower - the water goes everywhere, even if you are careful. But all in all, a very attractive room, with automatic curtains so you can just lie in bed in the morning and push a button to see the view of the canal (and people breakfasting at the hotel opposite). Our daughter's room was at the back of the hotel with only a very limited view out of the back over the rooftops and one window with a view of a wall. Not great but what you expect in Venice if you don't pay a premium for Grand Canal view. Her bathroom was actually nicer than ours, with double sink and far more spacious. Again, the gold leaf finish wasn't holding up well. As we had been told, her room was very close to ours - diagonally across the hallway. The only problem was the key system, as she found it very difficult to open the door to her room - you had to hold the key to the pad and push the door at the same time. The door was very stiff and she found it really hard to get in without one of us to help her. We had a lovely night's sleep in these rooms (very dark and incredibly quiet given the location) and a great first day in Venice - starting with a fabulous breakfast at the hotel's restaurant. We battled for a table outside - there are about six on the deck over the canal, so if the hotel is full I'd imagine you'd be more likely to be inside, which is nice but not really as special as eating on the Grand Canal. Great spread of food and even Prosecco if you're not in a hurry to do anything (we weren't!!). Only thing to beware of is the seagulls - if you leave your table for even a moment they will swoop down and eat your food. We saw this happen to a couple of tables - predictably our daughter thought it was hilarious! When we got back to our rooms in the afternoon, we noticed that there was a puddle of water in the doorway to our suite. It turned out that the air conditioning was leaking. After much consultation, the maintenance team concluded that we'd have to move rooms. We were told that we'd be moving to 2 interconnecting junior suites on the second floor ('at no charge' - 'I should hope not!'). We packed up and the staff helped us move all our things. The two new rooms were lovely - with the same ceiling height as the suite but without the mezzanine. Again, full length windows over the Grand Canal and very luxurious. One was decorated in rich reds and the other in orange (or umber perhaps?). The bathrooms were far more spacious than the one in the suite, and again had the same issues with the gold leaf and a very leaky shower in one. We had to make a dam out of towels to have any hope of avoiding a total flood. Beds were fabulous and curtains made the rooms lovely and dark in the mornings. The fact that they were interconnecting would have made them a far better choice than our original rooms, as we didn't have to worry about our daughter letting herself out of her room and getting stranded in the corridor. In summary, potentially a great hotel - fabulous location (2 minutes from the traghetto over the Grand Canal, 2 minutes from the Guggenheim etc.), great service and spacious (for Venice!), modern rooms. However, I can't see the bathrooms lasting long without a total revamp, and they obviously need to sort out the A/C issues - they had to turn it off entirely for repairs on the morning we checked out, which with temperatures in the 30s outside wasn't ideal. If they sort out these issues I can't think of anywhere I'd rather stay in Venice.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Joanny Barton","date":"2012-02-23 15:22:13 +0300"},{"content":"Next door to the Mayo Clinic the room comes with a small kitchen, couch, Wifi, desk and king bed. The staff was great even found us coffee at 4:30 am. They have a free grocery delivery service available which is nice. We were here because of the Mayo Clinic but would stay here again if we were in Scottsdale area. We paid $143 for the room and found that to be great value for what we got.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Adell Harris","date":"2012-08-16 14:10:17 +0300"},{"content":"My husband I are elite platinum Marriott members - so we've seen our fair share of Marriott hotels. This one, however, was truly a relaxing stay! Lots of space in the rooms - but more importantly - lots of space outside the rooms. We throughly enjoyed the gas firepits outside as a place to watch the sun set and enjoy a few quiet moments together. The week that we were there, there was a big soccer tournament in the area and a number of youth players in the hotel with us. Outside of breakfast being a little busy, you would never have known they were there! Fortunately, we were not there to visit the Mayo Clinic next door, but it was obvious other guests were. This hotel has special amenities such as wheelchairs and extra-wide elevators to accommodate guests who are \"on the mend\". Finally, the location couldn't have been better. Very nearby a large shopping complex with loads of good restaurants (and a grocery store), but not right in the middle of the mix. Thanks Marriott, for yet another nice stay!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Florine Shanahan","date":"2015-01-03 23:12:32 +0300"}],"public_likes":["Bailey Harvey","Rosalinda Morar","Kylee Rippin","Augusta Veum","Mr. Hallie Effertz","Rosalind Marvin DDS","Jermain Lemke"],"vacancy":true,"description":"This hotel had a recent renovation in 2004 and has cable TV and high speed internet.  As with many of the other hotels in this area, they also offer free parking.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}