{"title":"Bakersfield","name":"The Padre Hotel","address":"1702 18th Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.thepadrehotel.com","checkin":"1PM","checkout":"11AM","price":null,"geo":{"lat":35.375572,"lon":-119.02151,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":1501,"country":"United States","city":"Bakersfield","state":"California","reviews":[{"content":"Very nice hotel. The room was perfect with an extraordinary bathroom! The view was boring, but how much time do you spend looking out? I loved the reserved elevator for rooms 52 and above, so we never waited more than 30 seconds. The pool area was very ordinary, not the main attraction, that's for sure. Only had breakfast at the restaurant, and very expensive ...But, isn't everything else in Vegas? Can't get a cocktail under $12.50, witch is a rip off if you ask me. Even a beer will cost you $8.50. The shopping center accross the street, the fashion show, is the perfect place to buy some beer at a normal price, or a nice bottle of rum...So you can enjoy in your beautiful suite at the Trump hotel! The only downside of this hotel is the walking distance to all the action...Get in shape people, because lots of walking in Vegas. Taxi's are a rip off, so be prepared. But all in all, I don't regret this hotel. Very friendly staff working, and very comfortable rooms. The price is good and the pillows are perfect! Enjoy","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Tania Gerlach III","date":"2015-07-08 03:14:11 +0300"},{"content":"We had a room on 40th floor in Sept. 2011. The room is exceedingly large compared to, say, The Bellagio's, with sink, stove, refrig, closet, bookcase, etc. and one king bed and a pull-out sofa. The bathroom is equally large with huge shower and \"john\" areas. BUT, the carpets are stained...both in room and in halls. Mattress left much to be desired. It has user-unfriendly doors, i.e., each room is partioned off with another room and one has to enter two heavy doors before entering their rooms. This resulted in late-nighters slamming the doors twice when they returned to sleep. Additionally, we heard \"boom-boom\" music all night. Another guest? We never knew where it came from. Then we were \"hit\" with their $22.35 \"resort fee\" on check out but only used one bottle of water that falls under that category. The dining rooms are far from \"friendly\" in atmosphere and the lobby is just a large \"cold\" area. A plus might be that one can jaywalk across to the large shopping mall. For $50 more, we'd select The Bellagio any time we revisit Vegas. There you get a clean room/floor with no noise, and it's gorgeous. The Trump is a mistake we will not make twice.","ratings":{"Location":4.0,"Overall":3.0,"Value":2.0,"Service":3.0,"Rooms":3.0},"author":"Angelica Block","date":"2015-09-06 19:45:04 +0300"},{"content":"We'd booked the Trump via the \"hidden name\" deals on Expedia. So it wasn't by choice that we stayed here, but it was a great stay overall. I was a little disappointed to learn that this was just a hotel and not a hotel/casino. But liked the fact that it is a smoke free facility, including the pool area (there is one small smoking section on the back patio). We checked in very late at night - around 1am, so there was no line. The clerk was courteous and friendly and remembered me when I checked out 2 days later. The lobby is exquisite, though sorta small compared to many other hotel/casinos in Vegas. They have a bar/lounge in the lobby and an adjacent restaurant. The service one of the best I've had in Vegas. Housekeeping was quick with orders for extra towels and water bottles. The doormen always had a smile and were attentive, and the shuttle drivers, were courteous and friendly (asked questions about our time in Vegas). PS - there is a free shuttle to the Wynn or to the Caesar's Forum Shops that runs very frequently throughout the day and into the night and also picks up from these locations. We stayed in a King Suite on the \"strip view\" side of the hotel. It did not disappoint. Great view of the strip including the Bellagio Fountains (though I don't think every room will have this same view). Kitchenette which includes a microwave, small stove (electric) and a fridge (bigger than a mini-fridge, but not full size). The suite also had a nice couch and two chairs along with a coffee table. Included in the suite was coffee (quick brew coffee maker) and bottled water (unlimited refills). The bed was a little firm, but I slept well. My girlfriend claimed that she didn't sleep as well, which is strange since she prefers a firmer bed than I do typically. There was a couple water spots on the ceiling in the bathroom that were questionable for a 5 Star hotel, and the toilet seat seemed to have a \"hinge\" problem, but fairly minor issues. The bathroom amenities were fantastic - large stand up shower, along with a huge spa bath, two sinks and a toilet that was partitioned off; it also included a t.v. in the mirror. The pool is great. Plenty of seating (at least in early September) on both Saturday and Sunday. It is large enough that you can actually swim laps (not quite olympic length, but long enough). There a about 10 cabanas for rent along with large round couch chairs for rent, or the free seating. The free seats are obviously first come first served, and don't come with umbrellas by default, but if available the life guards/pool attendants will bring one over for you. There is a bar and light restaurant right next to the pool. Drinks are typically overpriced, but you can order a tropical smoothie for $6-8 and add a shot of rum for $3 and have a very tasty drink. They also had a \"bucket of beers\" special - so ask. We didn't use the spa or the gym, but they looked nice. As stated in the beginning of this review, we booked this hotel via an \"unpublished rate\" deal, so we got the room at a discount. I would say that it was worth what we paid and generally speaking, this hotel is worth it if you are looking for a place where you can get first class service and a nice place to stay. As well, it's not so far off the strip and is right next to the fashion show mall (the entrance to Nordstrom is right across the street from the hotel).","ratings":{"Location":4.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Millie Lebsack","date":"2015-08-18 14:24:10 +0300"},{"content":"excellent hotel; stayed there for 4 nights and don't regret it. the hotel is well located, doesn't have all the hassle and overcrowdedness of a casino hotel and thus offers you a safe haven close to the classical strip... the rooms are spacious, of high quality and very very clean, the service and friendliness of the staff is among the best I have encountered in my life... I would definitely go back and my opinion of the Trump hotel brand is now very high, after my first stay in one of it's hotels.... 5 out of 5","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Sallie Gutmann","date":"2014-07-23 20:28:30 +0300"}],"public_likes":["Mittie Pollich","Elizabeth Reilly","Mr. Jovan Schuster","Tyrell Ritchie","Emmitt Zemlak","Jackie Kirlin","Cindy Schaden","Ms. Aurelia Dibbert","Tyson Jacobi"],"vacancy":false,"description":"This boutique hotel offers five unique food and beverage venues.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}