{"title":"Beverly Hills","name":"Maison 140 Beverly Hills","address":"1140 Lasky Dr","directions":null,"phone":"+1-310-281-4000","tollfree":null,"email":null,"fax":null,"url":"http://www.maison140beverlyhills.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.065643,"lon":-118.409792,"accuracy":"ROOFTOP"},"type":"hotel","id":3428,"country":"United States","city":"Beverly Hills","state":"California","reviews":[{"content":"The Fairmont is a lovely hotel right on the square at Copley Plaza, with Trinity Church at one end and the Boston Public Library at the other. The location is perfect. Copley metro stop is right outside and there are lots of shops and restaurants within walking distance in Back Bay. My only complaint is that the room was very small. There was some building work going on but this did not affect us at all.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Lexi Swift","date":"2015-05-16 04:22:37 +0300"},{"content":"Every encounter with staff in this hotel was warm and so hospitable. I have not had such a pleasant experience at hotel ever and I marvel at this since it is such a large size. It also was great to see the black lab in the lobby. Love it! The historic building definitely has a lot of charm and is a great area to go shopping.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nasir Renner","date":"2012-06-02 17:59:28 +0300"},{"content":"Grand and opulent main lobby area. Feels like you are in a different era. It's a beautiful hotel in a very convenient location. Customer service is outstanding. Umbrellas from the concierge and lots of good advice. We went to Newbury Street after we checked out and realized that we left a laptop charging cable in one of the rooms. We made a quick call to the hotel and they were extremely helpful. Someone ran right up to the room, got the cable, wrapped in plastic with our name on it and put it with our bags that we being saved with the valet while we shopped. We were traveling with our 3 children and booked 2 rooms. We asked that they be adjoining and we were thrilled to find out that we actually ended up with the whole end of a hallway to ourself. There is a potential doorway at the end of the hallway that can block off the whole area like it is one big suite with 2 bedrooms. It was awesome! My husband and I had a room with a king bed and the kids had a room with 2 queens. If you are traveling as a family and require 2 rooms, I cannot recommend this highly enough. Everyone had their own space and that feature alone made the high room price worth it. Don't expect to find modern conveniences like a coffee pot in the room or coffee in the lobby, but there is a Starbucks on the corner. Also, you will not find free wi-fi like a newer hotel. Wi-fi is $13. per room per night.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Samara Howell","date":"2015-11-21 17:09:37 +0300"}],"public_likes":["Elisha Murray","Jonatan Grimes","Onie Conroy","Lionel Dickens","Mikayla Abbott","Jamarcus Olson","Paula Schumm","Margarita Mann","Idella Haag"],"vacancy":false,"description":"Slip into the French and Far East-inspired modes of Maison 140, an intimate, 43-room boutique luxury hotel in Beverly Hills. This unique unique hotel was redesigned by Kelly Wearstler Interior Design as a contemporary tribute to the classic Parisian inns of the last century. Visually striking, yet inviting and warm - the Maison 140 Beverly Hills Hotel is the city's perfect pied-a-terre for the imaginative traveler.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}