{"title":"King City","name":"Keefer's Inn","address":"615 Canal Street","directions":"Exit Canal Street","phone":"+1 831 385-4843","tollfree":null,"email":null,"fax":null,"url":"http://www.keefersinn.com","checkin":"2.00 pm","checkout":"11.00 am","price":"69","geo":{"lat":36.202642,"lon":-121.128153,"accuracy":"APPROXIMATE"},"type":"hotel","id":14005,"country":"United States","city":"King City","state":"California","reviews":[{"content":"This was our last stop at this trip and this hotel worked well for our needs; lots of activities in the hotel and a short drive away from parks and shopping. We had again booked a Club level room and got an ok room with a nice view to the pools and to the nightly fireworks of Disneys. The room was very average and a bit small for an adult and two pre-teens, but it worked out fine. The bathroom/ closet door combination is though a bit strange and not very practical. The premises are average in style but the pool activities just great for this clientele. It was the climbing wall that won the votes of my sons, but unfortunately with quite destricted opening hours never had a chance to use it. They were not open in the morning and closed before returning from the days activities, pitty. Anyway, the pool slides and grotto, bicycles etc provided some fun for the kids. The service at the pool is almost nonexistent, a big minus. The Club here had nothing to do with my previous hotel in Key Biscayne, and therefore was a quite disappointment. A small club with inconvenient opening hours and very limited servings did not impress. Additionally, the alcoholic drinks had an extra charge. The breakfast was correct for our needs, so that worked out well. Extra plus for a very helpful Club Consierge, who gave us so many tips for the parks and shopping. As said, the hotel is very conveniently located by 15 minute drive from Disney and Universal, two major shoppings, and only 5 minutes away from a Outlet Mall. In the area, there are plenty of restaurants to feed the children for their taste (Subway :-). Last evening we dined at the hotel´s Hemingway restaurant, and it was really worth it. The food was great and the athmosphere quite nice. We had to rush out though, since the children had heard about \"smors\" session at the \"beach\" and it was about to end in half an hour. Well, this turned out to be fire made so that you could prepare your marshmellows, but after buying the kit from the bar, we had no glue what to do! Good thing there was one parent who was able to give us the instructions. In general, we had a great stay in Orlando and the hotel worked out well, but as said they could put some more emphasis on their guests. Thanks to a one previous tripadvisor posting, I was alert about the summer package charging, and guess what, they had charged me four nights instead of three. The receptionist though credited me without problems.","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":4.0,"Value":3.0,"Service":3.0},"author":"Tyree Beahan V","date":"2013-03-22 14:07:42 +0300"},{"content":"I had an extra day in Orlando and planned to stay in a \"normal\" hotel in Orlando. When the weather turned nice, I changed to this resort. The staff is great, the rooms are newly nice, and the property has stunning views. The best part is that I actually relaxed. I even took a nap on one of their hammocks. I have stayed at virtually every hotel near Disney, and this one even beats the Grand Floridian.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Esteban Crooks","date":"2014-06-30 06:34:02 +0300"},{"content":"This hotel is gorgeous. I loved so many things about it: the room, the pool, the service, the people, the views, the breakfast buffet, the conference center, the landscapes, and resort amenities, free shuttle to disney. The only things I didnt like was that the food was really expensive and I wish the pool/bar thing was open later.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Brooks Littel","date":"2014-10-16 16:57:24 +0300"},{"content":"I stayed 6 days at this resort and must say it is pretty top notch. Being used to New York hotels I am shocked when I see all the staff from the bell service to securities guards being friendly. The in room dining is very good I must say. If you ask for something special like extra hot sauce they will bring you that extra hot sauce. The pool is gorgeous, and I loved the water slide as well. The free shuttles are pretty decent but we found going to universal from 9am to 6PM was just a bit too long for us, took a taxi home instead. Tips: We ordered take out to be delivered from a local establishment. They wouldn't let the people in to the resort. We had to take a shuttle to the front gate, by then my phone was exploding with calls from the delivery man. Don't take the town car they provide, it will cost you an arm and a leg. I called the yellow cab company and scheduled a pick up. Also, beware when they take you to universal it should be around $22 but the drivers take you the long way which ends up being $36...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Abigale Greenfelder","date":"2015-11-27 11:22:23 +0300"},{"content":"Check in was perfect and they went over and above in this area. Room was very new and modern. We had 2 adults and 3 kids in standard, a litlle tight. Very clean room. Lobby was nice. Pool area was terrific! So many kids activities, all free by pool. Parking is a little far but not horrible. Downside is the shuttles provided to parks are to limited. You really need a car, while there. Good location with plenty of decent restaurants near by. Exceptionally value for what they offered. Leave a day to just hang and the pool and do the activities.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":3.0,"Rooms":4.0},"author":"Maggie Luettgen","date":"2013-02-16 01:44:04 +0300"}],"public_likes":["Adeline Kertzmann","Lorine Robel","Wilbert Carter","Vida Runolfsdottir","Zechariah Wilkinson","Gennaro Ebert","Isac Barrows","Maymie Hegmann","Khalid Senger"],"vacancy":false,"description":"47 Units Inn W/Swimming pool, Hot-Tub, Free High speed Internet,Business center, On site restaurant, Free Continental Breakfast, Nice Clean Rooms","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}