{"title":"Nottingham","name":"Eastwood Hall","address":"Eastwood Hall, Mansfield Road","directions":null,"phone":"+44 (0)1773 532 532","tollfree":null,"email":"reception.eastwoodhall@principal-hayley.com","fax":"+44 (0)1773 532 533","url":"http://www.eastwoodhallhotel.co.uk","checkin":null,"checkout":null,"price":"Bedroom daily rates start from £69","geo":{"lat":53.024729,"lon":-1.31076,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20794,"country":"United Kingdom","city":"Eastwood","state":null,"reviews":[{"content":"Nice hotel with spacious rooms and options for various group sizes. Rooms haev all facilities for short and long stay and staff is very helpful.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Juwan Ernser","date":"2012-02-27 09:41:00 +0300"},{"content":"We are a family of four, with two children aged 8 and 11. We stayed at the Point Resort for 2 weeks in April 2011. The rooms were huge, much bigger than I was expecting - plenty of room for all our gear. We got a two bedroom apartment which would easily have functioned as two separate apartments. The kids room had a big bed, tv, their own separate kitchen and bedroom. We got a separte tv room/kitchen area which had everything you would need, washer, dryer, dishwasher, cooker, cooking pans. We didnt cook but if you are so inclined on holiday then everything is there for you. The second bedroom also had a tv, with a huge ensuite with a jacuzzi bath, shower, separate toilet room, airing press. The beds are v. very comfortable which is important when you come back from parks tired. We had a nice view over the pool area - at night you could see the fireworks at Disney in the distance. Outside there is a nice pool with a lovely hottub which is great after a long day walking in the parks. A new bar pool has just opened which is a nice addition. There is an indoor gym next to the pool area. The hotel is in a good location for parks - wet n wild is 5 mins walk away. Universal Studios is just a mile down the road. We didn't drive, but a free shuttle bus brings you to all the parks. There is a nice TGI Fridays and a Chilis about 5/6 mins walk away. There is a small area in the lobby where you can get breakfast in morning (they serve starbucks coffee) and they serve tapas/snacks in evening. We didn' t eat there as we self-catered for breakfast, but the food looked nice. I would definitely recommend this hotel to someone travelling with children who wants a bit more space than a hotel and some of the comforts of home. It is in a quiet area, away from the madness of I-Drive. I found the staff at the hotel to be very friendly and helpful, we were always greeted with a smile. I would definitely stay here again.","ratings":{"Overall":4.0},"author":"Doris Kilback","date":"2015-11-21 07:50:10 +0300"},{"content":"excellent attentive staff. the new pool bar was a great addition. The attention given by angie at the pool bar was great. and jose had good stories.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Joseph Sipes","date":"2014-04-28 07:35:07 +0300"},{"content":"Husband and I stayed at THE POINT ORLANDO RESORT for one of our many stops for our honeymoon... Neither of us has kids, so while we understood that we were in the heart of Orlando's theme park district, we didn't want to be bothered with them the entire time. So choosing the Point and staying there was definitely a good idea.... everything wasn't perfect but we definitely would return.... The way that the rooms are set up is really nice... makes you feel that you are in an apartment.. Very spacious rooms for the price. The lobby is also very pretty.... The parking lot was never too busy, maybe because we were there during the week, but it was spring break... I did NOT like the stain that was on the floor in front of our room and every now and then it smelled like bad water in the hallways.. At one point I asked hubby did he let one go and he said NO... lol But overall, it was a nice experience and really really close to everything near Universal Studios, Wet n' Wild, carnivals, Downtown Disney, etc.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Abe Bernier","date":"2013-07-31 21:38:42 +0300"},{"content":"We loved our stay here but, felt the pool was a bit small and quiet for 2 young kids. The pull out was uncomfortable for adults but, fine for kids. The room was super clean and we really loved having a kitchen and washer/dryer. The location was great as it was quiet but, close to International Drive. I liked it here and would stay again although I felt is was not a true 'resort'. However, the staff was great! OUr friends had a great room overlooking the pool (we did not) and their room was bigger (we had a 2 bedroom lock off)- it did make a big difference having the bigger room.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Adolf Krajcik I","date":"2013-03-30 17:10:55 +0300"},{"content":"Stayed for two nights at the Point Hotel (my second stay there). Everything was wonderful. The 1 bedroom suite is huge- with a full kitchen, washer/dryer, bathtub with jets and a pullout couch. We were close enough to walk to Universal Studios and City Walk and took a short cab back. The location couldn't be better- and the staff was extremely accommodating. The only place I want to stay when I go to Orlando.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kylie Abbott","date":"2015-12-18 17:06:13 +0300"},{"content":"My husband & I made the decision to stay here based on reviews we read on Trip Advisor but have to say that our experience at this hotel was one of the worst we have had. We have never had a problem with any of the hotels we have stayed at in Orlando before. This one disappointed us on every single level - only thing in its favour is the location as it is very convenient for Universal Studios and the International Drive area. However, there are much better hotels to choose from in this area and for much better, lower rates as well!! We figured we would pay more as we wanted to treat ourselves before we went on our cruise but it was such a bad mistake. The hotel was not very clean - in fact the carpets were positively filthy!! Also the bed was the most uncomfortable bed we have ever slept on and the result was that neither one of us got much sleep due to the sagging mattress and poor quality of the bed. They really need to invest in some decent beds in this establishment!!! After all, when you book to stay at a hotel it is in the hope of being able to get some rest before continuing with your onward travel - we were both exhausted after our stay at this hotel and found the staff to be very unhelpful and disinterested when we told them of the problems. There are much much better hotels to choose from in Orlando than this one and the biggest mystery to me is how this hotel is so high in the ratings on Trip Advisor as our experience there bears no relation whatsoever to how some of the reviewers have described it. It is as though they are describing a completely different hotel to the place we stayed at!!! I have to agree with the people who have left poor reviews and the best advice I can give to anyone looking for a place to stay whilst in Orlando is to do yourself a favour and give this one a miss.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Ewell Moore","date":"2014-06-15 08:32:49 +0300"},{"content":"I would have never stayed here had I not read prior reviews and noticed that it was recognized as a Univeral Studios partner hotel. We were within 5 min of Universal and within only minutes of anything to eat. Wet and Wild Park is across the street. The hotel was clean, staff helpful, and was very nice!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ervin Strosin","date":"2013-01-19 06:41:47 +0300"}],"public_likes":["Penelope Von","Vinnie Shanahan","Jakayla Wyman","Roosevelt Wunsch","Myles Effertz"],"vacancy":false,"description":"Hotel and event venue offering 150 bedrooms and 36 meeting/event rooms, all connected to Wi-Fi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}