{"title":"Los Angeles/Downtown","name":"Westin Bonaventure","address":"404 S Figueroa St","directions":null,"phone":"+1 213 624-1000","tollfree":null,"email":null,"fax":null,"url":"http://www.starwoodhotels.com/westin/search/hotel_detail.html?propertyID=1004","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.052913,"lon":-118.255828,"accuracy":"ROOFTOP"},"type":"hotel","id":16640,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"I was reading some of the reviews and I can not believe that some people find this place not clean. I had use this hotel at least four times in last two years and every time the rooms are very clean and with some partial view of the Isla Verde beach or the city. Pool area is very nice, as the pizza restaurant in the lobby.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Larue Mitchell","date":"2014-02-03 07:48:54 +0300"},{"content":"The hotel is very nice. The furniture is from the 1960s which is all right with me. For us smokers, we have the second floor reserved which is a must and a plus. There is wi-fi in the rooms as advertised. The pizzeria/italian restaurant in the lobby is great and the pizza is the best. There is a parking lot next door - cheap. You will pay the hotel for it when you register. Cristina from the hotel was very accommodating as I asked to be moved to another room and it was done at once. Will definitely go back to this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Cole Shanahan","date":"2014-04-12 06:39:15 +0300"},{"content":"HAMILTON, ONTARIO CANADA FEBRUARY, 2008 We stayed at his hotel as a pre-cruise destination. Arrived at the hotel at 4:00 p.m. It is a very short drive from the Airport. Check in was a breeze. Rooms are clean and include iron, coffee maker, fridge, and microwave. Bathroom is tiny but clean and renovated. Airconditioning worked well noise level was quiet all night. There is a restaurant in the main lobby selling mostly Italian Food. Food is not bad and reaonably priced. We took the bus to Old San Juan. 75 cents per person and about a 15 minute drive. The bus ride was an eye opener as we drove through what looked like a lot of government housing. Wouldn't recommend doing this at night. Took a taxi back from Old San Juan at the end of the night cost was 19.00 dollars. This was a more than acceptable hotel for a very reasonably priced will definately stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Max Bins","date":"2013-06-10 04:01:50 +0300"},{"content":"My husband and I stayed at Howard Johnson in Isla Verde in March 17-20. We were disappointed as soon as we checked in and saw our room. It was on the lobby floor which may not have been terrible except for the fact that the room was tiny, you could hear everything that was happening outside of the room and worst of all, there were no windows! It was a dark little dungeon. But for the fact that we were only staying 3 nights, I was very close to walking down the street and finding something else. We did ask to change rooms but the staff stated that everything was booked. The staff, by the way, could have been a bit more customer service oriented. They seemed to have attitudes and were not receptive to questions. The service in the hotel restaurant was terrible. The waitstaff were friendly but the service was beyond slow. They don't acknowledge you when you walk in, you have to just guess that you should pick any seat available. The tables were still dirty from prior customers and on one occasion, we waited approx. 30 minutes before anyone even came over to take our order. It was so bad that we complained to the restaurant manager and we weren't the only ones complaining. On the good side, the pool was nice and the beach is conveniently right across the street. The hotel is nicely situated on a relatively busy strip but having visited Old San Juan, I would have rather stayed nearer to there because they seemed to have a much wider and nicer selection of restaurants than where we were and our location seemed better suited for spring breakers. The bus stop to Old San Juan is across the street from the hotel and is approx. 45 mins, it costs about 50 cents. El Yunque is a must see and I would recommend renting a car a driving there as it's a relatively easy drive and was much cheaper than a tour. Our one day car rental was $27 and the visitors center at El Yunque charges about $3.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Service":1.0,"Rooms":2.0},"author":"Toby Wiza","date":"2012-04-18 06:39:37 +0300"}],"public_likes":["Dayna Crist","Lauriane Olson","Novella Thiel","Ms. Lon Sipes","Patrick Moen","Myrtle Ryan"],"vacancy":false,"description":"Recognizable from various movies it has appeared in.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}