{"title":"San Francisco/Castro-Noe Valley","name":"Twin Peaks Hotel","address":"2160 Market St","directions":"between 14th and 15th","phone":"+1 415 863-2909","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7669,"lon":-122.4303,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25392,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Book the 'San Francisco Package' The Mark Hopkins Intercontinental is first class accomodations in a perfect location. If you have a car and will require parking, book the San Francisco Package (available Mon 28 June 2004-Friday 31 December 2004). I made my reservation on Intercontinental's website and received a rate of $209. plus room tax: $26.46, for a total of $235.46 for Friday, August 27th, 2004. The S.F. package includes a full American breakfast at The Top of the Mark ($57), overnight parking ($50), two complimentary cable car passes per day ($18), and late check out (2pm). I stayed in room 520, had a king bed with a beautiful city view, highlighted with a fountain and cathedral. The bathroom is very tiny, but is lavishly done in marble, chrome hardware, and not enough towels. After requesting additional towels, which were immediately delivered, the room had everything I could hope for. The breakfast is excellent and the view is breathtaking. I heard the Tongo which is across the street at the Fairmont is a must for a cocktail, unfortunately did not have the time to check it out. If you are shopping, Macy's offers a 12% discount card, just show your hotel key at gift wrap. The discount card is good for one day. San Francisco is a great week-end destination with lots of romance and adventure; but all those memories are superior when you stay at the right place. The Intercontinental Mark Hopkins is the right place.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Damion D'Amore","date":"2012-04-01 13:39:41 +0300"},{"content":"Unpleasant experience I stayed 6 nights on the Club Floor Level, which was so unsatifactory that the Management credited me with one free night. The Club floor is poorly staffed and does not compare with other InterContinental properties. I have complained to InterContinental Head Office without getting any satisfaction. I would not stay there until something has been done to this very tired hotel.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Keyshawn Wuckert","date":"2012-11-26 07:38:02 +0300"},{"content":"True pampering...1st class hotel   showReview(1129689, 'full');","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Colten Mills","date":"2015-02-05 23:56:13 +0300"},{"content":"Great Location, Classy Hotel       Another city view from the bedroom, with the bay beyond..","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Denis Rippin III","date":"2015-01-06 20:40:43 +0300"},{"content":"Our room was gorgeous - great service too After reading some of these reviews- it's like we were staying at a different hotel. The service here was top notch from beginning to end and we felt pampered and luxurious. From what I can tell by reading previous reviews it must be that some of the rooms have not been renovated yet. Perhaps when booking you have to be very careful to ask for a renovated one. If enough people do that will it put pressure on mgmt to cough up the $$ to finally renovate all of them? I feel badly for the people who got bad rooms when they were expecting luxury. I also feel a bit badly that the Huntington is being labeled a ripoff and horrid when our experience was the polar opposite of that. Anyway...Our room was on the 11th floor, had a huge flat screen TV on the wall, brand new carpet, bath fixtures, beautiful mirrors everywhere. It was a nice large room (although it was the cheapest available) and there was enough room for a conversation area which were two comfy overstuffed chairs and table. I sat in one of the chairs a long time and watched the fog roll in over the city. The view was excellent, over the city and toward Twin Peaks.You will really be missing out if you stay here and do not book a treatment in the spa. We had massages and pedicures. The sun deck overlooking the city, the infinity pool, the jacuzzi- all great. Again the service was great and they anticipated our needs from the beginning. I will definitely stay here again.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Etha Graham","date":"2013-11-13 15:46:38 +0300"},{"content":"great location and good service After a bad night at the Laurel Inn we decided to check in to a large hotel. The Huntington staff were great. Bell services showed us three rooms to choose from and we checked in.Room was spacious and bathroom was quite large, but not very stylish. Bed was comfortable and the windows kept the quiet out.Location is great, right on the cable car line.Full service staff, including Doorman, Bellman, Conceirge, Curtosy Driver and Reception. All were very nice, especially the concerige and curtosy driver ( those two women know their town )The bar downstairs is very nice, dark wood and hushed conversations with a baby grand for atmosphere. The pianist was there nightly.The only thing that let it down for me was the room service. They had no vegetarian options and weren't accomodating ( but wholefoods is just down the street )","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Lorenzo Bode","date":"2015-02-23 12:11:41 +0300"}],"public_likes":["Krystina Lemke","Frieda Beer"],"vacancy":true,"description":"Not the Ritz but a cheap budget hotel option","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}