{"title":"Cromford","name":"Greyhound Hotel Cromford","address":"Market Place","directions":null,"phone":"+44 1629 822551","tollfree":null,"email":null,"fax":null,"url":"http://www.greyhoundhotelcromford.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.108608,"lon":-1.560513,"accuracy":"ROOFTOP"},"type":"hotel","id":7008,"country":"United Kingdom","city":"Cromford","state":null,"reviews":[{"content":"I have stayed at Harrah's seven out of my last eight trips to Vegas. I will continue to stay there. Their service is unmatched! We always get a great room, good food, and lots of fun! Some say the casino is loud and smoky, it's a CASINO!","ratings":{"Overall":4.0},"author":"Janae Kutch","date":"2013-02-13 00:19:50 +0300"},{"content":"This was our 4th visit to Las Vegas and we have stayed in the Stratosphere every time, we really like it here. The 'select' rooms are wonderful, really comfortable, spotlessly clean and at under $40 a night Including resort fee, is well worth the money. Cassandra Blackwell who is a hotel supervisor is wonderful. I have contacted her numerous times with questions and she always writes back to you quick, thanks for all your help Cassandra! Also at check in we were dealt with by Lisbertha, what a really nice person, thank you! We ate in Roxys and at the buffet in the hotel, really enjoyed both as usual !! Location is not an issue for us, after an evening down the really busy strip, people everywhere and getting pestered by people trying to force these cards in your hand we find it so relaxing to get out of that environment back to a nice relaxing atmosphere and comfortable hotel. Cant wait to visit again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dan Stiedemann","date":"2015-12-04 08:54:57 +0300"},{"content":"The Stratosphere is basic as far as Vegas hotels go, that being said it frees up more money to play! The pool is nice and the view from the tower at night is awesome. I would recommend this hotel for people who want minimal frills with their hotel and are coming to Vegas to have a great time not pamper themselves. The pool bar makes a yummy strawberry cucumber mojito that I'll be craving all summer long.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Location":3.0,"Rooms":3.0},"author":"Nathanial Braun","date":"2013-01-04 00:29:21 +0300"},{"content":"We only stayed here for a few nights, the service was pretty average and getting to our room wasn't explained to us very well. The rooms are actually in the building beside it not the actual tower. The rooms where very basic and old, it appeared as some rooms had been renovated but not the one we got. The pool is a small size compared to the amount of rooms, the tower entry came free with the room. OK if your on a budget and get a really good price","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Jaqueline Block","date":"2014-07-31 05:30:35 +0300"},{"content":"i stayed at the stratosphere April 2011 with mum in the new select rooms and they were amazing and im not just saying that coz of the cheap price we got it at. The rooms were beautiful, clean and spacious. The beds were comfy and the bathrooms were nice and clean as well. The distance from the main part of the strip is not that bad at all and we walked it nearly everyday and night and did not feel uncomfortable one bit. The deuce bus stop is right by the side of the building so again no problems with transport.. We had pre paid our trip through Expedia so we didn't have to worry about hidden charges like other people are complaining about.. Only disappointment was no free WiFi in the room however i didn't have a problem walking down the road to McDonald's and using their free WiFi.. All in all i had a great hotel experience and would definitely stay in the select rooms again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Jaylan Rath","date":"2014-02-21 17:43:59 +0300"},{"content":"Got a great price and got a good room. But the third bed didn't really fit in it which was a pity. I'm a bit cynical about the whole Vegas thing and this was just a one-night stop on our tour of the West. I'm afraid I left still cynical. But the hotel is ok, has good facilities, cheap rooms, free parking, free entry to the tower. Really can't complain too much. Tower was the best thing about Vegas in my view so well worth sitting up there with a drink. Location not perfect but it's not difficult to get to the main strip. Had to queue for check-in and check-out which I found very frustrating. Only place on our tour that didn't do free wi-fi.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Sadye Kutch","date":"2014-03-15 09:52:53 +0300"},{"content":"Stayed at the Stratosphere August 2010 as part of a 26 strong group attending a family wedding. Rooms OK, but if you want a view I suggest you upgrade. Had problems with security staff, just stop for a brief conversation with kids in tow and theyr'e down on you like a ton o' bricks to keep moving if your in the Casino area. We were told before booking this was a family orientated hotel - BULL!! Ther are far better hotels in Vegas for what you pay at this excuse for an Hotel.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":2.0},"author":"Fae Hettinger","date":"2014-05-27 04:22:10 +0300"}],"public_likes":["Breanne Tromp DVM","Roger Harber"],"vacancy":false,"description":"Built in 1778 by Sir Richard Arkwright.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}