{"title":"Gumfreston","name":"St Lawrence Country Guest House","address":"Gumfreston","directions":null,"phone":"+44 1834 849727","tollfree":null,"email":null,"fax":null,"url":"http://www.stlawrencecountryguesthouse.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.67915,"lon":-4.72794,"accuracy":"ROOFTOP"},"type":"hotel","id":38525,"country":"United Kingdom","city":"Pembrokeshire","state":null,"reviews":[{"content":"We went there to celebrate my husbands 50th birthday day and couldn't have picked a better resort. Read alot of reviews on this hotel and we did not have any complaints. Beach, food, service and room were all wonderful. I can't see how anyone can complain about this resort. This was one of our best vacations. Thanks to Sue and Steve for going with us.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Hortense Stehr","date":"2014-04-26 22:54:30 +0300"},{"content":"I never usually write reviews, but I felt compelled, as we relied on so many before we booked. We had the absolute best time at Secrets Maroma! To give you some background on where our point of view comes from, my husband and I are in our mid-30's, and we were there celebrating our 11 year anniversary. We are pretty well-traveled when it comes to the Caribbean. This was my fourth trip to Mexico, and my husband’s first trip to the Mayan Riviera. We stayed from 10/1-4. As for all-inclusives we have stayed at 3 different Sandals resorts, and have had really negative experiences at 2 of the 3. However, we cannot travel as much as we'd like to, so all-inclusives are an easy way to alleviate the extra planning as far as dining and activities are concerned. This time, we decided on Mexico, and booked Secrets due to the positive reviews. We are so glad we did. And I will never give Sandals another single cent of my money now that I see how much more superior Secrets is. They ought to be ashamed of themselves, charging 2-3 times as much for such substandard accommodations and below-par service….yet, I digress. I won't break down every aspect of the resort, as this has been done. However, I would like to address some of the negative comments. First, this resort is designed in a specific Mexican style. As such it has interesting fountains and waterways, and a very clean design aesthetic. Everything has been laid out to promote the feeling of tranquility and a spa-like atmosphere. We loved this about Secrets. We aren't the type to live in the pool, as the reason we go to a beach resort is to enjoy the beach, but we were happy with the set-up of the pool areas. As for the complaints about lack of lush vegetation, again-I feel that the people complaining just don't understand the design. There was absolutely nothing brown while we were there. Quite the contrary, everything was very green and there were flowers everywhere. Short of staying in a tropical rainforest, I am not sure what these people are looking for as far as landscaping is concerned. We have been to beaches in 10-plus different Caribbean islands and I will say that this is one of the most beautiful beaches we have ever seen. The water is very clear and you can see your feet on the bottom. I suppose it gets cloudy from time to time--when a WAVE crashes the beautiful, soft SAND onto the shoreline. If that's a problem, then I am afraid there may be no pleasing you. The seaweed is minimal (and is raked away), there are pretty angel fish everywhere, and it is simply gorgeous. It was hard to stay out of the ocean. We always got a palapa in a spot we liked, the service on the beach (and everywhere else) was amazing, and we could not have been happier. There was never a crowded feel. The ashtrays are there to keep smokers from putting their butts out on the beach. As a non-smoker, I appreciated this tremendously. Basically, I know that not everyone can be pleased all of the time. There were a couple of areas that we felt could have been a little better (food variety at dinner, mainly), but I cannot say we were ever complaining. The good exponentially outweighed the less than good, and you can be sure you will have a wonderful time at this resort. Look at it this way, if the main complaints are mosquitoes (which is out of anyone's control--try Jamaica or St. Lucia if you think Mexico is bad), not enough trees, and beach ashtrays, then you really don’t have problems. Book with confidence and enjoy.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Aletha Pfannerstill","date":"2012-09-02 20:13:35 +0300"},{"content":"This resort is Wonderful. I'm still unclear why one would complain about the grounds not being tropical enough or the food being below average. We ate far better than we expected, and the place is beautifuI. I mean, come on, this place was incrediable! I won't even try to describe the breathtaking ocean view because you just can not unerstand it until you've seen for yourself. The colors of the water and sky look more like a painting. I didn't think anything could really be That Picture Perfect. My husband, better known around the pool's swim-up bar as \"Tuscaloosa\" (Johnny) and our buddies Kandy and her husband \"Alabama\" (Richard) were pampered and spoiled from the time we were picked up from the airport until we were,sadly enough, delivered back there almost a week later. We had swim-out rooms that were fantastic! Really, I would have protested had they tried to upgrade us to anything else. Yes, the A/C are below par. We spent Very Little time in our room and we're always greated with little suprises when we returned...Roses, drawn bubble baths, turn down services. (and we were not even honeymooners or anything) Please, don't be one of those Non Tippers! REALLY, These people work way too hard for you to use the excuse that it's not required. Besides, You'll be surprised at the extra attention to detail you receive when you repect the people who are working so hard to please you. The spa is a must. My husband went kicking and screaming but now is checking for local spas around our home town so we can enjoy little weenend \"pick me ups\" Ha! The swim-up bar was a blast. The event staff was great at getting a willing, and usually tipsy gang to join in on the activities. I can't say enough about the pool volleyball. Although my back picked the worst weenend EVER to go out, I laughed more in two days just watching and listening to all the funny \"smack\" talk from the guest AND event staff. If you see Fernando at pool bar, ask him to introduce you to Don Julio. We give them (Don and Fernando) honerable mentions every time we talk of our vacation !!! Please remember to take a bottle of fresh water and a little extra bite of meat and share with the stray dog at the beach. She sometimes plays in the ocean after she's been fed. Look for the man on horseback a bit south down the beach. For tips, He does a few tricks on horseback and will let you take pictures of them or he will take pixs of you on the horse..Pretty cool for photo opp. Please tell Fernando that Diane and Tuscalosoa said hello. And relax, you're gonna love it here!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Candice Koelpin","date":"2014-03-26 13:54:01 +0300"}],"public_likes":["Isidro Heathcote","Serena Harris","Lucinda Carter","Ms. Stacey Auer","Rosalinda Homenick","Raven Koelpin MD","Esperanza Tillman III","Jerad Carroll","Gus Hansen"],"vacancy":true,"description":"A small country guest house providing bed and breakfast with stunning views across the countryside to the sea and Caldey Island. Close to the [[Pembrokeshire Coast National Park]] and a good base for walking, sightseeing and cycling and for those brave enough to tackle [http://eu.ironman.com/triathlon/events/emea/ironman/wales.aspx#axzz2qprvonAU ''Ironman Wales'']  Gumfreston is just 10 minutes from the starting line.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}