{"title":"London/Hammersmith and Fulham","name":"Adria Hotel","address":"44 Glenthorne Rd, W6 0LS","directions":"tube: Hammersmith","phone":"+44 20 8742-6674","tollfree":null,"email":null,"fax":null,"url":"http://www.adria-hotel.co.uk/","checkin":null,"checkout":null,"price":"£69","geo":{"lat":51.4946,"lon":-0.2286,"accuracy":"ROOFTOP"},"type":"hotel","id":16168,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Great Vacation! My family and I got back from the RIU Bambu in the DR about 2 weeks ago (7-18 Aug in the DR and Bambu) and just now getting the time to write this review. I have been in the Army now for over 20 years and have been stationed all over the US and Germany. I have even done a couple of tours in Iraq. I mention this only give a frame of reference of where I am coming from. I have no idea about the people who did not have a great vacation. My family and I completely loved every minute of it. I did a pretty good job of looking at all the reviews before we booked the trip and for every 10 reviews there was about 1 negative one. After we booked the trip I started seeing several more bad reviews. This had me a bit worried. But I figured it must have been some very picky people. I saw the reviews about the rock hard beds and flat pillows. I had no problems with the bed or the pillows. They were fine. The room was a bit small but then again we were not in the room very much anyway.  I would like to talk about the good things at the Bambu and then I only have one comment for them to improve on. First the good things: The in room mini bar!! The mini bar in the room was great. I perfect touch when sitting on the balcony relaxing or waiting your turn for the shower. They come and refill the mini bar daily so you are never without your favorite drink. Next was the weather. Just incredible! Temps in the upper 80鈥檚 to mid 90鈥檚 the entire time. Just wonderful. The beach was one of the best I have ever seen. We have been to Hawaii, Spain, Cancun, Portugal, Tunisia and a few other all inclusive places. All seem to have there own charm but I can honestly say, that the beach was awesome at the Bambu. The ocean was just as nice. The pretty blue colors of the ocean were amazing to look at. The pure white sand was also just amazing. I really cannot think of anything negative about it.  Next I want to talk about the hotel staff. Again an area that I was a bit worried about. I read some reviews that said if you did not speak Spanish you were not waited on or not helped. Not true at all. I would say about 90% of the Hotel staff spoke English. In fact about 90% of the staff spoke 3-4 languages fluently. The staff was very friendly and always went out of their way to make you happy. They do work very hard and have long hours but I never saw any one of them complain. The staff also had some very nice shows in the evenings and there was always putting on things to do during the day. I thought the staff was very professional and you could tell they loved their job.  The hotel had several day trips for you to book. We decided to do two of them. Both were great and we had an awesome time. The Sanoma Island trip and the Party boat were both well worth it. I highly recommend either one. The food at the Bambu was perfect. Some reviews talked about the same thing being served over and over again. That was true to a point. Most nights there were things that they had the night before, but they also had many other items to chose from. Most nights there was a theme night. For example a Spanish night where there were lots of tacos, ect鈥?Even the nights were they had the same thing as the previous night, it was not bad at all. There was so much to choose from you did not have the same thing each night if you did not want to.  Ok now for the only area I was not happy with. The cleanliness of the pool was not the best. I thought for a nice hotel it was pretty bad actually. It did not stop me from swimming in the pool daily, but it really needed to be cleaned out. I think if they hire a 鈥減ool cleaner person鈥?who walked around 3-4 times a day to get the stuff that fell into the pool out it would have been much nicer. The pool itself was nice and again I was in it daily but at times it needed someone to get the floating stuff out. The pool bar however was great. The pool bar staff worked hard but always had a big smile on their face and every time I swam up to get a drink they would immediately have one for me. I liked the way they remembered what I was drinking and what my 10 year old daughter was drinking. I gave a few tips (dollars here and there) but I think they would have been just as nice even if I did not.  The last thing I want to bring up was how friendly the other guests staying there were. On my first day we meet a wonderful family from England (Gary, Linn Jess and Katie). It turned out that he had a daughter Jessica who was one year older than my daughter and Katie who was one year younger. They turned out to be good friends and played together as much as they could. It was great meeting them and we are still emailing back and forth. Hope to run into them again in a few years! Ok I think I have rambled on enough. After discussing it over with my wife, we had no trouble deciding this was one of the best vacations we have even been on. We plan on going back in the near future. I would highly recommend it to anyone looking for a great time","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Mercedes Conn","date":"2014-03-29 04:08:05 +0300"},{"content":"Amazing beach! We just returned from a week at the RIU Bambu. I had read the negative reviews, but was optimistic anyways. The hotel is not bad, but is certainly not a 5 star. The lobby is beautiful, but the rooms are small, standard, and in need of renovating (hole in the tub). Very clean and great water pressure though. Mini bar with pop and beer, but the only water was in a gallon jug, no indivual bottles, which was disappointing. The air conditioning worked poorly, and a main factor in my disappointment was your room is the ONLY place in the hotel with air conditioning. Be prepared to be hot and sticky at dinner; less than enjoyable. Didn't even want the have a coctail at the bar after dinner or watch the entertainment since it was so hot and uncomfortable. Pool area crowded and could be cleaner, water way too warm. Beach area fantastic!! Plenty of chairs and your choice of sun or shade. Entertainment throughout the day is fun, your choice to join in or not. Service not the best. We brought plenty of money for tipping, but rarely received the service to give a tip. Drinks are great! Overall, ok hotel for the money, would rate a 3, not a 5.","ratings":{"Service":3.0,"Business service":2.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Daniella Casper","date":"2013-10-28 18:18:46 +0300"}],"public_likes":["Otilia Wiegand","Marjory Rempel","Adelia Kshlerin IV","Doyle Weimann","Nigel Hamill","Macie Wilkinson","Kaia Smitham","Elwin D'Amore","Solon Gleichner"],"vacancy":true,"description":"A four generation family run hotel with excellent transport connections and good value for money. Regularly refurbished.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}