{"title":"San Diego/Downtown","name":"The Keating Hotel","address":"432 F Street","directions":null,"phone":"+1 619 814-5700","tollfree":null,"email":null,"fax":null,"url":"http://www.thekeating.com/main.asp","checkin":"2PM","checkout":null,"price":"Rates start at around $200 for a Stanza, up to around $1200+ for a luxury suite","geo":{"lat":32.71376,"lon":-117.16043,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25165,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"My husband and I stayed here for 2 nights in July. Great value, incredibly helpful staff, delicious breakfast and breathtaking Bosphorus and Blue Mosque view! Thank you Ahmad very much for your help in production our fotokast! You are a great manager and a wonderful man! Your smile, friendliness and cheerful way of being remembered today. I recommend to all without exception! Pics and sound on our web site","ratings":{"Overall":5.0},"author":"Cole Lockman PhD","date":"2014-11-06 19:04:15 +0300"},{"content":"We were there in late October but I have to write a review. This was our second trip to Istanbul (May 2010 was the first) but it was the first for our friend from Australia. We all agree we would go back. The location is excellent. Easy walking to the Blue Mosque, Hagia Sophia and the tram. The airport pickup was wonderful -- better than on our first visit when we stayed in a more up market place for twice the price. I don't know if it's the norm for the pickup but we had onboard video in our car and it was a good introduction to this fascinating city. The rooms are a little on the small side but to be expected in a converted traditional building. A room with 2 singles seemed to have a bit more room than the double room. Rooms facing the street are a little noisy but what would you expect in a city? And the noise does die down around midnight. The staff are very friendly, helpful and courteous. Nothing was too much trouble. We ate twice at their family owned restaurant around the corner, again, courteous, and friendly service, and good food. We received the discount without being asked - how did they know we were staying around the corner? There are other restaurants in easy walking distance which we found helpful after a day full of sight seeing. Breakfasts were enjoyable and there was always enough to choose from. Maybe not enough seating in the cooler months when everyone wants to sit inside at more or less the same time, but it was manageable, I suppose this wouldn't be a problem in the warmer months. We would definately stay here again if we are lucky enough to visit Istanbul again, it is an amazingly beautiful and diverse and friendly city.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Aiden Bednar","date":"2014-09-12 07:26:48 +0300"},{"content":"The hotel is conveniently located, the staff helpful, and the rates affordable ($50 / night for 1), however - however, the bed was uncomfortable, they changed which room I was in (and moved all my stuff) during the day while I was out sight-seeing, and the view from the roof was a bit disappointing (you do have a partial blue mosque view, but not in the area where you would likely sit). It was 'fine' - no big issues, but I just think there might be probably better options in the same price range. I waited until the last minute to book, so I was just happy to find something acceptable. It is convenient to historic sights, but can also be noisy. However, when I shut the window and used the A/C it wasn't too loud for me.","ratings":{"Overall":3.0},"author":"Adolf Parisian","date":"2014-12-12 08:42:43 +0300"},{"content":"I recently spent two weeks in Istanbul, and stayed at Ocean's 7. Clean rooms, friendly and helpful staff, quiet street (at least in the off season - not sure what it's like in the summer), made it all a great stay. The hotel also owns/runs a restaurant around the corner which offers a 15% discount for hotel guests. Breakfast on the rooftop cafe is a treat!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Earl Parisian","date":"2012-12-12 11:22:53 +0300"},{"content":"It's a pleasure to suggest you this pretty hotel located in the heart of Sultanhamet. Let's me explain the reasons for we liked it so much! 1) That who made Ocean's 7 unique are its employees; they're all young, brilliant, very friendly and super helpful (truely they're there for you and don't worry: if you have any problem or you're in searching of any advice or instruction about what to do and how to organize your journey through Instanbul and Turkey, ask Sharan...it's a master!). 2) You will be sorrounded by the most important and beautiful architectonic and urbanistic beauties of Istanbul (really just a few steps from Aya Sofia, Blue Mosquee, Eminonu and Grand Bazaar...). 3) The Hotel it's cool, well furnished, with nice and comfortable rooms (we stayed here two times in two different rooms...). One impotrant thing is that we noticed with supreme pleasure that the rooms and the common spaces are extremely clean. 4) And last but not least: please, enjoy your breakfast on the terrace admiring the Bosforo and the Blue Mosquee...and naturally eating some Turkysh tastes... That's all... Greetings from Angelo e Orianna (Italy)! Bye...","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jaycee Batz","date":"2014-04-20 17:19:42 +0300"},{"content":"I, my wife and two boys (10, 11) stayed at Oceans 7 hotel in Istanbul for 3 nights, May 9, 10 and 11, 2009. I did not know anything about Istanbul and I booked this hotel purely on the basis of the reviews I saw on the Internet. This turned out to be the perfect hotel for us. Having traveled all over the world, I am not much for glitzy, high-end hotels that have impersonal service. Oceans 7 felt like home. We were welcomed by Ahmet and Sharan each time we stepped into the hotel. Ahmet and Sharan acted like friends rather than hotel staff. The hotel was spotlessly clean and the staff very friendly. The location is perfect! While we saw loads of tourist buses unload visitors at Blue Mosque or Aya Sophia, we used to walk 3 mins from our hotel to these locations. The trams are close by. There is really no need to book a guided tour or a walking tour. With Oceans7, you are already where all the tourist attractions are! I would highly recommend Oceans7 to anyone going to Istanbul as a tourist. Oceans7 will make you feel welcome in Istanbul.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Ciara Nolan","date":"2015-10-29 16:38:57 +0300"},{"content":"I liked it very much in the Hotel Oceans 7. The People/Staff are very nice and helpful , the rooms are clean and from our hotel room we had a great view to the blue mosque (so the hotel has got a very good position.. near the blue mosque and the hagia sophia..) :)) Thanks for everything, Sophia.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Wendy Heller","date":"2013-12-27 06:40:27 +0300"},{"content":"The people working at the reception are pretentious. They think they are above their own guests. Even after informing them of an issue they say they will take care of it. But it never is. They make promises they cannot keep. When I asked at check-in if it was possible to have a room with a view of the sea I was told the hotel was fully booked. I then asked another receptionist and they said the hotel had rooms available. When I arrived in my room and went to the mini bar for some water. I found that the previous guests had opened and left the 2 bottles half empty. In any hotel, the mini bar should be re-stocked and changed immediately when the room is prepared for the next guest. The hallways seem to have a musty or mold smell to them despite this being a relatively new hotel. The conference rooms are located in the dark floors of -1. They have mold issues down there as one person who has a mold allergy had to be taken to hospital. The food in the restaurant is nothing near 5 star. The food is closer to 2 star. Even I could cook better than their main chef. The only thing that is 5 star in the restaurant are the prices. The staff in the restaurant are very nice. The hotel itself is 5KMs outside of the centre of Barcelona. If you are looking for a real 5 star hotel consider the W. It is right on the waterfront. The ME is about 7 blocks away or a 20 minute walk to the beach.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":1.0},"author":"Elta Keebler","date":"2014-10-29 23:00:34 +0300"},{"content":"The hotel was excellent - rooms were comfortable with spectacular views, the ground-floor restaurant was also good (I recommend the lamb shank) and eating amidst enormous coloured glass panels was quite an experience. Staff were always attentive, especially in helping to contact embassy etc when we were pickpocketed and lost a passport and €500 before even getting to the hotel. My companion had to spend a day flying to his consulate in Madrid and back to get an emergency passport. Subsequent web research showed such crime to be a serious problem in this town. Verdict: great hotel but avoid Barcelona until the police has acknowledged and acted on the crime problem.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Jazmyn Kautzer","date":"2014-02-12 08:56:13 +0300"}],"public_likes":["Karl Pfeffer","Katlyn Yost","Leone Parisian","Tiana Daniel","Rosa White Jr.","Deshaun Anderson","Hector Streich","Ted Bogisich PhD"],"vacancy":false,"description":"A modern luxury hotel with an on site bar, spa services, and Italian designed rooms.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}