{"title":"Chamonix","name":"Chalets Marmotte Mountain Adventure","address":"31 chemin des Rambles, Argentiere","directions":null,"phone":"+33682891523","tollfree":null,"email":null,"fax":null,"url":"http://www.marmottemountain.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":45.98383,"lon":6.93428,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5336,"country":"France","city":"Chamonix-Mont-Blanc","state":"Rhône-Alpes","reviews":[{"content":"First timers to Vegas, wonderful hotel, decor inside is very modern and very red but really funky! We stayed in a Panoramic King Suite which was on the 61st floor - fabulous views out to old Las Vegas. Room had all the conveniences you could wish for and a really comfortable bed with pillows to die for - we did learn you could buy the matress and take it home for only 2000 USD! Bargain. Lovely hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Ollie Harvey","date":"2012-04-22 20:25:57 +0300"},{"content":"I found the experience to be quite refreshing. I travel once or twice a year to Las Vegas and have stayed in a variety of places. I can quite canidly say that this was hands down the best experiecnce that I have had. Everyone made an effort to make us feel welcome. I never felt rushed, or intruded upon and in fact was quite comfortable and relaxed. La Reve was the most amazing show that I have seen and the most important part was that my wife was thrilled with the experience of the food, show, and hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Efren Connelly","date":"2014-08-10 12:58:31 +0300"},{"content":"The Encore is a gorgeous hotel. Although on the boundaries towards no \"mans land\" and the deserted end of the strip its still in a good position and close to the other hotels and fashion show mall. We had a strip view on the 51st floor and views were pretty awesome! The suites are large, airy and tastefully decorated, the bed far too comfy and the bathroom had huge shower room, bath, 2 sinks and still big enough to hold a small party in! The 2 pools that we found were beautiful and got a lot of sun throughout the day. Free pool towel rental and comfy beds awaited. The pool also opened at 9am so you didnt get greedy sunbathers saving the \"good beds\" before sunrise! Also drink service was frequent plus free pots of grapes not necessary but such a lovely touch. The hotel itself was grande and beautiful inside it had a large open casino floor with assortment of games and croupiers very friendly. The restuarants we visited were all very wonderful in their own right and sadly due to so much choice we did not get time to eat in all those we wanted. Shops were very high end fashion Prada, Gucci, Oscar de la renta, Tiffany etc but nice to have there if you win have a big win! I love Vegas, have been many times before and I would put Encore up there with my favorite of hotels to stay in. Encore is a good name. Steve Wynn has done well","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Octavia Hudson","date":"2012-03-29 01:46:09 +0300"},{"content":"Steve Wynn didn't cut any corners on this hotel. The rooms a re the best I've seen on the strip so far. The amenities include a nice TV in the nice spacious bathroom, large lounging area & bedroom that includes electronic shutting of the drapes & light. The hotel's decor is a red and butterfly with almost smokeless casinos. I can't wait to visit again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Beau Renner","date":"2013-06-26 15:41:05 +0300"},{"content":"Stayed here on honeymoon in June 2011 and, despite United Airlines doing their best to ruin our stay by cancelling our flight and costing us a day and a night in Vegas (never again), the pure opulence and wonderful staff made our stay an amazing experience. We stayed in a tower suite (got it on tripadvisor - rates for about $325/night AUD) and it was beautiful, complete with strip and pool view and electronic everything. From the tv to the blinds it is all remote controlled, you almost don't want to leave the room! We did however and found the shopping (although a little pricy, but hey it is a top line Vegas Casino after all), the grounds/pools and the restaurants were all unbelievable. The only slight downside I will say is that the casino is mainly for big players it seems (high table minimums) and lacks a little atmosphere, but I must say we are not big gamblers and were happy to stay on the slots, where we were always looked after with a constant supply of drinks (much better service than other casinos in Vegas I have experienced). The major bonus of staying in the hotel we found however was VIP entry into all of the Wynns night and day spots, the Sunday pool party is a must and the highlight of our stay. Overall I would have no problem recommending this hotel to anyone, but I would caution it is not for those on a budget.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sienna Berge","date":"2014-11-25 04:18:46 +0300"},{"content":"I was so surprised when I walked into Encore that it didn't smell like smoke like every hotel on the strip! I have asthma so it was great not having to choke every time I go through the door. The hotel is absolutely beautiful. It's not a themed hotel but the decorations are exquisite, love the red & butterflies! Our room is extremely comfortable, very spacious and spotlessly clean. Great tolietry items as well. Pools were good, we can always find suntanning beds and the pools are not too crowded. They provide iced water nearby. We had a massage at the spa and it was ABSOLUTELY AMAZING. You've got to splurge because it's the best massage I've ever had. We ended up being at the spa all afternoon because we couldn't bear to leave. Only a couple of downsides: Location is far from everything else as it's at the end of the strip. Also service is not very personal. I was there with a few friends to celebrate us turning 30 this year, I had emailed Encore in advance to see if they would make our special trip more special (usually hotels offer upgrades etc) but they never responded nor did they do anything special. My friends who stayed at Mandarin Oriental at the same trip was treated with birthday cake, fruits and personal cards. Not huge problem though as we thoroughly enjoyed our stay. Highly recommend it if you don't mind a longer walk.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Nicklaus Nitzsche","date":"2014-07-22 07:39:17 +0300"},{"content":"It is hard for me to say better than expected because the caliber of the property is such that you expect it to be what it is. Walking into Encore is a pleasure. The feeling of luxury is everywhere, the fresh flowers, the welcoming staff, and the total ambience. The rooms are extremely comfortable. Everything you could want. Bought the entire bedlinen set. Cannot say enough wonderful things about this property. Everywhere I went I was wished Happy Birthday.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Keeley Heidenreich","date":"2015-07-04 00:10:05 +0300"}],"public_likes":["Meaghan Greenholt","Mr. Gisselle Herman","Blaze Gibson","Nella Zboncak I","Joanny Larkin","Giovanni Kautzer","Matteo Cronin"],"vacancy":true,"description":"Luxury catered ski chalet accommodation in Argentiere.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}