{"title":"London/Hammersmith and Fulham","name":"K-West","address":"Richmond Way, W14 0AX","directions":"tube: Shepherd's Bush","phone":"+44 20 8743-3206","tollfree":null,"email":null,"fax":null,"url":"http://www.k-west.co.uk/","checkin":null,"checkout":null,"price":"From £150","geo":{"lat":51.5024,"lon":-0.2164,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16179,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Super holiday My Wife and I visited the Riu Bambu resort from 7th January - 14th January 2004. We are aged in our mid twenties and can say we had the most enjoyable amazing trip ever. So I thought I would write a full as review as possible. We flew from London Gatwick Airport with My Travel Airways, which was fine. The flight lasted approximately 9 hours going there and on return only 7 hours 30, due to the tail winds. On arrival at Punta Cana Airport the first thing we noticed was obviously the heat, it was around 4.30 ish yet it was still lovely and hot even at that time. A sort walk across the tarmac took us to the arrivals where as soon as you enter you are photographed with a pretty Dominican lady. Being tired, we both thought that this was a security photo yet when going back to UK in departures all photos were posted up giving you the opportunity to buy one. Needless to say after long flights, most people looked pretty rough! Once through the photo all passengers are required to fill out a tourist card to hand in at immigration where they tear off the top strip. We purchased one before we flew out form the Consulate office in Liverpool and filled it out at home which we are pleased we did as the people who bought one on arrival had a bit of a queue to buy one and then had to fill it out there. Just made our life a little easier that s all. After immigration we thought we were done and heading for the coach yet forgot about baggage and I was one of the unlucky ones who had their bags searched. This was probably the least enjoyable part of the trip as they were rather heavy handed when doing this and I don t even think they were being that thorough when searching anyway. Anyway after this you walk outside where there are porters trying to take your bags to the various coaches as I didn t know what coach to go on my main concern wasn t a porter but finding our tour rep, Thomas Cook, who were all lined up waiting to tick your names. When we got to our coach we were slightly peeved that one chap asked for a tip for taking our bags literally 5 metres. I love tipping but that seemed to take the $@!#% a bit. When on the coach the holiday really started. The driver switched on the music and suddenly the soundtrack to holiday had started! The journey to Riu Bambu for us lasted about 1 hour, as there were other hotels to stop off at first. Can definitely say that Riu Bambu looked the best by far. Arriving at the Bambu was painless and the check in reception staff were instantly friendly and helpful, a trait that was reflected through every member of staff we met during the trip. A porter takes your luggage and you then find your room. One bit of advice here. We were in a room the furthest from the reception, which wasn t a problem and only a couple of minutes walk, yet couldn t find it the first time and in the dark, as it got dark at 6.30, we got lost! Therefore it s a good idea to look at the map they give you first to work out the numbering of rooms go. The room itself was wonderful and completely to our taste and convenience. It was well air conditioned and also had a ceiling fan. The safe was good, yet I couldn t work out how to operate it at first, as the key was tricky to put in yet when you get the knack it s easy. There is a minibar full of beer, sprite, coke tonic water, and four optic dispensers of Rum, Gin, Whisky and Brandy and bottle opener and it was all free hooray! You are also given a very large bottle of water, sealed, that is safe to drink and replaced every two days. We could have done with maybe slightly more but this didn t really affect us that much and I imagine if we had asked the reception they would have kindly obliged. The shower and bath were both easy to use and the bathroom itself was clean and tidy but the light in there didn t do your tan justice as it was quite bright! We found the beds quite hard but didn t care about this at all as we got so tired that we could have slept on anything. The balcony was also nice with chairs and table and also a rack for wet clothing very handy. Bring a hairdryer; there isn t one and also the correct adaptor (USA). The TV in the room worked well and most channels were either American or Spanish. Now comes my big word of advice for parents with children at the resort. In the morning on what was our channel 23, at even 7.30/8 am we switched on to find hard-core porn playing freely much to our surprise. This didn t bother us but I would definitely have had concerns if we had kids with us and they saw this. This didn t seem to be there all the time, only in the morning before breakfast and I imagine through the night and maybe it is me being a prudish Brit as we don t get this, but I found this so surprising. We loved the food and didn t become ill at all. Breakfast was lovely. There is a huge selection of fruit, mostly tropical, fully cooked selection of fried food, pancakes, doughnuts, rolls, unlimited fruit juices, cereals, toast etc. Really very very nice. Lunch food was probably my favourite time. Again there is a huge selection of food, fried, cooked meats, fish, vegetables, salad bar (didn t use this though as we had heard this was most likely to give you the Belly problems) all to choose from plus lovely puddings and more fruit. Evening meal again was wonderful, I had read reviews that there was not enough choice, I must have been at a different hotel. There seemed to be something for everyone and I am a really picky eater but enjoyed something new every night. The drinks in the restaurant were also good. Fruit juices, fizzy drinks flowed freely and you could help yourself to beer on tap and wine (rose, white and red) though I found the White and bit grim for my liking. The two main swimming pools were lovely and even though I had read that some people found them too small, we didn t notice this at all and there always seemed to be plenty of space for everyone. The Jacuzzi was a lot of fun and there always seemed to be a free bed. Many beds are in the shade and there are also many in the sun so you can take your pick. Sometimes the shade was needed as it got so hot and really easy to burn yourself. The Swim up bar, how I loved this! There are approximately 25 seats around it, and yes the afternoon got crowded but if you keep your eyes open you can usually find a space. Above the bar are the names and ingredients of cocktails stating either alcoholic or non-alcoholic and they were lovely. You could also have other drinks e.g. beer, vodka, coke etc if you fancied. The bar staff were excellent; we made really good friends with Javier who was the most fun bar staff man around. After a tip at the beginning of our holiday he really looked after us, even though he was also great before we tipped him. He even used to shout up to me when I wasn t at the bar to see if we wanted another drink. Ahhh, we miss Javier! The pools were warm and refreshing. The animation staff were so **** hard working. They were constantly from morning till late at night doing their work and doing it very well indeed. There were two girls who seemed to do most of the children s activities during the day, who we called girl A and Girl B (Girl B seemed newer) and the kids seemed to love them both and got involved in face painting, volleyball, football, dancing, etc etc. For the older kids amongst us and adults the animation staff were also great. Water Aerobics was fun for both sexes and they organised darts competitions, dancing, volleyball, etc I won a swimming competition which I was quite proud of! The only thing I would say is that sometimes you felt like you had to hide if you didn t want to do an activity as they were trying to get so many people involved. Yet a straightforward no seemed to do the trick. Before we knew there names we gave them nicknames: Shaggy (guess who he is), The Chunk, Kieron Dyer, Boy C, The Queen (again guess who he or she is!) and Ad Bandy and they were all fun. They seemed to work to soundtrack of music through the day and at times just came to the pool and did a dance. You could never get bored here, whatever age you are. One thing I would say is that if you want a completely quiet holiday this isn t for you as they do use music quite a bit round the pools. We loved it though and wish we had the music at home now to relax and dance to! The beach was stunning and the water crystal clear and warm and safe. There were also enough beds for everyone. We loved the beach so much it was perfect postcard material. One word of advice, it can get a bit breezy and you can forget how strong the sun is and thus burns easily happen if you are not careful, like me! The grounds of the Bambu were amazingly well kept and everywhere looks attractive. We were really impressed with the maintenance, if anything needed doing it was done. Look out for the lizards and tropical birds they are lovely to look at. The evening entertainment was quite cheesy but enjoyable nonetheless. It starts with the kids entertainment which was fun to watch and then comes the dancing with the animation staff if you want to followed by awards given to competition winners from the day, followed by a fun icebreaker and then a show, mixed in with more dancing from the animation staff and laughing at the Queen s outfits! Mix this with unlimited bars and popcorn for all and the cheese didn t bother us at all. With regards to money, from a British point of view, you need to take US dollars with you and you can either buy things in US dollars or get it changed to Peso s in the reception. We barely spent anything though and mainly used our money for tipping and $20 departure tax. We were really sad to leave the Bambu as you can probably tell from my ridiculously long essay but would love to go there again in an instant. I have read reviews of people stating that it shouldn t be 5 star but maybe 4. Well, it might be my age showing and lack of visits to 5 star hotels but this looked the best hotel we saw in the Dominican, as we looked around several others and from our point of view couldn t have been any better and THAT justifies why we give it 5 stars. Enjoy!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Jovany Harber","date":"2015-08-16 22:13:18 +0300"},{"content":"Okay but a lot of problems I really don't understand why so many people are enthusiastic about this hotel. The food isn't that great, the pool is small, the entertainment is boring, there is no palapas on the beach so you're moving your sun chairs all day long not to get a sunburn.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":3.0,"Rooms":4.0,"Location":-1.0},"author":"Loy Thiel","date":"2013-12-05 07:05:50 +0300"},{"content":"Had the time of our lives! We just returned last Wednesday, July 23rd from Riu Bambu in Punta Cana. While I knew before hand that it was not a 5 star hotel, I was told that it is the best Riu hotel in the Riu complex of 5 hotels. That was very true - in fact the guests from the Riu Palace (much more $$) spent more time at our resort than their own due to the fact there was more to do, more shows, etc. at our resort. We had the best time there and have already stayed at a 6 star in Mexico. The Riu does a wonderful job in ensuring your comfort and happiness the whole time you are there. While our room was the furthest from the main lobby, we were persistent and succeeded in moving to the FIRST villa by the lobby by the next morning. That was wonderful! The Scuba Caribe water team were wonderful and their prices were less than Apple Tours tour prices - by enough to cover an additional trip - the Sunset Cruise/snorkel trip. That was $25.00 per person and the best time we had the whole week!!!!!! We went deep sea fishing - also an awesome time - our boat caught a 40+ lb. yellow fin tuna - which was quite a prize for the team that ran the trip. The horseback riding was not recommended by my husband and other couple (I did not go). Their truck broke down in a bad area (ran out of gas!) and the driver had to leave the people (14 of them) alone to go get gas. Besides that, two horses were uncontrollable and my friends nearly got badly injured. The staff at the swim-up bar were fun and attentive - try the Coco Loco drink (inside a real coconut) - it tasted like chocolate milk! There is a wonderful whirlpool off one side of the pool that is the same temperature as the water so not too hot - and very relaxing. We found it inconvenient that we had to pick the same dinner time each night (and were assigned a table). Some days you were hungry earlier than others! If you are not comfortable bringing your children around topless bathers, beware -they are everywhere! It is not allowed in the pool area, but nobody listens.Tipping was not necessary - especially when trying to switch your room. We paid cash to get a better room and the clerk forgot. Make sure you speak to a manager and get their name (there are different managers day and night).The food was excellent - enough variety to keep us placated until we got home. There was pizza, hamburgers, hot dogs, french fries, seafood, pasta (lots of alfredo which was excellent). Each night they celebrated a different ethnic group with the food - caribbean night, Mexican night, etc.We stopped at the Riu Palace Casino - not big by any means, but nice and cool. Punta Cana was extremely HUMID - but we had beautiful blue skies and sun all 8 days we were there! The coolest place to go is the beach - day or night.The water is green and beautiful - navy blue out further in the sea. Gorgeous resort......The rooms were adequate - not 5 star, perhaps 3 or 4 - but we were seldom in them!Hope you have a great trip! I will return some day! Any questions, feel free to email me any time.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Rusty Hoeger","date":"2013-10-10 03:26:15 +0300"},{"content":"feels like paradise on earth I stayed with a friend at the Riu bambu hotel during the first weeks of may. We had a warm welcome which was accompanied by a welcoming drink. The rooms were excellent, mini bar was taken care of nearly every day, rooms very clean, nice staff, excellent food, beach clean, nice carribean atmosphere, shortly 100% to recommended !","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Bobby Gerlach","date":"2012-01-20 21:26:07 +0300"},{"content":"very nice resort,abit too much wind on the beach and no lobster       The liquior dispenser","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Chadd Gibson","date":"2013-05-10 22:39:08 +0300"},{"content":"De pena, un aestafa, 5 estrellas Jaaaaaa   showReview(20870438, 'full');","ratings":{"Service":3.0,"Business service":1.0,"Cleanliness":1.0,"Check in / front desk":3.0,"Overall":2.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Kaitlyn Mayert","date":"2013-06-15 03:02:30 +0300"},{"content":"unable to sleep The Dominican Republic has an amazing and diverse cultural heritage. It is independently thriving with its agricultural and industiral developments. I am unable to convince myself to return however, mostly due to my stay at this hotel in 2003. My son, who was 3 at the time, tripped over a very large rat one evening by the pool after participating in a children's program. The rat was large-probably around 5-8 pounds. Luckily my husband scooped him up as the rat was circling around with a broken leg and he avoided being bitten. There were rats playing around the pool area during the day causing guests to scream occasionally and raise their feet up to their chairs. There were large cockroaches in our room on the ground floor. The pillows smelled of mildew. After the rat episode on the third evening we requested to be moved to a new room on an upper floor. In the second room we did not see any cockroaches-this may have been due to sleeping with all the lights on due to my fear of the rats. The pillows in this room also smelled like mildew. In one restaurant for an evening meal my husband had to use the restroom. There were roaches crawling out of cracks in the walls. The food tasted great and we did not get sick. I just can't help but imagine the roaches and rats walking over the kitchen areas since they were out in public areas. I could not sleep and anticipated the end of our trip. We decided to get a Taxi and go into a small town to shop. A prostitute approached my husband while in a cafe with myself and our 3 year old. A man from a shop attempted to carry off my child in an attempt to get us to follow him to his store (this was not encouraging to get us to buy something). Finally we were riding the shuttle back to the airport and are pulled over by men with machine guns. Apparently we were attempting to return to the airport when government members were arriving for the latin american summit. We have stayed at other Riu properties in Latin America, and the Melao was an entirely different experience. I do realize that the climate is very nice for roaches and rats, but the hotel needs desperately to implement some form of pest control as well as dehumidification system in the rooms. I did not feel safe (especially for my child) for these health reasons as well as the political instability. My husband is a police officer and speaks Spanish fluently and usually we are comfortable traveling about and had looked forward to a trip to the Dominican Republic for quite some time. It is the most unforgetable trip we have ever been on.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":2.0,"Location":-1.0},"author":"Leopold Schumm","date":"2013-02-08 20:36:59 +0300"}],"public_likes":["Elfrieda Jacobs","Dr. Branson Hayes","April Bogan I","Bette Mayer Jr."],"vacancy":true,"description":"Modern, fashionable hotel with a day spa.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}