{"title":"London/South Bank","name":"London Bridge Hotel","address":"8–18 London Bridge St, SE1 9SG","directions":"tube: London Bridge","phone":"+44 20 7855-2200","tollfree":null,"email":"reservations@londonbridgehotel.com","fax":"+44 20 7855-2233","url":"http://www.londonbridgehotel.com/","checkin":"14:00","checkout":"noon","price":null,"geo":{"lat":51.5052,"lon":-0.0881,"accuracy":"APPROXIMATE"},"type":"hotel","id":16349,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"A Delight of a Vacation This pass summer my family and I had a wonderful time during our vacation. My girls enjoyed the shows, kids camp, and the food. We enjoyed the beaches and and the tours we took. We are planning another trip in sometime soon. The animaion crew was Excellent! They were very very friendly. The staf was great. If you are planning a trip ti Riu please do so.Enjoy your trip.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Alexandrea Crooks","date":"2014-03-22 00:39:16 +0300"},{"content":"Wonderful Trip I just got back from the Riu Taino two days ago and the person who wrote from Pittsburgh, PA who wrote on April 27th review was right on the money. Print that review out and take it with you if you plan on going.I went with my girlfriend and my parents and we had an absolutly wonderful time. The staff is amazing. They are so energetic and fun to be around. During the day they have all kinds of activities that include, aerobics on the beach, water polo, soccer on the beach, ping-pong tournament, dance lessons by the pool, water aerobics, etc. etc. etc.The food was very good for the most part. There were plenty of choices. The two a-la-carte restaurants were average. I found the food better at the buffet restaurant in the hotel.The beach is simply beautiful and there is incredible snorkling right off the beach where we saw many specicies of exotic fish and a octopus. There were a lot of Europeans and many women went topless.Yes. I did get sick. But that was because I accidently used the hotel water to brush my teeth and because I drank a lot of booze the entire trip. However, if you are careful, this can be avoided.My impression of the Riu Taino was that it was a younger more fun Riu out of the Riu hotels in Punta Cana. There were a lot of younger couples, and honeymooners. Also, it is very close to the beach. Whereas other Riu hotels were set back further from the beach. It is also next to Caribbean Street that has a bunch of stores and the Pachu Disco as well as the Casino that is part of the Riu Palace.Rooms. The rooms were nice and clean. Nothing fancy. I travel a lot for work and I thought the rooms were great.I would definately go back to Punta Cana and if you are doing your research, I would strongly recommend the Riu Taino.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Chase Hilpert","date":"2015-03-30 02:37:57 +0300"},{"content":"AMAZING- wanna go back STAFF~ they were all out going........if your in the ages between 14-19.....u will have sooo much fun with the staff..FOOD~ it wasn't that great but it was edible....there were always french fries to eat....HOTEL~ overall the hotel was very clean....the people were very nice.......NIGHTLIFE~ doesn't matter how old you are you can get into the disco.....the age is 18.....i'm 14 and i got in.....you just ahve to watch yourself because the guys come on a little too storg but you just push them away.....they will listen...i have no clue how people are saying they didn't have a fun time....because i stayed 2 weeks and started to cry leaving there...........i would recomend this hotel to EVERYONE........","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ollie Murazik","date":"2012-02-11 04:00:37 +0300"},{"content":"no encontre la constelaci贸n de las 5 estrellas   showReview(20102968, 'full');","ratings":{"Service":2.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":2.0,"Rooms":1.0,"Location":3.0},"author":"Katharina Halvorson","date":"2015-08-01 06:55:47 +0300"},{"content":"me encantoooooooo   showReview(10028060, 'full');","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Alfonzo Hermann III","date":"2012-04-17 21:36:05 +0300"},{"content":"I stayed here for two weeks and base my review on the aggregate visit and observations of both properties. First, know that there are two locations for Vantaggio Suites in San Diego: the State Street property, which is like a very run down and poorly managed combination of youth hostel and frat house, and the Broadway Street property, which is comprised of several individually-owned units thrown into the Vantaggio Suites rental pool. It seemed like a poor rendition of a time-share situation; however, there was no effective management or oversight to speak of and there would certainly not be any takers were this a \"real\" time share property. Pros: State Street property is right on the edge of Little Italy in downtown San Diego, directly across the street from Amici Park. There is easy I-5 freeway access, and plenty of Italian restaurants and shops easily within walking distance of less than a block. And with a short walk toward the San Diego bay, this place has got location, location, location (but no parking!). There are common areas like you would find in a frat house as well as a laundry room. It is a highly international clientele, with Japanese advertisements and postings all over the place. Broadway Avenue property is further east from San Diego, located on Broadway between 26th and 27th Streets past the East Village area. It's a fairly residential area but is quite unsafe in the evenings. There are bars on the windows and a gated entrance and gated garage (which is included in the room price). The area is very Hispanic, and there are a few Mexican restaurants within walking distance (but I'd recommend only do this during daylight hours). There's a fire station within a block, so expect to hear lots of sirens. Rooms come with balconies and kitchen facilities, complete with full-sized fridge, microwave, dishwasher, stove. There is unlimited wired internet access. There is a small TV, about the size of a 17\" computer flat screen. Cons: First let me say that I am jaded about this place and would absolutely NOT recommend it to anyone. This is due to the fact that I had two \"accidents\" on the property and sustained injuries and bruises, and I gave up trying to assign responsibility for the poor condition of not only the elevator but the emergency and stairwell access. The elevator broke, with me in it, and dropped a floor very quickly. I was thrown to the floor injuring my back and left side/hip/leg. To add insult to injury, neither the alarm nor the doors worked so I was trapped inside. Calls to the management office were futile and they declined knowledge or responsibility to the property, so I called 911. The firemen had me out in about 20 minutes; however, they could not find the stairs (because the stairs were unmarked, and they are also inaccessible from outside the stairwell meaning that you can get out but you can't get in). We had to walk completely around the block (on my injured hip and leg and back, no less) in order to get into the complex. Anyway, to make a horrible story shorter, Vantaggio Suites management and employees, NNJaescke Property Management and employees, and the owner of the actual unit all pointed to each other and the State of California for responsibility for the malfunctioning elevator and my injuries. By the end of my stay there, I felt like it was my own fault. Other cons for Vantaggio Suites at Broadway: - Filthy dirty. Old, ragged carpet that was not only frayed but was a trip hazard. - Old dirty curtains. When you pulled the fabric curtains opened, you held your breath that the curtain rod would not collapse, and you literally had to unstick your hand from the dirty fabric. - Damaged screens with holes. Place was so dirty that there were spider webs (inside!) and bugs flying in and out. With no air circulation, no fan, and no air conditioning, and weather in the 100 degree range, I had no choice but to leave the windows opened. - Murphy bed. It was down when I arrived, which was a good thing because I could not get it to raise or go back into the wall. - Stinks! This place smells like old garbage. Though it is getting a facelift, repainting, and fixing the front courtyard area, it is still a very old building that resembles a converted flop house or homeless shelter. - Dishes and utensils provided were well used and dirty. Though there was a dishwasher, apparently the previous occupant had not used it and nobody checked (or they checked but did not care). Dishes were past spotty ... they had grime on them. I promptly threw every dish and pan I could find into the dishwasher and ran them myself. - Plastic utensils (spoon, spatula) they had provided were melted in half and unusable, so I took them to the front desk where they promptly laughed me out of the office. I ended up purchasing my own set and taking them with me. - Combo tub and shower were in a decent sized bathroom area. However, it was a very old metal tub (read: slippery). Because of a fall, I ended up purchasing my own bath mat. - Old construction! This means that the walls are thin, and the permanent apartment residents do have their own TVs and stereos that echo around the complex. It's shaped in a square with the courtyard in the middle, so the noise bounces inside the place. Also, the couple on the 4th floor (the top floor) had hardwood floors and sounded like the walked everywhere with tap shoes on. - Remember that this operates much like a time share, so you do not have cleaning service. If you desire, they can schedule once per week refreshment/upkeep cleaning, for $150 per month. I would have run screaming in another direction within 10 minutes of arriving there and gone to another property if given the choice. However, the entire stay would have been non-refundable. When I voiced my concerns to the management at the front desk, the response was \"you can leave whenever you want, but there's no way we're giving you back any money.\" You have been warned ... I would not recommend this place to my worst enemy!","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":4.0,"Rooms":1.0},"author":"Monique Torp","date":"2014-09-17 15:06:50 +0300"},{"content":"Donner une chance   showReview(23041145, 'full');","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Deondre Hayes","date":"2013-07-16 12:08:24 +0300"},{"content":"staff not approachable, not helpful at all. check in was ok, we're booked for 1 night. we said to extend another night. receptionist said ok. we paid for the extended night. we were touring dubai when we get a call that we have to leave because our room is reserved for somebody else!! big hassle, big disappointment. the apartment is ok. but the staff needs to learn how to serve their customers right.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Mrs. Pansy Lind","date":"2012-11-11 08:36:40 +0300"}],"public_likes":["Darrell Reynolds","Pete Block","Aurelie Friesen","Carmen Funk","Westley Cassin"],"vacancy":true,"description":"Four star boutique hotel popular with business travelers with its sleek and contemporary design and furnishings.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}