{"title":"Islay","name":"Port Charlotte Youth Hostel","address":"Port Charlotte, PA48 7TX","directions":null,"phone":"+44 1496 850 385","tollfree":null,"email":null,"fax":null,"url":"http://www.syha.org.uk/hostels-in-scotland/islands/port-charlotte,-islay.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.74119,"lon":-6.3789,"accuracy":"ROOFTOP"},"type":"hotel","id":12337,"country":"United Kingdom","city":"Port Charlotte","state":null,"reviews":[{"content":"This was our second time staying at the JW Marriott Resort. WE LOVE IT. Quiet, comfortable and clean. All employees were very nice and helpful. The rooms are large and nicely decorated. The bathroom is huge. I loved the walk in closet. The buffet and other eateries were the best. The wait staff, in all, was great. The Rampart Casino, on site, made it easy to go back to our room when ever we wanted too. I will stay here again on our next visit to Las Vegas.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Norma Hagenes","date":"2015-01-21 19:31:06 +0300"},{"content":"I have stayed at JW Marriotts all over the world-Lima, Rio, Hong Kong, Singapore to name a few and this one doesn't EVEN come close. You could choke to death in the casino because of all the smoke. I walked in, looked around and was out in ten minutes or less and absolutely wreaked of cigarette smoke-to the point that I went to the room and immediately took a shower. As far as the rooms are concerned, they are dull and unexciting. They upgraded me to a suite and it was the ugliest thing I've ever seen. The furniture was scratched, the carpeting was stained and one of the lamps didn't even work! This is definitely the dog of JW Marriotts. Book it only if you can get a good price!","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":4.0,"Location":1.0,"Rooms":1.0},"author":"Lottie Schroeder","date":"2012-11-01 11:48:48 +0300"},{"content":"We took a weekend trip to Las Vegas with our two young children under 7. The JW Marriott is exactly what we had hoped for. It was a huge property with gigantic rooms. It was only about 7 minutes off of the strip. Self Parking was right by the entrance to the Spa Tower which was very nice. One odd thing that seem misplaced was the casino. I'm assuming they farmed it out as the restaurants and the casino seemed so un-Marriott like. We had the breakfast buffet at the restaurant closest to the front desk (can't remember the name right now). They had omelette station, waffle maker, and fresh pancakes. Other than that, the buffet overall was pretty disappointing as far as selection goes. We loved the gigantic pool. It was 3 1/2 feet deep in the majority of the pool which was perfect for me 7 year old, but a bit too deep for my 5 year old. There are two hottubs as well. The one closest to the towel cabana was lukewarm, the other one was the perfect temperature. Overall, I would highly recommend this hotel if want to be in Las Vegas but not necessarily be in the craziness of the Strip.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Julie Blick","date":"2015-04-13 12:16:43 +0300"}],"public_likes":["Amber O'Reilly","Eva Trantow","Emerald Schneider","Miss Mark Farrell","Jackson Dicki","Tomasa Osinski","Antonia O'Kon"],"vacancy":true,"description":"SYHA Hostel in old whisky warehouse in the village of Port Charlotte. An excellent conversion of the building about 15 years ago giving a 30 bed hostel with good common room facilities. Wildlife Centre Exhibition in the downstairs part of the building.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}