{"title":"San Diego/Downtown","name":"Hotel Palomar","address":"1047 5th Avenue","directions":null,"phone":"+1 619 515-3000","tollfree":null,"email":null,"fax":null,"url":"http://www.hotelpalomar-sandiego.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.71623,"lon":-117.15984,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25166,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Yes, the hotel has a unique design and it was planned, designed and decorated excellently. It was a very comfortable stay. But I must agree with the other reviewers that the ME Barcelona can definitely do better at its service. One evening we ate the restaurant and it took for ever to order, to get the food and even to get the check! Great location.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Anibal Gottlieb","date":"2015-09-25 13:49:56 +0300"},{"content":"What a great location. We LOVED this neighborhood. We walked into a \"local\" restaurant row similar to Las Ramblas but full of locals. It was delish! We could walk to the beach, easy to public transportation. Graet great place! We were here for our honeymoon and really fell in love with Barcelona. I am very allergic to nuts. The hotel restaurant made me breakfast everyday and made sure there was no contamination. I am so lucky that they were that kind. Food variety was def very European; remember you are in Europe. I loved it. ould go back. Drink prices were on the expensive side however I am sure that the cost to run that hotel is high. I'd go back in a split second.","ratings":{"Location":3.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Sandy Wilderman","date":"2013-07-19 08:03:32 +0300"},{"content":"Last week we stayed at ME Barcelona and we spent some days in this beautiful city and we had a an amazing stay. The views from the rooms were beautiful overlooking the sea and the staff was superb and very attentive. The location is better than the W or the Arts. It is not right at the city center but it is 4 blocks away walking distance from the beach and you can go to La Sagrada Familia even walking, the metro is right behind the hotel. We discovered the area and it is beatiful, specially if you go to la Rambla del Poblenou with amazing tapas bars and beautiful architecture. The atmosphere, the pool, the restaurants and bars were all excellent. We will definetely come back!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mrs. Clovis Haley","date":"2012-09-22 05:52:02 +0300"},{"content":"Just back from a four night stay and loved every minute of it. Friendly staff, lovely interior, great room and located in a quiet neighbourhood, this hotel has everything you expect from a 5* hotel. Highly recommendable..","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Sterling Abbott","date":"2013-06-04 02:39:33 +0300"},{"content":"First of all, the check in was extremely friendly and quick. We asked for an early checkin prior to reaching Barcelona and the request was duly obliged. The room was excellent, amazing views of the sea and very spacious and well equipped. We had to ask for an iron and ironing board but that was provided. The location is very good, with a metro station 5-10 min walk away, althought the tram station is virtually outside the entrance. The customer service was second to none and the staff could not do enough to ensure you have a wonderful stay. One of the best hotels we have stayed in. Thoroughly recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Silas Greenfelder","date":"2015-12-17 02:57:06 +0300"},{"content":"The Hotel is located in a former working-class neighborhood very close to the Barrio Gotico. The neighborhood is undergoing transformations with a lot of skyscrapers and nice and modern building. The Me Barcellona is hosted in one of those skyscraper, more than 110m high. The hotel is very modern and pretty posh but feels good and not too pretentious. The tube is 5 min walk away and will take you Downtown in 10 minutes. Arrived there around 12, they upgraded to a better room - 18th floor - but asked us to wait at the Bar. Room was ready and there we go. Very nice seaview and a lot of light - room is very very nice, the bathroom has a glass wall that looks toward the bed and the windows. Staff was nice, breakfast was pretty good as well, maybe not up to a 5 Star hotel par but no complains. Visited the famous lounge bar on the sixth floor but was not impressed - maybe it was too early in the night. The only downside is that I had trouble with the wireless - works fine in the lobby, not so good in the rooms and moreover you are forced to login with a user/password each time on each device (at least on my Apple devices) But you're in Barcelona, so no time to spend Recommended!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Mr. Kiara Runte","date":"2012-05-12 06:16:25 +0300"}],"public_likes":["Halle Spencer","Maci Schneider"],"vacancy":true,"description":"Formerly the Se Sean Diego, now a Kimpton Hotel. This boutique hotel is near Horton Square and a few blocks from the Gaslamp District. Rates start at $159 a night.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}