{"title":"San Francisco/Union Square-Financial District","name":"Wyndham Parc 55 Hotel","address":"55 Cyril Magnin St","directions":"between Ellis and Eddy","phone":null,"tollfree":"+1-800-595-0507","email":null,"fax":null,"url":"http://www.parc55hotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7849,"lon":-122.4088,"accuracy":"ROOFTOP"},"type":"hotel","id":26234,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The rooms are just like in the pics on their own site - cabins styled like the early part of the last century. There's a shelf and clothes rail above the bed, draws and luggage space underneath. Views come with the noise of the west side highway, at the back is quieter. My room overlooked a courtyard with trees. AC above the window, and a wall fan. The bathrooms are at the end of each hall, with lockable units for each shower and toilet. I never waited for either. Very nice tiling and rainfall showers. Nice touches: wood panelled rooms, with soft panels around the bed, free replaceable bottled water, old school decor details. The cafe and ballroom closed after the recent licensing controversies. A new cafe is coming soon, looking like a Parisian cafe - may be open by now. About 5% of the rooms on my floor had long term residents in their unrestored rooms. Rooms were a little smelly from the cleaning products used. The beds are right next to the doors, so you hear corridor sounds. Location is excellent - west village, just south of meatpacking, subway a few blocks north at 14th st. Great for $99 in NYC, and a very stylish hotel, in a retro/quirky way.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Johnnie Rath","date":"2012-11-17 20:39:32 +0300"},{"content":"Stayed for five days, on the 5th floor, room 542, after reading about it's renovation in New York Magazine. Great location in the West Village, not far from the now infamous High Line Park, and right on the Hudson River. New York was super hot that week, and I took three showers a day, and the shared bathrooms were spotless 95% of the time. (I loved gazing at the Statue of Liberty each morning as I brushed my teeth!) Good extras: Flat screen TV with DVD, ipod docks, air conditioning. Great staff! Rooms and beds very tiny; similar to all the small hotels I've stayed in in Europe. I didn't experience any bugs, and had minimal conact with postitutes/johns and 'odd' permnament residents, but also met nice European and American guests, too. Hotel is a little haunted; it's over a hundred years old, and sheltered Titanic survivors, after all, and I saw a few ghosts (!) The Jane is very much like New York City itself, fascinating beyond belief, and unforgettable. Nice story about The Jane in the newest Paper magazine, too.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Willa Klocko","date":"2013-06-16 03:57:30 +0300"},{"content":"I absolutley loved this hotel for the week I was there. The staff are friendly and helpful. The room comes with a great TV, MP3 Dock/Radio and DVD player with a free bottle of spring water. Bathrooms are clean and work perfectly. The location next to the Hudson is breathtaking. Ladies and Gents, stay at this hotel. It was honestly a great experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Bulah Spencer","date":"2015-05-02 11:12:58 +0300"},{"content":"E' bellissimo   showReview(21691398, 'full');","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Hardy Bradtke","date":"2012-06-12 20:12:33 +0300"},{"content":"A wonderful place to relax and forget about everyday rutine. Hotel has excellent location, close to all tourist atractions. Food is just delicious...:)And staff at the hotel so helpful and kind. Ive stayed there with my child so of course there is always something to ask for, hehehe. Nice, polite and really friendly people. Rooms are clean and price reasonable. Would come back there for sure!enjoy!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ola Koch PhD","date":"2012-10-25 02:25:56 +0300"},{"content":"i've been in hotel evsen with my wife.it was a short istanbul stay for us.we were so lucky because location was amazing, it was in the city.so most of the time we walked around.open buffet breakfast was delicious also a lots of choices.our room was very good for price and it was very clean specially bathroom.i couldn't find any hair on the floor or somewhere else. and last few words for staff, they showed us turkish hospitality.they were so helpful whenever needed.also they were very smiley. now whenever i go to istanbul i always go this friendly enviroment.and i'm offering my friends as well.thank you for good work :)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Austyn Hayes","date":"2013-06-21 05:57:54 +0300"},{"content":"Arrived at 3:00am (morning!) greeted at the door by the nightstaff. Provided with cherry juice and biscuits. Took our luggage to our door for us. Breakfast was typical cold meats, cheese and fruit. Ample amounts. The room was TINY! Good thing we were only in it to sleep. But with a minibar which was awesome for a nice cold drink after sightseeing. The amazing thing was the service. We have travelled a fair bit and the helpfulness of the staff is definitely something to share. They answered every question and gave us good local information. For that level of service, and it's location in Sultanahmet (nice private road), I will definitely return to and recommend Hotel Evsen.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mr. Cristian McClure","date":"2014-07-13 22:39:44 +0300"},{"content":"This hotel is in a great location. Yes the rooms are very small, but who stays all day in their room anyway? We did have a window, but the view was of a wall 1 foot away. This was not a big deal to us, since we did not want to spend the day looking out the window. The room was clean, the shower was fantastic - great pressure and nice hot water, the bed was decent. The breakfast was plentiful with fresh cucumbers, tomatoes, eggs and yogurt - typical Turkish foods. We were lucky to have a table by the window in the breakfast room on the 5th floor. The staff at the front desk were all very friendly and helpful. I would stay here again and recommend this place. If you want a fancy hotel with a great view, dont stay here. If you want a good price and a decent room in a good location, then its perfect.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Aidan Quigley","date":"2012-02-23 02:13:57 +0300"},{"content":"I stayed in Hotel Evsen for 1 week and it was really really nice. Our room was deluxe double room with french balcony and we are totaly satisfied with the room; with its facilities and its cleaning!! Open buffet breakfast on roof restaurant is rich and nice. The staff is so friendly and polite to every customer. I recommend Hotel Evsen to anybody..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Velva O'Connell","date":"2014-06-11 19:50:58 +0300"}],"public_likes":["Raphaelle Huel","Claudia Dare DDS","Miss Kian Schiller","Aron Corwin","Brooklyn Cole"],"vacancy":false,"description":"A highrise hotel with large rooms, lots of amenities, and great views of Downtown.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}