{"title":"San Francisco/Union Square-Financial District","name":"JW Marriott","address":"500 Post St","directions":"at Mason, one block west of Union Square","phone":"+1 415 771-8600","tollfree":null,"email":null,"fax":"+1 415 398-0267","url":"http://marriott.com/property/propertypage/SFOJW","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7883,"lon":-122.4104,"accuracy":"ROOFTOP"},"type":"hotel","id":26227,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed 4 nights at this NH and we were really pleased. The room was large (superior one) and there was a balcony (no table or chair to sit :( ). We really enjoyed our stay there, the breafkast was excellent, with a lot of choice, freshly made bread, fresh fruits, yogurts, prosciutto di parma and other italian specialities. We ate at the restaurant twice, the food was really good and the price not too high. The service was great, and they are really generous with wine when you only order a glass. If we get back to Rome, we will certainly try to stay there as it is in the lovely area of Prati, a typical neighborhood of Rome which we particularly appreciated. It is easy to reach from Termini station with the subway to Lepanto and 5 minutes walk to the hotel. The historical center is only 5-10 minutes walk, the Sant' Angelo Castle is 2 minutes away and the Vatican 5 minutes away.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Nettie Ziemann","date":"2014-02-11 07:26:36 +0300"},{"content":"We stayed at this apartment trom 9th to the 12 sep and were extremely happy when we arrived at our apartment, the taxi was reasonable priced from the station(around 20 euros) and the location of apartment was in a quiet street not far from all amenities. The owner of the apartment was really helpful, friendly and an all round nice guy. The apartment itself was like a home away from home, gorgeous, comfortable, very clean and just like in the pictures. We were pleasantly suprised and very happy with the \"breakfast\" food in our fridge.......5 stars guys, We managed to walk to areas quite a fair distance thanks to maps provided in apartment and the tram stops are conveniently just round the corner from apartment. We will definately be coming back to stay here if we return to Amsterdam and will be recommending this accomodation to any other couples we know as we were so happy with our experience. Just one last note to say thank you for holding our bags all day on our day of departure. Keep up the good work!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Kale Koss","date":"2014-03-07 16:40:45 +0300"},{"content":"The hotel is quite pretty with a quaint inner courtyard & pool. The service was okay. They definitely need to update their linen, unless you like the colour grey. You cannot drink the tap water in the hotel but they do give you 2 500ml bottles of water each day. The beds were very hard and uncomfortable. Our room was spacious with a small fridge, hairdryer, ironing board and large walk in shower. We had a balcony overlooking the street which was nice for people watching. The hotel is VERY NOISY. Coco Bongo is half a block away and gets going at 11pm, then there is the regae party down the street that started at 1 am. The open to the street bar across the road does karaoke. The noise virtually didn't stop so bring ear plugs. I imagine if you asked for a room at the back of the hotel it might be quieter. It is fairly close to the beach so that is an asset. It may be inexpensive and quaint but I would not return there.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":1.0},"author":"Ora DuBuque I","date":"2014-06-11 14:18:30 +0300"},{"content":"Just spent 2 nights at the hcda Real, it is an ok hotel. It is old and could use some fine tuning. The room was adequate. We reserved a room with 2 queen beds, but got a small room with one queen bed. We faced the street, on the 3rd floor, and the noise at night was quite loud. The staff was friendly, but didn't seem well trained. The attached restaurant, while the staff here were very good, the food was mediocre at best. There is a coffee maker in the room, but for the fixins you must go to the desk and pay 5usd for the 2 cups of coffee! Free wifi, but if I didn't want to leave the room I had to sit on a pillow on the floor by the door to get it! The hotel is convenient to the beach and shopping, I'd prefer to walk a bit farther for a better room. No serious complaints, but I just wouldn't stay here again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Ashleigh Bayer","date":"2015-03-20 09:32:04 +0300"},{"content":"I just returned last night from this hotel and all I can say is \"it's a great bang for the buck \" The place is imaculate, staff is outstanding, and the location is excellent. The only and I mean only thing they need is a hot tub.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Vallie Balistreri","date":"2012-03-28 20:32:55 +0300"},{"content":"I walked in here with my wife and two kids and got a double room for $70. The comfort level far exceeded my expectations: beautiful room, comfortable beds, air conditioning that works, polite staff and great pool. One block off the main drag with tons of great restaurants and shopping...and another block to the beach.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Walton Hilpert","date":"2013-05-11 01:16:59 +0300"},{"content":"Beautiful, clean, updated, cozy hotel in a fabulous location! I can't say enough good things about the Osmanhan Hotel. I am a 29 year old American female and was in Istanbul for work this past November. I moved from the Hilton near Taksim once my work meetings were over, and selected Osmanhan based on the shining reviews and easy location to local attractions. Being a single woman traveling alone, I was very concerned about safety, but I must admit that I never once felt unsafe anywhere in Sultanahmet. The hotel was perfectly situated by countless local restaurants, shops, Blue Mosque, Hagia Sophia, Topkapi Palace and the Grand Bazaar. Fatih and the rest of the hotel team were very friendly, incredibly helpful and went above and beyond to make my stay enjoyable. The rooftop terrace was picturesque and relaxing. The breakfast spread, delicious! I would wholeheartedly recommend Osmanhan to any friend or family member traveling to Istanbul!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Adolf Will","date":"2012-05-17 13:33:07 +0300"},{"content":"We booked this hotel based on the TA reviews we had read - and we weren't disappointed. The location is perfect - the roof top breakfast terrace had views of the Bosporous, Blue Mosque and Hagia Sophia. It was easy(and safe) walking to all the main sights and transport. The hotel itself was very comfortable and had a nice \"feel\". We also stayed recently at a brand new hotel in Istanbul which was nice - but the Osmanhan had more character. Fatih manned the desk for most of our stay and was delightful and very helpful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Kieran VonRueden Jr.","date":"2015-12-10 15:17:42 +0300"},{"content":"The Osmanhan with its' 7 rooms feels more like a B&B than an impersonal hotel. Fatih (Fah-tee) in particular but all the staff were terrific. They went out of their way to help with all our requests be it extra pillows, suggestions on places to visit to arranging airport pick up for our friends staying at a different hotel !! As mentioned in the other reviews, location, breakfast, wifi, cleanliness are all first rate. Tip - Unless you are bushed and don't feel like walking, skip the restaurants near the hotel and check out the restaurants near and past the tram stop. Some are still a bit touristy but you will see more and more locals the further you go.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Libbie Willms DDS","date":"2013-04-22 16:48:06 +0300"}],"public_likes":["Javon Smitham","Jaquan Hoeger"],"vacancy":true,"description":"A AAA four diamond hotel with lots of amenities and nice rooms.","alias":"former Pan Pacific","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}