{"title":"San Diego/North","name":"Homewood Suites San Diego Del Mar","address":"11025 Vista Sorrento Parkway","directions":null,"phone":"+1 858 523-0500","tollfree":null,"email":null,"fax":"+1 858 523-0591","url":"http://homewoodsuites.hilton.com/en/hw/hotels/index.jhtml?ctyhocn=SANDEHW","checkin":"3PM","checkout":"noon","price":null,"geo":{"lat":32.91643,"lon":-117.22882,"accuracy":"APPROXIMATE"},"type":"hotel","id":25263,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"We stayed at the resort for our 43rd wedding anniversary. Our Room was awesome. We had breakfast in our room the next morning. Food was excellent and room service personnel were fantastic. We received a tour of the property by a staff member. He was very knowledgeable and shared some of the uniqueness of the resort, its beginnings and how it was built. Everyone we came in contact with was top shelf. We highly recommend this resort.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Clovis O'Reilly I","date":"2014-10-09 02:58:01 +0300"},{"content":"My second stay at the AZ Biltmore and like in 2005 I found the resort to be very, very good. The design and layout is quite unique and the low ceilings (so different from most breathtaking hotels) lends to it's intimacy and sophistication. Rooms are spacious, modern and well appointed. There are multiple buildings, all in close proximity to the lobby and main building. Only four stories high. The grounds are beautiful, the pool a real show peice. The gym is free and well equipped. Food and drinks are solid+ and as expensive as you would expect to find in high-end places like this. Nice employee to guest ratio so finding \"help\" is easy. Not quite FS or RC level talent but close enough. Parking is easy and on-sight. Flawless Phoeniz winter weather makes this an ideal spot to escape for a few days. I'll be back and not soon enough.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Laura Anderson","date":"2015-06-04 06:07:38 +0300"},{"content":"Stayed as part of a conference in August - thank god I didn't pay for this experience. On check in my room wasn't ready and although they promised to call me, they never did.- I ended up calling back at 6pm. It took me 20 minutes to find my room in the Catalina section, the signs kept pointing different directions. When I finally got to my room, a dirty tray was waiting at my door. I ordered room service that evening and they picked up the dirty tray but never came back for mine. It stayed outside my door for 2 DAYS until I rang and complained. Other annoying things: The shampoo/conditioner tray had a film of shampoo on the bottom of it. When I used the shampoo I found out it had been watered down and didn't foam at all. I called for a golf cart to help me bring heavy items to my room from the conference center and it never came, I ended up carrying boxes in the heat. The lobby smells and in places linens were ripped. Place needs a complete overhaul and service in general is mediocre. Not many good remarks to share except the bed and pillows were very comfortable and the Catalina and main pool were really well maintained.","ratings":{"Service":2.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":2.0},"author":"Raoul Bogan","date":"2015-12-11 14:29:33 +0300"},{"content":"I spent four days at this hotel due to a business trip so I heard many comments from all my colleagues. I personaly had a room with balcony, kitchen, two floors and two queen size beds. The room was big, plasma TV, nice pillows and towels and a comfortable bed. The shower had no pressure and one morning I noticed water falling hard from the ceiling from the room above. it did get fixed however other colleagues mentioned AC and shower problems. One smart colleague asked to see rooms in each wing until she found one she liked so if you have time, do just that or try to stay away from the old wings of this hotel. The bar is nice and the drinks are great but (yes another but) service is lousy because they only have two servers around the bar and drinks are expensive ($16). The grounds are beautiful, the pools are very nice and friendly to the kids and the golf course is just ok. All in all a great stay but if I had to pay for it I would choose another destination.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":2.0,"Value":4.0,"Rooms":5.0,"Location":3.0},"author":"Mr. Ophelia Moen","date":"2013-02-21 18:51:58 +0300"}],"public_likes":["Candace Beahan","Dr. Emiliano Ritchie","Neal Huels","Pascale Halvorson","Geoffrey Waters II"],"vacancy":false,"description":"Don't be fooled by the name. This hotel is not in Del Mar, but in the neighborhood of Sorrento Valley. The location is actually more convenient to points south of the I-5/I-805 merge.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}