{"title":"Death Valley National Park","name":"Panamint Springs Resort","address":null,"directions":null,"phone":"+1-775-482-7680","tollfree":null,"email":null,"fax":null,"url":"http://www.deathvalley.com/reserve/reserve.shtml","checkin":null,"checkout":null,"price":"$79 to $149","geo":{"lat":36.33931,"lon":-117.4687,"accuracy":"ROOFTOP"},"type":"hotel","id":7386,"country":"United States","city":"Darwin","state":"California","reviews":[{"content":"Went for Jazz Festival was staying at another location not real happy there. We walked into this hotel and had to stay here. We had room 239 which they called the honeymoon suite very large and huge step down shower. The staff was wonderful and Wendel the doorman was the BEST. He was so friendly and had a smile on his face each time we met him. He as well as the hotel are JEMS in the big easy town of New Orleans. Will go back and stay here for sure.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Mr. Carson Ebert","date":"2015-04-12 21:33:48 +0300"},{"content":"We stayed at the Avenue Plaza Resort through our Worldmark timeshare. The hotel was just okay. It met our basic needs - having a place to sleep and a place to shower away all the NOLA humidity. Other than that, the room that we stayed in was out-of-date - worn down furniture, dim lighting, carpet flooring, etc. However, the location of this place was great! It's located in the Garden District and there's a trolley right outside the hotel. Had we known this, we would've opted out of getting a rental car - which by the way, we'd pay $$ for daily parking at the hotel. So for those of you looking to travel to NOLA, get the multiple day trolley pass! It's so worth it! Altogether, I would like to go back to NOLA. I'd only come back to this hotel if I was on a budget.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Ramon Bernier","date":"2012-11-29 23:21:48 +0300"},{"content":"When selecting this hotel consideration was given to the location, price and amenities required. The Avenue Plaza resort didn't disappoint. It is located in the Garden District along St Charles Ave. It is far enough away from the French Quarter and CBD in a quieter suburb, yet close enough to hop on a streetcar and be there in 10 minutes, less the hassle of trying to park or pay for the privilege in expensive car parks. However, word of warning, streetcars during busy periods can be very crowded and unpleasant. Also be sure to say to the driver you want a day pass, (if you want one which is the best option), before putting money into the ticket machine. Or else you'll be yelled at! (Albeit in Southern good humor). The hotel offers valet parking but enough free parking can be found on the street within easy access to the hotel. The room we stayed in was a one bedroom suite on the 10th floor with foldout bedding in the lounge in addition to the big bedroom. It was very clean, the kitchenette was excellent and the view from the suite window was fantastic. For an even better view, the rooftop terrace accessed from the 12th floor is great for a panoramic view of New Orleans and suburbs. Reception desk assistance was disappointing, I asked where I might find the nearest post office and was told to wait for the tour desk manager, who never appeared. Porters were sought, by repeated requests over a lengthy period but never came to assist. Laundry appliances were unreliable, but as I don't like to judge a vacation by doing a mundane chore like laundry, whilst on it, I perhaps should let that pass! LOL. Plentiful restaurants and convenience stores are closeby. The business centre in the hotel had three computer terminals to access internet 24/7. Lifts worked efficiently and the outdoor areas were good. Overall a pleasant stay in a comfortable and well located hotel.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Miss Beau Hackett","date":"2012-11-07 05:32:30 +0300"}],"public_likes":[],"vacancy":false,"description":"Located just inside the west entrance, this resort is the most economical lodging option. The rooms are small and very outdated.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}