{"title":"Santa Monica Mountains National Recreation Area","name":"Sycamore Canyon Campground","address":null,"directions":"Adjacent to Sycamore Cove on Pacific Coast Highway","phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$45","geo":{"lat":34.07269,"lon":-119.01423,"accuracy":"ROOFTOP"},"type":"hotel","id":37591,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"Felt like a weekend away from the wife and kids (more wife than kids to be honest- I know she wont read this !!) Chose Seattle to do this, as its within easy reach of my hometown Vancouver. Decided on the Moore Hotel,downtown as I'm both thrifty and poor and on reading previous reviews, seemed to suit my budget. Also as I was staying only one night-how bad could it be. On first look at the place from the outside ,I knew it wasnt going to be Buckingham Palace.The lobby is pretty spartan,the desk clerk on duty pretty friendly-one guy in front of me at check in was turned away as place was full-so book ahead. Was pleasantly surprised by the room-spacious,and clean. No frills,no shampoo etc one bar of soap for all your needs. The mattress felt more like a water bed than a spring one and I almost seemed to touch the floor as I hopped on it.Ok so 125 kgs will do it-but crikey some of those bed springs had surely seen better days.Ah now for some TV-but wait no remote- 125 kgs jumping up and down to change channels,is not on. A trip down to reception to enquire as to whereabouts of said remote-shrug of shoulders-\"our guests take them home you know\" set TV to CNN for duration of my stay. Off to Pike Place market-a short jaunt from the hotel-fantastic location-a few dubious characters around,but you find that in any major city.Parked right across the road in a place offering a spot for only $5-had to move my car that night to see De La Hoya/ Mayweather fight at local sports pub-on return garage was full-now what ? no problem-park on the street for free-after 6 pm and Sunday all day free. Saturday evening and I'm winding down-Seattleites are winding up-the noise level rises to a crescendo-its now 2 a.m. A water pipe ( a prominent celing to floor fixture) in the room, not to be outdone,comes to life with a gurgle and splutter and keeps this up until 5. a.m an hour after the Seattlites decide its time to go home.I nod off into a fitful sleep. Something about this hotel though-somehow its quaint and pleasant in an obscene kind of way.Was almost sorry to leave-or was it teh thought of another Monday at the office looming large ? Give this place a go-just catch up on sleep before you do.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Tyson Muller III","date":"2012-01-19 00:37:47 +0300"},{"content":"The Moore Hotel is an older building, yet scrupulously cleaned and maintained. The staff were very helpful and courteous. The prices were great. However, its chief advantage is its location. At the corner of 2nd St. and Virgininia, it is only two blocks from Pike Place Mkt! It is also within easy walking distance of the Convention Center area. One block either way puts you on major city bus lines to connect to the stadiums to the south, or the Space Needle to the north. Airport transportation via the Shuttle Express vans drops you off/picks you up at the door of the moore for a great price. Two cruise lines dock at the waterfront directly below the Moore, but HAL and RCL dock closer to the Pioneer Square area. We stayed two nights pre-cruise, and two nights post-cruise at the Moore and felt it was a bargain. I would advist to request the upper floors, as street noise was noticeable in our room on the fourth floor. Also be aware that there is no air conditioning, but this was not a problem at all during our stay in August, 2006. If you want luxury and pampering this is not the place for you. However, for a clean room at a great price and in a great location, the Moore is the place. I would definitely stay there again.","ratings":{"Overall":4.0},"author":"Erik Grady","date":"2015-12-13 09:08:04 +0300"},{"content":"I just got back from a five night stay at the Moore Hotel in Seattle. For $65 a night I paid it was an amazing deal! My room was on the 6th floor, and I had views of the bay. The room was large, clean and quiet, if somewhat dark, and the staff was friendly and helpful. the one drawback was the clawfoot tub in the bathroom had no decals or bathmat, so if you are not careful it can be a bit slippery. The front desk does not provide bath mats, so you may have to spend three or four bucks on one while you are there. The location is also really convenient, just a few blocks from Pike Place Market, and within easy walking distance of Pioneer Square and the main shopping area, as well as the location to catch tourist buses and cruises. Also, the Metro bus (which is $1.25 to $2.00 depending on the time of day) to and from the airport is just two blocks away. Would definitely stay there again when I go back to Seattle, and at those prices I can certainly afford to!","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":3.0},"author":"Hayden Rohan","date":"2014-10-16 12:12:39 +0300"},{"content":"i must say that i was a little skeptical on such a place due to the price, in comparison with other hotels in the downtown area. man, was i wrong. very friendly staff, very helpful, and accomodating. building was very old, but very well upkept. only two blocks away from pike place market, four or five blocks from the shopping district, and the start of belltown (great restaurants and bars). would definitely encourage anyone looking for a great deal, and on a budget. will definitely stay again.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Ettie Anderson","date":"2015-06-23 11:55:43 +0300"},{"content":"We stayed for two nights (Sept 17 +18) while in town to see Dead Can Dance at the Paramount. Coming from Victoria on the Clipper it was $7 by cab (including tip) to the Moore. Check in was quick and front staff were very helpful! Our 7th floor room was charming and very clean. Water pressure was perfect but watch out for the shower - hot was cold and cold was hot - at least in our room. The hotel was quiet - we only bumped into a couple of groups in the hall and yes the noise on the street from the bar scene was noticable but close your window and you won't be bothered. The area is safe and really would you walk anywhere alone at 3 am? We found a coupon on the web for 10% off the already great price. Close to the Market, Monorail, major shopping, a 10 min walk to the Paramount - location cannot be beat. Belltown has many great placed to eat - Belltown Pizza, 2 huge slices and a soda for $7.91. For a late nite snack and a game of Connect Four or an early morning coffee try Nexxus - just 1/2 block to the north on 2nd ave. We are already planning our next trip to Seattle and can't wait to stay at the Moore again!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Bernadine Graham I","date":"2013-02-03 05:50:19 +0300"},{"content":"great, practical hotel at an outstanding price. walking distance to so much. great, friendly staff. again, great price for great location. room is simple, bathrooms with claw feet tubs! I'll definately visit again!!","ratings":{"Overall":5.0},"author":"Carmela O'Keefe","date":"2013-04-30 12:45:46 +0300"},{"content":"You will not find a better place to stay at comparable prices in Seattle. Staff are very helpful, rooms are very clean and the hotel itself is charming and interesting. Very close to Downtown Seattle, bus lines, the ferries and only a few short blocks north of Pike Place Market. If you are looking for plush towels and jacuzzi's, stay elsewhere. If you are looking for historical ambience, a staff that cares and to save yourself some money, the Moore cannot be beat. You can tell they are really trying to make this a well loved place to stay and at the rates charged, it's hard not to love this old beauty of a hotel.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Dudley Okuneva","date":"2014-09-12 05:32:09 +0300"},{"content":"Miauw Suites looked great on the internet but the reality is completely different. This is not actually a hotel as it has no facilities outside of the rooms whatsoever. Having lugged our bags up the steep stairs to the first floor (no elevator) we arrived in the White Room. The temperature was around 90 degrees inside (despite being 70 outside) and there is no air conditioning. We were on our honeymoon and wanted to experience a boutique hotel but this was appalling in every way. We checked out straight away and found alternative accommodation close by that was very good. Miauw Suites has declined to refund any of our costs for the 2 night stay. I understand that we arrived at 3pm on the first day and that it would be unlikely that the room could be sold again but feel that the second night should have been refunded.","ratings":{"Overall":1.0,"Rooms":1.0,"Value":1.0,"Location":4.0},"author":"Clint Cummerata","date":"2014-01-11 19:46:11 +0300"},{"content":"I was a little underwhelmed with this hotel. The price was good, though, so I wasn't expecting the world. I had read reviews saying the hotel was run down. It isn't. It's an older property so isn't brand-spankin' new, but it is certainly not run-down. We stayed in a basic room. It was a basic room. Standard layout. Small bathroom. Excellent bed. The lobby is unimpressive. There are no restaurants in the hotel except a coffee shop. However, there is a great italian place just up the street with the best tiramisu. The staff were very friendly. We came with two dogs, so we're not the most desirable clientele, but the staff were all very accommodating. All-in-all, there was nothing really wrong with this place but I don't think I would stay here again. It was just very average.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Alford Jast","date":"2013-11-30 10:00:06 +0300"}],"public_likes":["Nedra Hyatt","Lavon Schiller","Ebba Stamm","Terrence Bednar"],"vacancy":true,"description":"Developed campground near the beach in Point Mugu State Park. Easily accessible from the park entrance. Campsites are drive-in accessible.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}