{"title":"Birmingham (England)","name":"Premier Inn Birmingham City Centre (New Street)","address":"Pinfold Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47891,"lon":-1.90187,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3620,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"My Fiance and I stayed at this hotel at the end of January for 4 nights, under $100 a night, and we loved it. We stayed in room 1010 and it had a view of the city building across the street and the river. The room was spacious, clean, and nicely decorated. The window seats were cute too, loved the view, but I did notice that depending on the room you have, the window size varies. The service at this hotel was incredible. Everyone said Hi as you walk in and out, they hold the door, ask if you need a taxi etc. We had drinks one night at the bar downstairs and the bartender was very friendly. We got into the elevator with one of the employees one night and he asked if we were having a good stay, and my fiance said we just got engaged (he proposed in millennium park the first day we were there) and he told us congratulations and said he wanted to do something for us and asked for our room number. Later that night when we came back to the room a bottle of champagne and a card from the hotel was waiting for us. It was so thoughtful of them. They didn't have to do that for us, but they did. The location of this hotel is the BEST. It is just a block or two away from the mile, and a couple of blocks away from millennium park. We both thought this was the PERFECT location to see everything in Chicago. We walked everywhere. We went out every night for dinner across the river and it was an easy walk and we felt safe. Everyone is out and about. The only issues I had was the pillows were not comfortable and also we were close to the elevators so we could sometimes hear people outside. But everything else about the hotel made up for it. This is by far one of my favorite places I have stayed at. Thank you so much for making a special event in my life even more special!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Yasmin Emmerich","date":"2015-05-20 10:53:21 +0300"},{"content":"Staff was very friendly and helpful. room was spacious and lovely. Free breakfast was a nice plus. Would stay again--- thought it was great and a wonderful valiue.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Ms. Domenica Steuber","date":"2013-07-06 10:46:40 +0300"},{"content":"Great location, friendly and helpful staff, and totally cute room with cushy window seats you can plop yourself down in and watch over the city below.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dr. Katrine Koepp","date":"2012-05-26 23:25:53 +0300"},{"content":"We don't normally stay right in the city, but we were without the kids and got a great deal on the room. We had a wonderful time. The room was gorgeous, clean, and quiet. The staff were very attentive and helpful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Creola Kirlin PhD","date":"2015-12-02 09:22:08 +0300"},{"content":"Great location and helpful, professional staff. Elegant lobby and fun comfortable rooms. Ours had a view of the river. My only complaint was that the rooms both had a bit of an odor. My sister described it as \"leisure suit\".","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Mrs. Jimmie Frami","date":"2015-12-13 07:36:30 +0300"}],"public_likes":["Beau Kovacek","Deron Block","Rosella Greenholt","Vivian Wiza","Allene Baumbach","Kasandra Mueller","Rex Torp","Demond Hegmann","Ashton Luettgen"],"vacancy":false,"description":"There is no shortage of Premier Inns in Birmingham. This one is next to the New Street railway station.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}