{"title":"Tarbert (Harris)","name":"Rhenigidale Youth Hostel","address":"HS3 3BD","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.gatliff.co.uk/rhenigidale.php","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.91886,"lon":-6.68913,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":29610,"country":"United Kingdom","city":"Rhenigidale","state":null,"reviews":[{"content":"We stayed at the Hard Rock Hotel for two nights in February. The hotel was great. The rooms were nicely decorated and the beds were quite comfortable. There was a stocked refrigerator in the room. However, the prices of everything was outrageous. Needless to say, we didn't touch anything in the refrigerator. A bottle of water was $7.00 plus a 20% surcharge and 6.5% tax. The pool was beautiful, it had a nice waterslide. The water wasn't very deep. The deepest part of the pool was 4ft 6in. We stayed at the hotel for the fass passes and early access to Harry Potter. It was definitely worth it. Harry Potter reached maximum capacity by noon and with the fast passes we never had to wait to get on the rides. The location can't be beat if your going to the parks.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Garett Balistreri","date":"2012-05-27 21:31:36 +0300"},{"content":"Before booking our trip to Universal Orlando, I read a lot of reviews on TripAdvisor - thanks to those who take the time to post. Some were favorable, others not. With two teenage boys in tow, we opted for the Hard Rock Hotel. Our room was ready when we checked in (around 2pm) - clean and all in order. No problems with housekeeping during our stay. No problems with noise (we had a \"garden view\" room not facing the pool). Ate at The Kitchen for breakfast each day. A bit pricey but typical for resort restaurants. Food and service were good. Very easy walk to Citywalk and the two parks. Using your room key as Express Pass is the BEST benefit. We did not do the early AM entry to Harry Potter. Too many people do that so the lines wind up being long. During the regular hours we never waiting more than 30 mins. Priority seating at restaurants never was useful. Being able to charge to your room key is handy - especially when teens are on their own and need to purchase food. But watch out for limits as your cards get cut off if you exceed them. You need to work out limits with the front desk. Many restaurants in Citywalk give AAA discount so always ask. We used the Mears Shuttle from the airport. For a family I would not recommend it. Mears puts too many people in a van and makes too many stops. For a few bucks more, opt for the taxi.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Ebony Balistreri","date":"2012-10-29 17:28:25 +0300"},{"content":"Traveled here Jan 14th for 3 nights. Doubt we will make It to three. So expensive - worse customer service ever. Jonathan at the front desk was helpful, Paul with room service and a handful of others. This has been a nightmare. Room by elevators - listened to dinging of elevator all night. New room reeked of smoke and febreez in the smoke free hotel , not so good for a child with allergies. Jonathan was as genorous as he could be. After getting room service- it took 4 people over thirty minutes to get us a wine tool for the $70 bottle we had ordered. The food was freezing cold once it did arrive. When we called \"star service\", they repeatedly answered and hung up - or sent it to voicemail. Save your money. I wish I had. I have had better customer service at a gas station. Perhaps hiring the cute young girls is backfiring........","ratings":{"Overall":1.0},"author":"Mr. Taurean Schneider","date":"2013-09-25 19:07:23 +0300"},{"content":"Just got back from a wonderful birthday weekend at the Hard Rock! We had a basic room but were upgraded to one(b-day amenity??) with a great view of the pool , lush landscaping , and the twinkling lights of the Universal rides in the distance. Everyone on staff had a smile and a helpful attitude! We enjoyed food and drinks at the Velvet Bar,breakfast at The Kitchen, and drinks at the pool. The location was perfect to get to the Universal parks and it was a short drive from the airport. I think that families and romantic couples or just a bunch of friends would all have a wonderful stay in this hotel!! I highly recommend it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Delbert Conroy","date":"2015-02-28 21:02:18 +0300"},{"content":"average hotel don't phone home on the hotel phone. we paid $408 for 6 short phone calls to the uk.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Patience Mohr","date":"2013-04-11 04:01:56 +0300"},{"content":"We stayed in a Kids Suite at the Hard Rock Hotel for a week this summer, and we loved everything about our stay. The room was perfect for our family of 4. Our girls loved not only having their own room, but not having to share a bed with each other (they each had a twin bed). They also loved the pool slide. While others have complained about noise, we didn't notice any noise. The location cannot be beat - a short 5 minute walk to Universal Studios and CityWalk. And having front of the line passes for Universal was awesome. We can't wait to return!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Ulises Ankunding","date":"2014-07-28 03:24:21 +0300"},{"content":"This was our second trip to the Hard Rock Orlando & if possible it was even better than the first. The hotel itself is stunning, immaculate & contains something for everyone - young & old, the music piping throughout all common areas adds a modern yet unintrusive touch. The staff could not have been more accomadating & friendly, from the bar staff to the cleaners passing in the corridors at all times of the day. Checking in & out was particularly straight forward, as was getting taxis from the front of the hotel. The rooms were cleans, spacious & comfortable. The location in relation to the parks & City Walk along with the free express passes are undoubtable perks to staying here & add to the already incredible holiday experience.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Emelia Monahan","date":"2015-03-01 00:23:26 +0300"}],"public_likes":["Theo Wisoky","Kiel Tillman"],"vacancy":false,"description":"A hostel run by the Gatliff Hebridean Hostels Trust in the remote village of Rhenigidale, which is 6 miles from Tarbert on foot, or 13 miles by road. The road has only been there since 1990 and the only way in used to be on foot or by boat. The hostel does not take bookings, and has no phone.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}