{"title":"Carpentras","name":"Le Coq Hardi","address":"36 pl Marotte","directions":null,"phone":"+33 4 90 63 00 35","tollfree":null,"email":null,"fax":"+33 4 90 60 40 76","url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":44.0543996,"lon":5.044281800000022,"accuracy":"ROOFTOP"},"type":"hotel","id":40356,"country":"France","city":"Carpentras","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"Two friends and I spent two nights here and was very pleased. We all stayed in one room with two queen beds and there was plenty of room for all of us. The location is only two blocks from Grauman's Chinese Theater, the Walk of Fame and the Hollywood Highlands (which had great restaurants and shopping). Valet parking was $20 per day and well worth it. We did not use our car and walked everywhere. Free breakfast was included which was on the fourth floor which was where our room was. The desk clerks were extremely nice and helpful. They recommended places to eat and answered all our questions. Internet service worked perfectly plus we noticed a computer open to the public on our floor. Only one slight problem - the tv remote would not work - but someone was sent up and he promptly fixed it. Despite being in the hubble of downtown Hollywood, the room was very quiet.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Terence Glover","date":"2013-10-06 08:03:13 +0300"},{"content":"We started our 3 week USA trip in Hollywood. Check in was a breeze, our room overlooked the pool. It was clean, comfortable and quiet. The breakfast is a great bonus with a good basic choice and really yummy cinnamon rolls. We loved the pool and used it several times as it was around 27C while we were there. The location is wonderful, 10 minutes to the Highland centre, we loved the hop on hop off buses. The staff were friendly and professional. Thank you for a great start to our holiday :)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Wilber Abshire","date":"2013-11-30 10:17:26 +0300"},{"content":"The hotel is walking distance to hollywood boulevard. Rooms were big and clean. Nice mattress. Breakfast was outstanding. Did not go to pool but saw others in it. We had a 5th floor room and did not have a great view but did not spend too much time in room. Business center has one computer with internet access. Small store in lobby sells drinks and microwavable items. Valet parking required during the summer. $20.00 daily parking fee added to checkout bill. Would recommend but wish it were cheaper. Considering the other hotel prices in the area it was not bad. My husband did not think much of the gym and walked over to the LA fitness on Hollywood boulevard instead. No fee if you are a member.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ellis Abernathy","date":"2012-08-26 11:11:27 +0300"},{"content":"Good points: Very clean, nice decor, nice complimentary breakfast, nice pool, free computer use, good value, very central in LA for public transport (metro bus & trains 5 minutes walk away) if do not have a car, very handy to Hollywood Walk of fame, Madame Tausands Wax museum, Ripleys Believe it or not, theatres etc (5 minutes walk) & Universal studios (10 minutes by local bus @ $1.50 ea way). Will look after bags if check out early & pick up later. Seemed to have a nice clientele - lots of friendly people from Europe, Canada and Australia staying there, many families. Negative points: Room was very stuffy because windows do not open much. Many rooms only look into a wall (not good if claustraphobic!) Busy street - traffic very noisy - we had to turn on the air conditioner all night so it would drown out the road noise. Police sirens, helicopters & fire engines much of the night. Hollywood is generally quite a seedy area - lots of homeless people, beggars & weirdos wandering about, but most of LA seems to be like that these days! I noticed that the Magic Castle Hotel, very nearby, is on a quieter street and gets very good reviews, but it charges a lot more. Recommend eating at The California Pizza restaurant, upstairs on the corner of Hollywood & Highland. Greek Pizza scrumptious. Recommend not booking any LA tours until you arrive as they offer lots of discount vouchers in the main street, as well as deals for seeing multiple attractions, such as a tour plus wax museum. This hotel was also selling two day passes to Universal studios for the price of 1 day (but note that it is much cheaper to take local bus than to buy a pass that includes transport). We did La City Tour A1 - Venice Beach (very, very seedy & dangerous at night), Santa Monica Beach, Dowtown including oldest house in LA, Hollywood, then Movie Stars houses in Beverly Hills etc. A good way to see a great deal of LA in one day. But be aware that if you initially get a crappy seat on their mini bus they make you stay in the same one all day even though you paid as much as the people in the front row (good reason not to give a tip to tour guide who insists on noboby moving seats!) We also took the local bus (Dash Hollywood @ 25cents each) to the Beverly Centre shopping mall - there are also Outlet stores across the road at \"The Beverly Connection\" - designer shoes, handbags, clothes at greatly reduced prices.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Miracle Crist","date":"2013-07-27 08:04:20 +0300"},{"content":"Nice clean hotel with large rooms if I ever travel to LA again, I'm staying here.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Monserrat Pfeffer","date":"2014-03-03 13:45:47 +0300"},{"content":"Hotel is superbly located five mins walk from hollywood boulevard and the walk of fame. Hotel looks new, the rooms are a decent size and the beds are great. Reasonable parking on site and if eating out gets too much then there is a good store/Subway etc just across the road. Breakfast for a hotel of this class was really great and the lady running the breakfast room was lovely. Only issue we had was a bit of noise. Our room looked out over a next door hotel's parking lot and they had no qualms about firing up their noisy bus, right outside our room at 6am and letting it run for half an hour. Also our room was opposite the laundry and so 'thanks' go out to those girls who congregated there and chatted away at full volume whilst we tried to sleep and who also ignored our requests (twice) to please take their conversation elsewhere (perhaps their own room??). Don't these people realise that all those doors in the corridors are bedrooms at the end of the day? Of course being so close to the 'action' our saturday night was punctuated by significant noise from late night revellers (drunks) coming home at all hours. OK so these might not be directly the hotel's fault -there is no accounting for people, but maybe hotels should try and take some responsibilty - heck why not even put up a sign saying no noise after 10pm or something - it might be a start!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Antwan Abbott","date":"2014-06-15 13:15:23 +0300"},{"content":"Checked in here late at night, small problem that I had booked wrong date, however hotel honoured booking and did not charge extra. Our room was a great size, had two double/queen beds, a sofa bed, small table and chairs. Also a small kitchen area with a microwave, small fridge. I thought the room would be noisy as it overlooked busy road, it turned out to be a very quiet room. Breakfast was great, it is a continental breakfast, but is more than adequate to get you through the morning. It consisted of cereal, toast, bagels, boiled eggs, juices, yoghurt, coffee, tea and hot chocolate ( I seem to recall scrambled eggs and bacon too, but am not 100% sure). Had pizza and salad from across the road, which was great. There is also a Subway sandwich shop and a small general store. The proximity of this hotel to the walk of fame, train etc was fantastic. It was an easy five minute walk from the hotel to this hub. Many restuarants in the large shopping centre, plus lots of shopping around. We took a bus from this area to venice beach (well two buses), it took close to an hour to get there. Staff were great and helped book a car for our return to the airport, and printed our boarding passes. Would absolutely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Thelma Lubowitz","date":"2014-01-22 06:01:02 +0300"},{"content":"We stayed in Hollywood for the last phase of our American honeymoon and had a pretty good time. Hollywood itself seems to be quite overrated but the hotel was a great place to call home for six days. Check-in was easy and all of the front desk staff we encountered during our stay were pleasant. Had a nice chat with the girls while they were watching the Super Bowl during the quieter moments of the day. They even helped us plan our trip to the San Diego Zoo (and remembered us well enough to ask how it was when we returned). The room was quite spacious though perhaps a little dark with no proper lights, only floor and table lamps. Bathroom was nice and the bed super comfy...not much street noise either and you'd never know that busy Hollywood Blvd was close by. Free buffet breakfast every morning was a Godsend - nice supply of toast, bagels, cinnamon rolls, various cereals, milk, yoghurt, scrambled and hard-boiled eggs, bacon, sausage, juice, coffee, fruit, and more...fabulous! As a tip, it's probably a good idea to swipe a couple of paper plates, bowls and some cutlery from the breakfast room in the morning as although there is a kitchenette in the room, there is nothing to eat your food on or with. Only had two problems during our stay, both of which were handled by staff very, very quickly. Once our room key stopped working and it was immediately replaced by the girls on the desk, and towards the end of the trip our toilet backed up but the maintenance man was quick to fix that also. The free Wi-Fi was horribly slow at times in our 4th floor room...that's probably the only real complaint I would have. The small business centre was more than adequate for those times where we had to email home. We didn't have a car for the whole duration of our holiday but as tourists we made good use of the hop-on hop-off buses that most major touristy cities have. The company we used in Hollywood started from outside the Chinese Theatre so that was very convenient and the information they provided, as well as the variety of loops to take you to Downtown LA, Santa Monica, the hills, etc were great. Ordered in a couple of nights from some of the restaurants listed in the hotel's booklet...good experiences all round. There's a convenience store and Subway across the road (if you can ignore all of the scary people hanging around at night), and the sushi restaurant, Shinto is to die for! Best sushi, and affordable, that I have ever had! Overall we had a great stay at Holiday Inn Express Hotel & Suites Hollywood Walk of Fame.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Dalton Will","date":"2015-11-04 08:13:35 +0300"}],"public_likes":["Lorenza Yundt","Elbert Wuckert","Kimberly Schowalter","Aisha Bradtke","Juston Paucek"],"vacancy":false,"description":"also has a restaurant","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}