{"title":"San Diego/La Jolla","name":"The Bed & Breakfast Inn at La Jolla","address":"7753 Draper Ave","directions":null,"phone":null,"tollfree":"+1-888-988-8481","email":null,"fax":null,"url":"http://www.innlajolla.com","checkin":"3PM","checkout":"11AM","price":"$210-$459","geo":{"lat":32.84377,"lon":-117.27709,"accuracy":"ROOFTOP"},"type":"hotel","id":25193,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I just stayed here for 3 full days and could not have had a better holiday. The hotel is ultra swish and actually found the location to be about right. It will cost you 35 Euros from the airport, and will take approx 25 mins. (Cabbies are nutters) We stayed on the 13th floor and had a sea view which also looked over the pool. Room was beautiful and very spacious. All mod cons and everything you will need (No Iron) There is so much to do in the hotel like (Spa, Pool, Restaurant, Gym, Night Club on Saturday) We walked to the beach on the first day and did not realise how long the becahs was so settled in a nice spot which was busy but really nice. Food can be expensive but generally it is the drinks. Nice though. the one thing I would be wary of is the cost of drinks in the hotel A coke 5 Euros and vodka and Tonica 10 Euro's in the end I walked to the petrol station (1 minute walk) and bought water and cokes etc from there. Breakfast is 22 Euro's each. Very steap for what it is. More positives is the pool area. Lovely chilled pool enough beds as long as you get down about 9am and put your bag or one of their towels down. Food by the pool is lovely Service is lovely (always with a smile) Manged to get a check out at 2pm We went to two amazing restaurants: Ciutat Comtal (Rambla de Cantalunya 18) amazing tapas food. CDCL near the marina (prob the best restaurant I have ever been to) £50 per head roughly. (look on their website) I would also recommend the tour bus. Hop on hop off all day.. great to get around if you want to see everything. will definately be coming back here but will learn some more Spanish","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Alda Hoeger","date":"2012-02-20 07:26:28 +0300"},{"content":"Hotel building looks great and the staff were friendly and professional. Room was great with a floor to ceiling window with views out over the city, a copy of Wallpaper is included as reading material and its very appropriate given the slick interior. Breakfast was a little chaotic, the room is small and the staff struggled to cope with the number of people but the food and coffee was great. The hotel is a little out of the centre of town but there is a metro station close by and you'll be there in about 10 minutes. The area around the hotel has many construction sites at the moment.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Florine Fahey","date":"2015-08-19 05:39:19 +0300"},{"content":"This was only booked at really short notice through laterooms.com.Almost a home from home.Those small,but very thoughtful details.eg.fragranced diffusers,Molton Brown toiletries and slippers in the bathroom.Contemporary furniture and decorations.Well- kitted out kitchen.Spacious rooms,2 lovely roof terraces (Room 601).The list is endless!Another nice touch,was the information booklet,with helpful advice on supermarkets,transport services,local attractions and other ameneties.The reception area was relaxing and provided drinks and snacks.The two family members were lovely and nothing was too much trouble for them.I have already recommended them both at home and whilst in Barcelona.I would most definitely stay here again but on a romantic weekend next .Thank you for making our stay memorable.Unfortunately,our camera was stolen in Ciutedella Park but it did not spoil our visit to this beautiful city.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Evan Runolfsson","date":"2014-10-15 06:43:13 +0300"},{"content":"Not the cheapest place to stay, but very practical and functional for a family with 3 younger children. The location allows you to get to most of the major attraction easily and the tube is only 5 mins away. The apartments were clean, well furnished and the maid service very good - allowing us to just concentrate on Barcelona which was fantastic. Reception staff were very helpful","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Madalyn Miller","date":"2013-03-13 19:30:59 +0300"},{"content":"This is a 3* hotel, so we expected 'average' We were pleasantly surprised as we booked one of their suites for 3 people (me, wife, grown-up duaghter) expecting a 1 bed unit with sofabed. They gave us Room 316. Imagine our surprise when we saw it was a 2 bed; 2 bath; lounge & kitchen with machines. Unfortunately, besides cupboards, there was nothing else. No crockery/cutlery/glassware/ kettle/toaster. You get the idea. There is no room service, but the bar/cafe is open until 3pm and they were o.k. for me to take tea/coffee/food to the suite. They have the worst pillows I have ever tried (unsucessfully) to sleep on. No information book in the room and only Spanish TV. In conclusion, if you brought your own pillows (or used their very squashy ones) and didn't need to use the kitchen, this is a good place to stay, especially overnight if you flying the next morning.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Alysa Harvey Sr.","date":"2015-01-20 09:39:55 +0300"},{"content":"Very nice, modern hotel. Stayed there on April 7th and 8th 2012. They picked us up at the airport and were very helpful with advising us of what to do and see on our trip. Would definitely stay there again.","ratings":{"Overall":5.0},"author":"Mertie Zemlak","date":"2013-03-07 20:31:54 +0300"},{"content":"lovely, modern and clean hotel only 10min from airport.We found hotel taxi shuttle service was available for us free both ways[and out -with advertised service hours].Half hour journey on tube but very cheap at 1euro 50 [we purchased 3 day pass at 13 euro which was great for us staying for a few days]. Food was tasty-more than ample for breakfast,with cafe/restaurant serving fairly good choice menu throughout the day/evening. Room very spacious and clean with linen changed daily.Tv had couple of british chanels. Over all- good value- great hotel would stay again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Fleta Maggio","date":"2015-07-11 21:42:01 +0300"},{"content":"We stayed in this hotel two nights but we would never want to come on. Everything is perfect, the room was spacious, clean, well furnished and with all the comforts (even stocked the welcome kit). I can not judge the restaurant as I have not used it. Staff very friendly and helpful. The only thing that might scare you is the distance from the center of the city but with the metro at 2 minutes of walking, it's not a problem. I look forward to returning to Madrid to stay in this hotel again!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Miss Kali Mosciski","date":"2014-05-10 14:53:34 +0300"}],"public_likes":[],"vacancy":false,"description":"Bed and Breakfast steps from the beach. Comfortable rooms and suites.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}