{"title":"Birmingham (England)","name":"Premier Inn Birmingham Broad Street (Canal Side)","address":"Bridge Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47648,"lon":-1.90824,"accuracy":"ROOFTOP"},"type":"hotel","id":3621,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"We had a top-floor suite at the Monaco during Fourth of July weekend and loved it. The suite was very large with a comfortable bed, jacuzzi, two large flat screen tvs and a sleeper sofa for the kids. Our girls loved the huge window seats overlooking the river. The staff was very friendly, prompt and helpful. They gave the kids stuffed animals when we checked in and brought up a pet goldfish for us during our stay. The location was fantastic, right off Wacker across from Marina City on the river. We were in manageable walking distance to lots of kid-friendly spots: the American Girl Store, the Rain Forest Cafe, Cheesecake Factory, Hershey Store, Portillos, Millennium Park, the Art Institute and plenty of pizza places. The museum complex was also a short train ride away and it was easy to find a bus to take to Navy Pier. You couldn't see the fireworks from the hotel but we only had to walk a couple blocks to see them from the street. On the whole, I'd highly recommend this hotel.","ratings":{"Overall":5.0},"author":"Harold Weimann","date":"2013-12-10 09:23:43 +0300"},{"content":"I spent two nights at this wonderful Kimpton property for a romantic getaway weekend. The staff were extremely friendly. Our room was upgraded from a standard king to a larger room with a California King at check in. The room itself was spotless, nicely done with funky, yet tasteful decor. The oversized bed was extremely comfortable. Large bathroom with powerful shower pressure. The afternoon wine happy hour and w-ii is a nice touch. We also very much enjoyed two nights of cocktails at the adjacent bar and restaurant. The hotel is well located just off the Chicago River and almost anything you need/want to see is within walking distance, or a short cab ride away. Fast WIFI service that is also free (something not common at even the most upscale hotels). Our only complaint was the poor housekeeping service. Room was not cleaned until 2PM on our second day, requests for turndown service and extra towels took a couple of calls. The on site gym is tiny, but workable. I would definitely stay here again. This place is a winner.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Briana Morissette","date":"2013-08-02 23:24:43 +0300"},{"content":"We were able to stay at a promtional rate of $81/night, but would have considered it a good value at 4X that price. Location is perfect for tourists (a two minute walk to the river and to Michigan Ave, and very near the public transit loop). We never told any of the staff we were actually on a mini-honeymoon, but we were treated as if they did know that... very professional and friendly, with a few personal touches like treats delivered to our room daily. The room was average size, but extremely clean with very charming decor.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Serena Welch","date":"2015-08-13 09:55:13 +0300"},{"content":"I stayed at the Hotel Monaco the weekend of October 24th and had a generally good experience. The location is terrific, overlooking the river in a nice area close to restaurants and shopping. I stayed in a fifth-floor two-room corner suite with great views. My rooms were very comfortably furnished with oversized couches and chairs, two large flat-screen TVs, and three huge cushioned window seats looking out at the river. I enjoyed the large whirlpool tub with an ample jar of fragrant bath salts on the side. The downsides were a corner shower so tiny that I literally had difficulty turning around, a VERY limited room service menu, and construction noise during the night from the street below. This is a boutique hotel, so there is no bar or real hotel restaurant; if you go through a door at the end of the hall in the lobby you enter the South Water Kitchen, a casual-looking place that I didn't try. The hotel has a complimentary wine hour from five to six in the evening in the lobby, which is nice but rather spartan: the wine was accompanied solely by a dish of olives and a glass filled with breadsticks. There is nothing on the room service menu in the way of snacks or something light to tide you over to a late dinner. One other weak point was that my room did not receive turndown service on either of the nights I stayed there. On the second night I telephoned housekeeping a few minutes after 8:00 p.m. to request turndown service, as I was about to leave for a 9:30 dinner reservation. I was told that the hotel does not provide housekeeping services after 8:00 p.m. This makes no sense to me in what is supposed to be a luxury hotel. After all, not everyone goes to dinner at 6 p.m. in a city like Chicago. Other than this, my stay was quite satisfactory and the staff was pleasant.","ratings":{"Service":3.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Shannon Keebler","date":"2012-12-20 04:20:50 +0300"}],"public_likes":["Stacy Nitzsche","Muhammad Orn","Mrs. Lou Herman","Jace Swift V","Garrett Brekke","Krystina Larson","D'angelo Schowalter","Karson Dickens","Deanna Hansen"],"vacancy":false,"description":"This Premier Inn serves the ICC and faces a canal.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}