{"title":"Joshua Tree National Park","name":"Indian Cove Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$15 per night","geo":{"lat":34.09336,"lon":-116.15879,"accuracy":"ROOFTOP"},"type":"hotel","id":12926,"country":"United States","city":"Twentynine Palms","state":"California","reviews":[{"content":"My husband and I stayed here for our anniversary and had a very nice stay. We were upgraded to a Luxury Tub Suite (I'd sent an email letting them know it was our anniversary) and the room was lovely. The hotel is very new and the the staff was very friendly. We never at on property, but the menu looked good. It's in a perfect location in newly growing downtown Napa. There are so many restaurants & shops nearby. We spent one whole day just wandering around. The pricing was very reasonable - of course we were there in off season, so I'm sure it's more during harvest, but it was just perfect. The only reason I didn't give service an excellent rating was no one mentioned the upgrade or our anniversary upon check in. I had to call the property the day before to confirm they'd gotten my email from a few weeks prior about our anniversary and the person said they had received it and that they'd upgraded us. That was very lovely, but you would have thought they would have also said something to us at check in? But really, overall it was a great time. We'd definitely return.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Zita Feil III","date":"2015-06-28 04:33:45 +0300"},{"content":"Avia is truly a terrific place to stay. The front desk was very helpful giving us suggestions but we really loved the concierge who really took charge and gave us such wonderful recommendations to Napa and the tastings. Our room was beautiful and very spacious. Breakfast downstairs was memorable with the french toast and omeletes. I've worked in great hotels but I was blown away by the hospitality and sincerity when we asked where to go and what to do. NExt door is a great Italian restaurant as well. The hotel has a great wine reception as well.","ratings":{"Overall":5.0},"author":"Paula Greenfelder","date":"2014-12-30 09:57:57 +0300"},{"content":"Avia is everything the reviews say it is. The room was nice, the bed comfortable. Staff was warm and accommodating. The location is perfect. I have to say that in the one negative review the hotel has, the woman had a point. There is no sheering on the windows. There is some see though netting and black out curtains so you have dark room or totally open room. The sheering would be nice for privacy depending on the location of your room. I would definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Katarina Johns","date":"2012-11-30 06:38:08 +0300"},{"content":"Stayed 3 nights as a base for exploring wine country. Well located spot and a walk from the bars and restaurants of downtown Napa (which was a much more quaint and pleasant town than I had expected). Good service all round and the real treat was drinking wine sat in the rocking chairs next to the fire pit in the evening. Would recommend as a base to stay for a wine trip - use Beau wine tours and also we hired bikes from Napa outdoor adventures to do a self guided day in the wineries.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Jaylan Welch","date":"2014-07-06 08:35:47 +0300"},{"content":"The Avia was awesome and the staff is one of the best I have encountered in a long time (if ever). The hotel is in historic downtown Napa! It is a smaller hotel -141 rooms- with an eye to detail! I would highly recommend this hotel to my friends and family! And to anyone else heading to Napa!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nigel Wehner","date":"2014-10-31 13:38:24 +0300"},{"content":"We stayed with AVIA Napa for our honeymoon and were beyond satisfied. The staff are all very friendly and helpful. The rooms are chic and elegant. We stayed in a master tub suite and were very pleased. The shower and tub are both romantic and relaxing. The bed is extremely comfortable! I loved that the lights all had dimmers as well. Room amenities are great: the soap is the best bar soap I've ever used, and I love that they provide q-tips. They do free wine and appetizer tastings each afternoon, and the kitchen/wine bar is excellent. We loved the terrace with porch swings as well. I was hesitant with this hotel initially from reviews against its location, but my husband and I were pleasantly surprised. It sits in a cute area of downtown Napa, near shopping and restaurants. While you need car service or a rental car to get to wineries and restaurants in nearby towns like Calistoga and Yountville, the drive is very easy and self parking is free in the garage right behind the hotel (you can valet, but you're wasting your money, it's a 50 foot walk to the back side door). Dowtown Napa is very walkable from the hotel, we walked to breakfast and Oxbow Market. Overall, FANTASTIC stay. We will definitely return to AVIA Napa!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Kelsie Eichmann","date":"2014-06-23 20:14:29 +0300"}],"public_likes":["Jesus Jacobi DDS","Reed Nolan","Mr. Darrell Goodwin","Monica Hickle"],"vacancy":false,"description":"This campground is not accessible from the main park roads and may be reached only via Highway 62 and Indian Cove Road, between the North and West Entrance Stations. 101 sites. Water is available from the ranger station, and thirteen group sites are also available for $20/$35 per night.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}