{"title":"Downpatrick","name":"Denvir's Hotel","address":"English Street","directions":null,"phone":"+44 28 4461-2012","tollfree":null,"email":"info@denvirshotel.com","fax":"+44 28 4461-7002","url":"http://www.denvirs.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.3289,"lon":-5.7169,"accuracy":"APPROXIMATE"},"type":"hotel","id":37297,"country":"United Kingdom","city":"Downpatrick","state":null,"reviews":[{"content":"Travelled to Iberostar Quetzal based on trip advisor reviews and vale for money and it was one of our very best holidays. A special thanks to Gabriel who managed to plan a very short notice wedding (Less than 2 weeks) and everything went without a hitch. After many AI holidays for our budget which I guess would be mid range, Iberostar Queztal stood head and shoulders above many others. Amazing service, views, location, food, drink etc. Staff very friendly and weather was very good for 2 weeks in October (Only 1 day of stormy rain) transfer was very quick (Independent travel agent) only 6 people in mini bus. Best of all though our 2 year old daughter loved it. Regardless of which side you stay in, the hotel is big and the jungle in between makes for and interesting diversion on the way to getting food (Our favourite Chinese), bar service was good and it's easy to forget the bars by reception where service was always fast. Really would recommend this hotel to anyone. ** Room service included in an AI is really something you don't find in many other AI for this price **","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Carlie Stoltenberg","date":"2015-06-16 06:50:53 +0300"},{"content":"This was our 3rd Riviera Maya trip, second to an Iberostar, and first to the Quetzal. I'll avoid repeating what you'll find in most of the positive reviews here - the info provided here is quite accurate. Read about 15-20 reviews and you'll get the idea. A few people will find problems, but I suspect they are quite hard to please folks. We traveled with a group of our closest friends; 10 couples, all 30- to 40-somethings for a no-kids getaway for 4 nights. The thing that stands out the most for me is the service - the people at the Iberostar do their best to make your stay as enjoyable as possible. A few examples: 1) For our group, we were allotted 1 \"reservation\" for a 4 night stay. Not only were we able to get all 20 into a seating at the Japanese restaurant (even though they couldn't get us at the same table), we also managed to dine with big groups in the restaurants every single night. We just had to check with the concierge later in the day, and they did what they could to accommodate us. Steak house and Mexican were nice alternatives to the buffet (which was just fine as well.) Japanese is always fun - our group had both the top chef (most experienced), and the \"new guy\" who was shaking as it was his 4th time! no worries, food and fun was good. The \"sake\" was questionable, but fun to share anyway. 2) We are football fans, and our hometown team was playing on Sunday on TV. There isn't really a TV/sports bar anywhere on resort, but after asking the front desk, the StarFriends were engaged to help us out. They managed to open up the Disco (which has flat-screen TVs) and tune the game in for us. We were the only ones in the empty place, but they left us to enjoy. They even sent the bartender from the main bar over to check on us for drinks every so often - incredible service! Hats off - this is what I've come to expect from Iberostar. 3) The pool \"closes\" at dusk, but one night we were a bit rowdy and having a good time as a group. Security came by to check on us, but just to see that all was well and left us to enjoy the evening. They could have hassled us, but once they saw we were just having a good time, they gave us some smiles and moved on. (Well, maybe they were just checking out our wives, but that's cool too :) 4) Service staff will help in any way they can. Waiters kept an eye on us in the restaurants to bring special shots; bartenders would mix anything we wanted, and even put it in our insulated cups we brought. If you think the drinks aren't strong enough, just ask for an extra shot - they're happy to oblige! Whether you tip or not, they provide the same great service. However, as others have pointed out - these people work HARD so you can forget your troubles. Definitely bring some $$, turn 'em into pesos, and spread the wealth - even though they don't let on, you know they appreciate it. All in all another great Mexican trip. It's not a 5-star experience like you'd have in Vegas (food, accommodations) but it gets a 5-star rating for me for the experience that it is. In Vegas, you'd pay for 1 meal what it costs here for a whole day of food, drinks, and your room! Take some friends and go have a blast - the economy must be keeping the big crowds away.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Kenton Wyman I","date":"2014-11-09 04:31:02 +0300"},{"content":"To start we got this vacation at a great deal due to concerns over the swine flu and traveled with 19 people, however this wasn't even close to any reported cases the staff. The staff were great, and the restaurants were great as well. Whenever you want something they will get it for you immediately, or the staff will before you even think of it. The only things I didn't like was that during the day there was plenty to due with pool, beach, and booked excursions which I was able to do straight through the hotel in the main lobby at a reasonable price (swim with dolphins, horseback riding, visit to Chitzhen Itza, and snorkeling), however at night there is really not much to do. What I mean is that each day they have one show that lasts for hours on varying things, and they are NOT VERY GOOD partly because there are too many kids around to conduct audiences for the mature audiences. Kids under 18 will probably be very very bored at night, there were probably six children in our party who fell into this category who were complaining every night because there was nothing to do, this includes a 17 year old who was not able to hang out at the clubs at night with his brothers and sister, and cousins who are over 18. This group was not able to go into either category and I wish the hotel would provide something for them, Lucy's kid's club did events that were for very young audiences (under 7). Also there is an actual jungle inside the hotel, where howler monkeys, peacocks, cuccobarrows, turtles, flamingoes and lot of animals roamed free which was amazing to be in. Overall I really enjoyed this vacation, and really was an all inclusive, I never needed to have money on me during my stay since everything was included. The only thing I ask is that you tip the staff, who are always hardworking, most are Mexican and speak little English, but they try their best to please. Please visit","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Anastacio Kreiger","date":"2013-01-30 00:25:43 +0300"},{"content":"Funjet had this hotel w/airfare for less than $400 for 4 nights any day the end of June, so who couldn't resist the price? We have previously traveled to the Excellence in the Domenican twice and once to Cozumel on Carnival Cruise. The hotel was nice and clean. We had requested a non-smoking room on the first floor close to the beach. All were met, but the non-smoking, however like some reviews we could not tell that it was a smoking room, the bedding did not smell like smoke but also had to wait 2 hrs before getting the keys. A positive, was that the people on the beach actually walked away when you told them \"no thanks\" (tour people & hotel spa). We tipped the maid, and tried to give some to the bar tenders just $1, which they seemed way over excited about, apparently the whole 'all inclusive' takes effect because we noticed no one else tipping. We have been to other all inclusive but always tipped because we realized that an extra $1 or two really helps their low salary. One of the negatives would have to be the dinning arrangements (besides the taste of the cheap drinks and no bottled water available at bars to take to the beach). Depending on your stay is how many reservations you get. Well since we were 4 nights so we got 1 reservation. We tried to go back the other days at 4pm when they had openings open to everyone, but they would never have a table for 3 and the lady would not sit us at a table of 4. I guess as long as you are a party of 2 or 4 you should be ok, but we were really burned out on the buffet food, its pretty much the same for lunch and dinner, and after a day, its just too much. It would not have bothered us as much if our other trips had required the same, but the other all inclusive we have been to did not make you have a reservation, but this hotel feeds the Tucan and Quatel so I think they do not have enough room to do so. Highlights we liked outside of hotel: the $5 cab ride downtown to 5th ave where all the rest. (senor frogs) shops (cheap ones and also retail like diesel). The dolphin encounter was worth the $150 for my husband and 5yr old, and we also went to Xel-ha which was like a snorkel park. Both were worth the price and it was nice to leave to see the town. All of the staff in guest contact positions seemed to speak English well. Didn't use the kid club, never really saw any kids in it. Overall, we can't complain because of the deal we got on it, but next time we would rather spend more and not have to deal with reservations to eat and the atmosphere of the employee that hates their job but its a paycheck attitude. Although Cancun had a/c and concrete roads, we love Punta Cana way more. The hotel staff seemed to be a better/friendly mood, and they were able to bargain more out in town because they needed what ever money they could get. We felt that some stuff in Playa Del Carmen was over priced and they didn't seem to care if you left they were not that desperate to try to make a deal with you. So would I recommend it, sure if you get a good price. Ours was cheaper than Sea World or Disney and it included food & drinks. I can't imagine being there more than 5 days, we were bored. Getting a tan is great but it was hard for my son to play in the water. The waves were rough, and the rocks don't really stop the 'break' but that is a mother nature problem. Just take some extra $ to do some stuff, even the guy at the tour counter at the hotel said to make sure not to use your Credit Card unless you can see them swipe it. So we just pulled $ out of the atm, the front desk will break/exchange your $ for free.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Location":2.0,"Rooms":4.0},"author":"Mrs. Abdullah Smitham","date":"2015-05-27 21:30:50 +0300"},{"content":"The hotel itself was beautiful, the staff was great, and the food/drinks were excellent. The only complaint I had was peacocks. I had no idea peacocks make so much noise. They woke us up every morning. It was humorous but annoying after awhile. The monkey there ran past our hotel room at 2am and scared the $@!#% out of us. Overall, I didnt mind the animals. It was cool.. WARNING - DONT BE LURED INTO A EL CID TIMESHARE PRESENTATION AT THE AIRPORT. WHAT A NIGHTMARE!","ratings":{"Overall":4.0},"author":"Emil Volkman","date":"2015-05-06 23:17:01 +0300"}],"public_likes":["Chaz Roob","Pierre Schamberger III","Beaulah Koelpin","Hilda Rippin","Georgette Armstrong","Darryl Simonis","Albertha Rolfson","Harold Rodriguez","Krystel Schuppe"],"vacancy":false,"description":"Small hotel with six bedrooms. Established as a coaching inn in 1642. Also has a pub and restaurant.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}