{"title":"Paris/15th arrondissement","name":"Hotel Sublim Eiffel","address":"94 Boulevard Garibaldi","directions":"Métro Sèvres-Lecourbe","phone":"+33 1 40659595","tollfree":null,"email":"info@sublimeiffel.com","fax":"+33 1 42730713","url":"http://www.sublimeiffel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.845241,"lon":2.310056,"accuracy":"ROOFTOP"},"type":"hotel","id":21656,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Have stayed in several Hampton properties in Vegas but first time at this one. Clean and fresh, friendly staff and convenient to the strip and Henderson. Only drawback is McCarran runways are within spitting distance. When LAS is departing on the 25's you WILL hear the engines on takeoff. I travel with earplugs so that mitigated most of the noise.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Everett Boyle","date":"2013-09-01 12:02:10 +0300"},{"content":"Down town Las Vegas certainly ha sa lot to learn from the El Cortez. This hotel being as old or older than most down town renovated and expanded. Boyd Gaming needs to funnel some money into it's proeprties both down town and of fthe strip. El Cortez now is liek a strip proeprty that go lost. Great service, beautiful and friendly. Theonly concern would be that the public area management for cleaning needs to come on board of the direction they already went. A little more detail cleaning. Great job though. We enjoyed it to including the Food and Beverage.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Kirsten Dietrich","date":"2015-02-22 13:59:33 +0300"},{"content":"Our first stay off strip. We spend so much time gambleing and partying on Freemont thatwe wanted to stay there. Picked El Cortez because of price. Read all the reviews beforehand. Wanted to see for myself. Valet parking nice friendly clean area. First impression when I walked into Casino nice decor clean maybe a little Too much pumped in scent. Was not smokey. Check in was nice the guy was friendly it was after midnight. We did upgrade our room To a strip view in tower. Elevator was quick and clean secure have to use room key which is differant but safe. Short walk to rooms. Clean hallways and nice decor. Room clean great lighting options. Clean beds I checked for critters everything Was clean. Nice decor reminded me of staying at a bed n breakfast. Love seat and coffee table over looking a nice view. Grest place to was people and distant mountains. Bathroom was small sink area nice separate from toilet and bath. Bath area was nice like my old house homey. Shower head felt like rain very relaxing. Cool little window that opens inside tub area. First room I have ever had that had 3 waste baskets love not haveing to walk to find one. Room had no iron but did have a blow dryer. Walk to Freemont was iffy just stay in a group or come back to El Cortez before 11pm. It is a 2 block walk before next casino.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Location":2.0,"Rooms":4.0},"author":"Ms. Annamarie Jerde","date":"2013-11-24 18:28:48 +0300"},{"content":"I have nothing but good things to say about this hotel and casino. The location is on Fremont and free parking so I never had to drive. I was surprised at how spacious the room was with a queen size bed, 2 closets, a sectional type couch, desk area, coffee maker, hair dryer, complimentary shampoo, conditioner, lotion, and soap.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Yessenia Powlowski","date":"2013-07-27 19:48:52 +0300"},{"content":"My hubby and I recently returned from a 5 night stay at the El Cortez Hotel & Casino in Las Vegas. A birthday present for him. We were going for the car race and thought it would be closer to access a shuttle to the track and I have read positive things on TA about the gaming so thought we would give it a try. I chose a junior cabana suite thinking it would be worth paying a little extra. The decor was modern and funky. Fun to hang out in the room although a little small for a suite. I agree with others on here that the slots appear to be looser than other hotels we have stayed at in recent years and the blackjack pays 3:2 but in our experience quite hard to beat the dealer/house. Most staff in the casino were pleasant but others appeared to be tired and uninterested in their job or the customers in front of them. We found the staff in the Cortez cafe and Flame restaurant were great. It was the hostess in the Flame restaurant that retrieved the information for the shuttle to the race track when we asked at dinner although the bellman and front desk staff had been unable to do so earlier in the day. All staff were very friendly on our visits to both restaurants. The food was exceptional in the Flame restaurant. I would say the lamb chops are a must try as is the scampi and linguini. Meals in the cafe were great and excellent prices and you can use your comp. dollars in both restaurants. There is a walkway from the El Cortez to Freemont that has been refurbished which made it much less scary than I expected. I must admit this was one of my main concerns about staying there was the walk to Freemont at night as it seems a bit out of the way. Looked like a road a less traveled and not so well lit. I am not normally a fussy person or one to complain but this time I felt strongly about the poor housekeeping service and this place being advertised as the only \"boutique hotel\" in the Freemont district. The first morning, inspite of the Do Not Disturb sign posted on the door the maid was trying to enter the door to our room as I was walking out of the bathroom which she apologized for as she looked down at the sign. Thank goodness I was dressed. I assured her we would be leaving soon. Two days later the maid was knocking loudly on the door at 0930 hrs, again I informed her we would soon be leaving soon. I thought Vegas was about staying up late & sleeping in but not here I guess. It appeared the bathroom? or the toilet was being cleaned, we doubt the shower was cleaned, but the water was left running in the toilet on two of the five days. We arrived back about supper time and could only assume it had been running for several hours as it was obvious that the maid arrives fairly early in the morning. So much for water conservation in the desert. Second to our last day we returned that to a poorly made bed, dirty glasses and a dirty coffee cup left on the counter. We wanted to relax and have a drink in our room before heading out and thought a clean glass might be in order, I called down to the front desk who put me through to housekeeping and they said they would send someone up with clean glasses. This person did not arrive so when my husband went out for his cigarette he complained to the woman at the front desk about our disappointment in the poor service and within about 10 minutes the maid was at the door with glasses. By that time he had washed them in the bathroom sink and turned her away in frustration. Too little too late. Boutique hotel maybe but not the service one would expect, Next time I will pay less and return to one of the hotels I have stayed at in the past that have provided much better service for less money. I might return to the El Cortez for dinner and a little slot play but I would not stay there again. There is way too much competition in Vegas these days to not expect decent housekeeping service and clean glasses in your room. By the way very friendly security staff outside the cabana suites building 24/7 which we appreciated as you have to walk outside and cross the street to this building. Overall had a great time in Vegas as usual.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Roxane Hane","date":"2012-08-10 10:12:55 +0300"},{"content":"This hotel is about a block from the \"old\" strip. Check in was slow. The room was a good size, had 2 comfortable queen beds and a slightly worn couch. Cleanliness was not a problem, though. The in room safe was a nice feature. Flat screen and satelite channels included. Overall, nice comfortable and quiet. Free valet parking and free self park. I would stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":3.0},"author":"Leon Gaylord","date":"2013-04-24 02:08:23 +0300"},{"content":"After staying in a big 5* Hotel center strip the last time I visited Vegas I wanted to trie something different, after a tip and carefully checking out this site I booked El Cortez. It is really great value for money, friendly staff, 24 hour coffeeshop right downstairs with good food for an insane low price. The location of the Hotel was also above expectation with only a 5 minute walk to Fremont street where also the bus stop is which will take you to the strip or you can easily spend a whole day in that area. And yes, there where also some questionable figures walking around but I never felt unsafe. The security guards from the Hotel and the downtown area are doing a great job, even patrolling the Hotel floors. The Hotel dated back from 1941 and althoug it was renovated, it's still pretty old, so don't expect too much (except clean rooms of course) of it.If you are taking you're date on a romantic trip to Vegas or planning Honeymoon I would recommend staying at another Hotel.","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Billy Bosco Sr.","date":"2015-10-20 08:01:37 +0300"}],"public_likes":["Edward Halvorson"],"vacancy":true,"description":"Funky decorated rooms located within 15min walk from the Tour Eiffel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}