{"title":"Inverness","name":"Inverness Youth Hostel","address":null,"directions":null,"phone":"+44 870 004 1127","tollfree":null,"email":null,"fax":null,"url":"http://www.syha.org.uk/hostels/highlands/inverness.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.47973,"lon":-4.21101,"accuracy":"APPROXIMATE"},"type":"hotel","id":12236,"country":"United Kingdom","city":"Inverness","state":null,"reviews":[{"content":"Stayed a couple of nights during trip to S. Florida and Keys. Nice, fairly new building. Business center w/ 3 computers and printer was convenient. Staff was great - maintenance guy volunteered parts and tools to help me fix a broken wheel on a heavy suitcase - saved me from having to carry it around all week. Only (very minor) complaint is the pool/hot tub. It's too small to be a pool, but not nearly hot enough to be a hot tub. Most hotel hot tubs aren't hot enough, but this one was just lukewarm.","ratings":{"Overall":4.0},"author":"Matilde Bartoletti","date":"2013-07-07 14:34:22 +0300"},{"content":"While the hotel wasnt perfect it isnt what people make it seem. If your looking for a place to stay thats inexpensive and decent you can stay here. If you are expecting to stay in an upscale place for cheap, go somewhere else. Its clean and the beds are comfortable.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Madalyn Hermiston","date":"2015-07-09 10:26:07 +0300"},{"content":"First of all, we \"won\" this trip to Orlando and the Ramada Gateway was the hotel we apparently \"won\" a stay at.....Our room was directly on the parking lot toward the front desk area of the hotel. We were in the older motel looking part on the first floor. I'm not sure if the rooms in the tower of the hotel are better but the older motel style rooms are bad....Old decor, carpet, and finishings. I don't think there's any insulation in the walls because we could hear every single car or person going by our room at all hours of the night! Also, the people above us doing what people do in hotel rooms :) We asked for an extra blanket and were told by the front desk it would be there in 10 minutes. After an hour of waiting I personally walked to the front desk to see if I could just grab an extra blanket. Nope....I was told they don't have a key for the closet and I would have to wait for the security guard to bring it. Eventually it did come about 20 minutes after I returned to the room. It rained one day (luckily it was our last day) and water was dripping down in the ceiling onto our bathroom light...doesn't seem to safe. The cafe/deli are was ok...good chicken wrap. We bought a good looking pudding cup from the fridge and it had mold in it.....we didn't eat at the cafe/hotel anymore :) I felt bad for the lady working the counter. She was really nice and the best part about this place. WiFi in the lobby only. I know I won't return to this place.....","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":3.0},"author":"Delia Will","date":"2014-05-16 10:12:01 +0300"},{"content":"Just stayed a week in this hotel. A little intimidated on first arrival but soon relaxed. The hotel has two areas a tower and motel style rooms. I stayed in the cheaper motel rooms. When booking I was offered a free upgrade I thought this meant to the tower but no was just to a pool view rather than a parking view, pros and cons with each the pool side can get noisy so if you want peace parking rooms better also if you have a car great to be able to drive right up to your room, The rooms quite large two double beds air con and flat screen tv. Coffee maker and basic bathroom with shower. Note wifi not in all rooms do ask for a wifi room if you need this or access by pool, courtyard and loby all free and fast. I must say the cleaners do a great job here the room was spotless and cleaned every day. Although a basic hotel the cleaning standards in the room were excellent! Shuttle service to all parks and outlet shops all free limited times but works well. And saves a fortune on car hire parking and taxis. Nothing much in the area other than quick service buffet restaurants a few discount shops etc. I would stay here again as a great stop for Disney. The hotel is great base for exploring, if your looking for a luxury resort to chill in for a week this is not the product on offer here! But does a great job as a Place to sleep after a days fun at the parks and attraction. Finally value for money is excellent we paid less that £20 a night. The free shuttles alone paid for this (last time in Orlando we paid £9 a day each for shuttles!)","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Vida Goyette","date":"2014-02-01 04:32:05 +0300"},{"content":"Just checked in . So far, so good, except for the fact that the advertised \"internet available throughout the hotel\" is only available in the lobby. Not so good when you require the internet for work.","ratings":{"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Connie Tremblay","date":"2012-03-17 11:03:23 +0300"}],"public_likes":["Birdie Trantow","Pearl Cassin"],"vacancy":true,"description":"Victoria Drive, A modern 4 star hostel with excellent facilities. Some small rooms en-suite, internet, laundry. £10.75-13.50/5.00-12.00 (adult/child). Open all year.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}