{"title":"Swindon","name":"Mercure South Marston Hotel","address":"Old Vicarage Lane, South Marston","directions":"from Exit M4 (J15) and follow A419 to Cirencester, straight over roundabout, then take exit on left signposted Oxford (A420), turn right at next two roundabouts, stay on A420, cross the roundabout, pass the police station on left, pass the Esso garage on left, hotel is next turning on left, signposted to South Marston","phone":"+44 1793 833700","tollfree":null,"email":null,"fax":null,"url":"http://www.southmarstonhotel.com/","checkin":null,"checkout":null,"price":"From £55","geo":{"lat":51.58891,"lon":-1.7194,"accuracy":"APPROXIMATE"},"type":"hotel","id":28970,"country":"United Kingdom","city":"South Marston","state":null,"reviews":[{"content":"The hotel was well situated in the financial district. Staff was incredibly friendly and even the cleaning staff would greet you. The lobby was small but well appointed. Rooms were good although the glass door on the bathroom did not lend for privacy on a family trip. Hotel has 3 small cardio areas and a good reading room that serves as a bar on weekends. Rates appear to be steep but you can find good weekend rates. Close to South Street Seaport and other financial district tourist attractions, as well as Chinatown.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":3.0,"Service":5.0},"author":"Lexus Jakubowski","date":"2015-08-26 21:56:35 +0300"},{"content":"The Gild Hall is really nice. Luxurious, comfortable, quiet, and close to the public transportation. The employees are very friendly and do their best to accommodate you in anyway possible. My room looked really nice, its had very interesting decor, check out the website to see what I am talking about. Its like a modern retro kind of feel, I can't explain it, but I loved it. My room had an iPod dock, bath robes, and all the fancy stuff hotels provide. The only issue I had was my room phone didn't work so I had to use my cell phone to make calls. Other than that my room was spectacular. My stay over all could've been better. I went to the Libertine Restaurant which is a part of Gild Hall and I wish I didn't. I called them every 10 minutes for about an hour before I planned on arriving and no one ever picked up the phone. When I finally went down I was told there was a 25min wait. Which I could've avoided if they picked up the phone. So after the 25min wait turned into 40min, I was upset and went for a walk. walking past the restaurant window I noticed there were three open tables. At this point I wanted to leave but my fiance insisted we stay; so we stayed. The manager seemed nice, but the waitress made us feel like she had better things to do with her time. The food was great though. I'm a sucker for good food, so I kinda forgot about the horrible service when I started eating. So to sum it up: Gild Hall is great stay, but beware of the Libertine.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Nelle Hammes","date":"2012-05-02 17:09:10 +0300"},{"content":"Gild Hall really impressed when my girlfriend and I stayed there last month. The service was great, room was spacious and bed was super comfortable. This hotel is located in the heart of the financial district, but succeeded in making us feel like we were at home. It was convenient for all of the trains b/c they all basically converge on Wall St and Fulton St. Far and above better than a standard chain like the Hilton or Hyatt and a great deal, too. Highly recommended - we'll be staying there next time we're in NYC.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Hermann Adams","date":"2013-08-11 23:43:27 +0300"}],"public_likes":["Daryl Heaney","Roscoe Leuschke","Esmeralda Kovacek","Imani Witting","Layne Bashirian III"],"vacancy":false,"description":"Hotel just outside Swindon with fully equipped gym and 23 metre indoor swimming pool, as well as health and beauty spa. Special Spa Break from £75.00 per person for one night including three course dinner, full English breakfast and choice of beauty treatment.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}