{"title":"Malibu","name":"Malibu Country Inn","address":"6506 Westward Beach Rd","directions":null,"phone":"+1 310-457-9622","tollfree":"+1 800 FUN N SURF","email":"info@malibucountryinn.com","fax":"+1 310-457-1349","url":"http://malibucountryinn.com/","checkin":null,"checkout":null,"price":"$155 to $290 plus tax","geo":{"lat":34.0166,"lon":-118.81658,"accuracy":"ROOFTOP"},"type":"hotel","id":17308,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"The staff at the resort is amazing. Everyone was smiling, friendly and attentive the entire week. The beach has been restored beautifully.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Hector Reinger","date":"2015-07-05 07:27:21 +0300"},{"content":"Traveled many times to inclusive resorts, this was the worst. Rooms were disgusting! Bathtub and shower curtain had mold all over it, sink had a film of mold and was gross. Soap dish was moldly! Toilets backed up consistanly, because you had to throw your toilet paper in the trash can. Pool was filthy, pool lounge chairs were covered with seagull poop and were never cleaned. Wouldn't tell my worst enemy to stay there.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":2.0,"Location":4.0,"Rooms":1.0},"author":"Nya Emard","date":"2012-12-26 16:46:45 +0300"},{"content":"I have read alot of reviews about resorts and found people just generally like to complain. For example; when I read the reviews about the Riu Jalisco in Nuevo Vallarta there were some complaints about the property and the food, however I found it to be a wonderful resort, good food, beautiful property, great rooms, etc. So when I read the complaints about Allegro Playacar I just thought they were the same, very picky people complaining. Not So! The food really is bad, and it is the same every night, they just change the names depending on if it is French night, Carribean night, etc. Breakfast was okay, the other meals were not good. I actually came home lighter, which is usually hard to do with 3 buffets a day. The beds really are hard, they are a mattress laid on a cement slab. You really can't flush paper down the toilet. The beach really is non-existant. On the plus side; the grounds are well kept and the staff is nice, but that didn't make up for the bad food and bad rooms. We had a 6 day package and I actually paid a fee to come home 2 days early.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":2.0,"Rooms":1.0},"author":"Darryl Boyle","date":"2013-01-30 10:43:39 +0300"},{"content":"Nice hotel. Its bedrooms and the F&B deparment are 3* according to european standards. Common areas and leisure facilities are pretty good, though. If you plan to make excursions and not to stay in the hotel more than 2 days, then its a perfect choice. Mostly taking into account the price!","ratings":{"Overall":4.0},"author":"Miss Sherman Beatty","date":"2013-11-29 15:24:30 +0300"},{"content":"Our family had stayed twice in a different resort on the same beach (Reef Club Playacar). This was our first stay at Allegro Playacar, and there was no comparison. We traveled with two kids (10 + 12) and had a great time. The staff was always friendly and helpful, beginning at the reception, to all the waiting and entertainment folks. The property is beautiful, and kept very clean. The rooms are comfortable with good beds. If possible, ask for a room upstairs, which offers a little more privacy. The food was excellent. People come to expect a wide variety of food at dinner time, but even at lunch time, there was a full buffet, with anything one could possibly expect. This resort offers something for folks that want a quiet, relaxing vacation, as well as those that want to be active and entertained. We strongly recommend that you visit the various Mayan sites (don't miss Coba), as well as the extraordinary 'Selvatica' zip line tour through the jungle. Make the Allegro Playacar your place to stay on your next vacation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Woodrow Ritchie","date":"2012-02-24 07:59:36 +0300"},{"content":"we just returned may 02 from a week at this resort and have nothing but positives despite the beginning of press on the h1n1 outbreak. Great value for the-price far below any other area 4 stars. Excellent food-buffet and a-la-carts. Good variety and freshness. the outdoor grill at the pool everyday was great! beach was a washout but neighbouring resorts have great beaches you can frolic in all day without any trouble. the service throughout the hotel from front desk to bar service to maids was outstanding. pool was clean and well maintained with lots of seating always available. Only negative was that there was only 1 bartender at the poolbar most of the time so long line-ups sometime but no big problem. All in all great time had by all!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Providenci Koss","date":"2013-03-05 05:39:15 +0300"},{"content":"This resort is great for the price, it is not very large but you have the ability to have facial recognition by staff. The resort overall is just what it is listed as \"3 Stars\", If you want luxury beyond your wild imagination go next door to the Hideaway and air out your wallet!. The resort was hit hard in the past couple hurricanes and they did their best to rebuild and improve it. This was the first resort I stayed at 7 or so years ago and I have been back 4 times since. I purchased my vacation club membership here and I have totally benifited from it ever since! people talk bad about the \"Time Shares\" but It is the greatest purchase my family has made. Great night shows, beautiful views and good times.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Torey Flatley","date":"2013-12-29 23:50:06 +0300"}],"public_likes":["Otha Rath"],"vacancy":true,"description":"A charming Cape Cod style hotel tucked along the beachside bluffs of Malibu.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}