{"title":"Yosemite National Park","name":"Crane Flat","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.749802,"lon":-119.800272,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33896,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"Paradisus Paradise My boyfriend and I went to the Paradisus Punta Cana from May 8th to May 15th and had a great time.Check in was very easy. We were greeted by the bellhops and we went right to the check in. I think it took five minutes. The bellhops then brought our luggage to our room with the little golfcarts that they have around the resorts. As our bellhop brought us to our room, he toured us around a little and showed us what we needed to know and gave us tips. When we got to our room, we found it was very spacious and lovely (unfortunately, we didn't figure out how to put on our airconditioning until Sunday, but that was our own faults for not asking.). We had a corner room. the balcony was gorgeous (even better if you have a second floor room). The mini bar was stocked with Sodas and Waters, but I wrote a note and spoke with our maid and she took the sodas our and put in more water and beer (Heineken and El Presidente). It is helpful to speak some spanish, and the maids will be very generous if you make an attempt. I left a little gift and a dollar or two tip and they were great!The resort is very spacious. We did get lost the first day. There are signs at the major intersections as well as security to direct the golfcarts and maintenence vehicles. Once you get your directions set, then you can figure out where to go. The food was good at the restaurants. All of the restaurants use bottled water for drinking water as well as for the specialty drinks, so there is no need for concern on this part. The food is not always labeled at the buffetts, so if you have food allergies you may want to be careful. The menus are not always translated perfectly (appetizers in spanish is entradas, but they are listed as Entrees in english, so that was a little confusing, also camarones are shrimp but sometimes you would get squid instead!). Once again, it helps to have a spanish dictionary if you aren't familiar with the language.The beach and the pool were awesome. There is not a lot of service on the beach for drinks, but we did not find that a problem. We were more than willing to get up, walk around and see what was going on anyhow. You can get bottled water at the beach and pool bars as well. The pool bar staff and the beach bar staff were very accommadating and always had a smile, especially if you were kind to them. We didn't get the little beach beds under the covers but there were plenty of chairs. Also, we got up at 5:30 to watch the sunrise one morning, and we highly recommend that! Very beautiful!We went into the casino on our first night and only walked in and walked out. We are used to Foxwoods and Mohegan Sun, so someone who is unfamiliar with casinos may find this fun. I won't discourage you from checking it out, but we didn't find it interesting. When we walked past the fun club we found no one there, so hung out in the lobby bar. Most nights we were asleep by ten as we were just so tired, but we did try and check things out.The only restaurant we did not check out was the Chinese, otherwise, we found all the others pretty good. There are limited menu options on each menu, but since you have so many restaurants to choose from, we did not find that a problem at all either. Being open to trying new things is a must. If you are looking for American cuisine-burgers, fries you may be disappointed (as one other guest was that spoke with us).We did do two little trips. We did the Caribbean Festival Snorkeling, but found that there were too many people for a small area. If you haven't gone snorkeling before you may find this interesting, but if you are a person who has done a lot of traveling you may find it boring. The staff was very nice and accommodating however, and tried to make the trip fun. We enjoyed it, but were not over thrilled by the trip.We also did the ATVing with Ranch Nuevo which was excellent! Highly recommended. We went at 8am (we are early risers) and had our own trip with just us and our Tour Guide. Going to the Cave and swimming there was a once in a lifetime experience. The water was So clear, and the locals will speak with you as well. There is a store on the way that you have to stop in, and our tour guide was nice enough to tell us not to buy anything there because it was very expensive. We did buy a couple things by the cave (a lot of the stuff looked used or found but they were very kind and we haggled with them just to support them). The beach in Macao was also beautiful and we stopped and swam there for a bit too. Another little table was set up for selling items and they offered a free necklace. A lot of the store owners will offer free gifts so you feel bad and buy something. We usually did, but you really have to bargain with them! Also, tip your tour guide! They don't make too much but are very happy to speak with you about everything!Shops-be careful. If you walk on the beach, we had a lot of shop keepers that were aggressive. The best thing to do is say that you don't have any money with you (but that doesn't always work). We went into the Bavaro Beach shops, and really had to haggle too. All the shops have basically the same stuff, some a little less, some a little more, but all trying to get out as much money as possible. Be kind and they will be kind to you. We made the mistake of saying we would be back, and they would wait for you. So, be careful. Also, don't wear any jewelry when you go (or anything expensive) because they will size you up for how much you can afford!This vacation is for the open minded. If you are expecting people to speak english all the time and American food, honestly, it is not for you. If you are open minded easy going, you will be all set!! Enjoy!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Sydnie Watsica","date":"2013-06-01 03:54:41 +0300"},{"content":"Loved our Stay Here! My boyfriend and I stayed at this hotel and loved our stay there. We didn't really participate much in the hotel activities or outside excursions so I can't comment on either of those items. But we thoroughly enjoyed sitting at the pool or beach and reading a good book. We had great weather except for the first day, but we didn't let it dampen our spirits. Overall, the service was great and we enjoyed all of the restaurants located on the property. If you stayed longer then a week you might get bored with the selection, but we liked having so many choices of cuisine to choose from and for the most part we always had a great meal.We seem to always compare this vacation to all of our others and so far this was our favorite one! We hope to go back some day.We even considered having a destination wedding there if that tells you how much we loved it!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":3.0,"Rooms":5.0,"Location":5.0},"author":"Kenyon Hermann","date":"2015-05-09 16:10:40 +0300"},{"content":"Loved it! I stayed at this resort the week of February 16th to the 23rd. I had read some reviews on the site, and was a little hesitant, but my worries were calmed as soon as we saw the beautiful resort. This place is unbelievable. The grounds are so well maintained, the beaches are cleaned every morning, and you don't even have to worry about stepping on seaweed. It truly was paradise. Upon arrival, we were served ice cold champagne in the Royal Service lounge, which was wonderful after the hot bus ride to the resort. We were told that only one of our rooms was ready early and that the second one would not be ready until 3 pm, which was check in time. It ended up being ready around 4 30. Waking up the third day, our air conditioner was leaking, and there was a huge puddle across our floor. We called down to the front desk, and they sent someone up within the next hour to take a look at it. We were informed that the problem was worse than they had originally thought, and we could move rooms if we wanted, which we did.The staff was extraordinarily nice. Everyone was smiling constantly. I would 100% recommend the Royal Service, you're treated so much better when you have it. Also, if you tip well, and frequently, the service will be MUCH better.The service at the bars is excellent, however, service in the restaurants is definately lacking. The first night we went to the Italian restaurant, which took almost 2.5 hours to finally complete our meal. Unacceptable when all we ordered was an entree, no appetizers. The steakhouse was a little better, the French restaurant being the best of all of them. Apparently its pretty tough to get a reservation there, so make sure you book as soon as you get to the resort, ITS WORTH IT!!! The filet is one of the best I have EVER had, and the service was very good.The drinks would be better if they were made with fresh fruit, instead of slushee machine slush, however they were decent.The beds on the beach were amazing, but ignore the rules and reserve one early in the morning, or you'll never get one.Overall, it was an amazing experience, despite the few problems we had, which were resolved fairly quickly.I would recommend this resort to anyone!!Enjoy!","ratings":{"Service":4.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Antonio Wintheiser I","date":"2012-03-30 17:10:19 +0300"},{"content":"Ehhhh... The resort was OK, but in my opinion not worth the money.Check-in was smooth. Room was ready at 3pm like promised. I went with a group of 50 for a wedding, and requested we be somewhat near each other which was not accomodated - we were spread out all over the resort. This place is huge...HUGE. The walk from the lobby to the main pathway itself is long. There is a tram to take you around, which comes whenever it wants. Make sure you have everything you need with you when heading to the beach or pool because it's a long way back. The pool was really nice and the beach/ocean was great - definite pluses. The food wasn't that great - repetitive, which is common at an all-inclusive but the choices overall were limited. The best meal was at the French restaurant, which was for the wedding reception - not sure if that made a difference. Drinks were very good. I didn't care for the service/attitude of a good portion of the workers - some were very nice, but others were unfriendly or a little aggressive, especially if I was without a male friend. Room was fine, had a nice little patio. My friends had the Royal Service and we still had a nicer room.I wouldn't recommend this resort. And I don't think I would go back to the Dominican Republic again (three in our group came home with scarlet fever). It was way too expensive for what you get. I'm sticking with Mexico, especially the Riu chain - food good, hotel nice, workers great, good price.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":1.0,"Rooms":3.0,"Location":1.0},"author":"Emory Sanford","date":"2015-03-23 04:44:30 +0300"},{"content":"Almost a perfect place!! Our family of five adults just returned from the PPC and we had a wonderful time! We would rank it a 4+ star resort.The only negative things about the resort were:1. The front desk staff. Other than the young man who first checked us in, the rest of the staff were very unfriendly, slow, and spent more time talking to each other than serving the waiting people. The man who I returned our room keys, etc. to was just nasty! No excuse for such behavior either.2. There were no organized activities for teenagers and young adults. My kids are 20  24 and are used to a more fun and active atmosphere. Now obviously for some people this would not be a negative feature, but even we three older adults noticed a lack of a fun rapport between the staff and guests. This was especially obvious with the different bar staff, regardless of tips.3. It is very very spread out and can be confusing to get around. 4. The pathways are very slippery and the steps indoors are not clearly marked. An 80 year old man took a terrible fall as he was waiting to check in on stairs that should have been more visible.5. Access to the pool tables and air hockey. These are in a room that is often used for other things: karaoke, children's activities, etc. We all would have enjoyed many more games of pool had the tables been elsewhere.The positives far outweigh the negatives though!!!1. A la carte restaurants. Unbelievable choices and options. We ate dinners at the Italian (twice), French, Mexican (twice), Japanese, and Steakhouse restaurants. All but the steakhouse were exceptional! Others we spoke to had only good things to say about the Brazilian and Chinese restaurants as well. The best food we have ever had at a resort and we have travelled extensively. The decor of each restaurant was beautiful and distinctive, the waitstaff and hosts gracious and efficient.2. Alcohol options. We drank wonderful white wines, champagne, liqueurs, as well as beer and other mixed drinks.Presentation of food and drinks indoors was elegant and professional. Outside we brought our own insulated mugs that were filled without any problems. 3. The beach. My word, it was just perfect! White sand, no rocks or shells of any kind. A small amount of algae, but that is always the case. A steady surf that for us provided great fun for body surfing on boogie boards. Long stretch to walk for hours.4. Pedro the drink runner at the beach, Truly the sweetest young man who spoke not a word of english, yet managed to communicate brilliantly. Brought us drinks from the beach bar each day, and even a small table to put them on. He even pulled a beach bed down to the sunny area for us to lie on. 5. Access of beach chairs and beach beds. This was a very busy week but we always managed to get lots of chairs and the occasional beach bed without having to reserve them ahead of time!6. The pool. Clean and clear and refreshingly cool. A little noisy at times from the pool bar music, and the chairs there did need to be reserved early. The swim up bar was a nice option.7. Breakfast and lunch. The Hibiscus buffet was our choice each day for breakfast and had a huge variety of options to satisfy both North American and European guests. For lunch we ate either pizzas to go from the Italian restaurant (thin crust and very good), french fries and hot dogs from behind the pool bar, or a full buffet meal at the Caribbean grill next to the beach. It had a wonderful assortment and great pasta made to order!!8. Rooms. We had two in building 10, which was right next to the pool bar and within easy access of the beach and most of the restaurants. Neither had any stuffy smell or bugs of any kind!9. Maid service. Our maid was a sweetheart, she even gave us little gifts during the week! 10. The bellmen. Hector was a true gentleman and the rest of the men receiving the luggage and loading and unloading the many taxis and buses were friendly and fast. After my nasty experience with the checkout guy, thank goodness our last impression of the PPC was the bellmen wishing us a great trip and encouraging us to return!11. Raphael Silva transport service. I prebooked transportation to and from the PPC (two separate arrivals because my son arrived later) and the driver was there waiting each time promptly and with good quality vehicles.12. New Years Eve. From dinner, to the Christmas show, to the fireworks on the beach, it was a magical evening!!13. Shows. Most were wonderful, high energy and great!The Paradisus Punta Cana is a wonderful resort!","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":1.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Emory Doyle","date":"2013-08-20 06:49:03 +0300"},{"content":"Great Anniversary Trip ACTIVITIES: Scuba Diving was included which was a great treat for us as we were expecting to pay quite a bit to get in several dives. We thoroughly enjoyed the rock climbing wall as well. The horseback riding was fun but the helmets needed some cleaning. Take advantage of all the activities that the resort has to offer!STAFF: All of the staff was extremely friendly and willing to help. We did not sign up for Royal Service so we're not sure what we missed with that, but we thought that we received excellent service none the less. Bring a lot of one dollar bills for tipping.RESTAURANTS: El Romantico and the steakhouse were fantastic. The Japanese restaurant was very good but not as good as the other two. The Chinese was also very good. Our only complaint was that when we asked for decaf coffee we were brought a cup of water and a jar of decaf instant made coffee. We ate lunch at the Italian Restaurant a few times and got take out boxes at the buffett restaurants the other days to go eat on the beach.SUMMARY: We had an excellent relaxing time and will definitely be back with friends and family next time.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Alexie Macejkovic","date":"2013-03-10 00:49:01 +0300"},{"content":"Paradisus severely lacking. Stayed at the paradisus for our honeymoon sept. 18-24. We arrived at the Paradisus around 4pm on the 18th and were greeted with a strawberry fruit drink while checking in, in the expansive, gorgeous open air lobby. Upon arrival to our room we found a beautiful arrangement of towel figures upon our bed along with Good night spelled out in flowers. Very nice touch.......until I went into the bathroom and found it infested with ants. I called the bellman back along with the representative that checked us in and was assured it would be taken care of while we went to get something to eat. Upon searching for somewhere to eat we discovered that the place was like a ghost town(not a bad thing) and that the only place to eat was at the italian restaurant. One restaurant open at 4:30 pm? Not exactly my idea of exclusive service and definitely not mentioned during booking or in the brochure. Having no choice, Italiian it was. The food I ordered was not the food I recieved and the pizza was less than acceptable. Upon further investigation I found out the resort was operating at less than 20% capacity. Returning to the room I was disappointed again to find that our insect infestation problem was not addressed. I called the front desk and was told someone would be out immediately. Within 5 minutes a hotel employee showed up with a can of bug spray and a rag and went to work. 5 minutes later he is finished and leaves. The bugs are still there and now the room smells like raid. I call the desk again and voice my displeasure and request a new room, which they take care of in about 30 minutes. No apology, no offer of upgrade, no sort of compensation. Whatever. This review could go on forever so I will condense. For the next 5 days the resort had a series of rolling blackouts which they would announce with a note under your door everyday. This meant no electricity in certain portions of the complex everyday. No electricity means, no blended drinks, no AC, no light to see during the buffet breakfast(which there is only one of everyday), no hot water, etc. I dont know if this is a way to save money when the resort is slow or what but definitely unacceptable at a supposed 5 star resort. Now on to my main complaint. The resort has a claimed ten restaurants open for dinner, with two of them requiring reservations. Every night, and I mean every single night of our stay, a minimum of four of the listed restaurants were closed, and two were actually just one place named twice. Each night there was no more than three choices of places to eat. The worst part was, you didn't know what was going to be closed until the day it was closed. We didn't get to eat at the Mexican restaurant(which we heard was outstanding) because it was only open two nights we were there and we had reservations at the other two restaurants those nights. What a major disappointment. False advertising aside, I feel as if I didn't get the exclusive all inclusive treatment that they advertise and that I paid for. Dont promise me something that I paid for and I expect to get and then not deliver because its the off season, or your not at full capacity. As far as the grounds, the beach, and the pool, absolutely beautiful. Walking to the shops, you may want to mentally prepare yourself for the abuse you will take from the local shop owners(aka vultures) that will swoop down upon you to practically drag you into their shops. Would I ever I go back to the Punta Cana, yes, would I ever go back to the Paradisus, definitely not.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":3.0},"author":"Thaddeus Rogahn DVM","date":"2013-12-06 02:25:35 +0300"},{"content":"Paradisus Punta Cana Recap We just returned from Paradisus Punta Cana from Aug 1 thru Aug 9, our experience was one of an interesting nature. I will say first off the hotel grounds were very nice, dated but well maintained. It seemed that every corner we turned someone in some way was maintaining the property, whether it be cleaning the walkways to painting the signs. Thank you to all previous posts as they were very helpful and I will probably mirror some comments.* Language barrier was challenging at times, some staff went well out of their way to assist others had very little interest in understanding (this was the minority). Dollar bills help in most cases. Front desk spoke English the best.* Food- was decent, Mexican, Chinese  Japanese among the favorites. Just keep in mind that you are not in the USA. For those concerned about the water, everything is bottled. Table water is from 5 gal and you still can ask for small bottles. You just need to ask for it. Ice is purified and bagged; we saw carts delivering the water daily to the restaurants and bars each morning.*Rooms- were dated, this is where we ran into our first  second issues, and we were traveling with another couple and learned quickly that the plumbing was so so. There was an issue with one of the facilities and when the front desk was called, we were told to place the used paper in the trash rather than to flush. In the public areas you will see this. Just the initial shock that the front desk made this comment left an uneasy feeling. Long story short. they did have maintenance check the facility and confirm all was in order. After several flushes (or attempts) still no major change. 2nd call was made, management was then involved which resulted in a 2nd service call to more men arrived rather quickly and told us that there was a problem and would be fixed that evening. To make matters worse the room was not acceptable on the cleanliness side; one of the beds had sand between the sheets. On day 2 better accommodations were made through the involvement of our travel agent and hotel management. Room issues went away for the remainder of the trip due to a room change. They did provide an iron / ironing board  Hair dryer in the room in addition to a safe at no charge.*Attire- For men, expect to wear casual pants each night (we saw people wearing jeans but not too many). Restaurants that were air-conditioned were, Japanese (reservation required), French (reservation required) and Mexican all others were open air dining. For women, capris were fine. Just no shorts for either. If you want a 鈥渟horts鈥?night, there is always the buffet or room service, which delivers 24 hours a day.Last but not least, the bar on the beach that we called the fish bar due to the mosaic of fish swimming was our favorite; the bartender at night (Omar) had a great personality and was a pleasure. PS Try the Mamajuana (local drink), Omar will tell you all about it. For those interested in smoking, they offer cigarettes at all bars including the swim up (Marlboro  Marlboro Lights). Cigars are free only at the French  Mexican restaurants, all you need to do is ask because there is a 鈥済uy鈥?by the main lobby bar that will try and sell them to you.Taxes, be prepared to pay usd 10 for each person in your party to enter the Dominican Republic. There were rumors floating around the resort that there was a usd 20 tax per person to leave. We did not pay this to leave, we did hear that it is illegal to tax twice and only people who ask are trying to pull a scam. Only other annoyance was by the Hibiscus, there was a row of shops which of course encouraged you to shop, but by then entrance was a guy pushing ATV tours and Solmelia employees were trying to sell time-shares.We hope this helps, enjoy your trip.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Marquis Pfannerstill","date":"2012-08-05 17:50:18 +0300"},{"content":"Loved it! We just got back from the Paradisus and had a wonderful time! The hotel is very nice and very clean! The beach is wide and long so you can take long walks or jogs. The food was good but really liked the seafood restaurant on the beach the best...try the lobster! Brush up on your Spanish because not all that work at the hotel speak English; I think Americans are in the minority. We found the hotel employees to be very nice for the most part. Bars are fun...try the mojitos...very tasty! It is true that you should bring lots of one dollar bills for tips...these people are quite poor and a few bucks means a lot...tip the housekeepers, bartenders; anyone that is helpful and nicel.The only annoying thing about the hotel is the people by the lobby who try to get you to hear a presentation about time share vacations and buying a 1 bd. or two bedroom... they are nice but very pushy and we sometimes felt like they were stalking us...watch out for them! The only other thing: two nights in a row we were awakened by screaming feral cats outside the doors who try to get into people's room service that is left outside...the hotel should suggest you leave it inside until the next morning....Oh yes...the beach is topless ladies..if you so choose.....so bring some strong sunscreen!!!!We would definitely like to come back here again......P  J","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Luis Bosco","date":"2015-01-14 12:28:19 +0300"}],"public_likes":["Keira Murazik","Dameon Keeling","Arvel Barrows","Ms. Colleen Hickle","Brandon Abernathy","Mrs. Sherman Carter","Breana Tremblay","Everett Stark","Tyrel Cole"],"vacancy":false,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Crane Flat is open from June through September, requires reservations, and offers 166 sites for both tents and RVs up to 35' in length.  Water and flush toilets are available.  Campsites 423 and 427 are wheelchair accessible.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}