{"title":"London/Holborn-Clerkenwell","name":"The Rookery","address":"Peter's Ln, Cowcross St, EC1M 6DS","directions":"tube: Farringdon","phone":"+44 20 7336-0931","tollfree":null,"email":"reservations@rookery.co.uk","fax":null,"url":"http://rookery.co.uk/","checkin":null,"checkout":null,"price":"From £149","geo":{"lat":51.5202,"lon":-0.1026,"accuracy":"ROOFTOP"},"type":"hotel","id":16239,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"An Objective Review This was the first visit for my family and I, and it was the first time we had ever used the all-inclusive scheme. The hotel is beautiful, and the beach is very lovely, although somewhat breezy. I was impressed by the layout of the buffet, and the food was very good with a generous variety of items. However, by the third day I found the offerings to be redundant and tasteless. There were a couple of offerings that were appetizing, but overall not that good. If I had one complaint it would have to be that most of what was offered was cold. If you are going to buy anything to take home, take one of the tours to these small towns where the prices are resonable. Everything at the hotel and on the hotal owned market street has an exhorbitant markup. Rum is $10 dollars a bottle whereas outside the zone it is $6. Cigars are at least 60% higher here than at the factories you can tour. While our stay was fair, I was expecting more from thehotel. I don't think I will return for another visit.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":4.0,"Rooms":5.0,"Location":-1.0},"author":"Johnpaul White","date":"2015-11-23 20:30:44 +0300"},{"content":"RIU Palace has a little for everybody...       The Beachfront","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":-1.0},"author":"Colleen Monahan","date":"2012-03-12 00:35:38 +0300"},{"content":"Great place to stay We stayed at Riu Palace from August 26th - August 29th to celebrate our first anniversary. We decided on Punta Cana because I found a GREAT deal for a last minute booking (1 week in advance) on Travel Zoo. Neither of us had been there before and we had never stayed at a Riu property, so we read many of the reviews on this site to get an idea about what to expect. After reading the reviews, we were somewhat apprehensive about how our stay would be, but luckily most of the things mentioned in other reviews turned out to not be true for us. We found this hotel to be a great choice and we wanted to share our experience with others that might consider staying at the Riu.RoomWe stayed in a standard room. We asked for an upgrade since it was our anniversary, but the desk clerk was not very responsive to our request (could have been a language issue), so we didn鈥檛 push. However, the standard room turned out to be nice (no smell. as mentioned in other reviews) and it was on the top floor with a king bed, just as I had requested. There were a few of those 鈥渘o see ums鈥?after they removed the complimentary fruit tray from the dresser, but the next day (after the room was cleaned) they were gone. There did seem to be a limit on the number of towels that were left in the bathroom 鈥?exactly two bath towels, two hand towels and two washcloths, but as long as we showered for dinner before the turn down service (around nine) the room attendant picked up the used towels and restocked them, so we were set for the next morning. (By the way, as mentioned in other reviews, the washcloths did seem hard to come by, they were never restocked with the other towels, but when we mentioned it to the manager, he had some washcloths brought to our room immediately). The water was only hot first thing in the morning and before dinner. That was a slight inconvenience, but not bad, since it was at least warm at the other times. Food We ate at the buffet for all our meals. We did not worry about making reservations at the other restaurants because the food in the buffet was GREAT! Some of the items were the same every night 鈥?cheeses, salads, soups 鈥?but for the most part there were different things to choose from each night - different vegetables and all kinds of meats 鈥?fish, beef (very tender), pork and baked turkey and several different pastas. One of the other reviews had us worried that there would only be fried foods 鈥?not so. I had more than my share of fresh mangos and there were many other fruits and desserts to choose from too. Beach Nice beach with white sand, some seaweed, but not bad. All the other reviewers were right about people reserving the beach chairs early but if you look around you can find some empty chairs and some shade鈥t may just take a while.ServiceAll the employees of the Riu were GREAT!! They are extremely service oriented!!!. We did tip most of the time, but they all seemed to provide the same great service to all the guests whether you tipped or not. (NOTE: I did leave a small gift (nail polish and a trial size perfume) for the room attendant and she decorated our room with flowers the second day.) OverallI would definitely return to the Riu Palace. We really enjoyed our stay. Most of the employees spoke English so that was good since we didn鈥檛 know any Spanish, although knowing some Spanish would definitely be helpful. For buying souvenirs, make the walk (it is not a short walk) to the markets on the beach. You will find much better deals than on Caribbean Street, if you are willing to haggle. I don鈥檛 believe this is the best spot for families, since about 20% of the women sunbathe and walk around without tops. I am American (definitely the minority in Punta Cana) so that was new for me, but you get used to it after the first day. Also, be advised, the DR in August is INTENSELY HOT!!!!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Zachariah Abbott","date":"2013-03-12 12:05:22 +0300"},{"content":"Great Hotel My Fiance and I returned from a 2 week stay at the palace (2/6 - 16/6) and i have to say that this hotel is amazing. I read a lot of reviews on this website before we left and i was unsure of what to expect. However, we were blown away by the hotel and especially by the staff.The staff on arrival were friendly and exlpained the various rules of the hotel, such as how to get your towels each day and when and were to eat.The room we stayed was in great condition and thankfully there was air conditioning. There is a mini bar with bottled water, soft drinks and alcohol which was restocked everyother day. They also have a safe in each room.The pool is okay but we found that, because of the palm trees, there was not much breeze so it got very hot around that area. Still, its great to have the waiter come round and take your drink order whilst your soaking up the rays!We spent most of our time on the beach, which is fantastic. The sea is clear and very clean. The only problem was you got a lot of people approaching you to try and get you to go parasailing/scuba diving etc.ALL the staff were excellent, they do anything to help you and a big shout out goes to Rafael, our waiter in the main resturant. Most of them speak fairly good english but i does help if you know some basic spanish.The food is good but got a bit samey towards the end of our stay. Im pleased to say the we did not suffer any illness nor did anyone else that we knew of.The only negative we could find is that there isnt much entertainment in the evenings but you are free to go into the other hotels in the resort to find some.All in all, we thoroughly enjoyed our stay and came back alot more relaxed than when we left. Enjoy your stay !","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Lilian Pagac","date":"2014-08-27 21:45:31 +0300"},{"content":"Highly Recommended Let me begin by saying that we entered this vacation with a cautious eye. After reading the reviews on this website, I was more than curious about the lack of similarities between the reviews. This was a great vacation. My wife and I spent 9 nights and 10 days in paradise. The service and resort was much more than we ever expected, especially for the price. The natives of the island were a warm and firendly people. The beach was incredible with a constant breeze to keep the heat stress down. We prefed the pool in the afternoon. The lack of many kids was great. The Bambu was crawling with the rugrats, and we were glad to have stayed at the Palace. The food was nothing to write home about. I had no problems finding things to eat, but my wife (who tends to be a little more on the picky side) wasn't as thirlled with the cuisine as I. A basic knowledge of Spanish is helpful. Rough English is spoken by most workers, but remember, you are in a Spanish speaking country. We would expect them to speak English, if they came here. Also, Jonny Bravo, of the Anamacion staff was awesome. He was a blast to be around and wasn't as crude as some of the others. Again, have no concerns if you are booking your trip. It is worth your time and money.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":-1.0},"author":"Axel Konopelski","date":"2012-10-11 20:05:42 +0300"},{"content":"No Problems Just returned from a 7 day trip to the Palace. Not a mosquito to be found! I ate everything in site, as did the group of 7 I was with. This included my two daughters 9 and 7. We stopped at the Bambu pool for a cocktail and also the pool at the Riu Taino. Other than that we were content on the Palace grounds. The precautions I took are as follows.Malaria meds for my daughters. (Not me or the other adults.)I took hand sanitizer with me wherever we went and my daughters washed there hands often with SOAP and water. Brought a can of Lysol and sprayed the room from top to bottom. I sat on the beach and enjoyed myself.....","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mireille Roberts","date":"2014-11-21 03:38:32 +0300"},{"content":"Great, relaxing vacation We just got back from a 2 week honeymoon at the Palace. Overall it was a great trip and we enjoyed it immensely. The Good: The hotel and rooms were clean and beautiful; the food was delicious (buffet is definitely better than the a la cartes); the beach was gorgeous; and the service was excellent.The Not So Good: I had food poisoning one night after eating at the Steakhouse; we had to call the front desk a couple of times about the air conditioning not working but it was always fixed immediately; we were without water one day, but it was fixed by that afternoon.That being said, the good FAR outweighed the bad. I would definitely recommend this place to anyone.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Parker Zieme","date":"2014-07-24 08:26:37 +0300"}],"public_likes":["Lexus Champlin","Ms. Gayle Douglas","Alexandro Bruen","Reyes Hodkiewicz","Mrs. Douglas Thompson","Karl DuBuque IV","Emelie Bechtelar"],"vacancy":true,"description":"An atmosphere and decor that more recalls a private gentleman's club than a hotel.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}