{"title":"San Francisco/SoMa","name":"Mosser Hotel","address":"54 4th St","directions":"between Stevenson and Jessie","phone":"+1 415 986-4400","tollfree":"+1-800-227-3804","email":"reservations@themosser.com","fax":"+1 415 495-7653","url":"http://www.themosser.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7849,"lon":-122.4051,"accuracy":"ROOFTOP"},"type":"hotel","id":26020,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I \"splurge\" for the largest possible room with a window and it was still the SMALLEST room I have ever stayed in. There was just enough room for the bed and that's it! I can't imagine what a smaller room without a window would be like. Definitely not worth the price. London is expensive but save a little more & get a proper hotel. The bathroom is tiny. I shared a room with a friend and there was no room to even get dressed, nowhere to place a toothbrush or toothpaste. This hotel is definitely for the short & slim - I couldn't imagine what a 6' tall person would do in here. Good location though. And clean. I was unhappy about the reception. A friend (not staying at the hotel) gave the reception my name & the receptionist told him exactly what room I was in & to walk up into it. Random guy, unknown to reception walked in from the street was told my exact room number just with my name and was waved through. Harmless enough in this situation & I didn't complain but it irritated me. This is good for a solo traveller without much luggage but other than that, I would not recommend this hotel. And not for a long time either - 1 or 2 nights is more than plenty.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Dr. Alejandrin Hickle","date":"2013-07-03 07:54:26 +0300"},{"content":"Stayed two nights in a small ground floor double room, no window, with my 5 y.o. son while we were sightseeing in London. Is ideally positioned 5 minutes walk from Paddington Station so is great for either linking with the Heathrow Express or using the Underground to get around town. Plenty of food choices around, nothing fancy but you’ll get a satisfying feed (The Exchange near the local Laundromat is a kid friendly pub with good hospitality, and the food is tasty and cheap) Sainsburys and M&S have express stores at the train station so you can get the basics at reasonable prices Check in process went without a hitch, and they even let us check in early without charging us extra. Reception is manned 24 hours and everyone we dealt with on there was friendly and tried to be helpful, including booking us hire car for our early departure. Now to the room. I knew it was going to be small, website has dimensions etc but was still taken aback at the lack of usable floor space for bags and moving around. Effectively good sized double bed surrounded by the walls on three sides with a little built in bedside table. My carry -on luggage took all the little bit of floor by the bedside table. That leaves the area between the door, bathroom and bed. About 6 feet long by two and bit feet wide my big case used most of that. I expected a small room, had read the reviews and basically it’s exactly what I thought it’d be. If you don’t mind stepping over your luggage you won’t find it a problem. Bathroom tiny like onboard a ship, but very clean and functional. Must say bed was really comfortable too. Room has small LCD TV (you pay to get the remote which is worthwhile) and we had an air con unit so could control temp really well. Wi-Fi available and vending machines in reception I’d stay here again – cheap, clean and good location. Not everyone’s cup of tea, but if all you need is a bed easyHotel is perfect","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Adelle Wilkinson","date":"2012-02-20 17:39:17 +0300"},{"content":"I've been staying at the easyHotel Paddington for three nights. Cleanliness & Service: Let me start with the worst part: Bed Bugs (which I fortunately spotted in the first night). This is not necessarily a question of how the rooms are cleaned, but the staff at the reception seemed rather unconcerned. I was not offered another room but had to insist on it, and to actually get the room, I had to return early to make sure that not all other rooms were taken. At least the management seems to have taken care of the problem and my second room (on the same floor) was ok. Other than that, both rooms and their bathrooms were reasonably clean, but you have to be aware that rooms are only cleaned when guests change or for an additional fee. Rooms: The rooms themselves provide the absolute minimum you need. It's sufficient for a weekend in the city but not suited for a longer stay. Like their web page says: there are \"2 clothes hanging hooks provided\", and there is hardly any room for luggage. There is no shelf or hook in the bathroom to put any toiletries. For the rooms with a window to the street, there's another downside. The hotel is in a sidestreet and there's not much traffic, but there's a noisy bus stop right in front of the hotel. Besides that, the sound insulation between the rooms is also rather bad. Location: The location is pretty good, with Paddington station and the underground around the corner and lots of pubs and affordable restaurants in the area.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Pearl Watsica","date":"2014-03-14 01:43:56 +0300"},{"content":"I'm quite familiar with budget hotels, and my expectations are usually quite low for them... but easyHotel still left me a little shocked. Overall, not a bad stay, but there was definitely more nickel-and-diming than I'd seen anywhere in ages. I booked a small room \"with window,\" and since I was arriving around 10 a.m. on Christmas Day, I inquired about checking in earlier than the usual check-in time, by e-mailing the hotel. I was told that I'd have to book the previous night (Christmas Eve) in order to check in that early. First, that turned out to be untrue (the hotel offered early check-in for only 10 GBP). Second, even though I did pay 24 GBP to book that room for the Christmas Eve, once I turned up at the hotel, the front-desk clerk tried to tell me that since I'd arrived after 10 a.m. (check-OUT time for the night before), my reservation was worthless. Sound confusing? Quite. I pulled out the printed version of the e-mail telling me exactly the opposite, and started to explain, and he immediately did an about-face and said that, fine, I could indeed check in. I was given a room on the \"lower ground floor,\" which was, of course, a basement. I made my way down the stairs and opened the door. I wasn't put off by the tiny space, but I was quite appalled (as the last reviewer was) that the room \"with window\" actually had a window that had a lovely view of the hallway. As the room was uncomfortably warm, and the a/c didn't seem to work, I went back upstairs and asked if perhaps they had any rooms with windows to the outside world. I was told that for 10 GBP a night, I could \"upgrade\" to a bigger room with a real window. I knew I wouldn't sleep in the heat, so I splurged and got a room on the third floor. It was fine. Again, the a/c didn't cool the room, but the window wide open (there were no pesky restrictions on that, thankfully) cooled things down nicely. In early mornings, it was far too loud to sleep with the window open, however. Speaking of loud, the walls were thick enough to not hear into my neighbors' room, but the doors were incredibly thin and let in even the softest noise, day and night, from the hallway. When doors slammed (as they did quite often), the sound boomed through the room. The bathroom boasted a terrible smell for my entire stay, despite it appearing very clean. Think there must be some sewer problems. The tiny sink didn't drain very quickly, and that it stuck out all of eight inches from the wall, it was virtually impossible to wash your face (given the lack of a washcloth) without getting water all over the floor. The room was indeed small, but I was only one person and only had one piece of luggage. What was more than a little aggravating was that there was not a SINGLE flat surface anywhere in the room. Not a shelf on the wall, side table, nothing. So I was always stepping over piles of things on the floor trying to get ready in the morning. I actually used the outside windowsill to store spare change, etc. The room was clean but not spotless. There were some stray hairs on the comforter that led me to believe it doesn't get washed between every stay, more like shaken out... Oddly, someone \"cleaned\" the room after I'd been there one of my three nights, even though I didn't order this extra service. But there was a fresh towel and the trash was emptied. I'm staying in a Travelodge in Manchester as I write this -- another very basic bargain chain. And though I've only paid half the price of the easyHotel, it's far, far superior. So, I'm all for budget hotels, but the easyHotel really isn't much better than a hostel in my book. The capsule-hotel thing can be done well (see the Yotels), or it can be done shabbily. EasyHotel's definitely the latter.","ratings":{"Service":2.0,"Cleanliness":2.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":3.0},"author":"Benjamin Ferry","date":"2012-04-07 04:20:46 +0300"}],"public_likes":["Joey Hegmann PhD","Charles Bahringer","William Lesch","Kelsi Greenfelder","Ozella Labadie","Shanna Dach","Tiffany Kihn"],"vacancy":true,"description":"Nice, clean hotel with small rooms but a great location.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}