{"title":"Paris/1st arrondissement","name":"Hôtel Vendôme","address":"1, Place Vendôme","directions":"Métro: Pyramides","phone":"+33 1 55 04 55 00","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"Singles start at €350; suites can be as much as €4,000.","geo":{"lat":48.8670031,"lon":2.328706,"accuracy":"APPROXIMATE"},"type":"hotel","id":21735,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"After seeing some of the poor reviews posted just before we left to go to the Grand Wailea, I was a bit concerned if the hotel was no longer what we remembered it to be four years ago. We did not have any of the problems noted in the other reviews. The staff was freindly and helpful and the resort is as beautiful as we remembered it. We had an ocean view across the chapel. I would think that if there is a party out there, it would be disturbing. There is presently construction next door so if you are on that side of the hotel, you may hear some hammering and the beeping of trucks backing up. We last went just after 9/11 when the resort and the island were empty. We were mentioning this to the bellman as he came up with our bags. He was with them back then and he made a point of saying that the management did not lay anyone off during the recession following the trade center attacks. All staff were instructed to come in as usual even though the resort was pretty much empty. To me that says a lot for the people who run this place.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Dortha Okuneva Jr.","date":"2012-08-06 09:27:50 +0300"},{"content":"As part of our 10 day stay in Maui our first 2 nights were spent at The Grand Wailea. We thought everyone who worked here had a superior customer service attitude. The food was good though we never did eat dinner here (ate at Ruth's Chris..ummm). Just lunch at the restaurant near the adult pool and breakfast. I thought the lunch at the pool was excellent, and the service was great! Our room was located on the first floor very near the pool with a lovely view of the chapel and gardens. You could see the ocean if you really looked, but that was ok as I knew our next stop had a complete view of the ocean so I wasn't going to be missing anything. I loved it...totally serene and even saw someone getting married. Very pretty. Very easy to get to the pool! The bathroom was large and decorated tastefully. I thought everything about the hotel was worth the price. Just beautiful and the pools looked like a lot of fun. The disappointment for me was that our room smelled like mildew and with the fan blowing overhead all night the smell gave me a horrible headache. If you are like me and have a sensitivity to smells, this might bother you too. I felt sick most of the day after our first night so I could not do all the fun things I had wanted to do (especailly go down the water slide!!! Darn!!!) When I woke up the next day, same thing...headache. So, that pretty much ruined everything. As soon as I could get fresh air (which I rushed out of the room and didn't enjoy relaxing in it at all) I was better, but really disappointed that the smell was in the room. I did not mention it to the hotel staff....I loved where the room was located, I did not want to have to pack and unpack while feeling so poorly and I knew it was only 2 nights. My husband thought the place had an unfriendly air to it....not due to the staff but more the guests. Too many people on cell phones non-stop gabbing while laying out at the pool! Come on guys! You're in Maui! RELAX! Guess we are more \"kick back\" as we loved staying in Kanapali. Seems a little more relaxed to us. Anyway....the place is a dream but.......ask about the mildew.....I swear the carpet felt damp. I have no idea how they would have handled the situation had I complained but I hated to start out my vacation complaining. Aloha!","ratings":{"Cleanliness":2.0,"Overall":3.0,"Value":4.0,"Service":5.0,"Rooms":2.0},"author":"Justus Bradtke","date":"2012-03-24 08:55:37 +0300"}],"public_likes":["Harley Jacobs","Alejandra Mills","Jayme Terry","Naomi Feil","Alf Corwin","Domenica Klein","Ronny Kunde"],"vacancy":true,"description":"Occupying a building which was once the site of the Embassy of the Republic of Texas the Hotel Vendôme is one of the most exclusive addresses anywhere, much like the neighbouring Ritz. The 29 rooms each have been decorated in the style of a different period, such as Classic, Baroque, or Deco.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}