{"title":"Paris/17th arrondissement","name":"Hyatt Regency Paris Etoile","address":"Place du Général Kœnig 3","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.parisetoile.regency.hyatt.com/en/hotel/home.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.88023,"lon":2.28432,"accuracy":"APPROXIMATE"},"type":"hotel","id":21675,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"My husband and I just got back from our honeymoon in Maui and stayed at the Grand Wailea and had the best time! Of course, we had heard that Grand Wailea is the place to stay which is why we booked this hotel, but we did not know all of the little things this hotel had to offer that will keep us coming back here over any other hotel on the island. The grounds are truly beautiful! I was apprehensive about staying at such a large hotel at first, but it is so easy to navigate around the property and all of the different pools and slides all connect to one another. The grotto bar (in the water) is our favorite!The beach is not only beautiful on this side of the island but literally a few steps away from the pool, so it is super convient to go back and forth. They have this program at the hotel where we rented unlimited access to kayaks, paddle boarding, snorkeling gear, etc. for four days and it was totally worth the money; especially compared to the cost to purchase these types of activities outside the hotel. We also took advantage of the beautiful spa and fitness center which I only have good things to say. All of the staff were very professional and friendly from the bellmen to the maid service. After our bed was turned down at night, they would turn on the radio so you had music playing when you came in. We even didn't mind the mandatory daily valet parking, bc we could just call for our car when we knew we were leaving and it would be at the front when you arrive along with any directions you need. When we compared that to the time it would take to get to your car if you self parked, we felt like it was worth it. We got breakfast buffet included when we booked our package which was really useful, so you should check into the current promotion when you are booking your reservation. Next time we return, we will be excited to try the new restuaurant with chef, Alan Wong. I think it is opening in April and sounds great. Again, wonderful experience! We had originally looked into Four Seasons and now seeing everything Grand Wailea has to offer, we can't imagine going anywhere else.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Emmitt Johns","date":"2012-01-10 01:54:41 +0300"},{"content":"Beautiful resort, clearly. Very much enjoyed the focus on artwork. Service and staff effort was first rate - except for my concierge experience I'll note later. Until the new restaurant opens, the resort only has 2 full service restaurants and both are oriented for ocean views. Its impossible to get a reservation for either resort restaurant from open to 8pm every day without advanced reservations as they are fully booked with sunset viewers. Both restaurants are good and my dinner at Humuhumu was a highlight of the trip. I'll note that this was my first trip to Maui - a place that was recommended by friends as THE island to experience a slower pace and quiet relaxation. My rooms lanai was great. I watched the sunset from there every night and I loved it. But the resort itself is busy - with alot of families with children, business conferences, etc. I saw the amenities before I arrived so I cant say this was unknown but I hoped for more in the way of adult quiet. My experience with the concierge service was much poorer than the Waldorf Astoria name would imply. I visited twice. Once inquiring how to order and ship fruit and flowers to the mainland. The other was to book a restaurant reservation for my birthday - which at that point I saw as a necessity as, previously noted, restaurant reservations in the Wailea area are tough. For the fruit and flowers inquiry I was handed a brochure that I could use to order from a local company. As much as I tried, I was looking for the concierge to understand I wanted them to arrange the order to my home address. Instead I walked away with a brochure. For my birthday dinner, since the Grand Wailea concierge doesnt appear to have access to preferred tables at their own resort - I was sent offsite to the Four Seasons. My dinner at Duo was very good - and that time at the Four Seasons resort next door showed me that it was likely the place I would visit next as it was more adult oriented and was more responsive to service requests. The Duo staff presented me with a birthday desert. The Grand Wailea, after telling the concierge I was there for my birthday, didnt present me with any greeting at all. I wasnt in Maui expecting birthday freebies but something, anything would have been nice. As many have posted, the additional costs ie parking and resort fees seem unnecessary. Include it in the room rate and be done with it. I'm a Hilton Diamond member and the lack of Diamond amenities was disappointing. The rooms are showing signs of wear, ie dented walls, chipped bathroom tiles - but these are small details. The room itself was very fine. But again, not Waldorf Astoria level given what I associate that name with.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Shanon Corwin","date":"2015-01-25 05:32:25 +0300"},{"content":"We started this debacle by being deceived about how many wristbands we could receive when we checked in. Then, when we complained about this, the manager told us there was nothing he could do and whoever told us that we could have more wristbands was wrong. Then, we were supposed to have the oceanview room and when we got to our room, all we could see were palm trees. The bellman told us to just move the palm trees in our head. Then, when we are in the room, our bathtub is disgusting and we complained to the housekeeping staff and nothing was done. My wife had to clean the bathtub, ON OUR HONEYMOON!!!! The shower had mold in it, the air vents were black with filth, and there was dirt on the walls itself. I know we paid the local rate but that doesn't give anyone the right to do such a poor job. When we complained to the manager, Hilme, he implied that since we shouldn't expect much since we were getting the local rate. Just because I was a savvy shopper and knew people on the island is no reason for their standards to be lax. Then, we found that the valet parking (which is mandatory) is pretty ridiculous considering they are charging 30 dollars for parking. Then, I found out that 30 dollars is not total for your stay but PER DAY, which is not mentioned anywhere, which is fraud by the way. We complained and the valet manager reversed the charges after apologizing for the \"miscommunication \". When we checked out, we complained about the many problems and the manager, Hilme again, told us that \"A hundred off is more than generous considering you got the local rate.\" Now, not only is that being prejudiced against the local Hawaiian people, that is also showing bias against their guests for being savvy shoppers. That's not even remotely approaching the level of class that we were expecting from the hotel for something that was not our mistake. I expected our stay to be comped and apologies abounding. Instead, I got apathy and rudeness. Now, I work for the Bellagio in Las Vegas and when I booked our stay, they told me that the Grand Wailea was the Bellagio of Maui. Unfortunately, from what we saw, the cleanliness and professionalism of the hotel is comparable to a low-class Days Inn. I am extremely disappointed in the level of service and customer care that we received and I will be relating that information to every guest at the Bellagio who asks for the best place to stay in Maui. I will now be referring people to the Kea Lani from now on. That \"should be more than generous\", as the manager put it. They should have cleaned the room thoroughly. They should not have defrauded and deceived people about the price of parking and if they were gonna charge for parking, they should have offered the option of self parking. It is a Waldorf property, and I expected impeccable cleanliness, style, and charm. Instead, I got attitude, mold, dirt, and a poor attitude. I expect someone to contact me immediately regarding this problem. I expected more from a 4 diamond property.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Marguerite Hartmann","date":"2014-11-03 20:23:45 +0300"},{"content":"By far the most beautiful place I have ever stayed in my life. I know my wife would say the same. The room A++ the staff treats you like their life depends on it. The location just fab ul ouzzz in every way. Did I mention room service and the menu?? do try. I'm going back. Just a short walk from your room to the ocean. And clean so clean. Loved it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Zack Dietrich","date":"2012-04-23 16:27:23 +0300"},{"content":"The resort and grounds are beautiful, however I had a terrible experience at the Grand Wailea Spa. For what was supposed to be a relaxing afternoon with my husband at the spa, due to the poor customer service we experienced, it soured everything and I wish we had never gone. In addition, there were foreign gardeners right outside my massage room, chattering away, so it made for a very un-relaxing experience. Also, my massage therapist was just average- I thought their standards would be higher. When we complained to the spa manager on duty afterwards, she was very indifferent, like she didn't care. She gave us coupons to use their hydrotherapy again (which I believe is free to use with any service), which we will not use. We will not waste our valuable vacation time there again. Go somewhere else where the staff actually care.","ratings":{"Overall":2.0,"Value":1.0,"Service":1.0},"author":"Elmira Kerluke","date":"2012-01-28 04:16:47 +0300"}],"public_likes":["Marjory Bogisich","Cornelius Homenick","Geovanny Cummings Sr."],"vacancy":false,"description":"The tallest hotel in Paris is the lone skyscraper in the northwest of Paris, adjacent to the Palais du Congres. It enjoys an unobstructed line of sight towards the Eiffel Tower from the rooms facing it and its top-floor bar. After Hyatt took over the property, it is being gradually updated, but still not entirely up to the best Hyatt worldwide standards.","alias":"former Concorde Lafayette","pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}