{"title":"London/Hammersmith and Fulham","name":"Royal Guest House","address":"47 Shepherds Bush Rd, W6 7LU","directions":"tube: Goldhawk Rd","phone":"+44 20 7603-4528","tollfree":null,"email":"info@royalguesthouse.co.uk","fax":null,"url":"http://www.royalguesthouse.co.uk/","checkin":null,"checkout":null,"price":"From £45","geo":{"lat":51.5007,"lon":-0.2217,"accuracy":"ROOFTOP"},"type":"hotel","id":16173,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Moldy, smelly room -horrible hard beds but beautiful beach!!!!! I just got back from taking 52 people here (10 families). Stayed April 7-14. I chose this resort after reading every single review on every hotel in Punta Cana! I'm not a travel agent - just someone who likes to vacation with friends so I try to research as much as I can to pick a place where I hope everyone will have a good time. The check-in went smooth but they put our group in the far back of the resort. Some of us went to the manager and moved closer to the beach. We stayed in room 2309 which was on the 2nd floor and had a nice view. No rooms have an oceanview but this room looked onto the palms on the beach. Call the hotel before you get there and request upfront especially if you have small children.The number is found on their website and you will get the front desk. Our room's airconditioning did not work and the air coming out smelled like mold! I had a repair man come out and when he opened the vent in the ceiling some gross smelly water poured out- he could not fix it. We could have moved again but didn't want the hassle- wish we had- I still have a cough and so does my daughter-we're very allergic to mold.Some people in the group who had rooms in the back complained of a bad sewer smell.The beds are absolutely horrible-feels like you're sleeping on a boxspring! Believe me, I'm not one who expects or has to have the best and I understand it is the Dominican Republic but I really dreaded going to bed! Tip the maid when you get there to bring extra blankets for padding- it helped. Bring outlet adapters and boogie boards(if you can check them on plane) waves were fun. It's true that the Riu Bambu has the nicest beach in Punta Cana- palm trees everywhere! Stay on the beach as late as you can - it's beautiful! A man in our group brought his fishing gear and caught a huge Schnook(sp?) right at our resort-he gave it to the kitchen for them to cook.Food was wonderful- pleasantly suprised but didn't like the Carribean Restaurant or the Steak House- found the buffet to have more choices and you can see what your getting. Dominicans are so friendly and seem to like their jobs which is nice to see. I tipped a lot because I think its a nice thing to do but you don't have to- they don't expect it. Our group went on the Manarium Snorkel trip and had fun! You get to swim with Nurse sharks ( they don't have front teeth) that are in a netted area. The kids were scared at first but loved it. Some chose to stay on the boat and relax.The animation team at the bambu love their jobs and make the day a lot of fun with their contests and games, although the children complained that the kids club wasn't fun and the shows for them were boring.They need a better organizer and games coordinator for the kids.Some of us got a litte sick but not too bad.All in all, we had a wonderful time!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":4.0,"Rooms":2.0,"Location":-1.0},"author":"Ernie Brown","date":"2015-02-10 08:59:47 +0300"},{"content":"Oh My God, I love this place!! One of the best parts of this trip was the overall beauty of the grounds, beach, and the Riu itself. This was my first visit to the Dominican Republic, and I was very impressed and miss it already, and I have only been home since 2:30 this morning!My 17 year old daughter, her friend and friend's mom and sister were in the group that travelled together. We were very sad to depart the Punta Cana airport to fly home yesterday afternoon, and had to return to 34 degree temps and snow on the side of the road. This all after a week of sun, 85+ temps, and gorgeous beaches. It has been a very sad day.When we first arrived, the trip from the airport to the resort is rather intimidating, as you get a first hand view of the poverty, and it is VERY sad. It was a real eye opening and educational experience about appreciating some of the things that without knowing we took for granted living in America, prior to the trip. That was probably the biggest negative for me.The staff at the Riu Bambu were outstanding.......The Anamacion staff (entertainment team) were OUT OF THIS WORLD! In particular, Angela, Richard, Oliver, Jesus, Daisy, and all the others whose names I cannot remember right now. Wilkin, in the dining room ( aka Chocolat!), Vidal who made reservations for water sports, and all of the resort staff were very gracious and helpful.Not one day went by that there wasn't a new adventure. My daughter experienced several new nationalities, French, German, Canadian, Spanish, etc...She and her friend and friend's mom, could all speak a little Spanish which is helpful. We were all impressed with the staff's ability, many of them to speak, some, up to 5 languages! Impressive!The rooms were nice, and well cared for....don't drink the tap water, there is bottled water provided for you every day.The grounds were impeccable, and always being attended to....The food venues were amazing, anything and everything available to eat...or to try new foods whenever you wanted, needless to say the short walks on the beach may have lessened the weight gain from the constant source of food over the week!The beaches were more beautiful than I have ever seen. Nice tropical breezes, great sunning area with lots of shade for middle of the day sun, and outstanding people watching! Lots of topless sunbathers, which for myself and the other mom was not a problem, being nurses, however the first time you see it it DOES catch you off guard. WE took the Bavaro Runner excursion. Kevin, the guide and Johnny the driver were excellent, too. It was a 120 mile trip, for $80.00/person and well worth the money spent.We went inland to a sugar cane plantation, tasted sugar cane, went to a typical Dominican farm house, where they made organic coffee and chocolate. We also went to a cigar factory and saw a cigar being made and learned the history of tobacco raising and cigar production in the DR. Then on to the beach for horse back riding and lunch, then returned to our resort. A very fun day was had by all.The girls and the other mom went parasailing and went out on the paddle boats one day. The paddle boats are included in the cost of the resort, however the parasailing was extra. They had blast on both and parsailing was worht hte cost. They said it was awesome!Take lots of sunscreen and reapply reapply reapply.This vacation was a 9.95 on a scale of 10 and we had more fun than I can describe in this small space!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Bennie Padberg","date":"2015-04-16 18:21:15 +0300"},{"content":"Will definitely go back!! This was our first trip to Punta Cana and we loved it...equal to other trips to Mexico/Carribean or better! Overall the Riu Bambu was great! Excellent friendly staff especially the kids at the pool! Great beach and grounds. Food was above average...always could find something to eat. Our room was clean and very nice. The Carribean Street Night was awesome with the music and parade. It was a short walk on the beach to the market where we shopped and haggled with the locals! Good buys too! A couple complaints...the specialty restaurants only take reservations from 7-10 Am. If you are not an early riser as us you can't get in or get late times only. The rooms have thin towels and the mattresses and pillows are bad too. Also bring wash clothes...not provided. You need to often tell the bartenders to put alcohol in your drinks or you get it without! An insulated cup from home is a must to keep drinks cold while by beach/pool. We will definitely go back again and stay at the Riu Bambu.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Natalia Morar","date":"2013-11-26 12:01:37 +0300"},{"content":"Fun in the sun at RIU Bambu - I love my job!!! We just got back from a fun week at RIU Bambu. The resort is beautiful, clean and well organized. The rooms are sizable with a mini bar that is stocked every other day with liquor, beer, pop  water and yours to drink as you please. It's a short walk from your room to get around the resort and to the beach. The food is quite good, a little repetitive but they are catering to a variety of tastes  cultures so they're fairly mainstream (we couldn't get a reservation for other restaurants because you need to get there at like 7AM to book it so if a la carte is you thing get in line early!), the Mexican themed night at Colonial was really good. The pools are a little small and a little too shaded compared to other resorts I've stayed in - if you want a lounger, once again, you have to be up mighty early to snag one just go down put your towel on it and it's yours for the day!(which is consistent with every resort I've ever been to!). The bars are great and most of the staff are super friendly (and flirtatious!). The beach is beautiful and breezy which does give the ocean great waves that my kids loved diving into - lots of fun. The kids club was ok, in the brochure it says activities from 9:30am-12 - its not, more like 10:45 to 12, then 3 til 5 is more like 3-4!! which was a little disappointing especially if you're looking for some time to relax away from the kids the odd time. Angela who runs the activities is great with the kids and they do have fun even though it's short. The daily games with the Animacion Team are a good laugh, I recommend you participate - their favourite phrase is I lova ma joba which was funny, they are always so happy and they work LONG hours. Shows in the evening were enjoyable, they had a dance show, a Michael Jackson impersonator - who was excellent! and they did Grease! The staff really appreciate it when you try to speak a bit of Spanish to them not that you have to - most of them speak 3/4 languages anyway! Overall it was a good vacation - I wouldn't go back because I dont like to go to the same place twice, however I would recommend it as a nice family vacation, I wouldn't choose this resort if I was single and looking for a good place to party! P.S. I should forewarn though that all four of us got quite sick on our last day - not quite sure what it was! However it wouldn't put me off, you can easily get as sick just staying at home and eating locally!!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Noelia Crona","date":"2012-08-29 06:26:12 +0300"},{"content":"Don't go to the Riu Bambu We came today from Bambu. It was bad. Who rate this resort as a 5 star. I would rate it as 3 star, not more. Problems were everywhere from the first day to the last. Room we got was already occupated, so late at night we open somebody's room, people were scared. After that we were waiting pretty long for the new room. Rooms are were small (it wasn't my biggest concern as we didn't spend much time in the room), and we had not more than 2 towels. Towels were the problem on the beach as well, after the rain they run out of the towels. One day we asked for the extra towels to the room, I thouth that we agreed on 4 towels by the evening, but I was surprised to see this evening 4 BEDS in a small room. This is how they listen to you. There is No bar at the beach, and nobody served the drinks at the beach (5 star???). So I asked for the bottled water - it is not available. Gentlemen in Riu uniform SELL the coconuts at the beach, 1st day -$1, 2nd day - $2 per nut. We didn't check the 3rd day. And special words for the dinning arangements: a la cart restorans are so bad, it is no words to explain. Buffet are closed by 8 pm ( for the first setting), and god forbid you to be late - we stayed without dinner this day. Snack 24 hr. is not true. Hod dogs and burgers are not a snack. My advice - check the other secorts, don't go to Riu. No service, no entertaiment, no food.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":2.0,"Location":-1.0},"author":"Shayna Brekke II","date":"2014-05-28 14:35:26 +0300"}],"public_likes":["Vaughn Kling III","Tyrel Cruickshank","Dolores Jacobs","Hilma Stokes","Carmen Keeling","Darby Runolfsdottir DVM","Lavonne Lehner","Joany Jakubowski","Mr. Willa Ratke"],"vacancy":true,"description":"Very cheap guesthouse within walking distance of Shepherd's Bush and Hammersmith. Triple rooms available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}