{"title":"Paris/8th arrondissement","name":"Holiday Inn Paris Elysees","address":"24, rue de Miromesnil","directions":null,"phone":"+33 1 43 12 87 87","tollfree":null,"email":"contacts@hotelelyseesparis.com","fax":null,"url":"http://www.hotelelyseesparis.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.87301,"lon":2.31615,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21837,"country":"France","city":"Paris-8E-Arrondissement","state":"Île-de-France","reviews":[{"content":"My husband and I returned today from having spent 12 nights in Maui, the first half of the trip in Kaanapali and the last part at the Grand Wailea. Our reservation was in the cheapest room category (terrace level); however, we were upgraded to an ocean view room, an exceptional room with a great view. The staff bent over backwards in granting whatever request we made. We enjoyed the Hibiscus Pool which is for anyone 18 or older. Servers were constantly attending to guests at the pool. The last day we stored our luggage and enjoyed an entire day in the sun before using a hospitality room to shower and change for our evening flight home. We are already discussing the date to return next year.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Jerad Lebsack I","date":"2013-10-12 02:18:30 +0300"},{"content":"Traveled in mid-September. Had an absolute blast. Pictures don't give this place justice. Resort was immaculate. Comfy bed. Huge bathroom. Service impeccable. The food and wait staff at Kincha was first class. Just a recommendation for the girls, if you plan on a spa treatment (which was awesome) plan on wearing a bathing suit, even if it's just a facial. You will have to disrobe!!!!","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":3.0,"Service":5.0,"Rooms":4.0},"author":"Hester Eichmann","date":"2014-02-13 19:18:52 +0300"},{"content":"I just read a horrible reveiw of this hotel. They called it run-down and musty. This is not the case. Its is lush and beautiful. The rooms are of EXCELLENT quality. The sevice is wonderful, and the pools are the best I've ever seen. I would HIGHLY suggest this hotel (being that I've been there lets see 10 times). WHoever wrote that review MUST have mistaken it with another hotel.","ratings":{"Overall":5.0},"author":"Dolores Boyer","date":"2012-11-18 20:53:56 +0300"},{"content":"I went with my family to this resort in August of 2001. The moment we pulled into the resort we were stunned by the beautiful gardens, and waterfalls. The valet put our cars into the garage and were very courtious to anything that we needed. When we checked into the hotel we had booked a 2 bedroom molokini suite. Let me tell you this room was HUGE. None the less that was only minor to what the resort was all about. No matter what you like to do on your vacation this place had it all. It was right next door to a beautiful outdoor mall (the shops at wailea). You could lay out on the beach, swim in one of the 6 pools, go down the water slides, shop, eat, bike, hike, sightsee, you name it you can do it at the wailea. I would recommend this resort to a family that wants to go and have fun. No matter how old you are there is always something to do.","ratings":{"Overall":5.0},"author":"Ulices Bergstrom","date":"2012-05-11 15:34:30 +0300"},{"content":"We stayed for 5 nights in February 2004. We brought our two kids-ages 8 & 6. This was the ideal resort for us. Luxurious and romantic, yet fun for all. I don't know how I would feel about all the families if I was a honeymooner, but hey, I'm 36 and I LOVE a good waterslide so if you are comfortable with happy kids around you, you will be happy here. Booked a terrace room (least $$$) in the Molokini wing. Our view was of the mountain and the 4 Seasons next door. After extensively touring the resort and taking advantage of its many facilities, I think the location of our room was ideal! Close to the pool & beach and also convenient get a cup of coffee and a quick breakfast at the cafe. We didn't experience any long hikes anywhere we wanted to go. We met a family staying in the Napua (concierge) while tir room was lovely, we had to take two elevators to get there from the pool. Ugh. The pool and beach area is excellent. It's windy and split up into several areas. I think this design accommodates the crowds well because we never felt like we were swarmed by people. We got the same spot at the pool every day. If you like convenient access between beach and pool, the GW is ideal. Both the Fairmont Kea lani & the 4 Seasons wailea are beautiful but you either sit at the pool OR the beach, not both. The pool area at GW flows seamlessly into the beach, including the public beach walk. It has very good feng shui in that regard. Meals at the resort were disappointing overall. Food at the pool is way overpriced and bland. After 5 days I was tired of the same salads and sandwiches. We enjoyed two lovely dinners at Bistro Molokini where the food was good but not memorable. Our best meal was the buffet breakfast at the 4 seasons-it was an easy early morning walk and a great food. Camp Grande was great. We never dropped our children off there but you can freely use the facility at your leaisure. There are video games and computer games and two nice toy rooms for kids. It was a great place to hang out before dinner. We also took the kids to a hula class and a lei making class at the camp. They charge a ridiculous $20 for each session, but the kids had a blast. Counselors were lovely and seemed to truly enjoy their jobs. About the spa. WOW! I booked a lava stone massage. After the first hour in the hydrotherapy baths, I could have gone home happy. The massage was icing on the cake. My experience at the spa was fabulous. I thought the staff was friendlyand gracious but not overly so. I had no complaints other than the fact that I spent over $200 in less than two hours. We were all sad to leave the Grand Wailea. The thing was, while we were there, we hadn't seen Hawaii! We couldn't bring ourselves to leave the resort too long. It's really a destination resort because there is enough to do (or not do) that you are completely satisfied. All of our sightseeing took place after we left and were staying in Kaanapali. The Grand Wailea was just too good to be apart from for long. I can't wait to return!","ratings":{"Overall":5.0},"author":"Bryana Hoeger","date":"2014-02-26 19:40:55 +0300"},{"content":"The hotel staff was friendly, regular room with king bed on second floor provided a nice park view of plumeria and hibiscus. We were across from beach and in the center of Kihei. Many restaurants within walking distance. Hotel pool and extras like the bikes, water in room, pool/beach towels and being able to rent beach chairs in gift shop made our short stay wonderful. We were only in Kihei for 4 days for a wedding and chose hotel accomodations for that reason. Thank you Maui Coast.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Gerson Leuschke","date":"2015-07-26 16:59:48 +0300"},{"content":"We loved our stay at the Maui Coast. As long as you're not expecting the Ritz-Carlton, you will be happy. Nice, spacious and clean rooms (we stayed in a suite, which was perfect for kids who wanted to nap). Staff was the friendliest we've encountered almost anywhere, including stays at larger resorts and luxury hotels. The location was perfect - right across from the beach and within walking distance of numerous restaurants. The only downside was the parking lot view, but I'm sure we could have paid a little more for the other view. Our friends were staying at a small hotel in Wailea and our hotel was definitely better and more convenient.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Conner O'Reilly","date":"2015-09-01 01:02:51 +0300"},{"content":"It was nice tor hear \"welcome back\" from Rudy desk supervisor although this was the first time we havn't received a room update. They Now have king beds, since their update, rather than the 2 queens that we prefer which are very firm with lots of pillows which are uncomfortably hard. There is entertainment by the pool from 6 to 8: none of which is resembling Hawaiian which we missed. They are getting very cheap, no paper or pan by the phone. A gingerale at the bar was $3.50 with a lot of ice and not much drink for my tummy. The bar food is extremely skimpy and over prices for what is on the plate. The hot tubs are very nice for those with arthritis or miss being in hot water at home.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":4.0},"author":"Zachery Hammes DDS","date":"2014-09-24 23:55:04 +0300"},{"content":"We stayed here last year on spring break- Im a teacher. We loved the hotel, location, staff and the room. We were afraid it would to far off the trail of things to do- not the case at all!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Connor Frami","date":"2014-10-27 02:28:51 +0300"}],"public_likes":["Magali Hoeger","Pauline Will","Dayton Rodriguez","Bertrand O'Hara","Danika O'Hara DVM","Wilfrid Stark","Ryder Kulas"],"vacancy":false,"description":"Contemporary 4-star hotel near Champs Elysees and rue Faubourg Saint-Honoré.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}