{"title":"Oban","name":"Oban Backpackers","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.obanbackpackers.com/","checkin":null,"checkout":null,"price":"from £16","geo":{"lat":56.4177,"lon":-5.4727,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20955,"country":"United Kingdom","city":"Oban","state":null,"reviews":[{"content":"Spent a weekend at the Henderson Wharf Inn located in the Fells Point section of Baltimore. I had a great time. Its directly on the water and has a boardwalk that stretches almost all the way down to the Inner Harbor. The hotel is in a great spot within easy walking distance of the restaurants and bars of Fells Point. Room felt very \"homey\" and comfortable. Friendly staff. 2 drawbacks, no bell staff to help with baggage and bad pillows. Otherwise it was great. Definitely get tickets for the Aquarium at the hotel and save yourself a lot of time and money.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Lonny Flatley","date":"2014-05-23 04:32:37 +0300"},{"content":"Will come again in spite of a couple of small things... We requested a room close to the lobby as walking is a problem, but that request was ignored and we had to wait over a half hour for another room. The TV did not work well and the remote was broken. Someone came and played w the TV, got it to work on one channel but it was annoying to have to get up to shut it after dozing off. Never got our complimentary wine either. All in all though, a nice place and as I said, we would give them another try.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Miss Clint Barton","date":"2012-02-06 13:29:04 +0300"},{"content":"Came down from PA for a relaxing night and found it at Henderson's Wharf. It was a great place to stay and wander the Fells Point area. Our room was beautiful, extremely spacious and had a great view. The lobby was great and breakfast the next morning was wonderful. Sat in the courtyard and enjoyed a cool morning with coffee and croissants. We were given a complimentary bottle of wine upon arrival - which I thought was very nice. Only wish that we could have stayed longer.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Marcel Kemmer","date":"2012-11-07 10:20:57 +0300"},{"content":"My wife and I recently stayed at the Henderson's Wharf Inn and we definitely enjoyed our stay. The room was spacious, the beds were very comfortable, but the room could have had more light. We kept our shades closed because our room was on the ground level (as are all the rooms) and we did not want walker/runners along the pier peering into our room. But, our view from the room of the harbor was lovely. Service: There could be more front desk staff. During our stay, it seemed like the young lady working the front desk was extremely busy and she was the only person at the front desk working until the next morning. Inspite of this, she provided great service. The bottle of wine upon check-in is a nice touch. Food: the continental breakfast was fantastic and was one of my favorite aspects of the hotel. The continental breakfast offered nice variety and the fool was delicious. The woman who tended to the breakfast was friendly and efficient; she provided great service. Value: Truly, the only issue I had with the hotel was the price. It's an expensive hotel for what one receives. My wife and I have been fortunate to travel and stay in some great hotels worldwide and it seems in our travels; we have experienced more for what we paid for at other hotels than what we paid for at the Henderson's Wharf Inn. The Henderson's Wharf Inn is a nice hotel and I will recommend it, but it could add something more.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":2.0,"Service":4.0},"author":"Cayla Hermann","date":"2013-02-05 13:31:08 +0300"}],"public_likes":["Payton Beier","Brain O'Kon","Deron Ortiz","Halle Gottlieb","Jasper Bayer IV","Miss Clarissa Rempel"],"vacancy":true,"description":"Private hostel, relaxed, fun, clean and cosy. Landrover day tours of 'hidden Argyll' available leaving daily.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}