{"title":"San Francisco/SoMa","name":"Four Seasons Hotel","address":"757 Market St","directions":"between 3rd and 4th","phone":"+1 415 633-3000","tollfree":null,"email":null,"fax":null,"url":"http://www.fourseasons.com/sanfrancisco","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7864,"lon":-122.4044,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26023,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My stay was comfortable,but I have some suggestionsfor to make rooms more comfortable. A electrical kettle with facilities to make Tea/Coffee should be provided bcse it is not possible to go down early morning for a cup of Tea.Shower room should have sliding door so that water while taking shower should spread out.","ratings":{"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Rahsaan Ruecker","date":"2012-07-12 05:05:37 +0300"},{"content":"I was very surpriced by the service and the room at this hotel. I did not have high expertations after reading the reviews here on Tripadvisor. I was not at all disapointed...... It is a 2star hotel, and that is what you pay for.... Some of the reviews in here are unfair! - Perfect location near a shopping center - The resturant in this hotel and the hotel next door are great. - Free internet in the lobby, bring your own computer or use one of the 3 computers in the lobby. - Clean rooms, really great service. - Polite and service minded staff - Icecube maschine at the first floor - Nice breakfast - Free shuttlebus for the beach I went on vaccation with my family for a week, all six persons had a really nice time. We will for sure come back to this hotel again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Anabelle Hermann","date":"2012-01-29 11:46:38 +0300"},{"content":"AC in the Room was not functioning well. Call to the recepiton was not taken inspite of several attempts from Room. Free Internet connection was not available in the Room. Since internet facility is so cheap internationally unlike before, and it is one of the essential in the present way of life and most of the Hotels are providing the same without any charge, this should be provided free. Breakfast, was not having much options.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Russel Haley","date":"2013-08-14 11:18:51 +0300"},{"content":"I stayed in Dubai for two nights and searched for a reasonably priced hotel with good connection to the airport and sights/malls. And that is exactly what I got with the Ibis Deira City Centre. The hotel is a short taxiride away from the airport and is located opposite of a shopping mall (one in which you won't get lost), in which you will find common retail brands, a food court and a huge supermarket. Furthermore it is a 5min walk away from the Dubai Metro which will basically bring you to most attractions in Dubai (Dubail Mall, Mall of the Emirates, Burj Khalifa etc) I arrived pretty early in Dubai and was happy to be able to check-in at 10am. One positive aspect was that they indeed provided me with a room that I requested. A few weeks before my stay I messaged them asking for a room on a higher floor facing the Burj Khalifa side (only visible on clear days though), and that is exactly what I got. The rooms are a typical Ibis size, not too big, but for me it was more than enough. It is clean and looked fresh, and that's all that I hoped and asked for. As previosly mentioned there is no free internet in the room. I just checked my mails in the lobby where you'll find wireless as well as 3 PC's. In summary the hotel is very good value for money and seems perfect for me for a short stopover without spending too much money on accomodation.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Pietro Pacocha","date":"2015-11-29 21:13:21 +0300"},{"content":"Over all cleanliness, rooms and sleep quality were excellent. however front office staff particularly morning shift were seems grumpy and unhappy when dealing with guests. I thing need to improve this area otherwise its an excellent hotel to recommend a friends.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vicenta Rice","date":"2012-07-29 14:18:44 +0300"},{"content":"the hotel was efficient. breakfast was well presented and fresh. the receptionist referred us to the black non metered taxi at the entrance and he was aggressive in demanded more money than agreed when we got to the airport. only problem with a pleasant stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ignatius Rath","date":"2014-12-19 01:40:00 +0300"}],"public_likes":[],"vacancy":true,"description":"Very high-end hotel. Beautiful art collection, and extensive sports club with fitness facilities and spa.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}