{"title":"Paris/1st arrondissement","name":"Hôtel Brighton","address":"218, rue de Rivoli","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.paris-hotel-brighton.com/en/home","checkin":null,"checkout":null,"price":"Double from €229","geo":{"lat":48.86483,"lon":2.32905,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21726,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"My wife and I spent our wedding night at the Grand (we had rented a home in Maui for the week). We enjoyed a fantastic dinner and sunset at Humuhumu, and had an overall wonderful experience there. My only knock on the property (and bear in mind, we only spent one night there) was that the rooms felt dated to us. I would certainly consider returning to the Grand for future vacations.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Cullen Jerde","date":"2014-12-02 14:14:11 +0300"},{"content":"I am writing this review because I feel it could be very beneficial to not only family vacations but also corporate and incentive travel groups. I have worked in the hospitality industry over the past 30 years and currently own and operate a Destination Management Company in Scottsdale Arizona. Service is the key to my success and anytime I travel, I am always evaluating those who I encounter. I recently took a family vacation to Grand Wailea Resort on the island of Maui. I can not express enough what a wonderful time we had. The room was spacious and had all the necessary amenities to enhance our stay. My kids, 10 & 12 are still talking about the Tarzan Swing, Water Slides and Water Elevator. My wife on the other hand enjoyed a message by the adult pool. During one of the evenings, I noticed that a group was having a private Luau on the beach. What a spectacular setting, over looking the ocean with the sun setting. Even though Arizona is known for it sunsets, there is no comparison to what I experienced in Maui! The service at the hotel was outstanding, from the pool service to the front desk. As I had mentioned, being in the industry, sometimes I can be a little demanding. Not once did anyone say no or even give me a reason to think twice. Upon check-out, we needed to vacate our room due to a large group checking in. Since our plane did not depart until 10:30PM, the front desk clerk suggested that we enjoy the pool facilities and than come back to the desk and they would give us a hospitality room to change. In closing, I would highly recommend the Grand Wailea Resort to anyone who is looking for a beautiful hotel, with impeccable service, unbelievable sunsets and wonderful recreational activities, than this is the hotel for you! Jack Hardy Jr. Arizona Creative Events","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Zola Champlin","date":"2013-03-24 22:17:24 +0300"},{"content":"Everything and everybody at the Grand Wailea made our visit to Maui an absolute highlight: from roomservice, to conceirge, restaurant staff, beach boys...no one (and I challenged myself to find the anomally) performed their job less than professionally, courteously, and thoroughly. I do not hire out services at home so when I stayed at the Wailea, I noticed and appreciated that not a single dead branch was left hanging from a tree, bed corners were made nice and tigh, TP folded in a perfect triangle, no sand on porch or fingerprints on slider, etc. etc. Truely, my visit to the Grand Wailea was the best ever, by every standard I might measure. Thank you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Elwyn Zboncak","date":"2012-10-11 12:54:02 +0300"},{"content":"This is an absolutely beautiful spot, one of the most gorgeous scenery you will ever see. However, the first day there my husband and I got up early (6:30 a.m) due to time change and urge to walk the awesome cliff walk. When we got to the beach we saw a line resembling the running of the brides at Filene's Basement in Boston (except it was coed). We were puzzled and asked what everyone was lining up for. The response was that everyone was there to claim their chairs! I told my husband that I REFUSED to enter that rat race and line up at 6:30 to get a chair. Well, that was a mistake as I ended up laying on my towel on the beach at a $700 a night resort! I felt like I was back in HS! The elderly couple next to me was in the same predicament and I watched in horror as the gentlemen struggled to get up from the sand. The pool area resembled a scene from CNN showing the tent cities in Haiti. People were elbow to elbow with towels, rafts, etc strewn about. The resort is beautiful and the beach is glorious, however, I don't understand why this chair scene is more competitive than the Wall Street Job Market! Why don't they have enough chairs for everyone or why can't they stop people from \"saving their spot\" all day?","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Sebastian Hane","date":"2013-01-04 00:16:48 +0300"},{"content":"Just had the most wonderful 13 days relaxing at the GW- by the end of our vacation my 14 year old daughter was already planning our return trip for Christmas. What do you dream of when you go to a tropical island? Beautiful white sand beach with great beach activities? Warm tropical breezes and sunny skies? Great, friendly staff ready to satisfy your every request? So many pools to explore with slides and caves- and a swim up bar with Richie shaking up frosty cocktails? Incredible grounds with amazing tropical flowers, beautiful artwork around every corner- fabulous food in a thatched hut restaurant where you are suspended over a tropical aquarium- oh and the spa- heavenly! Does it all sound over the top? Maybe- but the GW is one of the most incredible hotels I have ever experienced. We were treated like queens- upgraded to a beautiful ocean view room in the Chapel Wing, had champagne and chocolate dipped strawberries from the hotel delivered to the room for my birthday. The only bummer was the guy in the next room who took a 5am conference call on the speaker phone for three days in a row- but one small blemish in paradise I can overlook. We will be back...as many times as we can!! Highly recommend taking a day trip to Piiholo Ranch for the Zipline- amazing, breathtaking, soooo fun!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaclyn Stanton","date":"2012-08-23 12:54:12 +0300"},{"content":"We chose The Grand Wailea because we had a great stay in April of 2007. This time (Oct 2009) things were a bit off. We caught two different conventions while we were there. It felt more like 'Spring Break' for 30 year olds. People were playing football in the pool and 30 year old drunk men were hitting on me. The grounds were also not as nice as I remember. Our room was great as it was the first time (clean and the bathroom is huge!). The staff was very nice especially in the main bar. However this will be the last time staying there.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Dorian Nienow","date":"2013-09-28 04:16:40 +0300"}],"public_likes":["Jerad Hilll","Chaz Zieme","Sonia Graham","Lonie Gottlieb IV","Jadon Yost","Jade Wisozk"],"vacancy":true,"description":"The executive and deluxe rooms offer a breathtaking views of the Louvre, the Jardin des Tuileries, and the Eiffel Tower. Classic Parisian-style hotel next to shopping and cultural hot spots.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}