{"title":"South Uist","name":"Brae Lea House","address":"Lochboisdale,HS8 5TH","directions":null,"phone":"+44 1878 700497","tollfree":null,"email":null,"fax":null,"url":"http://www.braelea.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.15798,"lon":-7.31391,"accuracy":"APPROXIMATE"},"type":"hotel","id":28178,"country":"United Kingdom","city":"Lochboisdale","state":null,"reviews":[{"content":"This is one of many wonderful Ritz Carlton properties. Although they do not all live up to their brand, this facility definitely does. Great location walking distance to the French Quarter. Wonderful rooms, beautiful courtyard, many well appointed bars and restaurants.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Service":4.0,"Rooms":5.0},"author":"Bruce Mitchell","date":"2013-11-10 04:31:27 +0300"},{"content":"I have stayed in many Ritz-Carlton's and was always a satisfied guest when checking out. But not his time!!! This time, my experience was not a very good one and I am very disappointed. The New Orleans Ritz-Carlton has to many flaws to justify a high classification of a top ranked luxury hotel. The rooms do not seem to be in a very good shape. The carpet in my room had many stains, and it looked like it need a proper cleaning. My room was also very noisy, letting me hear lots of disturbing noises from the street and from the rooms next to mine. Most of the hotel staff (housekeeping, room service, front desk) did not act very professional and seem to lack training. My recent New Orleans Ritz-Carlton experience was terrible in comparison to other Ritz-Carlton hotels, and well below the high service standard it normally offers under this flag.","ratings":{"Overall":1.0},"author":"Rosemary Kuhn","date":"2014-08-19 20:20:00 +0300"},{"content":"Yes the Ritz sets high expectations which means they have to stay sharp. I respect that, understand it, and am willing to pay for it. However, my stay last week in New Orleans left a little to be desired. Four days later, I stayed at the Holiday Inn in Historic Charleston and received twice the service at half the price. And yes, part of that was based on expectations. My stay at the Ritz was off-kilter by a stained carpet, red wine or ?, my room charge going up by $40 mid-week, stuffy front desk staff, and a focus on exceeding the expectations of not me, but other people. The spirit is there, but the delivery is a little weak at this hotel. I'll try again and hopefully, they will try harder.","ratings":{"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Service":3.0,"Rooms":2.0},"author":"Roselyn Veum II","date":"2012-02-10 17:33:38 +0300"},{"content":"We stayed in an Executive Suite on a recent four day trip to New Orleans. The suite appeared perfect initially then we discovered an unclean bathroom facility and waited two days for a special request from housekeeping. Despite the rocky start the service for the most part was up to Ritz-Carlton standards though turn down was skipped one night. The lack of a swimming pool was a disappointment in the August heat of New Orleans. There always seemed to be security personnel around the entrances to both the Ritz and the Maison-Orleans during the day. At night there was no visible security. We had to report an obvious intrusion by a New Orleans \"less fortunate\" into the Maison elevators at 2 am to a befuddled night guest service person. The person wandering around was harmless and simply looking to gain access..but this was not reassuring about the hotel security concerns. All the personnel were friendly and helpful until departure when my traveling companion was instructed to find a taxi on Canal Street upon departure. I can say I amazed the Ritz in New Orleans has maintained its 5 star 5 diamond ratings. I wrote an email to management concerning both praise and a couple of the problems. I am happy to say I was answered promptly, courteously and in writing. For that reason I will return to the Ritz in New Orleans. Otherwise the Windsor Court would get my business in the future.","ratings":{"Overall":2.0},"author":"Jerrold Gutkowski IV","date":"2015-01-04 15:29:47 +0300"},{"content":"This is the second time I've stayed here and I really like antique decor, balcony, and porch. The relaxed friendly atmosphere gives me a homey feeling. I find the historical nature of the hotel inspiring for my photography activities in the French Quarter and surrounding areas. It has always been clean and well neat.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Abbey Carroll I","date":"2012-11-23 17:13:06 +0300"},{"content":"I booked this hotel because of the incredible location in the French Quarter and because the rest of the city was sold out. At the time of my booking this hotel was #143 out of 151 hotels in New Orleans, so I was expecting a complete dive. I have to say I was pleasantly surprised. We arrived in the evening and a gentleman met us as we got out of the taxi with our keys. The room we were in had a door facing Royal street on the 1st floor. Yes, the furniture was old. Yes, the decorations were old. Yes, it smelled a little musty. But it was a great experience. There aren't big frills like Room Service and Mini Bars, but there is a kitchen with a full size refrigerator, coffee maker, adequate shower and bathroom facility, beautiful antique decorations, and most of all a true New Orleans experience. The one staff member that met us was available when we needed him for an iron, directions, and general friendly conversation. I agree that if you're looking for somewhere fancy look elsewhere, but if you're interested in a room with charachter that is literally one block from Bourbon street and walking distance of everything you need, this is the place.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Allan Will","date":"2014-01-01 01:46:24 +0300"},{"content":"The valets were extremely informative and polite. I received my car very quickly. Thanks to Bobby. He was a pleasure to work with. He is commended for hiswork service. I would recommend this hotel to a friend.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Kip Langworth","date":"2014-01-05 16:40:12 +0300"},{"content":"We stayed here before we took our cruise. Everyone was very friendly and helpful. Valet, while pricey, was very prompt with our car and very personable. I remember one valet team member, Richard, was super! The front desk staff was also wonderful. We actually booked the room on Priceline, and we had never heard of it before. We were very happy!! We had a balcony room, and the street noise was nonexistent. We would love to stay here again!!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Stephany Bauch","date":"2012-01-09 20:51:33 +0300"}],"public_likes":["Joelle Jakubowski Sr.","Ms. Nyasia Hamill","Connie Rath","Mariana Kuvalis"],"vacancy":true,"description":"A guest house with ensuite bedrooms about a mile from the ferry.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}