{"title":"Barmouth","name":"Môr Wyn Guest House","address":"21 Marine Parade, Barmouth, Gwynedd, LL42 1NA","directions":null,"phone":"+44 1341 280185","tollfree":null,"email":null,"fax":null,"url":"http://www.BarmouthGuestHouse.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.7235,"lon":-4.0608,"accuracy":"ROOFTOP"},"type":"hotel","id":2483,"country":"United Kingdom","city":"Barmouth","state":null,"reviews":[{"content":"Booked one night on our way from Newcastle to NZ through the Entertainment Book not expecting much as it was v.cheap for Sydney. Trip Advisor reviews tipped the balance and came through for us once again. Excellent location, room was smallish but bathroom was big and v.clean. Comfy bed and quiet considering we were on George St. Didn't try the pub grub as we had dumplings and dessert at 2 favourite places both within 2 minutes walk of the hotel. Would definitely stay again!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Mr. Demetrius Hudson","date":"2015-01-20 21:20:53 +0300"},{"content":"Love that everything is just a short walk away, the meals were huge and delicious!! Great value for money! Yes the rooms are small but really.. Your only sleeping in them","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Eloy Brekke","date":"2014-04-23 09:59:58 +0300"},{"content":"I haven't actually stayed at the Great Southern Hotel yet, but I have got to say that the Great Southern Hotel has exceptional staff and service. My flights to Sydney (today) were cancelled this afternoon due to the ash clouds passing over the air space. This was extremely inconvenient and has messed up many of my business plans. Fortunately, I have one thing less to worry about with GSH. I called the Great Southern Hotel, hoping for a refund although I was aware of their cancellation policy (I should note that I was rather impolite and pushy, but they put up with me and were very patient). Their staff recited their policy as I had expected. A couple of hours later however, Donald from GSH called me to tell me that a refund or change of dates was on the way. This is fantastic service. The staff at GSH really know how to treat customers to keep them coming back. Mind you, they are very strict with their cancellation policy, but in my case, with such unfortunate circumstances, they understood and made my life much much easier!","ratings":{"Overall":5.0},"author":"Mrs. Pascale Mueller","date":"2014-06-06 12:10:23 +0300"},{"content":"While the location was good, pretty much right in Chinatown, that is the only good thing I can say. On checking in we were confronted by a notice saying that there was a 2% surcharge on credit cards. In all our years of business travel, we have hardly ever been charged a surcharge and certainly not 2%. The room was not inspiring - no artwork or anything to break the monotony. The toiletries consisted of one minuscule soap, a combo shampoo/conditioner (1 measly bottle) which left our hair feeling like straw, a shower cap and tissues. There was no mini bar - you had to venture down to reception to purchase anything. The room had no compendium or any hotel information at all. Pillows were uncomfortable. We paid for breakfast vouchers, and what a disappointment - slimy eggs with uncooked white slopping around, anaemic baked beans, the most horrible sausages we have ever tasted, and something that looked like bacon but may not have been. I was woken up the day BEFORE checkout by a call from reception telling me that we had an outstanding balance. We were quite aware of this (internet use, breakfast vouchers) and would have settled as usual on checkout. Why we had to be disturbed and told this is a mystery. I would definitely not recommend this hotel.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Hanna Zieme II","date":"2015-06-02 12:26:39 +0300"},{"content":"This hotel is in a good location just five minutes(walking) from main station it is at the top of the shopping area.Staff at front desk were helpful. rooms a good size and clean.it has internet connection but you pay. will store bags for you but you pay$2 a day which is not bad. pub and food on site","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":4.0},"author":"Hollie Sauer","date":"2014-10-19 10:11:40 +0300"},{"content":"I only paid $94 per night to stay at this hotel. It had been 7 years since I last stayed here and I was pleasantly surprised. Close access to Chinatown and the theatre district - a short stroll to Central Railway Station, and 5 to 10 minute walk to Pitt St Mall. The room was clean and the bed comfortable. I slept very well! It is a cheap nightly price to stay in the Sydney CBD","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Mrs. Zora Carter","date":"2012-01-25 20:20:34 +0300"},{"content":"Got a great rate for this hotel - for under $A100 it's cheap and cheerful, a great deal in the city centre. It's 2 blocks away from the central railway station and on the free commuter link bus route. The staff are young, happy and well trained, and look after you well. It's a good hike above a backpackers in quality, in the backpacker district. The rooms aren't by any means designer, but for the money they're clean and do the job, reasonably quiet. Right out the back is MarketCity, for healthy brekkies. The restaurant is of the steak and chips school, so dinner at MarketCity might be a better health choice :-) Overall I enjoyed my stay here, and found it an excellent base for exploring Sydney on my own coin (although would go a little more upmarket if there on business).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Jamarcus Nolan","date":"2013-03-03 19:25:31 +0300"},{"content":"We stayed at the Great Southern Hotel for 3 nights (incl weekend). The room was more than adequate, the location was great for access to transport (and walking - which we mostly did) and shopping. The meals in the bar were excellent value and very good quality. Try the 280gram rump steak with chips and salad for $7! All round the stay was pleasant, with the only minor problem being the occasional noisy guest/s in the corridor. We requested a quiet room when booking and were put out of the way, so this wasn't such a problem for us.","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Ms. Amani Schmeler","date":"2015-01-16 07:54:49 +0300"}],"public_likes":["Eleonore Connelly"],"vacancy":true,"description":"8 bedroom guest house family friendly at the end of Marine Parade, closest guest house to beach.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}