{"title":"Lochmaddy","name":"Hamersay House","address":null,"directions":null,"phone":"+44 1876 500700","tollfree":null,"email":null,"fax":null,"url":"http://www.hamersayhouse.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60489,"lon":-7.16229,"accuracy":"ROOFTOP"},"type":"hotel","id":15978,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"Lived up to the hype! We stayed from the 5th-19th May for our honeymoon and highly recommend the Iberostar Bavaro.Transfer time from Punta Cana airport 30-45mins. Getting through the airport was less painful than anticipated. We purchased our tourist cards in advance, but it cost twice as much. It did not seem any hassle at all to buy them at the airport upon arrival, which is what we wish we had done.Check in at the hotel was smooth, complete with Banana Mama upon arrival. We rented a safe in our suite for $2 a day.The junior suite was very impressive. I think we may have been lucky enough to get a recently refurbished room, no musty smells, air con worked fine, beds huge and very comfortable. Good size bathroom with separate shower cubicle and bath.Our suite was perfectly located for both the pool and beach. Blocks (which house 8 suites each) numbered 234,235 and 236 are in the same area. We were in 2365, a ground floor suite. 5 minute stroll to the lobby, bars and buffet/restaurants.Its worth tipping the maid a dollar a day, it keeps the minibars well stocked with what we wanted and we are convinced that the lovely little touches the maid did to the room were as a result of tipping.Staff are friendly and helpful, good levels of service, it was near impossible to have an empty glass. Make sure you tip for good service, make the effort to pick up a few words in Spanish, it makes a big difference.We confirm that pathways are hazardous when wet. My wife tells me the paths are not for high heels, flat shoes are the way to go.Grounds are stunning and impeccably maintained and contain amazing wildlife.Huge pool with complete with swim up bar. The swim up section of the pool (about one third of the area of the pool) was closed for refurbishment from the 4th day and this was still going on when we left. It was disappointing, but its an all year round resort, so it has to be done at some point and I guess as the low season has just got underway and the rainy season is coming it seems a sensible time to do such work.Beach is by far the best we have encountered, a tropical paradise. No trouble getting a palapa, but if you insist on a front row palapa, get there by 9-9.30.Breakfast and lunch buffets are of good standard. For lunch, the poolside buffet offers a wider selection. We found the evening buffet below par. However we both suffered with stomach problems which took the edge of our appetite and could well have clouded our judgement and we may have been over critical because of this. Stomach problems or not the Gourmet restaurant was great.We ordered room service one night, took about 40 minutes and was of a decent standard.We tried hard to listen for construction noise throughout but could hear none. We ventured to the south side of the resort and did hear moderate construction noise. To avoid this being a problem within the suites try to avoid suite numbers starting in one (buildings 101-132). In our opinion, if you choose suite numbers starting in a 2 or a 3, you should have no problems.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Kirk Hintz","date":"2014-12-22 06:08:32 +0300"}],"public_likes":["Fausto Abernathy","Pink Tromp","Elta Schaefer"],"vacancy":true,"description":"Formerly the Tigh Dearg Hotel, a new hotel (opened in 2005) located about 15 minutes walk from the ferry.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}