{"title":"Birmingham (England)","name":"Holiday Inn Express Birmingham Oldbury","address":"Oldbury M5, Jct 2","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.expressbirmingham.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.49476,"lon":-2.02214,"accuracy":"ROOFTOP"},"type":"hotel","id":3611,"country":"United Kingdom","city":"Oldbury","state":null,"reviews":[{"content":"My 2 teenage daughters and I wanted a short weekend away and i was lucky enough to take advantage of a TravelZoo promotion at the Hotel Burnham in Chicago. From the welcoming e-mail we received a couple of days ahead of arrival right to the loading of the car at departure we were treated like royalty. The luxurious rooms,the restored wood and iron grills on the elevator were even appreciated by my daughters which from teenagers is a real compliment. The offer of a glass of wine when I first entered the lobby after stressing through rush hour traffic was very welcome. I know there have been lots of complaints about noise but we had a corner room on the 12th floor and we had no problems with noise. Even though we were across from the elevator we never heard anyone in the hallway-it was as if we had the place to ourselves. We had an amazing deal for the 2 nights but I'm already making plans to go back with my husband this time and I would happily pay the going rate if there are no discounts available. The hotel is central to everything and we enjoyed walking in all directions to see what was around the corners. My first trip to Chicago but I'll be going back for sure.","ratings":{"Overall":5.0},"author":"Orval Rippin","date":"2015-02-16 15:38:10 +0300"},{"content":"Spent three nights here before moving to another hotel for a conference. Should have stayed here for the duration. Beautiful, quite hotel in a historic building with an unparalleled location. Staff were uniformly friendly and helpful--all seemed happy to be working here. This will definitely be my Chicago hotel for future trips.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Furman Carroll","date":"2015-07-03 21:07:14 +0300"},{"content":"We have a corporate rate with this hotel and I can't be happier. It's an ideal location to our office (3 blocks away) and it's got great decor. Everything feels like its brand new yet looks antique. The huge windows afford a great look of the area outside and checking in and checking out is extremely easy and painless. The staff here is always trying to make my stay better than the previous one, which is great. Checking in at most other hotels is about as exciting as going to a bank and you get treated like a chore. There is construction going on across the street at a 24-hour pace. Surprisingly, it has yet to disturb me or disrupt my sleep.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Clementina Luettgen I","date":"2014-07-21 20:01:19 +0300"},{"content":"The Hotel Burnham is a recommended experience for anyone exhausted of the bland environment of many major chain hotels. First of all, the ambience is quite nice, where the up-to-date interior design exploits the charm of the historic architecture with quite a modern flare. My wife and I stayed in the smallest room available (queen bed), overlooking State Street, but found the space large enough for my needs. The room was very clean, comfortable, and visually pleasing. The view of the Christmas Tree and Macy's made it all the more romantic and quaint. The staff was quite professional and friendly. Overall, it was top-notch service and a great experience. I am now addicted to Kimpton hotels and will stay there as often as possible in my travels. Now most reviews are not found credible without some constructive criticism. While I have very little serious criticism of the hotel, I found the food selections, and in particular, the wine, at their restaurant slightly overpriced considering the competition of world-class dining in the area. However, the food and service was still, by-and-large, above average. Considering many respected hotels have much worse food quality but at inflated prices, this hotel's dining is definitely ahead of the game. Overall, a more more memorable hotel stay. Hotel Burnham is luxury at a very reasonable price.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Lillie Roberts","date":"2013-08-27 20:13:28 +0300"}],"public_likes":[],"vacancy":true,"description":"Where comfort meets great value rates, all guests receive free WiFi in public areas and a complimentary breakfast to set you up for your day.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}