{"title":"Swansea Bay","name":"The Towers Hotel and Spa","address":"Jersey Marine, Swansea, SA10 6JL","directions":null,"phone":"+44 1792 814155","tollfree":null,"email":null,"fax":null,"url":"http://www.thetowersswanseabay.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.631018,"lon":-3.862038,"accuracy":"APPROXIMATE"},"type":"hotel","id":28962,"country":"United Kingdom","city":"Skewen","state":null,"reviews":[{"content":"I never stayed at the Hotel Riverview but live in the neighborhood. Believe all the negative reviews. This place is downright scary. There are drug addicts and transgender prostitutes that frequent here. I always feel sorry for the unknowing tourists I see arriving outside this hotel. STAY AWAY!","ratings":{"Overall":1.0},"author":"Monserrat Johns","date":"2013-05-26 13:55:11 +0300"},{"content":"Stayed at the Gild Hall last month and I was pleasantly surprised. I just moved from living in New York for 7 years so I am well aware that the financial district shuts down on the weekend but as a former New Yorker enjoyed the quiet streets and neat little finds for pubs and places to dine. It is also walking distance to Tribeca where you can find a little more night life. As for sleeping it was quiet and enjoyable. The staff was overly helpful in recommending places close by and gave us a room upgrade upon checking in (even having booked at a very discounted rate). If you are looking for the bright lights and touristy NYC don't stay here but if you want to enjoy a bit of New York off the beaten path then I highly recommend the Gild. Not to mention when the Monday rolled around the hotel was a buzz and you can't beat happy hour on Stone Street.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Alison Gutmann","date":"2015-02-07 23:50:26 +0300"},{"content":"My boyfriend and I both live in NYC and wanted to do a little \"staycation\" in the city. We found this hotel on a whim and booked it. We were SO pleasantly surprised. Leather tufted chairs, well-styled bookshelves, and beautiful objets adorned the very handsome lobby. A parquet staircase led to a gorgeous bar with a great ambiance. The room was immaculate and new - very comfortable bed and huge shower complete with Bigelow toiletries. We slept in, checked out an hour late and were not charged extra, the staff was super accommodating and friendly. All in all, a great value (probably the best value in NYC) for a stylish and modern hotel with great customer service.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Ms. Dejuan Kautzer","date":"2014-08-26 13:57:37 +0300"},{"content":"Great Location walking distance to South Street Seaaport and the Seastreak Ferry to Atlantic Highlands NJ. Great rooms, clean,comfortable and great service and attention to detail.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Candido Ernser","date":"2013-03-22 20:56:22 +0300"}],"public_likes":["Maximo Schumm","Jettie O'Reilly","Lila Jaskolski","Edmund Hilll","Mrs. Hazel Dickens","Ollie Botsford","Mariane Zieme","Rosalinda Pagac"],"vacancy":true,"description":"Located next to the Jersey Marine Tower which is the tall octagonal tower visible from the Fabian Way.  The tower itself is the hotel's premier suite and the top floor bedroom offers views of Swansea Bay.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}