{"title":"San Francisco/SoMa","name":"Marriott Marquis","address":"55 4th St","directions":"between Stevenson and Mission","phone":"+1 415 896-1600","tollfree":null,"email":null,"fax":"+1 415 486-8101","url":"http://www.marriott.com/hotels/travel/sfodt-san-francisco-marriott","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.785,"lon":-122.4042,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26027,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The hotel was very nice. The room was clean and the view was amazing. The main problem that I had during my stay was upon checkout when I realized I was being charged $25 a day to park my car in the hotel parking garage. Other than this everything else was excellent.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Amparo Waters","date":"2012-09-17 17:12:07 +0300"},{"content":"This hotel gets it. The minor details are what set this hotel apart from the others. Ashley at the front desk was extremely sweet and accommodating, checking me in well before the 3pm check in time after a horribly delayed red eye flight from the right coast. The rooms are immaculate. Clean, nice furniture, and are fully stocked. Small things like the basket full of umbrellas at the entryway really set this hotel apart. Yes, we all know it rains in Seattle, but how many of us pack umbrellas on our trips? Probably not many. Hotel is definitely in walking distance to the Space Needle/Pike Market and Westlake.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Theodora Beahan","date":"2015-03-12 13:21:13 +0300"},{"content":"This hotel is highly recommendable if coming to Seattle for tourism purposes. Staff were courteous on arrival. My room was not a suite - just a basic room with a kingsize bed. The room wasn't huge but was an adequate size and was quite cozy. It had a balcony and all the usual amenities (fridge, safe etc) and the Internet connection was free. Location of this hotel is perfect - 1-2 min walk to the main shopping area of Pike Street, the bus tunnel is opposite the hotel and it is a short walk to the Seattle Center monorail. The only very slight negative point is that it is situated on a hill (not a steep one though).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tatyana Lakin","date":"2015-03-05 11:31:17 +0300"}],"public_likes":["Christop Fahey","Neha Sanford DDS","Donnie Ruecker"],"vacancy":false,"description":"Convention center hotel situated across the street from the Moscone Center.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}