{"title":"San Francisco/Union Square-Financial District","name":"Le Méridien","address":"333 Battery St","directions":"between Commercial and Clay, next to the Embarcadero Center","phone":"+1 415 296-2900","tollfree":null,"email":"hotel@lemeridiensf.com","fax":"+1 415 296-2901","url":"http://www.starwoodhotels.com/lemeridien/property/overview/index.html?propertyID=1957","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7947,"lon":-122.4009,"accuracy":"ROOFTOP"},"type":"hotel","id":26228,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"It is a very nice clean hotel, staff are very helpful and friendly, and the neighborhood is lovely. I stayed there for two days and I will next year because it felt like home. Thank you Fatih.(for all the maps:) )","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mrs. Dustin Raynor","date":"2015-07-11 13:16:36 +0300"},{"content":"Our seven day stay at the Osmanhan Hotel was wonderful. It is in the Sultanahment District with a rooftop view of the Blue Mosque and overlooking the Bosphorus . My husband enjoys drawing, and it was a perfect place to sketch. The staff were helpful in every possible way. It is impeccably clean and comfortable. The breakfasts were perfect. You will be lucky to get a reservation. We will book ahead on our next trip. March is low season, but we met people from all over the world. What a wonderful Istanbul experience staying at the Osmanhan Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Lia Nolan","date":"2014-05-16 04:06:24 +0300"},{"content":"The hotel is located right next to all the important sights in Istanbul. They serve an execellent continental breakfast served on the rooftop terrace with beautiful views over the Bospherus. Friendly staff and a very safe neighborhood makes this hotel great value for money. Within easy walking distance to the tram that enables easy access to airport via metro. Nice running route available just head towards the coast (2mins) and follow the coast a couple of km and turn left into the park which leads to Blue Mosque and back to Hotel. 4 km route and very peaceful running between the great Mosque and Hagia Sofia early in the morning when the streets are empty.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Kellen Feest","date":"2013-05-21 07:33:15 +0300"},{"content":"Found this place on Tripadvisor and it totally lived up to it's billing. We stayed for three nights in July. The hotel organised an airport transfer for us and the staff couldn't have been more helpful with restaurant recomendations and trip bookings. The room was lovely and the breakfst delightful with plenty of choice in a superb rooftop location. The hotel is ten minutes walk from all the main sites and a few minutes from a bustling street with a good choice of restaurants and bars. Not only all this but its good value for money too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Andrew Turner","date":"2015-01-03 05:37:47 +0300"},{"content":"The hotel is in the heart of the old city and within walking distance of most of the attractions.Use the shuttle transfer service to get you to and from the airport, its much cheaper than a taxi and you can arrange it from the airport/hotel. During breakfast on the rooftop where you can admire the view of the Sea across the red tiled rooves, you will probably be joined by the inquistive doves. There is no lift in the hotel so if this is going to be an issue for you you may need to consider other hotels.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Felicity Yundt","date":"2013-10-18 16:42:09 +0300"},{"content":"Chose hotel based upon TA recommendations. Very good in all respects but rooms are a little small but OK for short stays. Reception staff excellent - friendly and helpful. Top location being near good restaurants and all the top sites.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ismael Heidenreich","date":"2012-01-10 12:30:57 +0300"},{"content":"i am traveling to Istanbul since long time and i have been in many hotels, but OsmanHan is the one that i can say i felt like home. Located just in perfect place. You can get easily to all historical places in a walking distance. But beside that what i was really impressed is the clean rooms and friendly stuff, who were always ready to help and easy to communicate in English, helping with everything with their smiley faces. For those who really want to have a real Turkish breakfast is a must in OsmanHan Hotel with the terrace view on Bosporus.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaeden Stokes","date":"2014-03-05 15:45:38 +0300"},{"content":"Fantastic location, in a quiet area 2 or 3 minutes' walk from the Blue Mosque, Topkapi, Hagia Sophia, bars, restaurants, shops and tram stop, with a breakfast terrace overlooking the Sea of Marmara and with a close-up, albeit partial, view of the Blue Mosque. Newly renovated building with a definite charm, but admittedly most of the hotels in the area are in similar buildings. Room not luxurious, but perfectly well appointed, comfortable, quiet and spotlessly clean. What made it exceptional, almost unique in my experience, was the staff. All of them, without exception, were at all times faultlessly friendly, attentive, helpful and polite.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Christelle Considine","date":"2015-01-29 07:42:16 +0300"}],"public_likes":["Ethel Harvey","Damion Jacobi PhD","Karen Okuneva","Antonietta Stehr","Maureen Thiel","Dusty Goldner","Miss Velda Stehr"],"vacancy":false,"description":"A luxury hotel that mostly caters to business travelers. Large rooms and very nice furnishings and art work. If you stay at this hotel, make a point not to eat breakfast here, as it is expensive and there are other good options nearby.","alias":"formerly the Park Hyatt","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}