{"title":"San Diego/Balboa Park-Hillcrest","name":"Balboa Park Inn","address":"3402 Park Blvd","directions":null,"phone":"+1 619 298-0823","tollfree":null,"email":null,"fax":"+1 619 294-8070","url":"http://www.balboaparkinn.com/","checkin":null,"checkout":null,"price":"$100-$240","geo":{"lat":32.74134,"lon":-117.14785,"accuracy":"APPROXIMATE"},"type":"hotel","id":25118,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"10/3/2008 - 10/6/2008 This is a 20 minute ride from the airport in San Juan, (taxi is $50). If you want to get away from the tourism this is the place to go. You will see everyday people going to/from work and going out to dinner. But you will still feel like you are on vacation! This is a new hotel less than a year old. Nicely decorated with a modern decor. Clean as a whistle! The rooms are simply nice.... you can't ask for more! To top it all off...you can't beat the price. Continental breakfast was very good. Waffles, muffins, fruit, cereal.....you get the point. The staff was very nice and helpful. They were even patient allowing me to praticar espanol. Across the street is the beach. I would recommend walking down about 1/4 mile to get in the water, but you are not allowed to swim. It is beautiful. Or travel down to the next light and you will be in Punta Salina. The beach there is even better. There are places to eat across the street. Eat at the taco place and at a restaurant around the corner called Restaurante Meson de Playa. GREAT FOOD there! Try the food from the vendors along the road for authentic food. 1. Go to Casa de Bacardi - Tour with two free drinks 2. Go to El Morro in Old San Juan - travel to Catano and take free ferry across. I LOVED this hotel and I LOVED my stay in Puerto Rico!","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":3.0},"author":"Kristopher Russel","date":"2015-04-20 04:03:11 +0300"},{"content":"The hotel was exactly at the center of everything. Istiklal str- The shopping street!!!- is 4 seconds away. Taksim square-where metro and buses and tram begin- is1 minute away. All kinds of restaurants are nearby. The residence is in excellent condition.11 rooms only, so it was like we were home. Everything in the hotel is new. Great matresses and great jacuzzi in the room (not in all rooms).The stuff was great and helpfull. We booked a room in the back side which has got no view AT ALL but it's extremely quite-exactly what you need after a full day walking around a city like this. You need to sleep, you don't want to sit outside in the balcony. The only thing that was poor was the brakfast but with a hundred places around to eat, you don't need the breakfast. I will go there again for sure.","ratings":{"Location":5.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Brady Lehner","date":"2013-05-23 00:55:55 +0300"},{"content":"I lucked out with a conference rate and was quite pleased, worth the extra walk to get to the convention center. The hotel is fairly new and definitely up to 4 seasons standards, similar to the one in Denver in decor. The room was quite large with a separate bedroom separated from a large bathroom by a small hallway-- I had a city view room but could see the harbor in a reflection on the building across the street. As is typical of 4 seasons, the staff really made the experience with everyone being very helpful and friendly, including providing a town car for trips around town when it was available. The hotel is 1 block from the Pike Place Market, 7 blocks from the convention center, and 3 blocks from the Westlake station that will take you to the Space Needle.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Garett Ritchie","date":"2012-09-27 14:09:53 +0300"},{"content":"Me and my husband stayed here for a short weekend getaway and we couldn't have been happier. The rooms were spacious, bathroom was big, clean and cozy. The staff from front desk to restaurant and bellboys were all very friendly, ready to help and polite. The hotel is within walking distance of the famous Pike place market, retail shopping and good restaurants. They also have a very handy complimantary car service. In short, if the rate is reasonable, there is no better high end lodging choice in Seattle !","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Myrl Heathcote","date":"2015-07-14 11:49:59 +0300"},{"content":"I stayed here in November and it was my first trip to Seattle. I wanted to near the tourist spots and didn't want to rent a car. Well, it was a long day of walking, but I think I managed to see everything on the beaten path. We had brunch both days at Art and one lunch. The food was delicious. The hotel feels very new and modern. Nice bar scene and fireplace.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Emmitt Stroman","date":"2015-12-22 23:21:11 +0300"},{"content":"We stayed here after returning from Orcas Island for our last day and night of vacation. We were upgraded and the room was fabulous. Service was out of this world. Stop into Fran's chocolate shop for an extra special sweet. The infinity pool is beautiful and oh so serene. Fitness center is well equipped and has a great view. Staff arrived several minutes into my workout and brought water to me on the treadmill... with a lid and straw, which just happened to fit perfectly into the cup holder... Now that's service!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Heaven Harris","date":"2015-10-19 21:58:01 +0300"},{"content":"One could not ask for a better property or better service. I would certainly not hesitate in staying @ Four Seasons in Seattle again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ryder Bauch","date":"2012-04-01 20:50:25 +0300"},{"content":"As Four Seasons fans, this hotel certainly didn't disappoint - usual impeccable service and quality premises. The location is amazing too - a stone's throw from Pikes Place Market and countless eateries plus water front. We were given a room upgrade too which was a lovely gesture. We stayed for 6 days - 3 days either side of a cruise to Alaska- and the hotel stored some luggage for us for the week while we were gone, free of charge. Can't recommend highly enough. Oh and whilst the food in Art's is awesome, there are soooo many places to eat nearby I wouldn't book bed and breakfast - go eat out and experience Seattle.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Jamison Oberbrunner","date":"2015-05-31 04:50:03 +0300"}],"public_likes":["Ms. Sanford Blanda"],"vacancy":false,"description":". This is the closest accommodation to Balboa Park. It's just north of the zoo on Park Boulevard, right across Upas Street from the park itself. The inn is small guest house made up of four Spanish colonial homes attached via courtyards, with 26 unique suites.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}