{"title":"San Francisco/Golden Gate","name":"Lombard Motor Inn","address":"1475 Lombard St","directions":"between Van Ness Ave and Franklin St","phone":"+1 415 441-6000","tollfree":null,"email":null,"fax":"+1 415 441-4291","url":"http://www.lombardmotorinn.com/","checkin":"3PM","checkout":"noon","price":"$77-$135","geo":{"lat":37.8009,"lon":-122.4258,"accuracy":"APPROXIMATE"},"type":"hotel","id":25805,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"What a find! Because of the storms across europe over the Christmas holiday we had issue with our luggage and had to wait at the airport for it to arrive on the next flight. The hotel is run like a B&B and after hours your on your own. So upon landing we phoned the hotel and Tommaso waited late for us to finally arrive. We were staying 7 days and given a nice, large, street facing room which I thought would be a problem but it was very quiet. Everything was simple and perfect for our needs. We don't like to spend time in our hotels when traveling but they must be in a good central location and clean, which this was. Breakfast is at a little bar a few doors down from the hotel and had really good fresh, hot croissants and coffee which was perfect. The Trastevere neighborhood is pretty awesome as well. Great restaurants, cafes and night life. This hotel is perfectly situated in Trastevere and near all major sites like; Vatican, Pz Navona, Pz Campo de Fiori, Pantheon, Trevi Fountain, all of central Rome. A short walk across the Ponte Gribaldi Bridge and you are walking distance to every main attraction. If you want comfortable, clean, value for the money accommodations in Rome, this is a good bet.","ratings":{"Overall":4.0},"author":"Citlalli Ledner","date":"2012-04-12 05:29:51 +0300"},{"content":"Sonnino Suite is in a great location--right in the middle of Trastevere. It is convenient to all of the nice restaurants and bars in the neighborhood. It is also an easy walk to the major sites. The Tiber is one block away and is nice to walk along as well. The room was comfortable and the price was right. The rate even included a breakfast of a coffee and croissant at the cafe on the first floor. The manager was friendly and helpful. Trastevere is a great place to stay--a very vibrant area.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Ivy Hahn","date":"2012-01-10 04:30:53 +0300"},{"content":"A Lovely boutique Hotel. 56 rooms in all. The rooms are very clean and nicely decorated. The air conditioning was a God send, as we had 31 degrees celsius and after a day out sightseeing, it was lovely to come back to our comfortable cool room. Being a small hotel, sometimes we felt like the only people in the hotel! The staff were very welcoming and helpful. Our barman Alexandross was very entertaining and friendly. My only warning would be that although the hotel is situated in Rome, it is about 1.5 kms to Republic Square, which is more or less the start of all the sites you will be wanting to see. We managed to walk most places, but sometimes we would have like to been closer to the places we were wanting to see. But in saying that, it was lovely to be able to come away from the throng of people and noise. So you just have to decide what is more important to you. We do highly recommend this lovely hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Alanis Bednar","date":"2014-12-15 20:53:53 +0300"},{"content":"I spent two nights at the Leon's Place and I was very disappointed: - unfriendly front desk and welcome - single room is so small you can not even open you luggage - wifi (not free) only in the lobby - the heating is not easy to control (either too hot or too cold) - the breakfast is poor given the hotel category - the bar served me a mojito prepared with salt instead of sugar - the gym and spa is not open 24/7, you must book it in advance to let them get ready On top of this, the location does not provide cafes, shops and restaurants at a walking distance.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":3.0},"author":"Roman Wilkinson","date":"2013-06-07 01:07:01 +0300"},{"content":"From the first contact through our stay to final communication, the entire experience has been a first rate experience. I have been in the Orlando/Disney area several times and I can say that this has been my best experience. For the rate, I kept my fingers crossed that the pictures and descriptions were truly reflective of what we received. We were not disappointed. The communications were clear and payment process efficiently handled. We had a 2 bedroom condo on the first floor because we needed a unit in which we did not have to climb stairs, etc. It had a screened patio which made sitting at night where we reviewed the day's activities or planning activities a pleasure. The clubhouse and pool were very close..steps away. We actually felt very much at home while there. The condo was quiet, immaculate, and very well furnished with a TV in each bedroom as well as the living room. Concerned about security? The condo is located in a gated community with access by a swipe of the card once you initially arrive. Your access to your condo is by entering a combination on the door. We loved this place so much that we plan to return next year....earlier than we normally would return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jayne Carter","date":"2012-07-20 09:56:55 +0300"}],"public_likes":["Micheal O'Kon","Myrtle Yundt"],"vacancy":true,"description":"Standard motor inn at an affordable price.  The building interior is getting a bit old and worn, however it is clean.  If you're a light sleeper, try to get a room that doesn't overlook the busy street.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}