{"title":"Mont Ventoux","name":"AIRE NATURELLE LE GROZEAU Aire naturelle","address":null,"directions":null,"phone":"+33 4 90 65 16 32","tollfree":null,"email":null,"fax":null,"url":"http://www.lespiedsenlair.com/camping.html","checkin":null,"checkout":null,"price":"7 € to 13 €","geo":{"lat":44.166897587843316,"lon":5.147718119642377,"accuracy":"APPROXIMATE"},"type":"hotel","id":19199,"country":"France","city":"Malaucène","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"Service: The service is excellent (both at the front desk and breakfast area). Rooms: although a bit small and quite dark, they are newly renovated and impecable. The bathroom was also very clean and brand new. Complimentary breakfast: all the basics as well as just baked cakes included. Very good overall. Internet access: Internet speed is okay, but the best of all is that we got for free a laptop to use during all of our stay. Never seen this service offered in any other hotel. Location: walking distance from main attractions (20 mins) and very convenient if taking the metro (5 minute walk) or train from termini station (5 minute walk as well). Easy access to all Rome attractions. In general excellent price/ value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Dorthy Ebert","date":"2014-01-26 07:42:15 +0300"},{"content":"I loved staying at Opera Roma Hotel. Great services, great staff and very nice rooms everything included !","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Manley Smith","date":"2014-03-28 13:49:55 +0300"},{"content":"My family and I recently had the opportunity to visit Montreal and stay at this little gem. Tourgay and his staff truly bend over backwards to ensure that your stay is comfortable. The property has no evelator but is only 3 stories in height - even though I travelled with school aged children this was not an issue. The hotel staff were very helpful in unloading and loading baggage from our vehicle. The rooms were very clean, hot water was plentiful and the kitchenette was well stocked with all the essential for food preparation. There is a 24 hour grocery store right next door and the metro is about a 5 minute walk away. Very close to McGill and would be an excellent base for anyone moving a student to that instituation in the city. We stayed in a room with a king bed and pullout queen sofabed. The queen sofabed was suprisingly comfortable as these types of sleeping arrangements can be touch and go depending on the hotel. Also included were 2 plasma TV's and free parking through a little laneway behind the hotel. The hotel is an excellent value when used as a home away from home. I would stay here again without question.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Murphy Durgan","date":"2015-12-06 09:29:05 +0300"}],"public_likes":["Carrie Leuschke","Mario Lemke","Mrs. Jeffery Gleason","German Stiedemann","Louvenia Stracke"],"vacancy":false,"description":"10 places of camping, in naturel site","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}