{"title":"Inverness","name":"The Royal Highland Hotel","address":"Station Square","directions":"Next to the Railway Station","phone":"+44 1463 231926","tollfree":null,"email":"info@royalhighlandhotel.co.uk","fax":null,"url":"http://royalhighlandhotel.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.479175,"lon":-4.223895,"accuracy":"ROOFTOP"},"type":"hotel","id":12243,"country":"United Kingdom","city":"Inverness","state":null,"reviews":[{"content":"I booked this hotel via Priceline and got a room on the front side of the hotel with a \"view\" of the city and I-5. Better than looking at the backside of stores on the backside of the hotel. The front side once you get in your room is very quiet. The rooms are very large and we had plenty of space to put out 4 suitcases and carry on's and spread out a bit even. Bathroom is a bit small, however there is a 15 minute timer heat lamp for when you get out of the shower or bath which is very nice. Water pressure is great and temperature can be as hot or cold as you want it. The vanity area is nice, but the sink pressure is a bit weak and the water is split out into a lot of small jets instead of one stream. Big plus in the room is the small refrigerator and microwave along with a coffee maker. We did not use the last 2 items but the refrigerator was great! Airco/heater units are a bit dated, but quiet and cool or heat your room pretty fast. Check in was simple and fast even when arriving at 8pm at night. The first room we got had a problem with the bottom of the door,which the maintenance guy on duty said he could not fix on his shift and went back to the front desk and got us another room within 5-10 minutes. We had 2 other minor issues which were responded to quickly during the day. Houskeeping starts at 8am, but does not check occupied rooms until after 9am. Very friendly staff and they keep the rooms spotless during your stay. Check out was fast, but the bell carts were nowhere to be found and a housekeeping person had to go look for one which took 10-15 minutes. That was the only down side. Wireless internet is fast in the room with excellent signal strength as there is a repeater on every floor. There are 2 older desktop pc's in the lobby that are free to use, however being public pc's there is no privacy programs to erase your history or filed in field entries. The CPU fans get very noisy when there are a lot of graphics being displayed. However web browsing is very fast! No charge to use them or to print documents out. A very nice thing to have. Lobby was spotless and modern and lots of daylight. Continental breakfast is good, you can make you own \"Belgian\" waffles, fresh fruit, eggs of various styles each day and bacon or sausage to go with them. Menu varies each day with waffles being the main item. Coffee and juice are also available. Wireless internet if you need it, with plug in's around the walls. Big screen TV's tuned to CNN. Breakfast is from 6-10am each day. We did not use the restaurant. Location is great, just off of I-5 at Northgate. Short distance to the mall from the hotel. A bit of a walk or a short drive with the car. Overall a pleasant place to stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Freeman Lubowitz","date":"2014-02-23 02:42:01 +0300"},{"content":"This is classed as an hotel but more like a motel, did not feel safe at night, people hanging around outside your rooms, doorlocks broken for entry to parts of the building. Barricaded myself in with s/cases chairs etc. Lesson to be learnt sorry but never again.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":1.0,"Rooms":1.0},"author":"Tommie Toy","date":"2013-08-29 01:44:33 +0300"}],"public_likes":["Mr. Esta Watsica","Ericka Simonis","Vada Dibbert","Nicola Daugherty","Arvid Abbott"],"vacancy":false,"description":"A completely refurbished luxury Heritage hotel and a landmark of Inverness. Opened in 1856 and offers a true Highland ambiance.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}