{"title":"Whittier","name":"Radisson Hotel - Whittier","address":"7320 Greenleaf Avenue","directions":null,"phone":"+1 562 945-8511","tollfree":null,"email":null,"fax":null,"url":"http://www.radisson.com/whittier-hotel-ca-90602/cawhitti","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.9746,"lon":-118.036837,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33342,"country":"United States","city":"Whittier","state":"California","reviews":[{"content":"We just returned from 4 days at the resort and feel like we have been gone for 10. The hotel was packed when we were there, however it is so spread out that we never felt the crowds. What I love about this place is the variety of things to do. Each day was different. The kids loved the water park. I loved taking the ferry to the beach. During the day there is plenty to do for everyone. We stayed at the marina this time and our room was spacious and had the same decor as the last stay. Great sleep. Loved the addition of free wifi. It worked great. The magic show was really great and the kids loved the games set up for vacation week. The teen lounge was fun for them. I thought that I would mind taking the Funicular everywhere, however it did not bother me at all. We had three great dinners at the hotel. The Strip house has the best salad, Blossoms was a great family style chinese/sushi meal. The italian restaurant food was fabulous ( service was a little slow). Our most favorite place to eat was the pizza/salad spot just off the lobby overlooking the pool. The setting of the hotel is spectacular. It reminded us of Hawaii. The hotel is older so don't expect it to be \"perfect\". I'll take that \"aged, casual feel\" anytime, versus a new hotel in a setting that is less spectacular. We are already trying to figure out when we can go back. Kudos to the entire team at the hotel for making the stay so enjoyable. We made great family memories. We had 3 other families at the hotel due to our \"talking up\" the resort. They all loved it too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Marques Kuvalis","date":"2013-10-04 09:54:47 +0300"},{"content":"The two of us spent 3 days followon to Caribbean cruise at El Conquistador, where we planned to experience Puerto Rico's rain forest and bioluminescent bay. After debarking from the ship, we taxied to the airport for rental car, and headed east for some fun in the sun. The trip to Fajardo was effortless, and when we arrived at the hotel (earlier than checkin time) the valet told us the wait to check in might take awhile, because of the line of people checking out. We thought \"no problem, we'll just hang out and explore the grounds until the line subsides\". We did stop at the lobby anyway, and saw that there was no line at the HHonors check in counter, so we stopped and asked if we could check in early. The staff were very helpful and courteous, even though the line of people waiting to check out extended way past the lobby. I hadn't been in contact with the news services for several days, so I didn't realize what was happening. Hurricane Earl was imminently approaching the island, and this hotel at the eastern tip of Puerto Rico was directly in the predicted path. To make a long story short, the three days my wife and I spent celebrating our 41st anniversary were both scary and wonderful at the same time. The hotel staff did a great job keeping us comfortable through some of the worst weather we have ever experienced. Needless to say, all services and visitor facilities on the Island were shut down for most of that time, power outages were frequent, and our plans were totally ruined. We stuck it out though, and my wife and I got to spend some quality time together doing abolutely nothing but watching the weather. We couldn't be happier with the facilities at the hotel that kept at least minimal guest services running, Who could imagine that this would turn out to be such a memorable event doing absolutely nothing? We hope to return to the island and to this resort again in the near future to visit all the things we missed out on. But we have no regrets for the time we spent there in this beautiful, wild and wet paradise.","ratings":{"Overall":5.0},"author":"Dr. Khalil Oberbrunner","date":"2015-10-06 23:41:15 +0300"},{"content":"We spent a couple of days at this beautiful resort. The Resort Manager was extremely helpful in order for us to book the right room-rate-location, thank you so much! The facilities are very well maintained, the room was very clean and perfectly located next to \"Coqui waterpark\". Food at Stingrays, Iguanas and Room Service was very good too. The short boat trip to Palomino Island went a very long way - Palomino is just beautiful and peaceful, yet very interesting for our 7 yrs. old, he really had a blast and we are so glad that we came to El Conquistador since this short time was meant to spend some family quality time - mission accomplished - Thank you Conqui!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Danyka Raynor","date":"2014-10-27 10:32:47 +0300"},{"content":"Just got back from 4 days at El Conquistador. It was an interesting experience in comfortable mediocrity. Everything was fine. Rooms were nice, People were friendly enough. Food was decent. Nothing was notable though. Renting a car was really the key to enjoying the place in my opinion. You don't have to ever leave the hotel compound. We rented the car after arriving to visit the nearby rain forest and just being able to see a little more of real life around the area felt like being released from house arrest. Old San Juan was pretty long drive but it was well worth it.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Queenie Miller","date":"2014-11-19 11:07:02 +0300"},{"content":"After months of online research, I finalized our vacation plans choosing Hilton's El Conquistador in Fajardo, Peurto Rico. It was gorgeous! The staff was the friendliness and most helpful we have ever encountered! We spent six beautiful days there and can't wait to return. The pools, golf course, and restaurants were of the highest quality. The views are spectacular and our teenage boys never complained about being bored! I thank all of you who waited on us, talked with us, and gave us the dream vaction of a lifetime (I wish I remembered all your names). I am so grateful to Asst. Hotel Manager, Mr. Manny Melendez, for answering all of my questions and being so patient with me when booking the trip. It was amazing!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kian Wunsch","date":"2012-09-14 18:21:44 +0300"},{"content":"We traveled last Christmas with a large extended family - ages 5 to 69. This was a perfect destination. The hotel has a separate island which is reachable by a short ride on the hotel ferry. At the Palamino Island site there is plenty of shade, a beachside restaurant, volleyball, and water toys for rent. The beach is wide and not crowded. The whole family went for the day and was sorry when it was time to take the ferry back to the hotel. There is also an entire water park with various slides and a lazy river feature. This provided another whole day of fun for the entire family. There is a charge for entrance to this water park, but it was a nice way to vary the days. If you do not want to pay extra for the water park, there are plenty of beautiful swimming pools available. We also used the tennis facility and loved it. Our rooms were very clean and comfortable. We went on 2 \"outings\" while there. The first was the rain forest for hiking. The second was a night-time canoe trip to the luminescent pool. Both were relatively close by and a nice family outing. The night-time canoe triip might be too late for the very young. The food choices/restaurants offered great variety. We expeciallhy enjoyed the teppan-style dining where the chef entertained us all with his knife skills! I would definitely recommend this hotel for a family destination!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Earnestine Balistreri III","date":"2012-12-25 20:12:45 +0300"},{"content":"Beautiful view, we got out upgrades. Breakfast is excellent, a lot of fruits.. Staffs are very polite and friendly.. Great trip!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ezekiel Kertzmann","date":"2015-08-27 06:28:31 +0300"}],"public_likes":["Rosina Bogisich","Gladyce Towne","Helena Rogahn","Jany Schmeler","Jerrell Emmerich","Retha Bayer","Hallie Price"],"vacancy":false,"description":"Located in Uptown Whittier.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}