{"title":"San Francisco/Chinatown-North Beach","name":"Grant Plaza Hotel","address":"465 Grant Ave","directions":"at Pine St","phone":"+1 415 434-3883","tollfree":null,"email":"info@grantplaza.com","fax":"+1 415 434-3886","url":"http://www.grantplaza.com/","checkin":"2:30PM","checkout":"12PM","price":"$70-$95","geo":{"lat":37.7913,"lon":-122.406,"accuracy":"APPROXIMATE"},"type":"hotel","id":25502,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We just returned from our 6 night stay at the Chancellor Hotel. What a wonderful gem in the city! From the time we made our reservations to check out, we had nothing but exceptional service. A special thanks to Nate in reservations. His kindness in helping us with our reservations and even during our stay there. He gave us great recommendations and always friendly! The rooms were clean, the location perfect and we would definately be returning! Thanks again Chancellor Hotel!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ciara Bruen","date":"2013-05-25 16:54:34 +0300"},{"content":"We were staying in another hotel that was WAY out of the way and not currently on the train route, due to construction. It was a nightmare using public transportation to get places and the hotel itself was dirty and we wanted out! Thankfully we had booked through Tripadvisor and were able to cancel and book Chancellor. The representative for Chancellor quoted me a LOWER rate than what was on the internet. Chancellor is in an EXCELLENT location. It is close to shopping, wonderful restaurants, and the conference center, & the price was extremely competitive.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mckayla O'Reilly DVM","date":"2014-06-19 22:37:07 +0300"},{"content":"Our first visit to San Fran and we loved this hotel - the location is fantastic (much prefer Union Square to Fishermans Wharf). Professional and friendly staff, felt like a family run hotel with little extras such as free tea/coffee and biscuits in reception. Rooms were very clean, bathrooms a little on the small side but functional. Great value for money and a location that would be hard to beat.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Jordane Cremin","date":"2014-11-25 04:14:38 +0300"},{"content":"Myself & my Daughter stayed for 5 nights and loved it, the free cookies & tea/coffee went down a storm with her :) staff were great, spoke with Rory a couple of times asking directions and how best to get to places, nothing was too much trouble. just across the way from union square, cable car stops almost outside the door, a few blocks up from powell st station... easy walk with a wheeled case. wallgreens few doors away incase you need anything, liquor store round the corner if you want a couple of beers to take back. Ate at Sears next door among other places and found the Steak amazing :) rooms spotlessly cleaned everyday (thank you room attendent enjoy the mintballs) if i went back to san francisco without any question this is where i would want to stay. thank you for a great stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Moses Gleason","date":"2015-05-28 00:42:28 +0300"},{"content":"I searched quite extensively to find a reasonably priced hotel in San Francisco. Finally decided on Chancellor. I was skeptical because the price was so reasonable, given its location. And I'm quite a picky person so I was prepared to be disappointed. The desk staff was wonderful! There was cucumber water, coffee, apples and cookies in the lobby at all times for guests. We paid the extra $6 a day for valet parking since the parking was already some of the cheapest in town. We went up the elevator to the 14th floor (I had requested a high room at the back as I am very sensitive to noise). We went into the room and was amazed to find that this was a suite! Bedroom, Living Room, and two FULL bathrooms!! The room was immaculately clean and tastefully decorated. The bathrooms had shampoo, conditioner, body lotion and rubber duckies!! The bed was comfortable, there was a small walk in closet, there were extra pillows and blankets in the closet. Small refrigerator, coffee maker in a little kitchen area. Desk in the living room. And a chair and table in the bedroom. Lots of drawers for putting stuff away. And a TV in each room. This meant my husband could watch TV in the living room whilst I read in the bedroom. And the location was right across the street from the St Francis and Sax Fifth. There was a Starbucks at the corner so we could grab breakfast. Union Square at the corner. Cable car runs right out front! I could still hear the cable cars but not very much. Earplugs were able to bring complete silence. This will be my home away from home in San Francisco from now on!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Leila Oga","date":"2015-02-03 20:18:15 +0300"}],"public_likes":["Jessica Will","Anjali Bruen","Sandrine Langosh","Karlie Senger","Joesph Gibson"],"vacancy":false,"description":"Good for 1 or 2 night stay. Rates are reasonable. Make sure you ask for one of the outside rooms that overlook Grant Avenue, the inside rooms are small, dark and dingy. Close to parking garages and walking distance to many restaurants, bars and attractions. Staff is friendly.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}