{"title":"San Diego/Mission Beach-Pacific Beach","name":"Best Western Blue Sea Lodge","address":"707 Pacific Beach Drive","directions":null,"phone":null,"tollfree":"+1-800-258-3732","email":null,"fax":null,"url":"http://www.bestwestern-bluesea.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.79038,"lon":-117.25482,"accuracy":"ROOFTOP"},"type":"hotel","id":25241,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I attended the motor-sport movie \"THE QUEST\" on Sunday January 15, 2012. It is a documentary 84 minute movie on the discovery and restoration of the 1960 model # 3 Corvette Briggs Cunningham LeMans Race car, and its return to LeMans 50 years later in 2010. We spent Saturday and Sunday evening at the Resort and found the complete experience very positive and professional. Many race car driver celebrities were present and a little 25 race car concour preceded the movie in the morning. The movie was shown in the Grand Ballroom, and was like an Oscar presentation on a large screen with perfect sound. The reception after with great food, service and drinks provided the 400 guests with a very positive feeling. The 82 year old facility is old history and worth a visit on its own. Food and service at the Fred and Albert were very good as well, which often are lacking at these types of hotels. The room , which was ADA Handicap accessible was very comfortable and clean and had a 32 inch flat screen TV and well stocked fridge. The shower facility was wheel chair accessible and worked perfect. I did bring my shower chair which was needed, however the hotel more than likely had one if I had asked. All in all, a great way to start AUCTION WEEK in Phoenix.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Rae Kling","date":"2015-07-04 21:24:47 +0300"},{"content":"Amazing experience. 6 stars, ******, too indescribable with words. They provided us and all their guests with an environment where all our needs are met with out seeing or hearing very much from employees and made us feel welcome. Being able to be friendly, naturally so it seemed. Kimberly at the Ocatilla Club ( sooo worth the extra few $ ) made all of our reservations, tee times, spa appointments... and gave us pointers and reminders to make our stay perfect. All a few days before we arrived and mostly on line from the two of us. We met so many nice people every where we went at this resort. It is arranged for maximum privacy and pleasure for all guests. We are planning on coming back ASAP! Really. If you like to travel and appreciate the finer things in life with out all the stuff that sometimes gets in the way this is the place to be.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Thea Effertz","date":"2014-03-05 11:58:54 +0300"},{"content":"we had friends in town and we picked the biltmore for the historical aspect-glad we did!we live i phx but this place makes you forget!there is a hotel ambasador that will give you a 11/2 hour tour of the property-i we totally loved it!(we tipped at the end) we had a poolside room so that was fab!rooms a aliitle older but had everthing you could want","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mackenzie Schoen","date":"2015-04-30 16:06:21 +0300"},{"content":"We stayed there in October and got an exellent deal from them for the premier building. We went on a budget and they offerd continental breakfast, happy hour with complimentary wine and beer from 5 to 9pm and also had appies from 5 to 6:30 and deserts for 8 to 9pm. We did not use the in room bar or had house keeping as it was not needed. Beautiful grounds and pools.Tons of history all over the walls to see and the restaurant we went to was very reasonable and good.( hand made guacamole is awesome , made at your table and plentiful).Service was good and freindly.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"America Green DVM","date":"2013-11-30 22:42:38 +0300"},{"content":"I traveled to this hotel to attend a business conference on site. The property is stunning. Top notch everything. One perk is also a bit of a drawback: The resort is a bit out of the way. I didn't have a car on this trip so leaving the property was not possible. I had no reason to leave the property but the trade off is that everything is very high priced at the resort. $4 for a cup of coffee - not a latte - a cup of coffee. There is shuttle service to the nearby mall. Taxi to the airport was about $40 each way. This resort is absolutely beautiful - highly recommend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Devonte Dickinson","date":"2015-02-20 22:47:26 +0300"},{"content":"I love the Biltmore. This was my fourth stay and will definitely visit again. This was my first stay in the main building and except for not having any outdoor space with my room I loved it. Vist the history room and get a feel for the places history. There are also some excellent pictures throughout the public spaces in the conference area. Worth a visit.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Karlie Farrell","date":"2012-11-05 01:40:26 +0300"},{"content":"This was a beautiful property! If you’re history buff, this is a great hotel to stay in and take the historical tour. The property was just stunning. I stayed in the Ocatilla building, which has a complimentary lounge which serves breakfast and food and drinks throughout the day. There is a lot of walking to get from building to building, which is not very pleasant in the heat of Arizona during the middle of the day. I don’t think I would have minded had I been on vacation rather than dressed for business. The setting is beautiful and the views were amazing. The pools looked beautiful, though I didn’t get a chance to enjoy them. I would definitely recommend this hotel.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Chloe Lueilwitz","date":"2014-04-29 10:29:12 +0300"},{"content":"Been to a conference here so I was pretty busy most of the time without enjoying the bar, restaurants or pools. They look pretty nice. However, I stayed in the Valley wing where the everything seems pretty old and tired. Doors still have the key knob, carpets are very used looking, same with bathrooms. There is no coffee maker and the snacks are extremely expensive. A small bottle of water (not even cold) is $8. A/C unit is noisy and has only ON/OFF manual controls. There was a lot of noise coming from the bathroom walls every time someone in the adjacent rooms was flushing or running water, or maybe their A/C units - God knows what some of those noises were. There is a resort fee of $28 per day that includes Wi-Fi in room. However, it was not working and after many tries I called the front desk to find out it was not working in the entire building. The cable was however working after calling the help desk again to figure it how to make it really work. The architecture of the resort is nice (Frank Lloyd design) but it is overrated and over priced.","ratings":{"Location":4.0,"Overall":3.0,"Value":2.0,"Service":3.0,"Rooms":3.0},"author":"Maeve Rath","date":"2013-08-31 12:46:15 +0300"},{"content":"We stayed over the 4th of July. It as a great time. The staff we very friendly, and gave us some great recommendations for restaurants. The architecture of the hotel was grand and kept perfectly, The grounds were kept quite well, and were nice to walk around. The room was nice and kept clean. Parking was very limited near the hotel, so if you don't mind walking, there is plenty in the garage. The pool area was cramped, and not kept very clean. Cups, dishes, and trash was left and often not cleaned will the next day. The included breakfast was amazing. Red velvet pancakes are impressive and will keep you going all day. We rented a car a drove ourselves all over to see the sights. It was totally worth it. We knew it was going to be hot, so we planned accordingly with our activates. The gem was the restaurant 'the Barrio' the concierge recommended- great margaritas and excellent happy hour tacos. That alone was worth the trip. The spa had some nice areas and always had ice water and space in the lounge. The staff was very pleasant and always accommodating.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Winifred Brekke","date":"2013-06-08 20:21:37 +0300"}],"public_likes":["Sophia Howe","Ms. Lelah Turcotte","Leora Hessel"],"vacancy":true,"description":"A beachfront Pacific Beach hotel with oceanview rooms.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}