{"title":"North Uist","name":"Lochmaddy Hotel","address":null,"directions":"2 minutes walk from the ferry terminal.","phone":"+44 1876 500331","tollfree":null,"email":null,"fax":null,"url":"http://www.lochmaddyhotel.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.59802,"lon":-7.15909,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20739,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"Currently staying on the 21st floor of this brand new hotel. I have to admit I was not looking forward to staying here. We had to stay downtown because of a convention and I know that downtown LA is pretty bleak. However, this hotel is really a bright oasis despite its not fantastic location in terms of things to walk to easily. The furnishings are are bright and elegant. I am sitting in an aqua butterfly chair next to a golden rod, retro-mod loveseat. We have a nice view of the mountains but I think the rooms on the freeway side of the building actually offer the best view.Rooms are almost silent from noise and the hotel feels very booked. The JW toiletries are great and the bathroom is large although no tub in our room. Coffeemaker and small fridge without minibar clutter make this a great room. The thing that really impressed me so far is the staff. The check in team was wonderful. Bright smiles. Very eager to make our stay terrific. Here is how I know this is a great hotel. The real sign of a fantastic hotel is shown when things go wrong. Yesterday the valet smashed the rear end of our rental car. We got a call from Rick the manager and he told us what happened and he did absolutely everything to make sure this did not disrupt our trip in any way. He swaped out the car with our rental company and gave us the use of the garage's car service. We were the first accident the garage has had since it opened so they were very apologetic and quick to make things right. Truthfully, it did mess up our day somewhat but everyone's attitude was so accomodating that we were able to get past it. My only criticism is the fee for Internet at $12.95 a day per computer. I wish these chains would wake up to the fact that free internet is essential for all travelers. I don't want to be charged for something that is not a luxury! Overall, very pleased with the experience here and if you must stay downtown this is the absolute best option.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":2.0},"author":"Roscoe Conn","date":"2012-06-17 10:12:50 +0300"},{"content":"I stayed here for nearly 3 months when my employer transferred me to their corp HQ, it was a second home to me.The room was clean, comfy & within easy walking distance to downtown, Space Needle, Pike Place, waterfront. As a woman alone, I never once felt unsafe. Staff & management are EXCELLENT. They're warm, friendly, greet you by name, and are very helpful & responsive to every request. I would recommend it HIGHLY to anyone who is looking for a quality, reasonably priced stay in Seattle. Thank You \"Bell\"town Inn.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Jayde Pacocha","date":"2015-11-21 18:57:47 +0300"}],"public_likes":["Vincenzo Bruen"],"vacancy":false,"description":"An established hotel next the ferry terminal.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}