{"title":"London/Westminster","name":"St James Court Hotel","address":"55 Buckingham Gate, SW1E 6AF","directions":"tube: St James's Park ''or'' Victoria","phone":"+44 20 7834-6655","tollfree":null,"email":null,"fax":null,"url":"http://www.stjamescourthotel.co.uk/","checkin":"14:00","checkout":"13:00","price":"£150","geo":{"lat":51.4985,"lon":-0.1374,"accuracy":"APPROXIMATE"},"type":"hotel","id":16528,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"There is nothing bad to say about the resort but there is nothing to gush about either. We prefer the smaller hotels and this one was quite large and very busy. We had a room in the Executive Tower which was very clean and comfortable. These rooms have not been updated yet as the other ones have been so they are a little outdated but adequate. Our ocean view more than made up for it. Put me on a balcony with an ocean view and I'm loving it! We did not go to the beach on the main property, but we went to the golf course beach because we read on here that it was nicer. But we had a car so we mainly found our own beaches on the south/west side of P.R. The pools were nice but much quieter at the golf course if you don't have kids. We thoroughly enjoyed the golf course and enjoyed 2 days of golf. The staff at the restaurant for breakfast (Executive Lounge is closed on weekends) was amazing! They made us feel welcome, like family, very attentive. Great job! Housekeeping staff was wonderful too! I am giving a rating for Service as very good only because the front desk staff could use a little work.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Unique Reichel","date":"2015-02-11 08:15:10 +0300"},{"content":"We stayed in the executive tower with ocean view on the 3rd floor at the southwest corner. Our room was large, tastefully decorated, quiet, fresh and very clean. The room has a large balcony and is near the shoreline. We had the door open the whole night to enjoy the surf-sound. There are several restaurants onsite and we had an excellent dinner at La Cava. The casino appeared to be bustling. There is a large pool as well as ocean beach frontage.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rollin Aufderhar V","date":"2012-08-10 10:11:39 +0300"},{"content":"The hotel is a great place for a quiet, relaxing get away. Rooms are pleasant and always immaculate. Grounds are well cared for. They have done a lot of work to improve the beach area and make it an attractive alternative to sitting by the pool. The breakfast buffet is wonderful - great coffee, fresh pastries, eggs any way you want them - everything fresh and fabulous. Sometimes the mixed drinks at the pool side bar are weak and more of a fruit juice drink - a minor problem - and once in a while it is hard to find anyone from the bar checking the pool area to see if you want a snack or drink. The staff - it is the people at a hotel who can make your vacation a hit or a miss and, in this case, it is always a hit! From in-house reservations tocheck-in staff to the breakfast chefs, to the restaurant and bar staff, to room service, cleaning staff, etc - always welcoming and helpful. They put in a lot of effort to make your stay enjoyable and I think this is what puts the Ponce Hilton a step above other hotels. As for the few reviews mentioning that rooms are dated and in need of a face lift - it is my understanding that the majority of the rooms in this hotel have been recently renovated. Perhaps management could address this here with a comment.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Lorenza Bailey","date":"2015-11-22 03:05:02 +0300"},{"content":"This was our fifth time at this hotel and will be the last first I reserved a room poolside and ocean view they put me on the second floor when I have problems with elevators and steps changed my room and needless to say told the maid everyday you have to $@!#% the bugs in bathroom and in bedroom. Asked if she could please change sheets daily for I broke out with a rash on my face and legs. It was not only me but my husband also and after 10night I was woken by something crawling on my face and to my surprise bed bugs.Took pictures and know going to doctors since I came home. They wanted me to go the day I was leaving but I did not want to miss my flight. Filled out incident report. And will be last time going to this hotel. Besides the fact had to get all my clothes and luggage sterilized.","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":3.0},"author":"Juliet Hickle","date":"2012-01-24 21:29:56 +0300"},{"content":"I stayed one night at Ponce Hilton. When I called, the person who made my reservation did not specify some charges, such as a special hotel charge of nearly $20. and a parking fee of $8. for a night. When I checked out, my bill was about $50 extra dollars, including the tax fee. When I got home and checked my bank account, they had made a hold for $100 more than the amount charged by the hotel. I made calls, sent emails, and, finally, almost one week later, the total was updated on my account, and still was about $10 more than an invoice they had sent to my email. Beautiful place, but the service at the restaurant was slow and there were outside noises in the room that bothered me.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Tyrel Weissnat","date":"2013-12-01 10:52:37 +0300"},{"content":"What a wonderfull place. Everyone from management on down could not do enough for you. First time in along time I felt appreciated for your business. All there recommendations for restaurants and activities were great. Only problem was not enough time, will be back next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Carrie Walker","date":"2012-02-15 01:29:12 +0300"}],"public_likes":["Virgie Treutel","Marshall Upton","Kristin Toy V","Arvid Kohler","Joelle Rau"],"vacancy":false,"description":"Four star hotel close to Buckingham Palace and The Houses of Parliament. Has three restaurants, Spa, and Gym.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}