{"title":"Offa's Dyke Path","name":"Glan-yr-Afon B&B","address":"Glan-yr-Afon, Candy SY10 9AZ","directions":"North of Trefonen near Oswestry","phone":"+44 1691 653085","tollfree":null,"email":"mail@glanyrafon.org","fax":null,"url":"http://www.glanyrafon.org/","checkin":null,"checkout":null,"price":"£30 pppn (£25 for &gt;2 nights) includes guests' sitting room and own entrance","geo":{"lat":52.84749,"lon":-3.10692,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21037,"country":"United Kingdom","city":"Morda","state":null,"reviews":[{"content":"I would never ever stay at this hotel again...Inside the hotel is run down and the lobby is nothing spectacular.. I know it is an old hotel but they really could modernize it.. I stayed here with my boyfriend for a concert.. (and believe me we are not picky.. we are only in our early 20's) and hated it.. we got a suite and there was only the bed, desk, and two chairs in the room.. it was just tons of empty space with no seating area.. and a really tiny bathroom.. our smoke detector was hanging out of the ceiling and all of the paint in the room was chipped.. The location is fantastic and the places to eat connected to the hotel are very good.. but the location itself does not make up for how awful the hotel is.. I thought for a city like Boston it would have some charm.. but nope.. stick to the Back Bay Hotel or the TAJ","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Tiffany Kiehn","date":"2015-07-10 07:29:06 +0300"},{"content":"We were terribly disappointed by this hotel. During our first night we were awakened by screaming and pounding on the door of the room beside us by some man who was clearly intoxicated. This lasted for quite a while and was actually quite scary. However since it was NYE we hoped it wouldn't occur the next night. The next morning the room service dishes that were sitting outside that room since early the day before had still not been cleared. Far worse was what we saw running through our closet and then under our door into the hallway.....a mouse!! I was horrified. After calling down and explaining the girl said \"gross\" and promptly transferred me to someone who offered a room upgrade and to comp that night for us. The next room had a mouse trap under the bed (empty thankfully). Obviously this is an ongoing problem for the hotel which they have failed to adequately address over the years.","ratings":{"Overall":2.0},"author":"Franco Mitchell","date":"2013-04-05 12:14:13 +0300"},{"content":"We stayed here for one night on Jan 2, 2012. I booked the hotel after much debate after reading mixed reviews on TripAdvisor, Google, and other travel sites. However, for a price of $102 for a Deluxe King Room, I couldn't argue. Our room was on a corner of the building and was sizeable. The linens were fresh, the bed seemed fairly new, the carpet was plush and everything was really clean. They even had a sizable LCD TV, with actual HDTV. Most places you go have the LCD TVs, but regular standard def. Anyway, the room was perfect for what we needed, a place to relax in the evening and get a nice night of sleep. I didn't encounter any issues with the thermostat, I simply lowered the temperature to 68 and it was perfect. I could even cut off the heating/cooling unit, had we gotten too hot or cold, so those complaints from other reviewers are unfounded. Complaints about the bathroom are valid, it was pretty small. Barely enough room for the shower, toilet and sink. However, being a guy I don't have an issue with it, as I shower, or use the sink and toilet and get out, and don't plan on spending hours at a time in front of a mirror. For that, it was adequate. Also you should remember that this hotel was built in the 1920s, so its historic and things may be small. In the end, this hotel is a great spot to spend a few nights. Its got a great location, its relatively cheap, and its easily a 4 star hotel. Is it 5 star? Definitely not on account of the bathroom. I feel like some people may be a bit picky on this site and expect a Ritz Carlton. The fact is, the price is much lower than many other hotels in the area, so any 'issues' you may run across are compensated for. Also, the complaints about $12.50/day for wifi are valid, BUT you have to remember EVERY other hotel in Boston, as well as most chains - Marriott, Hilton, Ritz Carlton, charge that amount or more for wi-fi. Its a way for hotels to make money. Back in the 80s-90s they made it off of phone calls, but now with cell phones they have to make up for it somewhere. If you don't like it, go to a Starbucks, McDonalds or get a smart phone like the rest of the country.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Julius Fahey","date":"2014-04-05 04:57:13 +0300"},{"content":"There is much to be said about this hotel that is great. The location is excellent - the lobby is old world style elegant and well-maintained. The front desk staff is very helpful and courteous -might be the fastest check-in service ever. We booked a standard king room, which turned out to be two small rooms that had been combined. Good size space in the room, and there were two bathrooms. Here's the caution - they were the tiniest bathrooms I've ever seen. On one side were the toilet and bathtub and no space in between. The sink was at the end of the bathtub. There is minimal counter space and most of it was taken up by the rack holding shampoo, soap, etc, plus a tissue box and cups. So just beware -- not all the bathrooms in this hotel are the same. Bed was very comfortable and there was a flat-screen tv in the room. The view was non-existent - both windows looked out on an air shaft and another building. There was no closet - only a free-standing wardrobe about 20\" wide. (The bottom of this was very dusty, as I found out when a pair of dark slacks fell off a hanger.) One inexcusable oversight - I got out the extra blanket that had been neatly stored in a zippered bag in the wardrobe - hence the fallen pants - and when I opened it, discovered that it had multiple holes cut out of it. It looked like someone had tried to remove burn spots but only made it worse. I dropped it on the floor and it was left there the entire time of our visit. Kind of made me wonder if the room ever got vacuumed. I would stay here again because the price was right and location very convenient.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Kiel Mertz","date":"2012-03-12 03:59:21 +0300"}],"public_likes":["Mrs. Marlen Jenkins","Kim Kirlin"],"vacancy":false,"description":"[[Bed and Breakfast]] with 3 bedrooms (1 ''en suite'') welcomes families and also has camping facilities. Evening meals and packed lunch (£4) available on request.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}