{"title":"Beverly Hills","name":"Four Seasons Hotel","address":"300 S. Doheny Dr","directions":null,"phone":"+1 310 273-2222","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":34.07264,"lon":-118.389284,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3425,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"It was like something out of a film. Luckily we only had to spend a night there after a mix up with booking our original hotel (The Modern Sultan, much, much better) The room is a joke, measures about 2 meters by 3 metres, with dilapidated furniture and a general grubby appearance. And the bathroom? It was so small I could sit on the toilet, brush my teeth in the sink and have a shower ALL AT THE SAME TIME!! It was very noisy, with a main street right outside the building, so plenty of traffic. We could clearly hear people stomping around the hotel until the early ours of the morning. And the lift? Enough room for one person, and no door to the cubicle, so you're seeing bare stone pass 2 inches from your nose. On the plus side, the terrace was nice.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Mr. Cordell Bruen","date":"2015-08-22 23:39:31 +0300"},{"content":"So glad we stayed here - had a fabulous time. The room was small as was the bathroom with it's Turkish shower (no shower surround), however these were minor inconveniences weighed against the perfect location & fabulous staff. The day starts with a Turkish buffet breakfast on the top floor with a view of the Bosphorus. The area is also open during the day & evening to any guest wanting to enjoy some quiet time and the view. Watch out for the endless cups of Turkish tea you will be offered if you want to sleep at night! All major attractions are within a 5 minute walk, as is the metro and the ferry. Surrounded by restaurants of all price ranges and rug & china stores where charming proprietors try to entice you to view their wares. A great day is to buy a 1 way ticket on the 10:30 Bosphorus tour ferry at Eminonu (be there at 10:00). Get off at Saiyer and walk back thru town picking up some snacks on the way. Walk back along the river about 15 mins to Buyukdere for the Sadberk Hanim Museum (allow 2 hrs Thur - Tue). Then turn right & walk to the bus stop, catch 25E to Bebek and visit the Rumelihisari fortress (9:00 - 4:30 except Wed). Then catch the 25E again to Ortakoy. Get your stuffed potato and waffle and wander the streets. Continue on the 25E to Kabatas and then change to the metro to get back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Miss Stephanie Huel","date":"2015-03-20 21:01:10 +0300"}],"public_likes":[],"vacancy":true,"description":"Luxury accommodation.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}