{"title":"London/South Kensington-Chelsea","name":"Park House Women's Hostel","address":"227 Earl's Court Rd, SW5 9BL","directions":"tube: Earl's Court","phone":"+44 20 7373-2851","tollfree":null,"email":"PH@viridianhousing.org.uk","fax":null,"url":"http://www.viridianhousing.org.uk/find_a_home/short-stay-accommodation/hostels/Park%20House/index","checkin":null,"checkout":null,"price":"From £49","geo":{"lat":51.4903,"lon":-0.1906,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16436,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Over rated My husband and I have travelled quite extensively in the Caribbean. This is the first time we would say that the resort was definately not worthy of the 4 star rating. The grounds are nice and kept tidy. The hotel itself is tired. We were supposed to have a king bed and ended up with 2 3/4 beds. The beach could be very nice but has a lot of seaweed and it seems to be the only hotel along that strip that doesn't clean it up. They seem understaffed and understocked. Towels are often not available and if you need a spoon, you'll likely be going on a treasure hunt. Seats on the beach are also difficult to find. If you'd like wine with your dinner, no problem. If you want a beer, you may have to ask about 3 different servers. You still may not get one, and they don't seem overly concerned. The food is ok, although I think it could be kept warmer. The steak house restaurant is very good. We managed to eat there twice. This restaurant is also off of the beaten track of Punta Cana. Outside the main gates is filthy and the local market is nothing short of harassment. My advice - go somewhere else!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Zander Williamson","date":"2012-10-18 07:02:32 +0300"},{"content":"For the price we paid, excellent deal.       goose","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Mylene Heaney","date":"2012-07-24 23:23:58 +0300"},{"content":"A good near great experience I spent 12/22-29 at Natura Park and had a good, near great, time. The grounds are outstanding; multiple different natural pools with different birds (flamingos, herons, peacocks, etc.)The food was less than superb but better than average. The buffet was better than the specialty restaurants. The staff was very pleasant and outgoing. There were minor problems but that must be expected in high season. The tours offered were very good. I particularly enjoyed the Outback Tour. Apple arranged golf outings to Punta Blanca and Punta Cana; both were excellent courses; well worth the money.The comments about the limited beach chairs are correct. After getting skunked two days in a row I learned to play the game and got a towel and claimed a chair as soon as I got up before eating breakfast.I recommend Natura Park to all but the most finicky traveler.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Mrs. Bryon Kshlerin","date":"2012-02-25 13:06:53 +0300"},{"content":"Natura Park - vacation from $@!#%! Natura Park ReviewWe (my husband, my 6 year old son and I) stayed at the Natura Park Resort from May 26th, 2007 to June 2nd, 2007.We have traveled to Punta Cana several times before, and it is safe to say 鈥?this was the worst vacation ever!!!!!!Here is our opinion of the resort and the (non-existing) customer service:Grounds: Beautiful landscape with lush greenery, lagoons, fish, flamingoes and, among other wild life, a bunch of geese. One of them, a large white male goose, viciously attacked my 6 year old son on the first day of our stay when we attempted to pass him on one of the walkways. The bird picked him so hard that he broke the skin in several places. Please do imagine the shock the child was under, since the bird, when aggravated and flapping his wings, was as tall as he was. Needless to say, I brought this unfortunate incident to the attention of the lady at the guest service desk 鈥?her response to me (in very broken English) was: This is an ECO Resort 鈥?Deal with it! I also voiced my complaint about the bird to the Apple Representative, who was told that the bird was very territorial and that management was aware that all vacationers as well as the staff were afraid of it. The only people capable of dealing with the animal were the ground keepers, since they had rakes, shovels etc. the defend themselves.We watched that bird attack 3 different people one evening within 10 minutes鈥? You tell me 鈥?is that something guests should be faced with as soon as they leave their room? Check In: Fast, again front desk staff spoke very little English.Rooms: Shabby, outdated and, above all, in bad repair. Toilet needed to get fixed sometimes twice daily, bathroom floor flooded, TV needed repair. Again, you need to walk all the way up to the reception to ask for maintenance, since if you try to phone the front desk or guest service, their English skills are not adequate to carry on a conversation.Pool: Dirty, even first thing in the morning.Food in the main Buffet Restaurant:Let me start by saying that we are animal lovers 鈥?but having birds sit in the scrambled eggs (and eating from it, of course) in the morning and subsequently walking through all the food platters is disgusting and definitely not improving anyone鈥檚 health. No wonder people were getting sick left and right. The food should have been covered up or one of the many staff members, just standing around involved in personal conversations could have chased the birds away.The food was tasteless, every day with no variety. They were also not very imaginative when it came to use up the leftovers from the day before. YUK. A la Carte Restaurants:First, they were just open one at the time, so if you were in the mood for seafood on Monday, you were out of luck since Monday the Steak House was open. Media Luna Restaurant (Steak House):We had a reservation for 6:30 PM and when we arrived on time, the wait staff was still setting up. They seated us, but didn鈥檛 even asked us if we wanted something to drink 鈥?never mind a menu 鈥?until well after 7:00 PM. When someone finally came to take our order, we asked for 2 beers and a 7-Up for our son. Not too difficult, one should think. We tried to order the Rib eye steak, which was not available that night and then settled for a Filet Mignon with mushrooms. Instead of mushrooms, the filet came buried under a mountain of onions 鈥?without any explanation. When after the meal we still hadn鈥檛 received our drinks (even though we had reminded the waiter repeatedly, we just got up and left. Staff is grossly incompetent.La Perla Restaurant (Snack bar during the day and seafood restaurant at night):Same incompetent wait staff from Media Luna the day before. Lobster was according to the waitress not in season so I ordered Shrimp pasta, which was the same pasta that is available at lunch with 3 shrimp on top. Very disappointing. My husband ordered the filet of sole, which was served under some saut茅ed veggies in aluminum foil. Lots of veggies 鈥?very little fish.Pasta Restaurant:We didn鈥檛 go since we anticipated the same lousy service and tasteless food.Entertainment: Nowhere to be found. No live music and the shows were marginal at best.Animacion: There were about 6 very disinterested people that gave us the impression they were just waiting for their shift to be over. Not much happening.Kids Club:This was the worst 鈥?we had picked this hotel since Apple vacations advertised a kid鈥檚 club from 9:00 AM to 5:00 PM.On our first day, I tried to take my son to the club and no employee showed up until 10:30 AM. I ended up leaving him at the kids club with a rather bored looking member of the animation team, who parked him in front of a TV and proceeded to put her feet up on a table and enjoy her book. To make matters worse, while sitting at the pool bar 鈥?we saw our son happily swimming towards us in the pool. Apparently, the girl didn鈥檛 understand she was to supervise the child until we would get back. Also, she informed us that the kid鈥檚 club was about to close for lunch from noon to 3:00PM!!!!!!!!!When I addressed the issue with the guest service clerk, I was again faced with an employee that spoke very little English and cared even less.So, if you have a child, stay far, far away from the Natura Park Hotel.Management:We tried to speak to the General Manager one evening about our concerns (that day that the toilet was still not working after they fixed it twice that day and the bathroom floor was flooded, we were told that it was dinner time and the manager was in the restaurant eating. We asked the front desk clerk to please call him and asked him to speak to us. The clerk even went downstairs to inform the GM, but no response. I was contacted the next day by guest services to make an appointment to finally speak with the GM 鈥?which I did. The appointment was set for 6:00 PM and when I got there (on time, of course) the GM was nowhere in sight. I was informed that he was on his way to the hotel and had car problems. Right! As we found out later, he used the same excuse for other unhappy guests that tried to speak with him.All in all, you can鈥檛 blame the staff for the less than marginal service 鈥?if management doesn鈥檛 care, why should they!This was by far our worst vacation ever 鈥?we will definitely never go back to the Natura Park Hotel.","ratings":{"Service":1.0,"Business service":2.0,"Cleanliness":2.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Miss Sean Barton","date":"2012-01-22 00:23:25 +0300"},{"content":"Great Resort - Terrible Service From Sun Wing Arrived at Natura on Mar.31 in the p.m. - 5 of us which included 2 children. Pleasant service, beautiful lay out, clean rooms, all greatly appreciated after a long day of travelling. Like others, we were pleased to see how wrong some of the previous bad reviews were. This was one of the nicest family resorts I've been too..and believe me, I've been to one not so nice...not half as nice as Natura. Would definitely go back. Beach was beautiful, pool was small but was perfect for us with the children - never out of our sight. Entertainment and activities for all...nightly shows were a bit cheesy but fine....can't comment on what happened past the shows as we were in the sack and up early for another beautiful day at the beach (or pool). Food was fine too...plenty to choose from especially for the kids who are normally picky eaters. Now on to the bad...stay away from Sun Wing!!!!! Should've known we'd be getting terrible service right from the start when our flight times were changed 2 times before we even left Hfx. On the way back home on Apr. 7th, we were re-routed due to a snow storm, from Hfx to Moncton..once there, we were left on our own to fend for ourselves...sat in the airport from 8:30 p.m. until 4:00 a.m. the next day, then demanded to be put up in a hotel like the hundreds of other re-routed passengers who were smart enough to go with another airline....Sun Wing had no one contact us, couldn't be reached in any way possible. By 3:00 a.m., we had airport staff track someone down (in Toronto).... were making offers that were ridiculous i.e. find your own way back to Hfx if you didn't want to drive back to Hfx in a snow storm in 4 clunky school buses (which never did arrive at the airport like we were told by the way) ....absolutely absurd..meanwhile, lucky travellers from other co's were flown back to Hfx by 9:00 a.m. the next day. Sun Wing rep. was finally contacted by phone from the hotel the next day - no help at all.....we found him with the help of a fellow passenger and the hotel front desk clerk but by then (after 11:00 a.m.) because we were all exhausted and told there were no other accommodations to be made, we climbed aboard...thank goodness we had great bus drivers ...trust me when I say once again (with support from appx. 70 other people)...stay away from Sun Wing!!!!!! There are plenty more details of the horrible service but not enough space here to write....stay away from Sun Wing!!!!!! It was the worse possible way to end an excellent vacation at Natura...I'll definitely go back to Natura but next time it won't be with Sun Wing.Take your family and enjoy the wildlife roaming the walkways...it'll be a great time!Debbie from NS","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Rebeca Fisher","date":"2013-05-08 01:19:57 +0300"},{"content":"Where you DON'T go for a vacation!!! This horrible experience began with a simple idea for a group of 8 friends to share a vacation in the Caribbean. We initially made our own reservations for a weekend stay at the resort and made multiple calls both before the trip, upon arrival to the country and again the day before we drove to the resort. The hotel staff confirmed our reservations each instance we called. Not until we arrived at the hotel early in the afternoon did we find out the staff there had LIED to us!!! They had given, yes given away our rooms which were reserved months ahead of time, to a tour group!!!! Even as we repeated our claims time and time again to staff at the reservation desk we were ignored and at one instance even told to shut up. They would not even give us the opportunity to speak to a manager, who according to them was not at the hotel that day. Finally after over an hour they found an assistant manager who admitted they lied to us each time we called to confirm. As we waited for the manager we saw multiple guests of the hotel approach the counter with their own complaints. They ranged from bugs in their rooms to bathrooms that didn't work and the staff did little to accommodate them. This experience left a nasty taste in our mouth the rest of the time there. In the end we were sent to another resort and no restitution for the lost day and aggravation. To sum up the staff are rude and unapologitic aswell as liers, and from the sounds of it the facilities are deteriorating. Don't bother going! You'll risk your piece of mind for a relaxing vacation.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":-1.0,"Location":1.0},"author":"Aliza Hickle","date":"2014-09-07 16:35:43 +0300"},{"content":"Not so bad. My wife and I just got back from Natura and had a GOOD time. We are both in our mid thirties and we found the resort to be nice. The food is decent and the weather is awesome. the landscaping is beautiful and our roome was mostly clean. If you have never been there are some things you might want to know about this place:1. Mini bar has only two beers and two Pepsi's. Good luck getting them refilled quickly.2. If your looking for a lounge chair by the pool to kick up your feet and relax, you better get up before 6am and take you towel out to the pool and claim your territory. If you don't, I hope you like concrete?3. Do not go to the Palma Real mall. Of the 33 stores claimed to be in operation, 12 were true to their word.4. Kirby at Conquest tours was absolutely useless. He showed three hours late for orientation and blamed us for the mistake. On this note get use to time deadlines not being made by employees.5. Bring plenty of American cash. They told us if we wanted more we could easily get it from the front desk. Take a wild guess what happened?6. The a la carte restaurants were nice, but we had difficulty getting reservations-even after orientatiion! Nothing a little cash couldn't solve. Amazing there were no spots left until Mr. LIncoln came out.7.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Myra Jacobson","date":"2014-08-01 15:37:51 +0300"},{"content":"Great vacation in the Sun We stayed at Natura Park Jan 11-18, 2007 and we had a great time. There is always something to complain about if you want to, but it was definitely a nice resort.We travelled with another family and had 4 children between us (ages 5, 7, 9 11). The kids were feeling a bit too old for the Kids Club but did participate in the Mini Disco show when they could. Petra was nice and did invite the kids to the club. Jimy encouraged the kids to participate in daily activities at the pool and on the beach. He was very friendly. They had sand toys and games by the pool - shuffleboard, mini-golf, bean bag toss etc.The beach did have seaweed. What built up over the day was collected each morning, so it wasn't horrible. There seemed to be more build up on the hotels next door (Allegro, Punta Cana Grand). We spent most of our time at the pool - though the older kids did some snorkelling. It was windy - so the ocean was wavy but the breeze was nice. It did bring in some clouds - and sunshowers, but really only lasted a minute or two.The rooms were average and we got good maid service. We did not use anything in the Mini Bar because we didn't need to. We had plenty of towels, soap etc. We got lots of water in big bottles every day.Don't buy from the vendors (sharks) that come on to the resort. They wear pink/peach shirts and hound you if you are around the pool. You can get much better deals at the hotel gift shop or if you feel like bargaining there is a market down the beach at the Punta Cana Grand (to the right). But beware, they will all want you to visit their shop for the cheapie, cheapie deals. Just be prepared to haggle or say no. We ate at all the restaurants -including the beach grill and none of us got sick. We liked the smoothie bar at the main buffet. But there was always a wait.The resort was getting busier as our week progressed and we did have to line up for lunch at the main buffet one day (I think they weren't able to clean up tables fast enough) and the pool restaurant was more crowded. But really what is the rush if you are on vacation?DO NOT change any money into Dominican Pesos. Everywhere takes US dollars and you can't change the Pesos back to any other currency. DO NOT take the bus to the Palma Real shopping center. It took over 40 minutes with all the stops at other hotels and there were only 4 stores open. It will be nice when it is done, but give it another year or so.DO take a bun and feed the turtles at the bridge at the front entrance. It is a hoot to watch the turtles, ducks and fish fight for the food. They all seem to come out of nowhere.DO take the country adventure/safari trip. We went with County Adventures - there are lots of tour companies that do it. You get to see a Dominican home, a school, a sugar plantation, a coffee/cocoa ranch, have a horsback ride and boogie board at a beautiful beach. (And the requisite stop at a tourist gift shop - with items made in China). The kids really learned a lot about how easy they have it. Also we took some school supplies to leave at the school (pens, pencils, erasers, crayons, notebooks etc). Enough said. Enjoy the quietness of the resort. There are no other attractions (other than a Casino) around, so you will relax. Take sunscreen and bug spray (we did have mosquitos at the Italian a la carte one night - but otherwise none).","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Antonette Stark","date":"2012-03-09 21:13:12 +0300"}],"public_likes":["Travon Bruen","Bridie Rutherford","River Klocko","Mohammed Gibson","Kelley Schaefer","Gabrielle Hoppe","Kailee Stark","Pinkie Kessler"],"vacancy":false,"description":"Women only.  Single rooms with shared facilities.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}