{"title":"London/Hammersmith and Fulham","name":"Lamington Serviced Apartments","address":"109 Hammersmith Gr, W6 0NQ","directions":"tube: Hammersmith ''or'' Goldhawk Road","phone":"+44 20 8748-2645","tollfree":null,"email":"lettings@lamingtonuk.com","fax":null,"url":"http://www.lamington-lettings.com","checkin":null,"checkout":null,"price":"From around £68.50","geo":{"lat":51.498,"lon":-0.2277,"accuracy":"ROOFTOP"},"type":"hotel","id":16180,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Spring 2001 and returning in 2002 My husband and I stayed at the Riu Melao in Spring of 2001 and are returning in the Spring of 2002 because we enjoyed it so much. The Melao is the smallest of the 4 Riu resorts in Punta Cana. The rooms were clean and adequate, the staffoutstanding, the food excellent. Guests were able to eat at the snack bars of the other Rius (except the Palace). The Carribean Street offers a festival night once a week featuring dancers, skits, animals etc. Very nicely done. There is also a cyber place where you can send and receive email ($5 per 30 mins). The resort tends to attract a lot of Europeans, especially Germans whom I found to be just downright rude to other guests. Most would not acknowledge a simple good day greeting. But that has nothing to do with the resort. Just letting folks know! It is not stopping us from going back. Please contact me if you would like more information!kbulger@michweb.net","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Montana Kilback","date":"2014-01-25 11:10:56 +0300"},{"content":"Fantastic! I just got back from an amazing week-long vacation at the Riu Palace Macao. A group of 35 went down for my sister's wedding and it was wonderful. It was my first time on an all inclusive vacation. The Dominican people and the resort staff in particular are probably the nicest people I have ever met. They are SO hardworking but go about their work with such a happy attitude. The resort was spotless except for a slight smokey smell in the rooms but that's the same in most hotels. The food was delicious. I'm a vegetarian and I found many options at the buffet for breakfast, lunch, and dinner. The a la cart restaurants are better suited to meat-eaters. The ocean was a little weedy because of recent storms but it was so warm and I swam in it more than the pool. I do recommend going off the resort on day trips because 1) it's fun! and 2) to see how the Dominican people live - it's a real eye-opener. If you want to go horseback riding I would think twice about it because the horses are not in the best condition. Overall I highly recommend the Riu Palace. I visited the top of the line 'Palace Punta Cana' and I have to say I much preferred the Macao - it's more intimate and friendly while still a 5-star resort. I would love to go back to the Palace Macao one day.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":4.0},"author":"Elouise Schiller","date":"2013-08-25 13:26:43 +0300"},{"content":"Season sees to make a big diffrerence This was our second trip to Punta Cana and the Riu Palace Macao. We picked this hotel because we had been there In November with another couple. Our first visit was fabulous. None of us could find any thing about which to complain, We had read all the reviews and kind of knew what we were getting., Our second trip in May left a lot to be desired. We had to have our first room changed because it only had a queen bed and we had requested a king size. Neither one of us is tiny!! We were moved the next morning to a room that looked exactly the same as our room in November 2007. However, by the second day we noticed very limited hot water for washing. By the third day we didn't have any hot water (gives new meaning to cold showers). We called the front desk and they said they were taking care of the situation No one (that day or any day after) seemed to think this was a big dea!! To make a long story short, the next time we had hot water was on the last (7th) day of our vacation. Ironically we noted that the only guests that were complaining of the lack of hot water were Americans! Lots and lots of Europeans. The service staff (cleaning, food, etc.) was still very efficient though did not seem to be as large as in the Fall/Winter, Could be the reason for the downfall in the property,I would not go back to this hotel. Definitely not 4 stars.I must admit though, that after returning home and speaking with my travel agent she did get us a one day refund from Riu. Big deal.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":3.0,"Rooms":3.0,"Location":5.0},"author":"Martina Connelly IV","date":"2014-11-22 03:57:18 +0300"},{"content":"amazing vacation I stayed at the Riu Palace Macao on July 6-13, 2008. I am a single, 35 year old female. I traveled alone because I wanted a truly relaxing vacation...and that is exactly what I had. I felt like a princess the entire time I was there.Airport: Quick, clean and easy. We landed at 10:00 am. The Apple tour guide was right there ---the bus trip was air-conditioned and fast. I was at the resort at 10:30am.Reception: I was handed a lovely drink upon arrival at the front desk. Widney was fast and friendly. I was in my beautiful room at 10:40amRooms: Very clean. Very roomy. No smell like I had read in other reviews. I was on the second floor facing the pool/ocean. The bed was very comfortable. The A/C worked, the fan was great. The refrigerator was fully stocked with beer, pop, tonic water and fresh clean water daily. The rooms were cleaned twice a day. Also, there was evening turn down service for the bed with candies.Food: The buffets were amazing. I never tried the A La Carte restaurants because I heard other guests say they were not that great. The have a Europeon flair to the style of the food--breakfast was amazing, eggs any style, made-to-order omelettes, french toast, pancakes, tons of fresh gourmet cheeses and meats, yogurts, fresh fruits. I had lunch by the pool everyday--that buffet was also amazing. Everything from pizza to pork, chicken, salads, nachos, fruit, desserts. Dinner was the greatest. The service was amazing. Food ranged from caviar, shrimp, pork, beef, chicken, pasta, salads, breads, pizza, etc.Service: I was truly pampered by the amazing staff at the Macao. All employees always had smiles on their faces and always greeted you happily.Casino: Very small, very old broken machines, but I won!!!I plan on returning again in March 2009. I layed out, I drank all day, I swam at the ocean and at the pool, I read many great books, and truly had an amazing, relaxing great time.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Domenico Schoen","date":"2013-11-26 04:07:09 +0300"},{"content":"Lovely hotel We stayed here from 36th May - 9th June. The hotel was faultless . We couldn't have picked a better hotel I'm sure. We moved rooms after the first 2 nights as the air con wasn't working and the 2nd room was much better.The staff are lovely, happy smiley people who can't do enough for you. look out for Antonito - he seems to work all over the place at different times of the day and is a real gem!! 'Oh my god he loves his job!! 'as he was frequently fond of telling us.Champagne flows all day long and the cocktails are to die for.We didn't get very good weather the first week - lots of thunder, lightening and rain but it changed on the Thurs of our second week and was red hot till we left on the Mon afternoon.We joined in some of the activities during the day but no one got pressured into doing anything.We looked round all the other hotels on the resort but still think we had got the better option and wouldn't hesitate to stay there again.We went on the Monster truck trip which was really good but we had really stormy weather and I could think of a lot better place to be than in an open topped truck in the mountains! It was certainly an eye opener and if you are going please take things for the people in Haiti - clothes, shoes, toiletries , food - they are grateful for anything at all . This is your last stop when you go to the Witch doctors.The night entertainment was ok although we didn't see alot of it as we made friends with other people and made our own entertainment.We used the a la carte 'restaurants a few times and they were really good , especially 'The Caribe' as you got a lovely breeze through as it was on the beach.the food in the main buffet was brilliant and there was everything you could possibly imagine at every meal time. The staff were very attentive at all times and kept topping your glass up when you weren't looking,All in all a good time was had by all!!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Miss Everett Mueller","date":"2012-04-06 18:45:51 +0300"},{"content":"Fantastic Holiday This was our third trip to the Dom. Rep. and our fourth stay at a RIU hotel all the others were great, but the RIU Palace Macao was by far the best. Excellente as they would say.Everything you need for a perfect holiday.The staff were very friendly and helpful even though we don't speak Spanish.The food was plentiful and with such a lot of choices that no-one need go hungry.The drinks were free flowing from morning to night, we even took a bottle of champagne to our room a couple of times so we could sit on the balcony in our rocking chairs and just enjoy the view.There are plenty of sunloungers by the pool and on the beach, we never had a problem getting one and we were not up at the crack of dawn as some folks suggest you need to be. They even carried mattresses down to the beach for your sunloungers if you wanted them.There was waiter service on the beach as well as round the pooland we never had to wait too long for our drinks, as one previous review has said.We didn't try any speciality restaurants, but always had our lunch at the Caribe Grill overlooking the ocean, where the service was excellent. If you have booked a holiday here rest assured that you will have a great time.We can't wait to go back next year and are already planning our return visit to the RIU Palace Macao.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Walton Wilkinson","date":"2013-07-20 03:48:03 +0300"},{"content":"Loved the Riu Macao, would recomend it to anyone I just got back from the Riu Macau Punta Cana, and I would recommend it to anyone. The staff was great, very friendly and engaging. The three restaurants in addition to the main buffet which had a different theme everyday were good. The Japanese restaurant served a great salmon, but you will not get sushi or shimie in any quantity or quality. The other two were Caribbean and a Steak house, which were great. The grounds were flawless and staff would bring you drinks while you laid around by the pool or on the beach (all included, but its nice to tip...hint hint) I would recommend bring $100 in singles and another hundred in $5 for tipping and to carry a few bucks on yourself during the day for those small things like Allovera (for those sun burns.) I would tell anyone to go there. This was my first all inclusive resort, so I don鈥檛 have a basis for comparison, but I could not have asked for anything more while I was there. This place was what I pictured in my head of what an all inclusive resort would be from tv, movies, and books, and then they took it a step further. There is a live show every night from 945 to like 1115 or 1145. The head of entertainment Johnny Bravo is funny, engaging, and puts on a great show. Plus alcohol and food 24x7, a four bottle liquor dispenser and a fully stocked mini fridge in your room is awesome and adds to the enjoyment. There are free amenities if you enjoy kayaking or sailing a catamaran. You can pay for other stuff like scuba.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Natalia Abbott","date":"2013-02-05 22:51:24 +0300"},{"content":"Riu Macau nothing special-not great Quick background...my wife and I arrived for a quick four-day stay due to work  our children back in the states. This was our forth visit to Punta Cana resorts in seven years and this review is based on comparisons to other stays in this area.  Check-in was seamless and uneventful-we later learned the resort was booked at about 60-70%. We received an upgraded room simply by asking. The room was clean but dated and the old bedding and mattress were well below par. Food at the buffet for all meals was good and varied. The on-premises restaurants offered little variety and slow service and were rarely filled. We found these restaurants were not worth booking. The grounds were good  the pool was clean-nothing more worth adding-we stay at the beach. The beach provided plenty of loungers and enough shade/sun for everyone at any time. Service was great and we always appreciate the staff that typically work 11 straight 10-12 hr days  3 days off. We appreciate everyone there b/c we know they work hard. We would not go back to a Riu property again. This was sold as a better than average level Riu. There are better run and better maintained resorts (Iberostar our favorite) that we enjoy more.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ila Brekke","date":"2012-07-22 15:46:03 +0300"},{"content":"Beware with teenagers We recently returned from a week at the Riu Palace Macau in Punta Cana with our 16 year old son. I wanted to post this since I was negligent in researching the property and its practices with regard to liquor. Traveling with a 16 year old presents challenges, which were compounded by the fact that the legal drinking age in the DR is 16. The hotel was very accomodating and eagerly served teenagers at the bar. When I inquired about a different color bracelet to prevent my son from drinking, I was told they did not do that. In addition to the liquor, cigars are freely given out to anyone wanting one by the people who set up tables to sell their wares to the guests. Both these policies should be reviewed.In the future I will be more vigilant about investigating the drinking policies at resorts we visit.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Vena Stracke II","date":"2012-09-01 17:38:44 +0300"}],"public_likes":[],"vacancy":false,"description":"Luxury short term serviced apartments for business and leisure guests. Spacious and modern apartments in a quiet residential area, with local restaurants, delicatessens, and amenities, and in walking distance of major transport links.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}