{"title":"Paris/16th arrondissement","name":"Hotel Keppler","address":"10, rue Kepler","directions":null,"phone":"+33 1 472 06505","tollfree":null,"email":null,"fax":null,"url":"http://www.hotelkeppler.com/","checkin":null,"checkout":null,"price":"€125-250","geo":{"lat":48.86983,"lon":2.29726,"accuracy":"APPROXIMATE"},"type":"hotel","id":21664,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I wanted a room with a jacuzzi . afer our new york new york plans fell through ( no money) we had to find somewhere we could afford. first off the room was $79.00 a night for a suite we expected a small room but some where we could celebrate alone. well we were blown away. the room was gigantic and very beautifully decorated. it could easily be compared to the higher priced strip hotels (beleive me i have been there) but it was quit and pleasant. and close to the fremont street expierence . we will be staying there again.","ratings":{"Overall":5.0},"author":"Leslie White","date":"2013-04-15 13:16:22 +0300"},{"content":"The only positive at Backstage Hotel Amsterdam was its location (it's just a short walk from Leidseplein, the square with the bars). But location in Amsterdam is a relative thing, as we discovered after renting bikes; you can easily move around the city with them: fast, cheap, green and fun way to discover the city. Unforunatley, I can't say anything positive other then that about this hostel-like hotel. The bathroom door was broken, the floor looked really dirty and used, as the rest of place. Wouldn't stay here again....","ratings":{"Cleanliness":1.0,"Sleep Quality":3.0,"Overall":2.0,"Value":1.0,"Service":2.0},"author":"Freeman Von","date":"2012-09-28 16:40:57 +0300"},{"content":"We got to Amsterdam late and had to take this hotel. Room was very interesting but bathroom plumbing stunk. Must have had a vent problem. The room was expensive but comfortable. Narrow (typical for the city) winding stairs that simply wore us out going up and down. Staff was very helpful. Only stayed one night but it served its purpose. Not a bad experience but stay was too short to provide a detailed review.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Hunter Terry","date":"2015-03-25 08:58:56 +0300"},{"content":"This is the most amazing hostel i've been. Me and 4 friends stayed in a room of 5 and it had the best beds. Space enought for what we expected, we all loved the decor, the heiniken welcome pack, the view from our window to the canal... Only the stairs were quite a challenge when we return at late hours. But we recommend this place to everyone, great location, not in the center and therefore quite but close to one of the main nightlife places. The staff are 5 stars, really friendly and helpful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Jadon Koss","date":"2015-05-22 12:58:59 +0300"},{"content":"When choosing a hotel you have to ask yourself what is it I am looking for. Vegas especially offers a very wide array of choices, so you really need to ask that all important question. Do you want glitz and glamor, pretty people and high end entertainment, spas and shopping? If so then the strip is the place to be. If I were treating myself and my wife to a fun vacation trip probably that's where we would head. Or if we were looking for just a basic, more budget minded, gamble a little play a little trip, then downtown might be our choice. This trip was a business trip, and downtown was simply more convenient, to say nothing of less costly. This was my first stay at the Fremont and it fit the bill very nicely, thank you. The room while not large was more than adequate. It was clean, as has been mentioned in some other reviews, tastefully redecorated recently. It was a nonsmoking room/floor and I didn't detect any smoke odor in the room although a little from the main floor does make it's way into the hall around the elevator. The bed, pillows and bedding were comfortable. The bath room was small, while I had no problems, it is a one person at a time proposition. Loved the water pressure, huge plus for me. Restauranting downtown offers a pretty wide choice, I opt mostly for sandwiches etc when not entertaining. People-watching under the canopy of the Fremont Experience is almost as good as any number of the shows one can see on the strip. But as I have said this was first and foremost a business trip. The staff was extremely friendly did their job well. Housekeeping missed servicing my in-room coffee, front desk handled it in a timely fashion. Check out was a little slow with only one person on station. Al in all have to give it a thumbs up. Not fancy, but the equal of any mid-range Motel chain. I booked as a Flight/Hotel package and was very pleased with the great value for the money.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Prince Treutel","date":"2012-12-18 06:55:02 +0300"},{"content":"As mentioned in the title, I rated this hotel a \"4\" for gambling and not necessarily for the rooms, although the rooms are bit smaller than what you'd get up on the strip, the excellent gambling makes up for it all. We just recently got back from an 11/11/11 trip and definitely enjoyed bringing back home all the money we went up with, plus more. We enjoyed playing every single day (6 days of fun) around the clock at the Fremont and other downtown vicinity hotels. Rooms have been updated as far as the decor goes, can't change the size of the room, but it's still kept clean, no flat screen tv, but that's ok, we're not here to stare at walls 24/7 or the TV...but strictly to play, enjoy and have a lot of fun, which we always get when staying at the Fremont. Table games, slot machines, poker machines, you name it, they got it and a lot of guests to boot, which makes this one of the best old times downtown \"happening\" hotels on the Fremont street experience. Now, don't go there expecting a 4 or 5 diamond rated room, because like I mentioned earlier, its \"old time\" Vegas, and not your spa & resort style uptown atmosphere, but the years of \"old gone by,\" where the real gamblers of past preferred staying and still do. As far as food goes, we skipped the buffet this time because most of our family vacationing there were staying at either the Main Street Station or the California (all Boyd hotels), so most meals were usually at the Main Street station hotel & casino. We did pick up some last minute in-between and after gambling eats at the open cafe where you can find a variety of fast food such as chinese, American, etc. and I can't forget to mention that huge bowl of delicious oxtail soup (with rice), you'll just have to try this one out. Also, be sure to try Tony Roma's restaurant, known to make some excellent ribs and other goodies, but, be sure to make reservations in advance. The overall happy atmosphere at this hotel is due not only to the type of guests that patronize this place, but also due to a lot of friendly, courteous and professional employees who'll help to make your stay comfortable, enjoyable and memorable. As far as parking goes, I normally only do valet in Vegas, hey, just let them park your car (it's much safer), and what's a two or three dollar tip when you'll be dropping even more into that slot machine or on that favorite table game of yours, for me, I call it convenience by getting right off at the the front door. Fremont is one of the best located downtown hotels there is with a 1 minute walk (I'm not kidding either) to Binions, Golden Nugget and the Four Queens casino & hotel. Fremont is a \"Boyds\" casino, & one can venture to it's sister properties, the Main Street Station or the California hotel & casino via a 4 - 5 min. walk down the street. Don't forget to sign up for your Bconnected players card which can also be used at all \"Boyds\" and \"Coast\" properties, and used to get \"comp\" rooms, discounts off buffets when you show your card, and at some of the sun dry shops too. Fremont is a good value for your money (it's not the Venetian) but you'll have loads of fun staying at this iconic oldie of an oldie hotel. Enjoy and happy gambling!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Eli Marquardt","date":"2013-11-24 18:35:34 +0300"}],"public_likes":["Raul Rohan","Vern Dooley","Denis Rempel","Ardella Reinger"],"vacancy":false,"description":"In the entertainment district with 34 guestrooms and 5 suites. A winter garden and bar is available within the hotel.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}