{"title":"San Francisco/Union Square-Financial District","name":"Hotel Abri","address":"127 Ellis St","directions":null,"phone":"+1 415 392-8800","tollfree":null,"email":null,"fax":"+1 415 398-2650","url":"http://www.hotel-abri.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7852,"lon":-122.4083,"accuracy":"ROOFTOP"},"type":"hotel","id":26215,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I booked this hotel on-line before leaving the UK as it was close to Phoenix airport and seemed to offer good value for money. We arrived about 9.45pm and had an excellent bowl of soup before heading to bed after a 16 hour trip. What a great night's sleep - the HGI pride themselves on their beds and pillows and it's no idle boast. We decided from then on to book HGIs whenever we could - Flagstaff, Las Vegas and our final night back in Phoenix before flying home, and we never regretted it! The staff were very helpful, welcoming and informative in Phoenix. The room was comfortable, the facilities and the coffee was great. Free wi-fi and printing in the business centre makes on-line check in for flights very easy. The location of the hotel is ideal, both for arrival and departure. Check-out is a comfortable mid-day and I really can't praise this place enough.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Adriana Marvin","date":"2014-07-28 02:01:55 +0300"},{"content":"Brand new Hilton Garden Inn close to the airport. Rooms exceeded my expectation. Breakfast was excellent. Also, good access to the new train line, only block away across a college parking lot. Would definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Edwin Nicolas","date":"2015-10-10 02:00:33 +0300"},{"content":"Was going to stay at another Comfort Inn in Phoenix, but they lost reservation. Found this jewel!! For New Year's Eve, got a room with king bed & hot breakfast for $55, homemade dinner served buffet style for $6/person, live band with no cover charge, and nice hot tub & pool. So my wife and I spent about $100 TOTAL for a New Year Eve's party with hotel room.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Martina Kling","date":"2015-09-10 04:16:19 +0300"},{"content":"This hotel is NOT in the \"heart of Phoenix\" -- it is in the distant suburbs -- the heart of PHX is nearly 20 miles away!!","ratings":{"Overall":3.0},"author":"Torrance Barton","date":"2015-07-10 12:07:01 +0300"},{"content":"Found this hotel through friends, booked a room for $49/Night. Upon arrival, upgraded to suite for $69. Sitting room had desk & wet bar, bath was good sized, King bedroom had sliding doors to patio & central courtyard/pool area. Hot tub just steps away. Very quiet & comfortable. Hotel is a tiny bit shabby around the edges but location was good & value was tremendous. Just the basics for breakfast but lots of it & the room where we sat to eat was lovely. Very friendly staff. We'll definitely stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Dangelo Kutch","date":"2015-01-06 04:25:49 +0300"}],"public_likes":["Carmelo Stiedemann","Kaitlin Predovic","Sibyl Ullrich","Marjolaine Halvorson","Kasey Tromp","Trey Gutkowski","Katelin Reilly","Chris Effertz"],"vacancy":false,"description":"Recently renovated hotel that lacks a pool or free breakfast. Rooms are small but has everything you need for a reasonable price. The cable car, MUNI and BART stations are within walking distance.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}