{"title":"Whittier","name":"Lambert Inn - Whittier","address":"13318 Lambert Road","directions":null,"phone":"+1 562 693-1099","tollfree":null,"email":"reservations@lambertinnca.com","fax":"+1 562 698-6752","url":"http://www.lambertinnca.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.958356,"lon":-118.038526,"accuracy":"ROOFTOP"},"type":"hotel","id":33343,"country":"United States","city":"Whittier","state":"California","reviews":[{"content":"The views surrounding this resort are simply amazing. I've never seen more beautiful surrounding in my life and I've traveled a lot. And if this is all you care about, then go for it. However, restaurants (and everything else) in this resort is redicuolosly overpriced. The small bottle of water goes for $3.50, two eggs breakfast costs $17 and small glass of orange juice is another $3.50. Me and my 10years old easily spent $500 on food in 5 days and we normally would share appetizer and one main dish and never order any drinks besides juice or water. They charge $20 per person for their own water park that consists of three water slides and lazy river. This is per day, not per stay. Service is very poor. The first thing you hear from a waiter is a reminder that tip is %15 and not included. Waterpark closes at 6pm, however at 5:30 I was told that they just put a bunch of chemicals in the pool and they don't want any people to be in it. The rooms are big, but run down. Dirty carpet, stains on the bed sheets. The pool towels needed to be replaced years ago. My daughter refused to use them at all. Beach at the private island is nice, however boats go there only once in a hour, so you have to wait in long line sometimes under the hot PR sun. Internet also costs money and the same about parking.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Kylie Beatty","date":"2014-01-27 10:58:35 +0300"},{"content":"When you associate a hotel with the Waldorf Astoria Collection you think of luxury and upscale - dismissed that Idea from your head if you are staying at this hotel. I also do not understand why the hotel is rated so high. It is overpriced in every aspect. I just returned from a 4 night stay and this is the first time I have traveled to this location in PR. 1. The room we stayed in was in bad need of renovation. Mold on the ceiling in the bathroom closet which actually was leaking on to our clothes. Mold in tub/shower area and the countertop needed to be replaced. Walls needed to be painted and floor needed to be grouted and cleaed. The radio clock did not work - no way to tell what time it was, or to have some background music. 2. Slowest service I have ever witnessed, and I have traveled throughout the Carribean. Food and drinks highly priced plus they were always running out of products. 3. Our outside patio never had to be cleaned, around patio in grass glass and debris. 4. Casino closed at midnite, and the so-called nightclub had a sign stating either 18 or 21 or older to enter, collar shirts. Well, there was a baby in a stroller and lots of kids dancing on the dance floor. Hotel personnel walked in there and never said a word. 5. Went to the private island, took the tram down to the boat shuttle which only came every hour and was packed. The second day we went to the island \"no towels\" and no staff member seemed to know why, when or where to towels would arrive. 6. No adult section, the pool that had the swim up bar (usually for adults) filled with children - (jumping into the pool and screaming). The positive things about the hotel was the morning breakfast buffet was very nice and had a nice selection of food. You could rent a car from enterprises right at the resort. Arriving at the airport it was easy to find the shuttle to the hotel which they provided you with water, soda, and rum.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":4.0},"author":"Elsa Reinger","date":"2012-05-25 00:40:29 +0300"},{"content":"My husband had a conference at this hotel, and families were invited to join for the weekend (Thursday-Sunday). My son (19 months) and I joined my husband on Thursday. On Friday afternoon we found out that the main pool area would be closed all day saturday and part of Sunday. If we had known that ahead of time, I don't think we would have stayed the weekend as outside of not being able to use the pools, we also had to deal with really loud music, spilt beer, and people walking everywhere in their swim wear acting like they were at spring break. (while also navigating hoards of people) But, assumably most people reading this hopefully wouldn't be dealing with such a circus so I'll share the relevant parts of my experience. Check-in.- My husband mentioned it took more than 45 minutes after arriving in line at 3:30 pm. with only a couple people in front of him to get through check in and too his room. I asked him \"why' and he said it seemed like they were trying to find rooms for everyone. El Conquistador handled the transfer from San Juan-surely they could have in the 1.5 hours it took to get to the resort work on finding rooms to expedite this process? Room- We were fortunate and unfortunate to be in the Marina area in a corner room overlooking coqui water park. On the plus side, this was a pretty quiet area of the park-particularly a corner unit. This was especially helpful for the chaos of the spring break Heineken party on the upper part of the resort. It was also close to the boat to Palomino island which was good for us. Finally, the room had been recently renovated so that was nice. Bathroom was huge, deck was huge, and room was a decent size. View was also nice. The negatives: Lighting was pretty bad at night. It only had 3 lights. This was okay for us as we put our son to sleep and hung out in the bathroom but would be irritating otherwise. Also, the location was far from most restaurants and basically the whole resort. It was kind of a pain to have to trek in for breakfast. In retrospect, I wish I just ordered room service on the days we were heading to the beach. Beach- This is a huge drawback and is actually why i had booked another hotel (caribe hilton) for our last night in Puerto Rico. In order to go to the beach, you need to take a ferry. I was told it was an 8 minute ferry leaving every 1/2 hour. The reality? A 20 minute ferry leaving whenever. The day we went to the beach, we treked up the funicular for breakfast then made it down for the 9:30 am ferry (arriving at 9:25 am) That ferry left at 10:15 am. Try waiting in line with a toddler for 45 minutes in the hot sun. fun. Ferries also have limited times- you can only go over to Palomino island between 9 and 3. Not very convenient to coordinate around naps. Once we got to the beach, it was nice, with many shallow areas for young kids. But, no showers that I could find. We had to rinse the sand off in our hotel room. Very odd. How can a beach not have any showere nearby? Pools- Well, they were closed for much of our stay. In 500 acres though, there didn't appear to be a toddler pool. I asked the bellman and he didn't know of one. He said my son could play on steps. Coqui water park (additional charge) had an area that was like a beach (with a low gradual increase in depth) We received complimentary passes with our group. If I were a regular guest, I'd be irritated that I had to pay separately for my toddler to go in a pool. (oh no fee for under 3, but I'd have to pay). Food- I actually was pleasantly surprised to have some affordable food options (ie. breakfast for $10/entree) No kids menu though. Most of our meals were included with the conference so I basically only went to breakfast. Thought the lunch on palmomino was good. Spa: A real trek t get here from the Marina. I did this the festival day and it was a bit of a headache. I did the caribbean escape session. I thought the spa was poorly marketed. If you are interested in attending, I'd look online to get the menu of things as none was really included in the room. The spa store closed before I got out of the lockerrom (before 6 pm). I was told to come back if I wanted any of the products used in my facial. Um, not happening. Toddler gripes- I wish they would have clear information on their sites for toddlers -ie. where can they swim, etc. Service- I thought it was fine. Everyone was very friendly etc and responsive to requests. HOwever, my husband thought service was terrible largley based on his huge wait to check in. I think the hotel might be doable for older kids. Not the best choice for the under 5 set. Much prefer the caribe hilton for that. We stayed in 3 hotels in Puerto Rico-El Convento (mom and dad's favorite), El Conquistador (a required hotel) and Caribe hilton (our son's favorite. If we were to go back to puerto rico its a toss up of where we'd stay-but not this place. Oh-and for the spring break thing- colleagues of my husband called security 6 times overnight do to a loud party. Nothing was done. There should be a limit to noise complaints then the guests are kicked out. Ridiculous. Others also complained about room conditions so I think it really depends on the luck of the draw as our room was renovated.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":2.0},"author":"Ludwig McClure","date":"2015-09-03 12:39:55 +0300"},{"content":"My husband and I stayed at El Con for a work/vacation trip and couldn't wait to get out. The views are spectacular and they definitely do their best to make the resort high-end, and by that I mean, they just charge the $@!#% out of you for everything. The breakfast buffet is $19.99, for instance, and access to the swim park is $20 a person. The only good part about this hotel is access to the Palamino island via ferry. Unfortunately, though, you can't count on the ferry and the last one leaves at 3pm to the island. Instead, stay somewhere else and be on YOUR schedule versus the ferry/fernicular at this hotel. Not to mention, every time I called concierge the phone just rang and rang-no one that works there really cares if you are helped or not. I would go to another island in general-not worth my money.","ratings":{"Overall":3.0},"author":"Faustino Conn","date":"2015-01-22 16:23:25 +0300"},{"content":"Loved it - i didn't realize how beautiful Puerto Rico really was until now. I've stayed on islands like Turks and Caicos, Four season in Nevis, Ritz Carlton's all over and I've also roughed it in the mountains of Utah and Colorado on horseback and in tents ---- I say all of this just to say that I've been to a couple of places and I really enjoyed my stay at El Con. Of course all places have good and bad things about them, but PR was awesome. Attended a wedding in the middle of June in PR and we had to find a hotel b/c the wedding hotels, Rio Mar and Grand Melia were booked in mid June. So we stayed at El Conquistador as a result of our taking a risk on one of the hotwire/priceline/hotels.com type of sites. After we discovered that we got El Con, we read the reviews and were concerned initially (b/c of the negative reviews and b/c we didn't know how far the wedding would be) until we remembered that we always have great vacations. We arrived in PR and got a rental car. The garmin gps device I brought with me worked perfectly in PR. The garmin led us right to El Con. As we drove up the winding hill past the golf course we couldn't believe how beautiful the golf course and grounds were. It took a few minutes to get to the main hotel - its located on cliffs of a mountain. The distance from the entrance to the main hotel requires a drive unless you don't mind walking golf course length distances. We dropped off our luggage with the bell man and parked our own car. The outdoor part of the lobby was gorgeous and the inside was very nice also. I'm an outdoor and plant person. They have luscious plants throughout the hotel and beautiful birds in the lobby that say \"hola\" - hello in spanish. We waited to check in and our bell man took us to our room. The bell man was fabulous. He made sure that we were pleased with our accomodations and went over and beyond to ensure that we were happy. I have forgotten your name Mr. Bellman, sir, but Thank you. I will look for you when I return in August. During the walk to the room we saw the casino and all of the shops. The views are truly truly breathtaking. The hotel is sprawled over a mountain and cliffs. You navigate the cliffs using the elevators, stairs, and funiculars (like a cable car). The outer funicular (closest to the water) is express from marina level to the top - The inner funicular is local (bellman explained it). so we knew to stay away from the local funicular since our room was not located on a local floor. Since this property is so large there is lots of walking - which is good b/c walking is good exercise :) It may be an inconvenience for a person with some disabilities - there are ramps everywhere. Our room was located at the marina level with a wonderful view of the ocean, and a view of the ferry coming in and right next to coqui water park (for my nephew) and right in front of the EXPRESS FUNICULAR. I loved listening to the birds perched outside of my room. I had breakfast at Cafe Caribe. It was a nice breakfast that I was pleased with. Most people ate at the wonderful las brisas buffet, but I don't need that much food in the morning, I just need food for my energy - so I skipped it and stuck to Cafe Caribe or oatmeal in my room (water was boiled in coffee maker). Each day, my Mom, my brother, nephew and I hopped on the hotels' catamaran to Palamino island, the private beach. I love to be on the ocean so this daily ride to me was a fun part of my trip. It wasn't an inconvenience at all. Especially since I knew that the hotel was not located directly on the beach and required the catamaran ferry. I do hope that people check the hotels they book to know what they are getting into. I mean if the hotel is across a mountain and cliffs and part of the journey is a boat to your private island beach, then you should know that going into it. I would see the ferry coming and run out of my room, and down the steps ready to board. I loved the sand and the warm warm warm water. Water visibility was terrific. Yes there is alot of seaweed and rocks, but other reviews tell you to bring some water shoes. Its the ocean. I was barefoot most of the time except for when I would attempt to walk out to palamonito, the smaller island in front of palamino. I never actually made it (too afraid). Wear shoes if you explore and shoes aren't always needed on the side of the island where the ferry comes in. The ferry shuttled people to the island, just about every half hour or so. Every time looked up, it was coming or going. The island is really fabulous. I ordered a greek salad and chicken fingers while on the island each day. I enjoyed my lunch. Yes its pricey but we were at a hotel and we budgeted for the fact that we may have a few meals there. We actually never ate dinner at El Con after reading that the restaurants were expensive. We used our car and we explored. La Estacion - 3 times - loved it , loved it, loved it. The passion fruit salad (or whatever it was) was awesome. One day I wasn't pleased with it and they replaced it without question. Great customer service. Another restaurant \"Pasion....\" - we will not eat there again. We ate at a mexican restaurant that had a fabulous brownie desert with icecream and whipped cream and fudge in the middle of the brownie. It was heaven. I do not remember the name. We purchased our room alcohol from the \"cash and carry\" in the neighborhood (yes we went to the cash and carry) and we also shopped at the supermarket and walmart. My nephew and brother loved the water park. They no longer joined us at the beach b/c they preferred the water park each day until the day before we left. The only time I spent in the room was to change afer a day at the beach, to get ready for dinner, to wash and to sleep. I spent very little time in the room. I'm a golfer but decided to look at the golf course rather than play it. Very very hot weather in PR. The sunrise and set and the dew over the lush greenery was beautiful everyday. All of the people we met at the hotel and in PR were friendly and nice. When our balcony door wouldn't open, they sent someone up to fix it. The walk to the car to go to dinner was never bothersome. After dinner we would take our walk to the room and realized it was just the walk we needed after filling ourselves up at dinner (we would laugh at how tired we were but we encouraged each other on until we got to the room). Just looking at the paradise we were in really made it difficult to get mad. Of course the 6 year old would fall asleep at night and this sometimes required his father to carry him on a few occasions which added weight to our room walks. we worked it out. Nightlife for me was looking at the view, or reading a book. There was salsa dancing Friday and Saturday night in the lobby. There is also the casino. But with our day activities, nighttime for us meant, SLEEP. I slept comfortably everynight. On the last day while checking out, we inspected the bill carefully and everything was correct based on our package. While checking out we discovered the pools and the views on the main lobby side of the hotel and wondered how we missed this (we spent time going from palamino to coqui park to room to shops to car for dinner, to wedding activities back to room). The views by the pools are so spectacular we decided on the spot to return. We will be back at the end of August. Your vacation is what you make it. I knew from reading the reviews that I should rent a car, I knew that the restaurants would be expensive, so either plan for it or eat locally as we did. I knew there would be rocks and some seaweed and the reviews said you will be ok with shoes. And we were just fine. The staff was wonderful, helpful and friendly. If there are problems, address the issues and continue to have fun. Do NOT be afraid to explore. Have an open mind - you are in paradise for a short period of time. As I stated, I was just there in June 2010. I'm returning this month, August 2010. In August I plan to do the other things I missed - swim at the pools while watching the views (at night-while sipping drinks from the bar ), El Yunque, one of the luminescent bay tours, I will tour rincon beach on the westside, I will visit culebra and maybe vieques, party in San Juan at Club Bravo (maybe), visit the town of Loiza and old san juan, eat at La Parilla, Pasta y Pueblo, Calizo, Of course La Estacion and Metropol. I will only be there 8 days. If palamino island doesn't grab me again the way it did before I will accomplish all of this - with mom and this time auntie. Since we drove before we are very familiar with the territory and comfortable driving especially with our friend, Garmin Navigation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Eleonore Stehr","date":"2014-05-03 11:12:03 +0300"}],"public_likes":["Bernard Armstrong","Carlee Hermiston","Marlin O'Reilly"],"vacancy":false,"description":"Offering an AAA 2-Diamond garden hotel in the heart of Whittier.There are jacuzzi suites and free Wi-Fi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}