{"title":"San Francisco/Golden Gate","name":"Cow Hollow Motor Inn & Suites","address":"2190 Lombard St","directions":"at Steiner","phone":"+1 415 921-5800","tollfree":null,"email":"reservations@cowhollowmotorinn.com","fax":"+1 415 922-8515","url":"http://www.cowhollowmotorinn.com/","checkin":"3PM","checkout":"noon","price":"$79-$145","geo":{"lat":37.7999,"lon":-122.4375,"accuracy":"ROOFTOP"},"type":"hotel","id":25801,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"As other reviewers have said, the hotel's location cannot be beat as it is within walking distance of most Boston sites and is in a great residential area. Our one bedroom suite was better set-up for a solo traveler than a couple as seating and moving around were a bit odd. The staff were very helpful but ran out of food for breakfast one of the days we were there. The keyless entry, etc. was a plus as far as we were concerned. Would probably go back again considering other options in the area. Fitness center and free computer/phone calls were a plus.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Wellington Schaden","date":"2015-05-16 00:06:25 +0300"},{"content":"We stayed at the Inn for 3 nights, the last stop in our 2.5 week family road trip. Hands down, the best accommodation! We never wanted to leave the apartment - that's how good it was. Spacious enough for our family of 5 - grandma, mom, dad, 2 kids. The kitchenette is small, probably suffice to heat up food and simple meals, but the three HUGE HD TVs were a real treat! The living room is very large, and the sofa plush enough to sleep on. You can tell they have put a lot of thought and pride in the furnishings and decor - everything was new and lush. We stayed on the top floor and one of the bedrooms was in the turret, which was quite special. You are given your own code for the main door and your room, so there's a lot of privacy. Now, the location - couldn't have asked for better - literally just behind the Prudential Centre. We will definitely be back to the Inn if we are lucky enough to visit Boston again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Candice Skiles","date":"2013-09-17 16:12:16 +0300"}],"public_likes":["Eliseo Jacobs","Ian Rodriguez","Stephany Glover","Rosie Fadel","Neha Stracke"],"vacancy":true,"description":"Centrally located in the Cow Hollow neighborhood, this motel offers 112 standard and reasonably priced rooms.  The decor is definitely dated and will not suit everyone &mdash; they have floral wallpaper that might just keep you up at night!  However, the rooms are comfortable and they do offer free parking.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}