{"title":"San Francisco/Civic Center-Tenderloin","name":"Cova Hotel","address":"655 Ellis St","directions":"between Hyde St and Larkin St","phone":null,"tollfree":null,"email":"contact@covahotel.com","fax":"+1 415 723-7877","url":"http://www.covahotel.com/","checkin":"3PM","checkout":"noon","price":"$85-$300","geo":{"lat":37.784,"lon":-122.4168,"accuracy":"APPROXIMATE"},"type":"hotel","id":25594,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"As usual, I used Trip Advisor as my final decision when selecting a hotel for our long weekend getaway in San Francisco. Wonderful staff, great location, great room. There are so many options for public transportation within steps of the hotel. On our last day in town, it was raining and the complimentary umbrella came in handy. Of course, the rubber ducky was a cute touch to the room decor! I would stay at the Chancellor again, hands down!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Rooms":4.0,"Location":5.0},"author":"Marlon Gleason","date":"2014-10-20 04:58:53 +0300"},{"content":"Having previously read the reviews on TripAdvisor, I felt quite confident on booking this hotel, and I was not disappointed. We arrived following a long flight, and a sharp introduction to driving in San Francisco (don't!) - we had a simple and very friendly check-in and were straight up to our rooms (which as we had requested were close together). The location is fantastic.. a short walk to the main shopping area, and easy (right outside the hotel) cable car connections towards Fishermans Wharf. The rooms were recently refurbished, and nicely decorated. Excellent walk-in closet, the bathroom was a little small - but thats hardly a problem! I thought it was great that you could plug your MP3 player into the radio, so that you could listen to your own music. And the nice touch of a pot of sweets was lovely! Coffee/Tea were provided in the hotel lobby free-of-charge so you could just help yourself whenever you fancied one - again a nice touch. Off-site parking is available on Sutter Street (quicker to walk to than drive to!) but none-the-less ideally placed. They also do valet parking there if thats your preference. The only downside really was that there was no AC, and the rooms can get a little warm. Yes, you can open the window, but it does get quite noisy with the cable cars... however after the first night I found I could get used the cable car bells, however the emergency services are not quite so quiet!!! Loved the little bar in the hotel.. only thing it closed at 9.30pm every night we were there... thats pretty early. I believe Friday & Saturday nights it is open later. Drink selection is pretty good. Overall, we had a great stay, and we would certainly return to the Chancellor if we find ourselves back in San Francisco.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Rosendo Lesch","date":"2012-02-14 22:08:19 +0300"},{"content":"The Chancellor Hotel comes highly recommended. The staff were friendly and approachable. The location can't be beaten- close to train, tram, bus and of course the cable car. The room was very similar to that on their website. It was clean, comfortable and quiet considering the location. It made an excellent base for exploring SF. Would definitely use again if lucky enough to return to SF.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Ida Davis","date":"2014-06-19 18:51:31 +0300"}],"public_likes":["Sonya Schmitt","Harmony Greenholt","Dr. Eli Dietrich"],"vacancy":false,"description":"This hotel has 96 well decorated rooms in the heart of downtown. All rooms have 300 thread count sheets, high definition TVs, complimentary breakfast, and free wi-fi.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}