{"title":"San Diego/Mission Beach-Pacific Beach","name":"Banana Bungalow","address":"707 Reed Avenue","directions":null,"phone":"+1 858 273-3060","tollfree":null,"email":null,"fax":null,"url":"http://www.bananabungalowsandiego.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.79232,"lon":-117.25538,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25239,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Stayed here for 3 nights to visit my son. Prior to coming I made my reservation for a spa/reserv. Great deal but no one knew what that meant. I called 3 times to get details but to no avail nobody knew what it meant. Check in, the front desk person didn't know either. Went to the spa and picked the least expensive treatments, and no one at the spa knew what I could choose. Long story short, at check out they charged me for all the spa treatments. Stood there for 45min while they tried to figure out what to do. Doris, manager, rudely came to tell me she would take the charges but if I did something wrong I WILL be charged. I tried to explain all I did, she shook her hand at me and said I already heard the story I don't need to hear it again. Dismissed by the manager of this resort. Shocking. The girls at the spa were equally rude. I thought to myself did I do something wrong.... but I did everything I could with no direction from the hotel. Sad Sad Sad","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":4.0},"author":"Noemy Reichel","date":"2013-04-30 20:41:36 +0300"},{"content":"My husband and I went in September. I had not been to Arizona in 20 years. We stayed in the Ocatilla on the property and there was a conciere that was so warm welcoming and couldnt be more helpful. She seemed to understand what my husband and I wanted to do and what we wanted in a restaurant. We had such a fabulous trip because of her direction I returned 6 months later with my neice. She put together ahead of time our agenda and each day was better that the day prior. When you have someone that can tailor your trip ahead of time and be so bang on, it makes it. Thank you Carolyn White I will be returning because of you. Anne and Arch","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tevin Willms","date":"2012-05-25 20:14:11 +0300"},{"content":"We just stayed at the Biltmore for a special girls weekend trip. We had one of the older rooms in the Terrace building. The room was good size and very clean. The beds were comfortable and although it was old - nothing looked worn out. We took a look at the newer rooms and they are definitely in better shape. However, everything else was great about this resort. The grounds are stunning - the history of the place is fascinating - the food was good and overall, the staff were very attentive. We especially loved Victoria and Marie in the restaurant. They were the best wait staff people I have have seen in years! Both accomodating and friendly - yet never overbearing. I wish I could bring them along to every hotel which I visit. The front desk staff were not very friendly - but still accomodating. They should be more energetic and gregarious but that is so small in the scheme of things. We had the best package with daily meal vouchers and spa discounts. It was perfect. The thing about this resort is that it is old and historical. If you are looking for chic, posh and a spot for the fabulously nipped, tucked and star struck - you need to go elsewhere. The Biltmore is comfortable and kitchey - and that makes it a great place to go. I never felt under dressed or out classed like in many top resorts. I felt like I belonged there and that the hotel was thrilled to accomodate every request. The door staff - was great. The tour of the property had a wonderful guide. All in all a nice get-away!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Irma Schulist","date":"2014-03-01 01:21:08 +0300"},{"content":"The most beautiful grounds I have ever seen at resort. Unfortunately, the room was very tired, looking more like a tired Day’s Inn with furniture that had varnish that was pealing. I suppose it was still real wood, which would not be the case with a Day's Inn (in my experience), but you get the picture. We also were maybe in one of the few remaining rooms that needed to be renovated, but I heard complaints from other guests about the same thing. Still, I was not there for the room, and it was, but the way, bigger than any single room i have ever stayed at at any property. The resort has great pools, excellent dining, but a small work out facility (though packed with equipment). My kids were with us and did not want to leave.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Eva Jewess","date":"2014-11-22 02:15:36 +0300"}],"public_likes":["Dawn Borer","Benny Erdman","Kaleb Connelly","Mr. Maeve Funk","Bernadette Berge","Kole Barrows","Rubie Hudson"],"vacancy":false,"description":"A small chain of tropical-themed hostels.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}