{"title":"Los Angeles/Downtown","name":"Figueroa Hotel","address":"939 S Figueroa St","directions":null,"phone":"+1 213 627-8971","tollfree":"+1 800 421-9092","email":null,"fax":null,"url":"http://www.figueroahotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.045481,"lon":-118.26387,"accuracy":"ROOFTOP"},"type":"hotel","id":16635,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"The hotel looks like the picture which is a good thing, it's beautiful. Everything from the pool to suites to the dining area was well kept. The location of this hotel is really good. Everything is within walking distance. We enjoyed the conviences of Pueblo's supermarket which is a short walking distance away where we purchased some items to keep in the refrigerator. We ate at a very good restaurant called Don Jose's which is on the main street once you leave the hotel, delicious food. Each night, this hotel offered complimentary drinks, which is a very nice thing. The beach was literally 2 blocks in front of the hotel. If you like beach and R&R, you'll definately want to check out Isla Verde beach. The water was warm and the sand soft. My friend and I rented a beach chair for $4 for the day and stayed there for hours. Our only disappointment was the nightlife for singles...or let me add 35 and older singles:) There didn't seem to be much to offer in this area. Other than that I would recommend this hotel and location to visit San Juan.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Rey Cronin","date":"2012-12-12 03:24:33 +0300"},{"content":"First all before anything....the service I got from the employees was absolutely superb. The front desk clerk was extremely helpful. I had a ton of questions and she did not get annoyed or short with me. She was very helpful. The room was huge and very clean. The amenities in the bathroom was great. I wish they had flat screen tv's in the room, but a tube tv was fine. When I checked out I left my GPS in the room. So right after I checked out i went back upstairs to retrieve my GPS and the housekeeper had it ready for me wrapped up in a plastic bag. I was so impressed that she actually held it. I've stayed in rooms where housekeeping or someone or something has stolen my products. Much Much Kudos to Embassy Suites San Juan! (Also....it's a straight, literally straight shot to the beach. And a FREE very good and big breakfast. And FREE drinks and snacks at happy hour.) Perfecto!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Orion Feeney","date":"2015-12-28 18:24:05 +0300"},{"content":"Just returned from a trip to San Juan for a cruise. We stayed twice during this time at the Embassy Suites, San Juan. I will begin by saying the staff, front desk personnel,bartenders, waiters, buffet area servers, etc, are all very hard working dedicated people. They are courteous and go out of their way to make your stay to your liking. That being said, I must say that the room quality is becoming an issue. We stayed there last year and at that time I thought the rooms needed some upgrading. They are not lighted properly, very dim in front room area. The sofa sleepers on both of these trips were not worthy to be slept on. We had another couple with us and they said they were just horrible as far as comfort. Also they need to get the latest flat screen TV's. The ones they have are ancient. The rooms just look worn out and need some new decor and brightness.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Frida Lebsack","date":"2012-11-01 14:44:02 +0300"},{"content":"We came to Puerto Rico for a friend's wedding. The bride had chosen this hotel for all the guests from the states to stay in. Very smart bride! This hotel was convenient to the airport and lovely Isla Verde beach. Lots of restaurants & a grocery store nearby. The hotel itself has a nice parking garage for your rental car. The desk staff, bar tenders & gift shop girls speak english. The free breakfast is outstanding! The pool is way above average! We never encountered any problems of any kind and would recommend this hotel to any body, especially first-time Puerto Rico visitors.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Irving McDermott","date":"2012-11-11 16:52:34 +0300"},{"content":"My wife and I stayed here for part of our honeymoon. The rooms are large, clean and perfect for relaxing. The cooked to order breakfast was always good and the free 2 hour happy hour was very nice as well. The hotel is clean and in a great location. Less then a 3 min walk to a perfect beach. The hotel pool is fantastic and the staff go out of their way to help you out. You are also close to Old town San Juan, about 10 min by taxi. Also close by there is a Ritz, El San Juan hotel and and intercontinental. All three are great if you want to get dressed up and go for a great meal, diner and dancing, all with great casinos. This hotel is great value for money. I would not stay anywhere else.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Alanis Will","date":"2012-02-01 22:54:54 +0300"},{"content":"We just came home from a long weekend to Puerto Rico. We picked the Embassy Suites because of the short distance from the airport. The hotel was clean and neat and the extra room in the suite was great! The beach is a 2 minute walk from the hotel which we didn't mind at all. We stayed all day - the water was beautiful. The hotel is also walking distance from nice restaurants so we didn't feel like we needed a car during our short stay.","ratings":{"Service":3.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Price Schaden","date":"2015-02-26 08:10:40 +0300"},{"content":"Hubby, myself and another couple stayed here from Oct 3 - Oct 8. The rooms were very nice - suites- with a separate living room area. Very confortable beds, roomy bathroom and accomodating service. The pool area was enjoyable, free internet access, nice bar / lounge area and the lobby was tropical with an open atrium & lots of foliage. Free full breakfast available, including ready to order omelettes / eggs, bacon, sausage, potatoes, bagels, toast, cereals, oatmeal / farina, coffee, juices, etc, etc. More than enough to start the day. Free evening reception which amounted to free drinks for guests from 5:30pm - 7pm. Two blocks walking distance from the beach and other restaurants & hotels. We enjoy walking and after a full dinner, welcomed the opportunity to stroll along Isla Verde Blvd to visit other hotels. We went to two local restaurants: Barrachina & Mi Casita. Both were within walking distance and very flavorful - check them out! Also, we asked them for a recommendation for a local bakery. They gave us directions to Espana Bakery on Calle Marginal Villamar. This bakery is awesome! Only 5 minute drive from the hotel and they had everything from pastries to sandwiches to quiches to hot meals and even liquor. Delicious! We went there the day we were leaving and picked up sandwiches to eat on the airplane. The other passengers were jealous! Down sides - they do not have an airport shuttle. The front desk said that they are not allowed to have it??? Small casino - okay for a novice, but not sure if real players would be satisfied. Daily parking fee for guests ($10 / day). You would think they wouldn't charge guests for parking. An added hotel fee of 9% (or something like that). They attribute this to providing free internet access, free local phone service and other services. Just be aware of this. Not sure if other hotels have started charging the same \"fee\", but the Embassy does. Regardless, we got a great package deal through Orbitz. Over all, service was great. We enjoyed it, and would stay there again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"August Doyle","date":"2015-10-04 02:29:51 +0300"},{"content":"loved the embasyy nick staten island my wife and i stayed ath the embassy after our cruise may 5th-may 7th the hotel is great. the staff is very accomodatng the grounds are beautiful. it is only 2 short blocks to the beach. they have a wonderful free breakfast every morning. at night from 5.30-7.30 pm a managers cocktail party in the lobby. we really enjoyed our stay and will be returning.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Cyril Herzog","date":"2012-11-30 05:45:44 +0300"},{"content":"The staff really needs to be reconsidered. While I was staying at the Embassy Suites, I had all sort of trouble and they either kept me ignored or came up with a temporary solution until I left. That is not the way to treat a guest.","ratings":{"Service":1.0,"Cleanliness":2.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":3.0},"author":"Alexandrea Lynch","date":"2014-09-02 19:02:35 +0300"}],"public_likes":["Rodolfo Larson","Nico Morar IV","Gia Jacobson","Hilton Christiansen","Earlene Larson","Felipa Jaskolski","Adela Dietrich","Jordane Johnson MD","Mr. Shawn Gibson"],"vacancy":true,"description":"For those looking for something unusual, Figueroa Hotel provides Moroccan styled luxury. Mystic and beautiful, this is where Cirque Du Soleil hosted their premiere party of Varekai.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}