{"title":"Beverly Hills","name":"The Crescent Beverly Hills","address":"403 N. Crescent Blvd","directions":null,"phone":"+1-310-247-0505","tollfree":null,"email":null,"fax":null,"url":"http://www.crescentbh.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.071182,"lon":-118.400346,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3424,"country":"United States","city":"Beverly Hills","state":"California","reviews":[{"content":"My family stayed in two rooms at the Hyatt over the weekend. Got a AAA rate of $186 per room on Hyatt.com several weeks in advance, but checked back a week later and saw the rate had dropped to $140, so cancelled the first reservation and reserved the improved rate. Also online found a code for free breakfast and used that in the reservation, so it pays to check the hotel's website! Had checked other reviews here and knew what to do: use the self park rather than more expensive valet, and carry your own bags to avoid the wait. As others noted, you have to use two elevators to get from street to room, but no big deal. The street outside is ugly and has run-down buildings for sure, but did not in any way feel unsafe to me. Two blocks from downtown crossing shopping, two blocks from the Boston common, right next to chinatown, so we actually thought it was a good location for getting around. Inside, the hotel was great looking, room was large for a city hotel, service was all good, and the buffet breakfast was awesome, especially if you can get it free! We also used the pool every day, and the kids loved it! For the price we paid I thought it was great value and I would definitely come back.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Chauncey Renner","date":"2015-09-06 21:45:05 +0300"},{"content":"A friend and I stayed here St Pat's weekend 3/17 to 3/19.We got a steal at $99.00 a night ( thru Hotels.com). the rooms were very nice, fairly spacious, clean and the beds were comfortable. friday night was st Pats and we saw plenty of revelers and when some came back to our floor we could hear them shouting in the hallway( but I am not sure walls made of steel would have dampened the noise and it wasn't for long) Loved the big bathroom vanity ( 2 women and our assorted necessities can take a lot of room) We were given a voucher for one free breakfast both days in the hotel dining room. Why only one, we don't know, but when it came time to get the bill for breakfast we were charged $21.00 for the buffet. Apparently that's what they charge per person. Now I am not cheap, but given what was offered in the buffet, we thought the price was exorbitant. No carving or omelet station or anything like that. Otherwise the staff was friendly and helpful, the rooms were nice, just don't eat at the buffet, they have a regular breakfast menu.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Miss Kaylie Ondricka","date":"2015-01-03 04:41:44 +0300"},{"content":"Stayed here just one night on a weekend on a business trip. The hotel interior was very nice and the staff friendly and helpful. Our room wasn't ready at check-in at 5:00 PM, but they gave us a complimentary drink and appetizer and called on the cell phone when the room was ready a short time later. What was disappointing was the exterior and the area around it. To get to the street was circuitous and then you had to go back upstairs (carrying wheeled luggage), so awkward on checking out and meeting my car service. The area around it was fairly seedy and dark on a street way off the mainstream, so a bit uncomfortable at night. The weakness of the staff is that they weren't particularly helpful in providing advice about nearby restaurants, so didn't travel too far in the dark. The next morning, discovered nice restaurants nearby and that we were only a few blocks away from Boston Commons and the theater district. Who would have known.","ratings":{"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Service":4.0,"Rooms":4.0},"author":"Frederik Von","date":"2014-03-27 20:39:33 +0300"},{"content":"This hotel was definitely very nice, clean, and very cosy. The hotel staff is very curteous, the common areas are very clean, and it's situated in a fairly central location. The highlight of the experience was the bed: it's the plushest bed I have ever slept in. With four very large down pillows, and a down pad under you while you sleep, it's heavenly. Most rooms have a nice chair and ottomon that you can enjoy as well. The desk (for travelling executives) is large and the bathroom is of ample size. In sum, it's a classy, clean, and comfortable, yet slightly expensive hotel.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Service":4.0,"Rooms":4.0},"author":"Brandt Hyatt","date":"2015-12-23 00:34:33 +0300"},{"content":"Would not recommend if you're paying non Priceline/Hotwire rates and you get stuck on the a low floor like the 6th floor where they're doing renovation work. (We checked in late and checked out earlier so we weren't terribly bothered by the noise) The rooms are nice. What you would expect from a Hyatt. The staff was friendly and willingly to help. If you want a nice comfortable clean place to sleep and you're not going to spend a lot of time at the hotel, i recommend the hyatt. the rates (probably because of the renovation work) are reasonable for good location.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Mrs. Pearlie Sawayn","date":"2015-07-10 14:03:32 +0300"},{"content":"Spent New Year's weekend in this Hyatt pretender. Read on, agh! No rooms renovated, ignore the blurb on the web site. Toilet paper not replenished, ditto kleenex. Tacky dispensers for shower soap, conditioner and shampoo hanging on tub wall and next to sink. Trying to find this one is a real pain with the one way streets and lack of sign- age. I've been coming to Boston for over 30 years! Restaurant staff very nice despite \"Beavis and Butthead\" pair abusing each other and the waiter. Front desk crew like programmed robots. Bellhop service surly and slow. No doorman and had to walk over the the Ritz Boston Common two blocks away!to find a cab! On and on and on! Who's in charge here. In short, four star rates, no star service. Room made up at 5pm on \"New Year's Day\" with a lot of rooms empty. If Paul Revere had stayed here he'd have left for Lexington and Concord at lot sooner. Even the elevators have a mind of their own! Don't even ask about the state of the bathtub! That's enough! Bottom line? Don't even think about it!","ratings":{"Overall":1.0},"author":"Nolan Halvorson","date":"2013-08-29 17:47:14 +0300"}],"public_likes":["Dr. Vivian Donnelly","Ila Hansen","Reece Leannon","Donavon Kunde","Myles Cruickshank","Issac Klocko","Wade Klocko"],"vacancy":false,"description":"A modern hotel originally built for silent film stars in 1926. Has a trendy on-site restaurant.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}