{"title":"London/Holborn-Clerkenwell","name":"MiNC Eagle Court","address":"Eagle Court, 10-11 Britton St, EC1M 5QD","directions":"tube: Farringdon","phone":"+44 20 7397-1325","tollfree":null,"email":"sales@mincapartments.com","fax":null,"url":"http://www.mincapartments.com/london/eaglecourt_apartments/details.php","checkin":null,"checkout":null,"price":"From £99","geo":{"lat":51.5207,"lon":-0.103,"accuracy":"APPROXIMATE"},"type":"hotel","id":16237,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"A Wonderful Experience This was our second visit to this hotel and second RIU property. It is excellent. Do keep in mind it is a European hotel. The food is wonderful, but not North American. Excellent breads and wonderful variety of foods. Do not expect large cuts of juicy beef. Deserts are more European and not typical North American fare. Wonderful beach. Attentive staff. Do tip; this is a poor country. Know basic Spanish words as English is far down the list. RIU is a Spanish Hotel chain owned by TUI - which is a large  diverse German company (their website is an eye-opener: they own over 100 aircraft and nearly 200 ships). You will need to bring an electrical adapter if you intend to use any three-prong plug. The recessed outlets accept only two prongs. Adapters are available at the desk. We look forward to another visit.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Thurman Wisoky","date":"2014-03-16 07:23:50 +0300"},{"content":"Enjoyable return trip but the Macao is begining to fade. We have just returned from our one week return trip to the RIU Palace Macao. After numerous visits to this resort we feel that we need to write a detailed review of our most recent experience at the Macao now in the shadows of the new RIU Palace Punta Cana.About us: We are a couple that has traveled extensively over the past 14 years in the Caribbean 2 or 3 times each year. Without a doubt we are true sun and ocean worshippers who seek out incredible beaches with powder white sand and clear Caribbean blue waters. Furthermore we enjoy personalized service, comfortable and well appointed accommodations. My partner being a private retreat chef here in Ontario, we also seek, good quality food that is presented with elegance and artful mastery. After visits to numerous islands and tropical locals we discovered Punta Cana 6 years ago and now view it as our home in paradise. In Punta Cana we have traveled numerous times to the RIU Palace Macao, once to the RIU Bambu and to the Bahia Principe Club Diamond.Planning and Booking: Our trip was planned using the very knowledgeable and professional guidance of Robyn at Itravel2000.com. Through her guidance and efforts we were able to find the best pricing and leaving at a date and time that were accommodating to our pocketbook and schedule. She answered our numerous emails promptly and with concise and accurate information. Who ever said that you did not get personalized treatment with an online travel company has never dealt with Robyn, who we will continue to book our trips with.Departure and Flight with Skyservice: We arrived at the airport within the three hour recommended timeframe and we were able to secure exit seats. I highly recommend attempting to secure these seats when you arrive at the airport (you can not pre-book these seats) as all others are completely unbearable. Our luggage was weighed and we were under weight, so no charge. Be warned baggage over is charged $10 per kilo.The flight was rather uneventful but made entertaining by the bumbling dialogue made by the head Skyservice flight attendant who stumbled through every announcement that she read. The flight was made further entertaining by the in-flight movie, not because the movie was entertaining, but rather by the further bumbling errors of the same flight attendant who first started the film then 1/5 of the way through after making an error with the sound system for one side the plane, restarted the film, then made an announcement 1/5 of the way through the movie and could not get the movie restarted so she went back to the beginning. Well if we missed anything in the beginning of the movie, we definitely caught it by the third time we saw it! The in-flight snack was a chicken quesadilla and other little packages of snacks such as cheese and crackers. All of this passes the time and tries to take your mind off the fact that you are cramped and uncomfortable and that most of the way you have someone鈥檚 elbow shoved into your side 鈥?and that is in an exit seat where you have the luxury of a little more room.Arrival at the Dominican Airport: As you walk off the airplane the warmth of the Caribbean night air kisses your face and you know that all of the discomfort on the airplane was definitely worth it. You exit the aircraft and walk towards the airport that is an open air thatched roof building. Get ready to smile as you enter the terminal there are two young ladies there to greet you in traditional Dominican garb who you will have your picture taken with as you pass through the entrance. These photos will be available for sale for $5 US when you leave the island a week or two later. The process to enter the island is smooth, have your passport, and blue Dominican tourist ready and wait in line to have them processed. As you wait you will be soothed by the mariachi musicians playing and the warmth of the Caribbean air. The line moves quickly. Once you have completed this process you collect your luggage and head out into the main lobby of the airport, where you will find a Sunquest rep who will point you towards the Sunquest bus which will take you to your resort. At the bus you will sign in and be given an orientation meeting invitation. At this point sit back on the air-conditioned bus and enjoy the scenery out the window and listen to the Caribbean music played. Arrival at The RIU Palace Macao: Arriving at night the week prior to Christmas we found that the palm trees that line the entranceway to the Macao a glow in hundreds of Christmas lights. The bus arrives and the luggage is taken off (make sure that your bag is taken off as the bus will likely stop at one or more other RIU properties). At reception you are given your tan wristbands, room key, safe key, towel card, and restaurant card along with luggage tags. Reception is warm, welcoming and informative and fluently delivered in English. A attentive bellhop quickly loads your luggage onto a brass luggage cart and shortly delivers your luggage to your room. The Room: We were very impressed with our third floor garden view room. We were pleasantly surprised to find we were given a corner room with three sliding balcony doors and wrap around balcony that forms into a large hexagon appointed with plantation style wooden rockers, cocktail table and drying rack. The room is appointed with two overstuffed comfortable wing chairs, small bistro table, two night stands, a large credenza that houses the mini bar, large closet that comes with approximately 10 hangers, iron and ironing board. The bathroom comes with tub/shower combination, bidet, well lit mirror, single sink and shaving mirror. The room and bathroom are outfitted with some limited toiletries (bottle of RIU shampoo/body wash, bar of RIU soap and shower cap.) You will also find a bar wall unit that houses several bottles of liquors including gin, rum gin and tequila I believe. The bar fridge has pop (Pepsi, diet Pepsi, 7Up orange soda, tonic and a large jug of water. You will also find two bottles of Bohemian Beer. Room Service: There is also a room service option for breakfast to 11:00 am and then a snack service including such items as a vegetarian sandwich, a BLT sandwich, Caesar with chicken, nachos and cheese to highlight a few.Orientation: Depending on whether you arrive in the morning or evening the orientation meeting will be held either on the day of arrival or the next morning. We always attend, but this time we wish we had not, the meeting started 20 minutes late and then all that we were told is where to find the Sunquest book that would list our departure time. Other than that the presenter struggled to explain the tours available. That was it! There was no information about the resort or the services provided.Late Night Snacks As we arrived at the resort at 11:00pm the late night snack bar was the only food option. It is located beside the pool. Here you will find a small salad bar and a small buffet serving fried chicken, fries, pizza, hamburgers, hot dogs and beans with rice. Once you are seated a waiter will come along taking drink orders. After two glasses of red wine were informed that they hand run out. Strange, we thought but decided it was because it was late at night and the waiter was on by himself he was unable to go to the main bar to get more. More on this later鈥? Piano Bar: Located next to the lobby across from the main buffet restaurant is the 24hour bar. This room definitely has a plantation feel to it, with dark, wide seated wicker chairs arranged in groupings of four around low cocktail tables. Here you can have drinks into the wee hours of the morning along with wonderful cappuccinos. Each evening you will find a variety of wonderful singers and piano players to entertain you. The last session ends around the time that the Pacha Disco opens (I believe that is 11:30). This is usually a wonderful room to sit back in and relax after spending many hours lounging in the sun.The Showroom: You enter the show room via the piano bar through huge heavy velvet drapes. The art deco d茅cor continues and gives the illusion of entering the showroom of a vintage cruise ship. Most shows are entertaining to watch as you sip an evening cocktail that has been delivered to your table by one of the waiters. The Michael Jackson show (even if you are not a huge fan) should not be missed as well the Cabaret show was extremely well done.The Main Buffet Dining room: The d茅cor here is definitely elegant and continues that art deco feel. During the evening you will find waiters and waitresses dressed in tuxedo shirts, vests, bowties and pants. At lunch the waiters are now dressed in colorful Caribbean flowered shirts and dark pants. Kabuki: The Japanese Restaurant is one of four a la carte restaurants for Macao guest to use. You are presented with a lovely plate of sushi and a menu. Next you are given a choice of several starters, entrees and dessert. We thoroughly enjoyed the Dominican version of sushi, then tempura, a wonderful shrimp stir-fry and then we were brought a tempura ice-cream and fruit to share. The food we found here to be very enjoyable but better than the food was the attentive waiter鈥?he made the evening very relaxing and enjoyable.The food: There is a wide variety of food served at several buffet stations. During the evening there is always a carving station that always has something delectable. The roast duck and pork were quite memorable. At the main buffet area you will find a fish, beef and chicken entr茅e at all three sittings as well as a variety of pastas and other vegetables and starches. There is always an abundance of cheeses and crackers at the cheese buffet, decadent desserts and a wide variety of fresh fruits Even the fussiest eater should be able to find something they find enjoyable. For those that are worried there is always French fries, rice, plain pasta and pizza!Pool and Pool Service: The pool is beautiful with elegant statues and fountains and is wonderful for cooling off in after basking in the sun. While floating in the pool or lounging in the sun, drink service is provided. The service of Jose was very notably attentive and professional. There is an abundance of loungers and a ready supply of fresh towels.The Beach: Breathtaking and endless. The sand is snow white and soft that extends into the ocean. The ocean bottom is clear and soft without being so soft that it feels muddy. There are lots of sun loungers available. People scope out there spots and do place there towels on the loungers and belongings but this is not a problem. As I have stated there are more than enough loungers and the resort was filled to capacity. Furthermore, your belongs are safe on chairs, though I don鈥檛 recommend tempting individuals by leaving cameras on your chair while you go to lunch for an hour but while swimming this would not be an issue. We also left our books and shoes along with our towels beach bag and a couple of $US for tipping wait staff all day and had no problems. I guess the rule of thumb is don鈥檛 leave anything on your chair that if it was taken your trip would ruined by. Departure: The bus picks you up at the resort about three hours earlier than departure and it escorts to the airport and gets you into the correct line. Be sure that your luggage is placed on the bus at the resort before you get on the bus. On our trip home one individual failed to ensure their bag was on the bus and had to leave the country without their belongs which would be sent to them at a later date.Skyservice: The scale mystery. As mentioned earlier, on the way down our bags weighed under the limit. They were loaded with sunscreen, health care products and gifts. All of these things were left on the island. We did not purchase anything and presto our bags were over weight???? First we were 7 kilos over then we were 5 kilos and finally we were 4 kilos over when weighed by the supervisor. First how did the weight keep changing??? The reason explained that our weight went up on our return was that our bathing suits were wet and maybe sand???? 4 kilos added due to 2 wet suits and sand? Something is not right. We are presently in contact with Skyservice.The flight home was miserable. We were not able to get aisle seats and we were crammed into the regular seats. We are average build men, one being 5鈥? and myself 5鈥?1. My knees were shoved into the back of the airplane seat in front of me so badly that I had to remove the aircraft magazines for a little extra room. Impressions of the Macao from someone who has been numerous times before: Seeing the Macao is like visiting a great movie starlet from an era gone by who鈥檚 makeup is starting to crack. If this is your first visit you will be very happy however, if you are a returning visitor you can鈥檛 ignore that nagging feeling that things are not as grand as they use to be. -Management has changed since we were there last and we are not sure if that is a reflection of changing standards.This was another birthday trip and there was not any recognition made by the staff what so ever 鈥?even at the Bambu my partner was presented with a cake and the room was decorated with balloons and a small painting and bottle of room were left as a present. This was disappointing and totally out of character, especially after numerous emails were sent to R Miller in customer service. Furthermore, when checking in the date was left with the front desk. -The selection of food was good but not as extensive nor varied. The Gala Night fizzled in comparison to other Gala鈥檚.-Previously, in the evening you were given one waiter who you became familiar with and who know your likes and dislikes, red dry wine not chilled for example. It was all part of that small intimate resort service that made the Macao stand out. This was not the case on this trip we had a parade of evening waiters and at times you were not even sure who your waiter was. Breakfast service was lacking as well, quite often your dirty dishes were left sitting on your table. These are all areas that the Macao use to pride themselves with 鈥攐utstanding Palace service.-The wine, one of the reasons we did not like the Bambu is the terrible wine that they served. The Palace always recieved a better quality wine than the other RIUs. Well the standard at the Macao has dropped to the same standard if not lower. They have also started to chill the wine to try and mask that it is starting to turn to vinegar. It seems on our first night we received the last two glasses of good red wine. Furthermore, at lunch sometimes your drink order was taken and never was filled.-The shows while entertaining are not of the same quality as in previous years. -The toiletries are not of the same standard and not replenished. Furthermore, sometimes you were given fresh towels in the evening and sometimes you were not. -When we arrived at the Macao we were told that we had exchange privileges with all RIUs but the new palace. We were assured that the Macao and the Palace Punta Cana were of the same status but the palaces remained exclusive. So we thought that made sense both Palaces had no exchange privileges with each other. This was not the case, the new RIU Palace Punta Cana have privileges at all resorts including the Macao. Here is the problem with that during our visit. The Palace Punta Cana had been invaded by a group of about 20 drunken mid twenty year olds who were heavy partiers and neither palace was set up for that BUT the Macao鈥檚 piano bar and casino were right beside their intimate piano bar. This group invaded the piano bar to get their buzz and every time they wanted a drink because the Macao would give them plastic drinking cups filled with alcohol that could be taken to the disco with them this became their evening hangout. It really did destroy the atmosphere. Management was completely aware of the issue of these individuals who even had the gall to go behind the bar to try and pour their own drinks if the bartender was serving someone else. The final straw was as they announced on their last evening that they were going to make themselves our (Macao guests) worst nightmare. I have to say that this did not happen in the previous years at the Macao not because out of hand partiers did not arrive at the Macao but because the management boldly put a stop to it.-The last straw, cockroaches, never had we encountered them at the Macao but we encountered one in our room and one in the dining room. This is just not acceptable for a RIU Palace. Yeas we only saw two but for us that was two too many.It is unfortunate that the Macao is allowing itself to fall this way. We loved the Macao and recommended it to many of our friends and family. My teaching partner was prepared to get married there but is now opting for the Palace Punta Cana instead. We loved the Macao鈥檚 art deco d茅cor, the small intimate setting and the service that could not be surpassed at any other Punta Cana resort. We had planned to return to the Macao in July with family and then for 2 weeks the following March but have decided against that. Instead we are planning to return to the RIU but this time we intend to stay at the new RIU Palace Punta Cana in our opinion it is worth the few hundred dollars more. We are wondering when they will drop the Palace name from the Macao. If you are booked at the Macao you will have a lovely time and be quite happy with the service and the quality of the food, as long as you have not attended another RIU Palace because this is no longer be presented by management as the Palace it use to be.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Nathan Lubowitz","date":"2012-07-11 08:25:34 +0300"},{"content":"Excellent Vacation and Value My husband and I just returned from the Riu Palace Oct. 16-20, 2006, (punta cana), I must say...we really had a ball. I've read some of the neg reviews about it...but I beg to differ!The shows were nice, some better than others but worth while, it all depends what you're in to. I have a broad mind and am therefore open to new and interesting entertainment, so I must say I really did enjoy the nightlife. I also read what someone wrote about the Casino... In part I agree that the Slots in the Sports Bar are not designed to WIN, in fact I spoke with most people to get there experience and feel for it...No one won a jackpot, or even coins worth cashing in. However, I took the Shuttle on two seperate nights to the casino at Macao and I must tell you I hit the first night on the slots for $75 bucks ($20 investment) and the forth night of my stay I hit for $275 bucks. Oh, and did I mention, I never take more than $25 dollars along to a casino...I'm a cheap skate. The beds were very hard...I like firm but not cardboard!! I'm keeping it real with ya. The housekeeper had to bring in a second storage blanket to place under the sheets. But all in all, it became tolerable. The grounds are kept and very well manicured. I didn't see one Gepco...and I can't begin to tell you my relief as I've stayed at other Punta Cana properties, and my husband thought that I'd come down with a nervous condition...because I became agitated and kept jumpting everytime I'd seen one in the past.The food was great. However, after a couple of days of the same food cooked a different way...can make you tired fast. We did make reservations for two of the specialty restaurants.. (Brazilian and Japanese). The down side is that you have to make reservations between 10am-1pm...if you partied like heck the night before... sometimes can be very discouraging. Don Manuels was fine with me, it was my husband who had a taste for venturing. I did enjoy the Brazilian Restaurant, but the Japanese one left a little to be desired. Not a great menu selection.I love it so much there, that I am going back for my anniversary in March.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Burdette Emmerich","date":"2014-07-12 20:04:11 +0300"},{"content":"WOW!! We stayed at the Palace for just 2 wonderful nights but had a fantastic experience!! First things first: Check in was quick and easy and we received welcome drinks (virgin). Our suite was elegant and had a jacuzzi. The bar and refrigerator was well stocked. The air-conditioning worked extremely well and was easy to adjust when necessary! The pool at the Palace is perfect for the couple or person seeking tranquility, on the other hand if a little action is what you're seeking, check out the pool at the nearby Bambu Riu!! In terms of the beach area, one has not seen a more beautiful beach until you've experienced the beach here! The food was great in the two restaurants we ate at. Overall, the service was wonderful and I must commend the assistant director, I believe his name was Roberto for being so attentive and professional!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Buford Schinner DVM","date":"2015-05-09 01:17:32 +0300"},{"content":"A perfect vacation Unlike many of the reviews I read on this page, I have absolutely nothing to complain about regarding my stay at Riu Palace Macao. The hotel is beautiful with wonderfully maintained grounds that include plenty of tropical foliage. Interestingly, the grounds provide many of the niceties you'll exeperience during your stay. The flowers in your room and the coconuts they serve by the pool are all harvested right from the property. The rooms are very nice and offers small balconies (we got lucky with a corner room that afforded a large balcony). The mini-bar and perpetually re-stocked fridge are a definite plus.The beach is gorgeous. There was a constant breeze that was just enough to keep you cool. For those that want to avoid the sun, there is a large palm grove that has plenty of loungers. Both the beach and the grove are very close to the beach bar which is a great place to meet people from all over the world. There are plenty of activities (volleyball, aerobics, dance lessons) right on the beach and you can also use the hotel's kayaks, snorkeling equipment, and paddle boats for free. The excursions (many of them) are exceptionally reasonable and range from quick parasailing rides to all-day boat trips. The food was also very good. We often opted for the buffets over scheduled dinners mainly because we wanted the flexibility instead of having a reservation. The Riu's best asset, however, is the staff. They are a wonderful lot of extremely friendly and helpful people. They were very engaging and always offered an easy smile and a warm Hola. Speaking just a bit of Spanish is a help but we encountered no one that had trouble getting by even if they spoke no Spanish at all. If we had any requests at all they were attended to quickly and with great customer service. Overall, a great time. Nothing but great memories. Planning a return trip in October...can't wait!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Mae Frami","date":"2015-07-01 20:28:46 +0300"},{"content":"RIU equals Paradise Macao Having been to RIU resorts before We somewhat knew what to expect. I was slightly troubled by some of the reviews I was reading about the resort. I am happy to say that the ONLY negative I found was that the resort was in bed by 10pm. Other than that Everything was perfect. The service at the front desk to the waiters and waitresses at the bars. The only waiting was just before dinner hours. The beach was incredible, resort was clean and beautiful, the food outside the special restaraunts was better. This place has hooked us on Punta Cana and we will return to Riu again with more friends next time.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Adella Fay","date":"2015-08-24 06:43:12 +0300"}],"public_likes":["Dr. Estel Ortiz","Deion Boehm","Garland Hand","Ms. Sigmund Roberts","Savanna Romaguera","Enola Rolfson","Brennan Klocko","Eldon Mayer"],"vacancy":true,"description":"Studio, one and two bedroom service apartments. Very modern and nicely appointed.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}