{"title":"Moss Beach","name":"Seal Cove Inn","address":"221 Cypress Ave","directions":null,"phone":"+1-650-728-4114","tollfree":"+1-800-995-9987","email":"info@sealcoveinn.com","fax":null,"url":"http://www.sealcoveinn.com/","checkin":"3PM","checkout":"12PM","price":"$200+","geo":{"lat":37.52137,"lon":-122.51264,"accuracy":"APPROXIMATE"},"type":"hotel","id":38036,"country":"United States","city":"Moss Beach","state":"California","reviews":[{"content":"It was fairly simple - while booking online through Starwood's site for a room the night before Halloween to have a \"staycation\", I requested a room on a higher floor for better views of downtown Seattle. We had been stressed out a bit and were looking forward to feeling as much like we were getting away as possible while staying close to other responsibilities. So I booked a \"Spectacular\" room, and when we checked in, was pleasantly surprised that the hotel had not only read the request, but had already booked us on the top floor of the hotel facing the side with the best views of downtown. No need for us to even ask at the desk. Granted, this wasn't a weeknight where the availability might be less, but it created a better experience right off the bat for us. Now if only they wouldn't insist we supply a refundable deposit on an umbrella that clearly came from a lost-and-found when it was pouring outside. A W-branded umbrella, sure, but a Sahalee Country Club umbrella? Come on! One negative - paying a $4 \"delivery service\" charge AND a 22% F&B charge (presumably for delivery also) on top of $6 for a cup of room-service coffee. I say this somewhat in jest, of course, because overall we were very pleased.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Marianne Herzog","date":"2014-08-08 16:51:40 +0300"},{"content":"The hotel is very good, perhaps not as huber cool as some of the newer W hotels. It is nonetheless very nice, the room is large, with a nice bathroom. Service is good and I found it exceptional good value for money. However I booked it though an expedia package. I would stay again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Amy Barton","date":"2015-03-20 12:31:35 +0300"},{"content":"My family and I are just back from a wonderful 2 night stay at this hotel and we had a fantastic time, so much so i am posting my first ever internet message. W you not only spoiled us above and beyond inadvertently you have moved me into the 21st century as well . The staff are very helpfull especially Brian Bunich who could not do enough for us . Working mums have a hard enough time so seeing my wife being spoiled in the very chic surrounds of the W made our short break all the more special . Guys you get it right keep up the good work , thanks so much we will be back i can assure you , Working Mums go on treat your self's you deserve it .","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lorna Orn","date":"2012-11-11 13:04:28 +0300"},{"content":"Stayed here 1 night for business. Typical, hip W hotel vibe in lobby and in rooms. As a Starwood Platinum member, I was upgraded to a suite which had a huge living room area and large jacuzzi tub in the bathtub among other extras. Always nice when a hotel goes the extra mile for loyal guests! Location is great for downtown business trips. Would recommend this place for a young couple or group of friends, but not necessarily families.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Althea Gutkowski","date":"2015-05-29 16:54:31 +0300"}],"public_likes":["Dr. Mylene Schoen","Dagmar Terry","Tremaine Lind","Karson Prohaska"],"vacancy":true,"description":"Located a few hundred feet from the ocean (but without ocean views), and surrounded by gardens and a eucalyptus grove, this European-styled inn has just ten rooms, each equipped with fireplace.  It's on the pricey side, although if same-day or next-day days may be available to those who call.  In addition to the impressive grounds, a gourmet breakfast is included (prix fixe menu includes items such as homemade scones and poached eggs), there is a daily wine reception, and the comfortable lobby offers a fireplace and view of the grounds.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}