{"title":"Puy l'Eveque","name":"Maison Delmas","address":"rue du Docteur Rouma","directions":null,"phone":"+33 5 65 23 31 75","tollfree":null,"email":null,"fax":null,"url":"http://www.maisondelmas.co.uk","checkin":"3.30PM","checkout":"10.30AM","price":"55 Euro +","geo":{"lat":44.502338,"lon":1.137771,"accuracy":"APPROXIMATE"},"type":"hotel","id":23387,"country":"France","city":"Puy-l'Évêque","state":"Midi-Pyrénées","reviews":[{"content":"Casablanca rules We have just returned from a weekend in New York. We stayed at the Casablanca and were really impressed. The staff were amazingly helpful and friendly and made us feel really welcome. Room was a good size for a city hotel and was very clean. The bed was incredibly comfortable. The lounge with the buffet breakfast and cheese and wine was a great addition. Location was fab, just a few steps from Times Square, what more can i say! Overall would definitely recommend and certainly hope to go back.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Hillary Grimes","date":"2014-06-05 23:58:22 +0300"},{"content":"Loved the Casablanca Just back from a 5 night stay at the Casablanca. It was very clean and quiet even though our room was right next to the lift and the hotel is just around the corner from Times Square. The complementary buffet breakfast was good. I would recommend it to my friends.","ratings":{"Service":4.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Orion Mante","date":"2012-04-28 16:41:00 +0300"},{"content":"Friendly hotel in fantastic location My friend and I stayed at the Casablanca for 4 nights in June and were amazed at how close to Times Square this hotel was located. Literally a couple of steps around the corner and you are there! The added bonus was that our room overlooked an internal courtyard, which although did not give much of a view, meant that it was completely quiet at night time - even in the city that never sleeps. We had a slight problem with the plumbing in the bathroom, but this was rectified after a couple of dozes with the plunger! I recommend this hotel to anyone who likes to stay in a small hotel and who are looking for a friendly atmosphere in a central location.","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Margarette Herman","date":"2013-06-12 02:51:38 +0300"}],"public_likes":["Eldon McClure","Jack Rowe","Citlalli Bayer","Mckayla Boehm III","Adell Rodriguez"],"vacancy":false,"description":"Maison Delmas a Chambres d'Hotes and is in the village within easy walking distance of the ten restaurants in the village. It has four Bedrooms and a lovely garden overlooking the town for the guests to use.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}