{"title":"San Diego/La Jolla","name":"La Valencia","address":"1132 Prospect St","directions":null,"phone":"+1 858 454-0771","tollfree":null,"email":null,"fax":null,"url":"http://www.lavalencia.com","checkin":null,"checkout":null,"price":"$240-400","geo":{"lat":32.84856,"lon":-117.27373,"accuracy":"ROOFTOP"},"type":"hotel","id":25199,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"We were very happy with our choice of place to stay after the flight from Philadelphia. It was so easy to call from the airport for our shuttle, which arrived within a few minutes. The hotel is set back from the street and is offsite from the airport, although quite close. Dinner in the restaurant was excellent and very quiet that evening. On January 2nd we asked about getting a rental car to get up to the condo we had rented, and the shuttle driver recommended an off-airport rental agency to which he drove us after his airport run. Physically, the facility was very satisfactory. Wanted to get into the pool, which looked great, but we had to move on. Staff were all very pleasant. It was a great start to the New Year!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Magali Torphy","date":"2015-05-29 10:45:42 +0300"},{"content":"Being in a Doubletree suite felt homey with 2 television sets, a dining/office table, refrigerator and microwave. Upon checking in, we were given 2 warm Doubletree chocolate cookies. Yummy! Great snacking. We ordered a couple more with pizza one night, and bought more to take home with us. Staff was so nice and helpful. Being in a warm locale, the room we stayed in was accessed by an open walkway, not a corridor/hallway, which surrounded the pool below. Hotel makes it easy for guests to print air boarding passes through use of its computer with printer. Shuttle service was friendly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nettie Kassulke","date":"2015-07-16 08:31:07 +0300"},{"content":"We had a 7:00 am flight out so we chose doubletree and with Hilton rewards this property was even better value as we needed two rooms. My husband returned the car that evening so we wouldn't have to take thetime in the morning. The Free shuttle service that doubletree provides both to and from the airport and to a nearby restaurant are an added perk. Not to mention the warm chocolate chip cookies on arrival.We couldn't try the pool as it was closed for a sandstorm. The only problem I have is that the suites which are extremely comfortable and appear brand new are acessed from an exterior coutyard which yes might be pkeasNt in the winter in AZ bit when it is 105 out I found it not fun as Phoenix has high humidity unlike the other areas we visited in AZ . They also provide coffee,fruit,and muffins for early departures who are missing the breakfast sit down which was appreciated by all five in my family.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Althea Fahey","date":"2015-06-07 12:13:03 +0300"},{"content":"Unfortunately, i am spending a bit of time on crutches but have decided to enjoy a vacation. The first hint that this hotel believed in service started with the person who drove the airport shuttle. He told me that I could have access to a wheelchair at the hotel for as long as we were there and he was right. The person at the desk also believes in service. She found us a suite on the main floor and it was beautiful. We enjoyed the meal in the restaurant. We felt special from beginning to end.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Henriette Leuschke","date":"2015-07-17 10:22:11 +0300"},{"content":"I enjoyed the room and the excellent breakfast buffet, the check in was ok. However I went later to ask about South Mounat and the awarded winning female clerk sneered, giggle, and ultimatley got to her having a fear of heights. Never did get an answer.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Alta Padberg","date":"2015-03-26 03:27:05 +0300"},{"content":"Stayed here on business. Even during spring training season the hotel was quiet. Furnishing are nice, rooms are sparkling and roomy as you'd expect with an all-suite hotel. Staff is generally friendly, and the breakfast buffet is good. If you can get a deal, don't hesitate.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Alejandra Ferry I","date":"2014-06-04 15:12:12 +0300"},{"content":"We recently stayed at the Doubletree Guest Suites on 2 Friday nights as we arrived in Phoenix on our way to Sedona and as we were leaving Phoenix. As reported in earlier reviews, the suite layout is very similar to Embassy Suites... living area as one enters and the bedroom in the rear with the bathroom in the middle off a small hallway. The upholstery in the living room is very dated... dark and almost dingy looking. However, the beds were very comfortable with numerous feather pillows. Front desk staff is very friendly and greets all staff with warm chocolate chip cookies. However, the restaurant staff needs improvement. Although the free breakfast buffet is excellent, I was never acknowledged by wait staff to ask if I would like coffee... even though the restaurant was only about 1/4 occupied. In fact, the ONLY contact I had at the restaurant was with the hostess who seated me, who never smiled, I noted this on the comment sheet left on the table which also asked for a gratuity -- a pen was included making it easy for the customer to add a $ amount. I added both a comment and a small gratuity because the food was good although the friendliness was NOT. The decor of the public areas - lobby, restaurant, conference rooms are very attractive. On the 2nd Friday night we stayed, we were assigned to a 2nd floor suite in the back by the laundry and overlooking the large and very noisy AC/furnace and utility area. Our entry gate (#5) on the ground level had us walking by the multiple laundry carts which were left very messy and disorganized... a very poor introduction to the hotel guest area. Not only was there no view we could not have seen out because the outside windows were absolutely filthy! Again, the decor in this room was very dated, although the beds were quite comfortable. The AC in this room had some problems and the thermostat was flashing that the battery was low. I was finally able to get the temperature adjusted to a comfortable level. I called the front desk and requested a room change and was told there were no other rooms available... although the parking lot was practically empty at the time we checked in. My reservation request had been made approximately 1 month in advance and I had requested an upper level room (in fact, I have a standardized note on my hotel profile). We are Diamond level Hilton Honors members and are almost always assigned good accommodations. It is my understanding that room assignments are made either the day prior to the reservation or early in the AM of the reservation. If the individual making the room assignments had actually READ the reservation and assigned accordingly, perhaps our suite would have been better. The hair dryer did not work in the morning. However, when I called, a man from maintenance came immediately and got it operating correctly. (I thought housekeeping was supposed to ensure things in the room were operating correctly before they leave the room each day... at least this is what I learned when I took a hotel management courses). Another TA reviewer also noted that the ice and vending machines are on alternate floors. This is accurate, so that on floor #2 one has to go either up or down a level to obtain ice. The hotel has moved their Business Center to just outside the restaurant and bar area and now refer to it as an Internet cafe. There are 4 computer terminals that are easy to use with comfortable seating. Although the paper in the printer had run out, it was easy to locate more paper in the cabinet below and refill the paper tray. The bar tender seems to have the responsibility of checking in with guests using the terminal to see if any help is needed and he did come by to see if we needed assistance. The next time we are in the Phoenix area, we may try the Embassy Suites which is nearby... hopefully, the rooms will be more updated, room assignment requests will be honored and restaurant staff will be more friendly. By the way, the front desk has a preprinted handout that provides specific directions from the hotel to the rental car return at the airport. Be sure and pick this up as getting in and out of the airport from the rental car garages can be very complicated. Signage upon leaving the rental car garage is very poor and construction on the perimeters of the airport is very heavy.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Location":2.0,"Rooms":2.0},"author":"Bernhard Stroman","date":"2014-03-29 23:50:26 +0300"}],"public_likes":["Edison Williamson","Mariane Schuster","Dr. Charley Conn","Kelsie Heathcote","Lexi Harvey MD"],"vacancy":true,"description":". A Luxury Spanish-style hotel, famed for its views of the La Jolla Cove.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}