{"title":"Joshua Tree National Park","name":"Cottonwood Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$15 per night","geo":{"lat":33.74528,"lon":-115.81267,"accuracy":"APPROXIMATE"},"type":"hotel","id":12924,"country":"United States","city":"Twentynine Palms","state":"California","reviews":[{"content":"We stayed at the Avia this fall as part of my fortieth birthday trip. My wife and I loved the gas fireplace and the mini balcony where we enjoyed sipping some of the wine we purchased during the day. The staff were great and the service topnotch! The rooms were well appointed with a docking station for my iPod, a huge bed with very comfortable sheets. The bathroom while a little small had a great tub and shower. We would stay here again when we go back to Napa.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Muriel Lind","date":"2013-11-07 13:41:57 +0300"},{"content":"My husband and I flew down for a Thursday through Sunday trip for my birthday. We upgraded to a room with a soaking tub. Everyone and everything was great. Everyone knew our names and we were even surprised with a complimentary bottle of champagne to toast my birthday in our room when we checked in. The fire pits on the second floor terrace were my favorite part. I think you would have to be super picky/snobby to not like this place. We would recommend this place to anyone. We would highly recommend booking a tour with Bruce at Wine Country Safari, also. It's well worth every penny.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dr. Gracie Rogahn","date":"2014-07-10 22:52:12 +0300"},{"content":"I actually stayed in this hotel last March and forgot to review it. That said this is a beautiful piece of property with every amenity you can think of...EXCEPT the cork screw? I stayed in the suite and the pass through fire place was delightful. We had a small living area and a large bedroom. I do have to say that they pass off the tub in the middle of the room as romantic but it was a bit odd. Great deep tub though! The bathroom is fantastic. Beautiful HUGE shower. The patio area outside our room was delightful with its fireplace and cocktail (wine) service! The service was attentive. As stated the only downfall is there were wine glasses in the room with no opener! Great Napa stay in the perfect location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Stacy Hills","date":"2015-08-05 02:22:21 +0300"},{"content":"Hotel is in a great location, easy walk to the restaurants and shops. Free self parking in back. Wine bar in the lobby. Staff is great. We upgraded to a LUX Suite: 1 King Bed:Studio Suite:Living area w/sofa Oversized shower with waterfall shower. The room was modern, blackout drapes were a plus. We enjoyed the fireplace. Plenty of room for two. What I didn't like is that we were put by the elevator, and it got loud. We could also hear people on the street so this may not be a big problem now, it could a problem for some at peak season. The bed was mushy, thankfully I didn't wake up with a back ache, so Hyatt it's time to change the beds.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Mrs. Fidel Stracke","date":"2015-04-28 05:20:23 +0300"},{"content":"EXCELENT EXPERIENCE BUT PEOPLE NEED TO READ ABOUT THE HOTEL FIRST AND A BIT IMPROVEMENT PLEASE READ!! my husband and i stayed for a quick getaway during harvest and we where uncertain after reading the bad reviews But it was good stay!!! and yes we could not check in early but WE asked when we booked and were advised to call early the day of and that is ok there was other guests making a big scandal about it IF ONLY PEOPLE WOULD READ THEIR EMAIL CONFIRMATION THAT BY THE WAY MENTIONS THE CHARGE FOR VALET,SELF PARKING,CHECK IN AND CHECK OUT TIMES WE WOULD ALL HAVE A SMOOTH CHECK IN PROCESS YES MAYBE THE FRONt DESK PERSONALPaul was very helpful during our stay yet sarcastic during our check out!! SASHA NEEDS TO RELAX AND NOT BE CRYING OR HAVING A PANIC ATTACK WHILE HAVING A LINE OF PPL. at peak chech in time. THE TERRACE AGAIN EMAIL CONF. SAYS ITS CLOSES AT 10!!! WE SHOULD ALL BE RESPECTFULL AND GO BY THAT BECAUSE IS SECURITY WERE TO KICK PPL. OUT that would be a bad review as well PPL MAK UP UR MIND!!! I STAYED IN A GORGEOUS SMALLER ROOM BY THE TERRACE and we had no problem. THE VIEW the hotel discription says \"DOWNTOWN NAPA\" Iwas not expecting a great view i got our moneys worth we talked to other guests and they where very un pleased for everything but yet they stayed hum?? they wanted a great view go stay in the country!! OR IF UR THAR HIGH MAINTENANCE GO SPEND 1000'S AND GO ELSEWHERE!! Needs improvement in manager respons. overcharges we dind nor have any rher is a note in snack tray/mini bar saying they are sensor very common mistake i wanna say on not checking bill at front dest i over heard alot of complaints bout it while checking out. We WILL DEFINITELY GO BACK NEXT MOTH FOR THANKSGIVING !!!","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":5.0,"Value":1.0,"Location":5.0,"Rooms":4.0},"author":"Orpha Kozey","date":"2014-05-09 04:06:52 +0300"},{"content":"This is definitely a hotel you can stay at for awhile. The rooms are nice and spacious with the bed area,bath and TV. There is a seperate sitting/living room with a TV as well. Very comfortable beds and big bathroom with a huge walk in shower. We stayed here one night after touring the wine country. All the restaurants and shops are in walking distance. The staff was very friendly and accommodating. My husband used the gym which is not part of the hotel however it is complimentary for the guests. He said the staff was very friendly at the gym. I would definitely recommend this hotel to anyone going to Napa, and I plan to stay here again! Great experience!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Margarette Aufderhar","date":"2014-11-05 16:47:04 +0300"},{"content":"This hotel is in the heart of downtown, walking distance to everything, rooms and staff were fantastic.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mr. Gregorio Yundt","date":"2014-04-17 03:47:57 +0300"},{"content":"Classy hotel in the heart of downtown Napa. Top notch place if you desire to stay in the Napa area, that provides good access to all of the areas attractions. I only wish the hotel had it's own gym and pool facilities. This would have made it a top pick for me.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Mya Lubowitz","date":"2012-07-05 18:56:16 +0300"}],"public_likes":[],"vacancy":true,"description":"Located next to the park's south entrance. 62 sites, water and flush toilets. There are also three group sites available for $25 per night.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}