{"title":"Mont Ventoux","name":"Camping du Mont Serein","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://campingventoux.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":44.184720018442064,"lon":5.275747845880687,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":19198,"country":"France","city":"Beaumont-du-Ventoux","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"The staff was very helpful and very pleasant. We had a computer to use in our room free. The room was very quiet (no street noise) The beds were comfortable. The bathroom was exceptional. It was very large and had a whirlpool tub with a shower! The coffee served in the morning was some of the best we had while in Rome. The neighborhood had easy access to the train station as well as the subway. We walked everywhere while in Rome. When we traveled by train from Rome to Sorrento and back to Rome from Florence this made walking from the train station very easy. When I go back to Rome I will definitely stay here again. We stayed at the Hotel Sonya on the first leg of our trip, and at the Hotel Opera Roma on our way back. Even though I enjoyed them both, I prefer the Hotel Sonya, because it was a smaller hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Miss Fay Schimmel","date":"2015-03-07 19:45:50 +0300"},{"content":"Very enjoyable 3 night stay; staff very helpful in accomodating us. Close to most sights in Rome; easily accessible by walking. Train & subway stations very near also. Breakfast included in rate was very satisfactory. Bathrooms very nice(big clean shower area). Lots to like!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Margarette Weissnat","date":"2015-05-23 08:02:26 +0300"},{"content":"We enjoyed our stay at Hotel Opera Rome very much, we preferred the second room that we were allocated upon our return - we had a split booking 2 days and 3 days. The second room had more space and a larger bathroom too. Nice breakfast, excellent coffee and very friendly staff. The only thing we noticed was the noise level in the breakfast room by the staff clearing away crockery. Other than this, it is an ideally located hotel and very good value for money. I was impressed by the internet service available and the loan of a notebook for our use in the room. I would recommend this hotel and would use it again when we next visit the very beautiful city of Rome.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Jacky Lubowitz","date":"2014-06-11 15:44:21 +0300"},{"content":"We had a great stay at the Hotel Opera in June /July 2009. We hadn't been to Italy for many years and found Hotel Opera to be a very pleasant surprise. The room was recently (and quite lavishly) refurbished and quite spacious (even with an additional bed for our 14 year old son). The bathroom was huge. There was free wireless internet access from the room, The hotel seems to be a smaller off shoot from a nearby hotel and so there aren't a lot of staff. But those that there are, were friendly and very helpful. The manager Reza seemed to be everywhere and very willing to help. When my wife enquired about a coffee shop when we first arrived after a long flight - Reza was back with a cappuccino almost immediately. Breakfast was basic but more than adequate. The hotel is centrally located near to the main railway station - but off a quiet street. And the cost was very reasonable compared with other places we stayed in Italy. We would definitely stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Stefan Littel","date":"2015-03-11 22:27:53 +0300"}],"public_likes":["Jenifer Cartwright","Shana Yundt","Akeem Champlin","Cynthia Conn","Vern Wolf","Moshe Pfeffer","Darrick Schowalter"],"vacancy":false,"description":"1410 meters high, north face of Mont Ventoux","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}