{"title":"Altrincham","name":"Bull's Head and Lodge","address":"Wicker Ln, Hale Barns","directions":"In Hale Barnes opposite Ringway Golf Course","phone":"+44 161 903-1300","tollfree":null,"email":null,"fax":null,"url":"http://www.thebullsheadhalebarns.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.36955,"lon":-2.31563,"accuracy":"ROOFTOP"},"type":"hotel","id":597,"country":"United Kingdom","city":"Hale Barns","state":null,"reviews":[{"content":"My family of 4 booked for two nights. We stayed one. The halls were dark & smelled putrid. The rooms, save for bathroom was just weird and disjointed. My son accidentally left his $400 glasses bedside.. Easy enough to get back just hours after realizing his mistake right? WRONG!! The staff was less than helpful and \"claimed\" they looked for them but to no avail. They were rude and impatient. Best hotel in seattle?? Who and how much did they pay to say that? STAY ELSEWHERE! Waste of money and valuable time.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Cleveland Swift","date":"2012-08-02 04:42:08 +0300"},{"content":"The Edgewater Hotel in Seattle has been there since the '60s when it was \"the\" place for rock stars. The Beatles, Roy Orbison, $@!#% Jagger & the Stones as well as anybody who was anybody in those days stayed at this great hotel. You used to be able to fish from your rooms in those days. The hotel sits out over the water...the only one like this...in Puget Sound. You just can't get any closer. If you fell out your window, you'd be in the water. There is a great bar and restaurant, beautifully designed, and part of the bar edges around the restaurant, outside. Food is great too. Rooms are not very fancy, nor big, but have so much 'woodsy' character and such terrific views, that the place is hard to beat. Within walking distance along Alaskan way to all the waterfront restaurants. Just next door to the Victoria ferry terminal, and on the otherside, there's a cruise ship dock. Up a few blocks is the main shopping center for Seattle's downtown area, and the monorail which goes to the Seattle Space needle. Cannot say enough about this wonderful Hotel and its perfect location. Oh yes, and on Thursday evenings, the Seattle Yacht Club has its sailing races and the boats get so close to the rooms and the main lobby and restaurant that you can see the faces on the sailors. Just phenomenal!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Savion Yundt","date":"2012-02-29 06:27:46 +0300"},{"content":"Very friendly, fast check in. The room was exactly as we had asked for in the online reservation system. All staff was friendly, and very welcoming. I only had two issues, but it didn't take away from the wonderful time we had there. You have to have valet parking regardless of the fact that you may not be leaving the room or grounds. The valet parking is an extra 34$ on top of the nightly rate. They used to have where you could park right in front on your own, but they changed that. We had a beautiful, king, water view room one of the windows had bird droppings all over it. It was a great stay!!! We plan on coming back at least 4 times a year. It was wonderful Thank you Edgewater for going above and beyond on customer service!!! ps Room service food was amazing!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Josiah Konopelski","date":"2014-05-19 07:06:55 +0300"},{"content":"We were in Seattle for our wedding anniversary. When We booked our room I called prior to arrival to make sure that we had a water view. When we arrived to Edgewater we were a little worried with the decore. VERY rustic, strange fake trees every where in the lobby. Kind of dark? We received our room key and proceeded down a long creepy dingy, smelly,narrow hallway to our room. We were shocked to find out that we didn't have a water view! The room was so small there was barely room for a bed! Immediately I called the front desk I was told that they were out of waterview rooms. We were given an option of a room with 2 beds. The new room was normal in size. Nothing exciting. Needless to say totally disappointing. Will not be back and we are not recommending to family and friends. We had stayed 2 days prior at The Hyatt Place near the space needle. Now that's Awesome hotel! Book a room at the Hyatt and you wont be disappointed!!","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Miss Bobbie Zieme","date":"2012-11-22 12:13:37 +0300"},{"content":"This was our first stay at the Edgewater and we loved it. The hotel has a lodge motif with lots of woodwork and fireplaces, even in the rooms. It makes for a very cozy, comfortable feeling. The rooms have luxurious beds, large stone showers, leather chairs and footrests before the fireplace and all the amenities. Our balcony, right above Elliott Bay, was the perfect location to view the waterfront and see Mt. Rainier, when the weather was clear. Being right next to the pier for the cruise ships to Alaska and the ferries to Victoria and the San Juan Islands make its location ideal for these trips and walking distance to almost all the attractions. The hotel also provides a shuttle service within a two-mile radius. There is a gourmet restaurant and lively adjoining lounge, as well as a cozy large lobby with floor to ceilling windows looking out on the water. All in all a very relaxing and enjoyable stay, and we will return here when next we visit Seattle.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tess Ward","date":"2015-05-15 22:57:56 +0300"},{"content":"If I could give this hotel a 4.5, I would have. There are only a few little flaws in the hotel that deducted a few points. Stayed in Seattle the first weekend in November and chose The Edgewater due to its proximics to most of the major attractions in the city. We were without a car and are walkers so this was a plus. If you are not the hotel offers a free shuttle that runs every hour and will take you anywhere withing two miles. We only took the shuttle once and realized they don't pick you up (not a problem in our case) but...if they do they never mentioned it!! The hotel is older and at first glance may not be up to everyones perfection but it is well kept and does actually sit out over the water. It's next to the cruise line building, near the Aquarium, the wharf, and ferry buildings. Not to mention Pike Market and some amazing restaurants. The hotel offers wonderful views from the sitting area which comes complete with fireplace and from the lounge as well. Our room was a water front room and the views were wonderful to awake to. Our room was of decent size with comfortable bed, warm gas fireplace. docking station for and iPod and big bathroom. That bathroom was one of our low points. Our photos showed a soaking tub and I requested one when I called to confirm. I did not receive one, rather a very nice walk in shower. I was really looking forward to the soaking tub as we were staying there for three nights! Another disappointment was the cost of INTERNET. In this day and age I really do expect free Internet?! Most of our better hotels do offer it! Our room was right near the railway so we had a constant rumble. If this is going to bother you, ask for a room closer to the main of the building. I don't know how the rooms on the upper levels might fare with the sounds. Everyone at the hotel was very pleasant. Room service was fast and efficient. The food was very good as well. The one thing I would advise is if you ask for a cab; don't let them tell you to come down and let them call. You will sit for twenty minutes. Tell the front door man you will be down for a cab in ten! It's a $32 cab ride to the airport or a $40 town car ride. So if you are a tipper ~ you do the math?! It was clean, comfy, good food, good views...and a walk to everywhere! Enjoy. I'd go back in a heart beat!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Darian Streich","date":"2012-04-03 18:53:12 +0300"},{"content":"I booked the Edgewater Hotel because it had good reviews, and met the requirements for my wife's' happiness: Be on the water or a view of it, and have a fireplace. It also provided a close location for the Opera we were attending that night for my wife birthday Our arrival was met with friendly valet and check-in staff. Upon arrival they notified me I had be complimentary upgraded to the Beatles Suite -- now, mind you, I didn't even know what they were talking about. When they told me the history I thought, \"huh, this should be pretty cool.\" Man. It was AWESOME. The room is HUGE. Decked out in Red and White and wooden decor. Little did I know my wife's affinity for British style and the Beatles. Having the Beatles pictures, books and memorabilia made the stay totally unreal. Icing on the cake - a CD with all their hits to listen to as we lounges in the spacious room. The room was immaculate (and my wife is very meticulous) comfortable and cozy with a shower and a large bear-claw tub (ah-yeah). The restaurant was great - a spectacular view of the sunset, great service and delicious food. At night, I stopped in for a bit and it was a lively and fun atmosphere. My only regret is that with our planned night out, we didn't have time to enjoy the room and hotel as much as we could have. The next time, the hotel will be the destination. Period. We had a great time and really did not want to leave.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sydnee Funk","date":"2014-09-24 11:24:55 +0300"},{"content":"My husband and I stayed at the Edgewater for 4 nights in a city view room that was located on the the 3rd floor. We travel a lot and typically stay in upscale hotels. First, I would like to say that the staff here were very friendly and the housekeeping did an exceptional job of keeping the room clean each night. The hotel itself is an older hotel and I would not consider it an upscale hotel but we still had a pleasant stay. The room itself was small and cozy with a great fireplace. The bathroom on the other hand was great & would definitely hold up in a 4 star hotel. The room itself I would give a 3-star rating. The TVs were not LCD/flat screen and you could see the age of the room. The pillows and the bed were not comfortable for us. The train did keep my husband up at night. I took sleeping pills so I slept through the train. We did not like the fact that you had to pay for internet but this did not take away from our stay b/c there were coffee shops in the area that did offer free wi-fi. The cool part about this hotel was it was over the water. We did enjoy our stay but I am not sure if it would have been so great if we had paid full price on it. We bid on it using Priceline so that is probably why I title it \"a pleasant stay at the Edgewater\". I think if we would have paid full price we would have been disappointed. I would stay here again but not if I had to pay full price....so sorry Edgewater! We do thank u all for being so nice to us during our stay!!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":3.0},"author":"Luis Quigley","date":"2015-10-27 05:22:25 +0300"},{"content":"This is a very special hotel, a true Seattle Icon! I've looked at the rates before but felt it was more than I could muster when my guy suprised me with a weekend stay for our 25th wedding anniversary! :D With an upgrade to a water view. Needless to say, we had smiles on our faces all weekend! The location is supurb and the food is top notch. Everything is with-in walking distance.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Neil Rosenbaum","date":"2012-11-27 22:53:45 +0300"}],"public_likes":["Zachery Jacobi"],"vacancy":true,"description":"Lodge that adjoins the village pub, handy for the airport and M56","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}