{"title":"Birmingham (England)","name":"Hampton by Hilton Birmingham Broad Street","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hamptonbirmingham.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47505,"lon":-1.91383,"accuracy":"ROOFTOP"},"type":"hotel","id":3609,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"I am a travel agent and I have stayed in my fair share of hotels around the world. The Hotel Burnham is my new favorite. I had the pleasure to stay in a Executive suite with an amazing view of the Chicago Theatre and Macys and from the other side Millennium Park. The room was large for a boutique hotel with a separate living area. Bed was extremely comfortable. Everything from the Atwood Cafe, to the elevators to the opulent hotel lobby features the charm that Chicago is all about. Another huge bonus is the location of the Burnham. You are literally a stones throw from the Lake subway on the red line, another block to the blue line. You can get to either O'hare or Midway airport with ease using public transit if you wish. With the location and decor aside, the main part of this hotel that sets it apart is the service. Whatever we needed at the Hotel Burnham, we got. The front desk was sincere and helpful. The housekeeping staff left personal notes and did an excellent job cleaning up our suite. Everything from check in to check out had a personal touch that you just can't get at a Radisson or major hotel chain. My boyfriend and I both really enjoyed the nightly wine receptions. This hotel exceeds any experience I've had at a city hotel, you won't be disappointed.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mireya Williamson","date":"2013-10-05 02:53:23 +0300"},{"content":"Who would have thought you could have such a comfortable hotel right downtown Chicago that was so quiet. The staff is friendly, and very accommodating. Plus you're steps away from all of Chicago's greatest spots and staying in an important historic landmark. The decor in the rooms is a little too frou-frou for my tastes, but not overly obnoxious.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brando Willms III","date":"2012-07-03 21:33:52 +0300"},{"content":"Spent two nights at this lovely hotel and loved it. The hotel is well located in the centre of Chicago right on the shopping streets. We walked everywhere and didn't miss having a car. Our room was big with a huge bed (although apparently we only had a standard room). Beautiful clean bathroom which was kept immaculate during our stay by housekeeping. Loved the touch of the zebra or leopard print dressing gowns!! We had a room overlooking the street but we were high enough not to be kept awake by the road noise. The staff were excellent - friendly and helpful but all very efficient. We did not eat in the restaurant but it did look nice but we had no food included in our room price. One piece of advice - join as a Kimpton In Touch member and you get free Wifi and $10 to spend on the mini bar. Excellent touches like free coffee to take away in the morning and free wine reception in the evening for all guests.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Kasey Hessel","date":"2015-01-26 06:09:34 +0300"},{"content":"My wife and I arrived on a Sunday morning at 9:00 am on Aug 21st. We did not expect any rooms to be available since most of Chicago was booked for the weekend. We checked out bags in a holding room til the afternoon. We eventually made it back to the hotel around 3:00. The check in was lightning quick. We stayed in the historic section on 12 th floor in room 1205. We had great view of State and Washington and everywhere else. We had a deluxe queen comfortable bed , nice couch, desk, closet, mini bar, and flat screen. The showers had the best water pressure that I can ever remember. Aveda bath products if you're imto that sort of thing. I'm used to Hampton inn generic myself. The Burnham had a restaurant near the lobby that I wish we would have visited instead of Quartino Italian up the road. The folks working the front desk were friendly and very helpful. The location was good, right next to the blue and red line stations. If i return to Chicago, I will most certainly reserve a room here again. I recommend the Hotel Burnham, an Incubus concert at Northerly pavillion, and Bobby's bike tours.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Angelica Hudson","date":"2012-08-16 01:09:39 +0300"},{"content":"This hotel is very nice and clean. Excellent location to shopping/restaurants/Park/theatre - all within walking distance. Lots of freebies: Starbucks coffee and tea in the lobby beginning at 6:00 AM. Wine served at 5:00. Always fresh water in the lobby. Staff is very friendly and accomodating. Room deco is great, bed comfy and normal size bathroom! I was very pleased with the stay and will definately stay there again.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mrs. Cassidy Nicolas","date":"2015-09-08 19:50:50 +0300"},{"content":"My family of four spent my birthday in The Burnham in mid june. It was great. Martin, the front desk manager is a charming man who was kind enough to get my wife and me a corner room which allowed us to look up Washington to see the top of the Gehry pavilion in Millenium Park and down the truly great street, State Street, to see the Chicago theatre. We were directly kitty corner across the street from what was the flagship Marshall Field's store, sadly, now Macy's. It was a short 2 block walk to visit Millenium park and an easy walk a few more blocks to the Art Institute. Or, we could have turned left and walked the magnificent mile. The room was lovely and met all of our needs. We had breakfast in the bustling ground floor restaurant and it too was excellent. They also set out coffee for those who just want to grab a free cup of joe on your way out the door. Kimpton properties are uniformly well run and exude a \"fun\" vibe. This may be their very best property. The physical plant and the staff are excellent. My kids room was small, only 175 square feet but they use every inch and it did not feel crowded. I highly recommend this hotel.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Carson Labadie","date":"2013-06-13 11:33:37 +0300"},{"content":"I have never had to write a bad review based on service for any establishment, so this review should really come across as strong regarding service at the Burnham Hotel in Chicago. My issue revolves around making reservations for international guests and I was to book 6 rooms for two days (being a good customer). I never received any confirmations as promised and after the second day, I called and was transferred 4 times, cut off, and received a recorded prompt to leave a voice message. In a professional and courteous manner, I did just that. Four hours later, no call back from the hotel. I then called back on three occasions and it seems like everyone is a manager when you ask for one. Another important aspect of this is was the fact that I was booking direct through the hotel and not via a third party which can cause conflicts. I am shocked frankly. A four star hotel messes up reservations placed on a credit card twice. Then to top everything, when I went to book the rooms, the special group rate of $118.50 per room jumps to $190 and the arrogant representative on the line states, that is the best I can do. Luckily, I went to another hotel a block away, received rates for $90 for a better upscale hotel, and received an email confirmation within minutes. I am not sure why this happened and who is inept at the Burnham Chicago (A Kimpton Hotel), but never again will I stay at this chain. Brian","ratings":{"Overall":1.0,"Service":1.0},"author":"Alessandra Mitchell","date":"2015-05-18 03:12:37 +0300"}],"public_likes":["Alfonso Pollich","Haylee Spinka","Ms. Keenan Olson","Elvera Maggio","Astrid Padberg","Keshawn Wehner","Name Stark"],"vacancy":false,"description":"Broad Street. Contemporary 3 star hotel offering 285 stylish rooms, free WiFi and complimentary breakfast.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}