{"title":"Windsor and Eton","name":"Beaumont Estate","address":"Burfield Road","directions":null,"phone":"+44 (0)1793 819 000","tollfree":null,"email":"beaumont@principal-hayley.com","fax":"+44 (0)1753 640 100","url":"http://www.beaumont-estate-windsor.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.450267,"lon":-0.573086,"accuracy":"ROOFTOP"},"type":"hotel","id":33431,"country":"United Kingdom","city":"Old Windsor","state":null,"reviews":[{"content":"This hotel could not have been better located for our first trip to Barcelona. It's in the smart and stylish Eixample district, just moments from all the beautiful modernista buildings. A short stroll in the opposite direction plunges you into the Old Town; walk right through it to the sea front. Everything we needed was on the doorstep - excellent cafes, tapas bars and restaurants. On the couple of occasions we wanted to go a little further afield the hotel staff were very knowledgeable about the best way to get there using the excellent metro and bus systems. The reception at the hotel is staffed by young people with excellent English who are unfailingly helpful and friendly - great ambassadors for this beautiful city. Don't bother buying the breakfast voucher though. Better and cheaper to put together your own breakfasts at the tapas bar next door.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Maureen Hand","date":"2015-07-17 03:34:14 +0300"}],"public_likes":["Armando Cormier","Francesco Von","Heather Brown","Horace Buckridge PhD"],"vacancy":true,"description":"This is a hotel and event venue offering over 400 bedrooms and 75 event suites. It originated as a family home from the 14th century, and is made up of several buildings - including an old school house and an iconic white mansion – featuring ornate architecture like grand white exterior pillars, barrel-vaulted ceilings and stained glass windows.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}