{"title":"Liverpool","name":"Crowne Plaza Liverpool Airport","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.crowne-plaza-liverpool.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.34754,"lon":-2.8806,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15913,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"The hotel was really nice but it was the employees that made our stay so much more enjoyable. Everyone was so friendly and helpful and seemed genuinely concerned with us. I can't wait to go back!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Else Hammes","date":"2013-05-31 17:15:04 +0300"},{"content":"Stayed here for two weeks, on arrival the room was not ready, once here, found out it is not kids friendly. somebody with access to the room went in and looked troughtout our luggage and stole more than 1,000. dollars, requested for the safe to be fix, but NEVER got fixed. Very dissaponted, will never stay here again, 4 star hotel with 1 star staff. So, if you have money ready to be stolen from the comfort of your room while you are out and about, this is the hotel for you. management gave us the run around until we check out with no resolution. other guest got their jewerly stolen in the same week, just prior to check out. Loved Puerto Rico but hated the stayed. If you must go, please, please stay somewhere else. Loved the island and all the activities, people out and about are very helpful and you can find your way around. The food is great and very affortable but you have to drive outside the \"tourist\" area. great beaches and natural resources that PR provide are second to none. come to PR for a great time, but staye else where! do your homework and plan your trip carefully. as for me and my family will never, ever stay here and will advise everyone not to stay at the intercontinental.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":4.0,"Location":3.0,"Rooms":3.0},"author":"Clementina Pacocha MD","date":"2012-06-03 22:44:39 +0300"}],"public_likes":["Gus Hand","Dayana Cruickshank","Cody Wuckert","Kelsi Spinka","Vinnie Dare","Julius Bergnaum"],"vacancy":true,"description":"A short drive from Liverpool John Lennon Airport, this makes fabulous use of its Grade II listed art deco building which was the old airport terminal and control tower. If you are looking to eat out of the hotel then Damon's is a restaurant on the same site which you will enjoy if you like American kitsch and microwaved food. Apart from that, there is a retail park with the typical fast food restaurants just a short walk from the hotel.","alias":"formerly Marriott","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}