{"title":"Avignon","name":"Avignon Hotel Monclar","address":"13-15 Avenue Monclar","directions":"just behind the central station, which faces the main avenue of downtown and the bus station","phone":"+33 4 90 86 20 14","tollfree":null,"email":null,"fax":"04 26 23 68 31","url":"http://hotel-monclar.com/en","checkin":null,"checkout":null,"price":"Double room with ensuite shower and bathroom €30-60, studios and apartments from €75, breakfast €7 can be taken in the garden in season 7:30AM 11AM","geo":{"lat":43.9397954,"lon":4.805895400000054,"accuracy":"APPROXIMATE"},"type":"hotel","id":1359,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"An excellent property for the price. Although it looks like it was built in the early 70's, it is well maintained, clean, and has an attentive staff. The location was excellent and we very much enjoyed the beach which was a short walk on a paved pathway. The housekeeping was minimal and parking costs extra. There was free cable internet.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Sylvester Zieme","date":"2015-11-09 20:26:29 +0300"},{"content":"As others have said, great location. Short walking distance to the Sheraton and Black Rock. Not that far of a walk to Whaler's Village either. We jogged next to the cart path for some exercise over to the village. Parking garage is in the middle, we were in unit I-201, right next to the garage with a partial golf course view, yet it was booked as a 1 bedroom garden view. The unit is huge for what you pay, 2 beds (we only used one), and a big living room area, plus the patio. Only cons I have is there is no work out facility. If you want to work out, you'll have to pay to use a facility. We jogged along the golf course (as many others do), did some pushups, and swam laps in the pool located on top of the garage instead. We also stayed 2 nights at the Kapalua Villas as a splurge and liked Eldorado better. The Villas were fancy smancy, but for the money, we thought the extra space and fancy stuff wasn't necessary. The location of Eldorado makes it the winner. A clean (firm) bed and shower area is what you're looking for in these places. This one had some mildew on the shower head, so do the Villas, but I can over look that and did mention it to the staff and my followup survey. Both beds were clean and firm here. Black Rock is the best snorkel location, and this hotel is right there. Don't worry about the views. Garden view is fine, and your view will be of a golf course no matter what you pick, even if it's a garden view. Some units do see the ocean, but you're gong to see that in person any way. So if you're on a budget and don't care about the view, the garden view is going to work and you'll be surprised.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Joany Waelchi","date":"2015-11-14 16:37:46 +0300"}],"public_likes":["Vicente Williamson"],"vacancy":true,"description":"Family run hotel overlooking a flowered garden, within a private carpark. Internet wi-fi available in the whole building. Recently renovated rooms with the typical Provencal style. 7 languages spoken. Private taxi service.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}