{"title":"Cirencester","name":"Cotswold Water Park Hotel","address":null,"directions":null,"phone":"+44 (0) 01285 864000","tollfree":null,"email":"waterpark@four-pillars.co.uk","fax":"+44 (0) 01285 864001","url":"http://www.cotswoldwaterparkhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.671013,"lon":-1.902302,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":6076,"country":"United Kingdom","city":"Gloucestershire","state":null,"reviews":[{"content":"We just stayed at this hotel for 3 nights and had a great experience. The property is very nice and the location is unbeatable for the Ka'anapali area. The hotel is located on a great stretch of Ka'anapali Beach right on Black Rock which offers beautiful snorkeling/scuba diving right in front of the hotel. It is also less than a 5 minute walk to Whaler's Village shopping and dining center which is also very convenient. The hotel is well kept and the rooms are not fancy but are updated and quite comfortable. Every evening the cliff jumpers light torches on black rock and jump off into the water. Its nothing crazy but a nice little touch that makes you feel connected to a forgotten true Hawaiian spirit. Our room upon check-in was the last room along Black Rock and had a great view but awkward layout. The cable didn't work and they couldn't fix it so they moved us to a new room in which they upgraded us to a Jr. Suite. The room was huge and was really nice. The staff did a great job to make up for the inconvenience and we were very happy with their assistance. I am a Starwood Platinum member so that may have helped out with getting a room upgrade but it was very nice of them to offer an upgrade without me having to ask for it. Sometimes the large resorts do not recognize Platinum status as much as more business-travel oriented hotels but this resort was very accommodating. The only negative, and this is really picking here, is that the pool is kind of an awkward layout. It is quite narrow in places and feels a bit small despite its enormous length from end-to-end. There is plenty of room on the other side for a second pool and it would be nice to see even a smaller, adults only pool as main pool area can seem a bit crowded and overrun with energetic kids. Overall I would highly recommend this property for those looking for a true mega-resort feel in the heart of Ka'anapali. The property has tons of energy and really is a great location. The hotel is great for families with children both older and younger as there is no shortage of activities. It is also great for those who like the feel of being in a larger resort town as it is merely minutes away from Lahaina and there are tons of activities, shops, and restaurants in the area. For those looking for a quieter, romantic getaway I would say that this resort is not exactly geared towards you. I would have no problem returning to this hotel when I have kids.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Laisha Schmitt Sr.","date":"2014-01-10 04:29:01 +0300"},{"content":"Just Arrived yesterday , but So far it is a dream come true !! Our room is amazing ! The staff is so friendly and helpful. Drinks are amazing ! And ocean is crystal clear!! Aloha, i will write more when i return !","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Ms. Hailee Hickle","date":"2012-11-24 09:17:30 +0300"},{"content":"We were delighted with our room, the friendly staff, the cleanliness and the wonderful buffet breakfast. The beach is fantastic. Our only complaint was that there wasn't a lunch place option other than the outdoor bar area. We would definitely use this hotel again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Wendell Bauch","date":"2012-01-04 07:58:43 +0300"}],"public_likes":["Hermina Herman DDS"],"vacancy":false,"description":"Four Pillars Hotel Group. New (as of 2014) 4-star hotel and apartments on the Lakes at South Cerney, outside Cirencester.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}