{"title":"San Francisco/Nob Hill-Russian Hill","name":"Intercontinental Mark Hopkins","address":"1 Nob Hill Place","directions":"at California and Mason Streets","phone":"+1 415 392-3434","tollfree":null,"email":null,"fax":"+1 415 421-3302","url":"http://www.intercontinentalmarkhopkins.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7914,"lon":-122.4102,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25966,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"this motel is very clean but old. it's close to the beach.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Thalia Wehner","date":"2012-04-07 05:05:04 +0300"},{"content":"This hotel has made some nice improvements from the last time I stayed. It is now under new ownership and I had a much more pleasant stay this year. The service was excellent. The rooms are like every other basic room you find in Ocean City. Ours was clean and that's what matters. We didn't have any problems with noise from other rooms. The prices are reasonable and the location is very good.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Moshe Bergstrom","date":"2013-03-20 21:49:39 +0300"},{"content":"and trust me- I travel for work a lot! I read another review about this hotel that basically had the same experirence, but to sum it up we also were evicted by the sercurity guard. They said we had 5 people staying in our room (there were 4 of us) and a friend of mine that came down just for the day to visit. They told us unless you are staying at the hotel you are not allowed on the property (they accused us of trespassing) also, they informed us that you are not allowed to have guests in your hotel rooms that are not staying there. We were evicted after we had been out, so they were waiting at our room for when we came back to the room. So they put 4 girls out on the street at 3 in the morning. The stafff was incredible rude and stood there while we had to try to pack everything and leave. The guard even kicked the door open at one point while we were trying to get changed and told us to change in the bathroom. I wish there was something else I could do to get the word out about this hotel and make sure no one every stays there again. Trust me if you are looking for a budget hotel there are plenty of other ones in OCMD to choose from....... STAY SOMEWHERE ELSE!","ratings":{"Overall":1.0},"author":"Ivah Hansen","date":"2014-05-31 09:27:02 +0300"},{"content":"We got the hotel off the internet and looked just what we wanted. We pre-booked and reserved a room for late arrival. This was confirmed as a Superior Room by the hotel. We arrived at about 01.00 and checked in and were shown to our room. It was the worst room we have ever had in a so called reputable hotel chain. The room was so small there was no room for our luggage on the floor; you couldn't get into the bathroom if the wardrobe door was open; the mattress was covered in a plastic sheet which meant all the bed clothes slipped off; although it was meant to be a no-smoking room the place stank of cigarettes; there was no window in the room. The room was nothing like the photos on the web site. Being tired after a long journey we slept as best we could for the night but in the morning complained to the manager. We were told they had no better rooms but for an extra charge we could move to a sister hotel virtually next door which, as we had paid for 3 nights was the best we could get and were told that we could complain later which we did. When we complained we were told that there was nothing they could do as we should have complained the night we checked in and despite our protestations the management refused any refund at all. We later found out that this is what is commonly called a “short time hotel” catering for ladies of the night and their clients. We have since written several times to the Managing Director of the Hotel 81 chain but not had the courtesy of a reply. If you want an hotel in Singapore don’t book the Hotel 81 Classic; it is awful and without doubt the worst hotel we have ever stayed in on our travels. Do learn from our mistake and check reviews on Trip Advisor before you book any hotel and if in doubt try and get an independent review.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Deonte Kling","date":"2012-07-28 20:56:12 +0300"}],"public_likes":["Tommie Kshlerin","Johathan Ankunding","Jadyn Wisoky","Janet Howe","Celestino Smitham","Sim Schaden","Miss Benton Stracke","Florence Kemmer","Wellington Hegmann"],"vacancy":true,"description":"Historic hotel atop Nob Hill. Convenient for walking tours of the city.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}