{"title":"Birmingham (England)","name":"ibis Birmingham Holloway Circus","address":"55 Irving Street,","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.4727,"lon":-1.9026,"accuracy":"APPROXIMATE"},"type":"hotel","id":3615,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"Hotel Monaco is a reasonably priced hotel in a great location. It s within walking distance of the theatre district, great restaurants and the lake (including Millenium Park with the Bean!). Some rooms have great views but all of them are well decorated. On weekends, complimentary wine is offered in the evening and coffee in the mornings. A nice touch.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lewis Cummerata","date":"2012-01-29 06:29:44 +0300"},{"content":"I stayed in this hotel in December. Hotel is clean, convenient location. Staff is very helpful. I will recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Belle Kris","date":"2012-05-28 15:04:29 +0300"},{"content":"We have stayed here twice and enjoyed it. Love the hotel happy hour. It provided a nice break from our holiday sight-seeing and shopping to stop and relax. The restaurant downstairs is great and super convenient for breakfast. Can't beat the location, right in the middle of everything. Walk to stores, art museum, restaurants. We paid extra to get a good view and it was worth it. (I think some rooms face a brick wall across an alley.) It was nice to sit in the window seat and watch the city. The room was wonderful, beds are super comfy and we enjoyed having a \"pet\" goldfish in our room for a few days.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Linwood White","date":"2012-07-06 06:17:04 +0300"},{"content":"Hotel Monaco is in the perfect location: across from the river, a quick stroll from Millennium Park and Michigan Avenue. There is so much to do and see within walking distance or you can hop a bus or the el to get you anywhere else in the city. Cabs are also plentiful here. The doorman is happy to get you one if you need it. The lobby is beautiful, the people at the front desk are always welcoming and a complimentary cocktail hour is included (every night, if I'm not mistaken.) The rooms are AWESOME! HM is a boutique and is classically Kimpton in that the rooms are decorated with a modern and unique flair. We stayed in a room with a huge window nook that overlooks the river. Super cool. It's notable that although HM is in a prime location, I have never heard any street noise. This is hard to find in the city-I'd even be willing the pay a little more for the quiet, but you don't have to here! The best part about this place is the value. We paid around $130 on a nice Chicago weekend. I suspect prices go higher on prime Chicago weekends in summer (airshow, Taste of Chicago, etc.) but they do everywhere, so book a stay here and try it out. You'll be glad you did!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Alf Towne","date":"2014-10-14 10:51:44 +0300"},{"content":"Every year we stay here for a meeting. The staff are incredibly friendly and welcoming. We love the nightly wine hour as it brings all of our friends who stay here together. No matter what goes on with the meeting, we meet at 5 for a wine. The location is great- easy walk to Michigan. Rooms are big with window seats. Art deco style and very clean. Only hang up is the gym room which was small until recently. Now it has been expanded and is pretty nice. The adjacent restaurant serves a nice breakfast too! Free wifi if you join the Kimpton rewards program (for free). The net effect is that we feel like we will keep returning here!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Frances Jast","date":"2012-12-08 23:18:49 +0300"},{"content":"We have always stayed in the Hotel Palomar, but decided to try a different hotel in the Kimpton chain. Rooms are nice and beds are comfy. Our bathroom was a bit outdated, but it was fine. We stayed in a room with a view over the Chicago River and window seats. This feature was so cool and unique. Where we have no complaints about Hotel Monaco and had a great stay, Palomar has nicer rooms and a more interesting bar. If you're looking for a room with a view, Monaco should be your choice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Maude Volkman","date":"2012-02-25 13:43:31 +0300"}],"public_likes":["Tamia Langworth","Austin Goldner","Jeffery Bogisich","Dane Beier","Oda Kuhlman","Lacey Hauck","Sarah Crona Jr.","Mr. Mittie Abernathy","Idell Bauch"],"vacancy":false,"description":"This is an older ibis whose suburban style belies its location close to the business district and the Holloway Circus evoked in the name.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}