{"title":"London/South Kensington-Chelsea","name":"Cadogan Hotel","address":"75 Sloane St, SW1X 9SG","directions":"tube: Sloane Square or Knightsbridge","phone":"+44 20 7235-7141","tollfree":null,"email":"info@cadogan.com","fax":"+44 20 7245-0994","url":"http://www.cadogan.com/","checkin":null,"checkout":null,"price":"From £209 per night","geo":{"lat":51.4969,"lon":-0.159,"accuracy":"APPROXIMATE"},"type":"hotel","id":16457,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"I stayed at The Upper House on the basis of all the TripAdvisor reviews and my experience surpassed everything I could have imagined. It is hard to set the bar high and then actually fulfill a guest's expectations, but The Upper House didn't falter at all. Like having a magic genie, everything we mentioned was miraculously realised. We chatted about our itinerary - and immediately tickets and reservations were booked. I remarked how much I liked the REN toiletries - before I knew it I was in possession of bottles and bottles of these lovely products. We upgraded to a suite on arrival and on our first night enjoyed the most spectacular view of the fireworks celebrating handover. The rooms are immaculate - restful and calming - beautiful to come back to after a busy day in the bustle of the city. I have stayed at the Four Seasons Hong Kong before, and I adore the Four Seasons generally, but The Upper House intimacy made for a better, more personal guest relations experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Furman Kling","date":"2012-01-22 12:36:15 +0300"},{"content":"I visit my friend for lunch and wine here. The service was amazing. The room is sick, not your typical one. Love the bathroom view ofnthe city. Love the restaurant on the rooftop of the hotel. Excellent","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tiara Wunsch","date":"2014-08-10 23:28:18 +0300"},{"content":"A great hotel our favorite Great design and features everything is good about the Upper House","ratings":{"Overall":5.0},"author":"Jevon Wisoky","date":"2014-02-26 04:30:15 +0300"},{"content":"Upper house is beyond amazing. I stayed in Hong Kong for 8 days in 3 hotels. The first couple nights I stayed at Marriott near the airport which was pretty good too but very standard room in Hong Kong. Then I stayed one night in Hyatt in grand central and that experience was pretty bad because the hotel is really old and the suite was really small compared to the money spent. The remaining nights I stayed at Uppder House and the experience was EXCELLENT. ROOM: The room is double of the size compared to the regular rooms in most of 4 or 5 star Hong Kong hotels although half of the room is used for bathroom space. I love the free snack and drink bar especially when I returned to the hotel late at night. The Hotel uses \"REN\" skincare products and I LOVE IT! They gave you one cosmetic bag full of REN products everyday even though you don't finish them. I had harbor veiw 70 room and the view is really amazing. I also loved the sitting area next to the huge windows over looking the ocean. I had my coffee and snack early in the morning or late at night looking at the view and listening to the iPod jazz songs the hotel provides. They also provide free wifi. SERVICE: The customer service is amazing too. I had a package delivered oversea and the front desk helped me to track it while I was out. When I returned, it was sitting on my desk already. Anything I asked, they figured it out for me with very professional manner. FOOD: I went to the 49th floor for breakfast and I wouldn't recommend it. There are TONS of good food out there. The breakfast was fancy but wayyyy over priced. LOCATION: Excellent location. It's right next to Marriott and connected to Pacific Place which is one of the stops of subway, but it has the quietness outside of the busy mall. In my opinion, the location is great. The ONLY thing I am a little bit disappointed is Upper House is sort of like an \"Apartment\" not really a \"hotel\", so it gives you lots of comfort feeling of a \"home\", so maybe that's the reason they don't have pool and spa. Therefore, I went to spas at both Mandarin Oriental and Ritz-Carlton. If you don't care about the 116th floors ocean view of Ritz-Cariton, you should consider going to the spa in Mandarin Oriental which is much better. I love their extra facilities and relaxation room. If you are willing to spend a little extra money, Upper House is definitely your choice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Estefania Runolfsdottir","date":"2013-03-22 19:15:18 +0300"},{"content":"I have stayed in many beautiful hotels in Hong Kong, but I wanted something different and exclusive. My friend suggested the Upper House, and I tried. It is located next to Conrad and Marriott, but had a definitely different atmosphere and a bit like a hideaway. The hotel makes you feel like a special person, and they treat you that way with personal attention. Upon arrival, I had reserved a standard room, but somehow they upgraded me to a huge suite. The standard room is already large to begin with, but the suite was huge. I had 8 guests come over to spend in my living room, and we all sat on the sofa very comfortably. The bathroom was surrounded by windows and I enjoyed the panoramic views while bathing. I was told not to forget closing the automatic shades when bathing after dark... The rooms are very simple designed, and thats what I like. But the amenities were very stylish and they even offered playing cards... The mini bar was all free, and they had candys and chocolates, and toilettry kit for takeaway. I loved the bathrobe, so I decided to buy one. There were few areas I found needs improvement. The carpet was stained, and some staffs seemed unexperienced. I had to wait more than 5 ringtones until the front desk answered my call. But all these were covered by all the positive aspects. The real downside for me was that they had no swimming pool and a tiny fitness room, but I was so busy that I did not have time even if they had those features. So if you are bringing children who wants to play at the pool, this is not for you. I was there for business, but I definitely would want to return next for holiday with my wife. They have a nice restaurant called Cafe Gray Deluxe, but I thought it could be better. The hotel is located by the cliffs, and my room had spectacular views of the bay, the city, and the mountains. It is near Admiralty on Hong Kong side, and just 5 minutes away by taxi from the convention center. If you want the hustle bustle excitement of Tsim sha tsui, then I don't think the location is very convenient, but if you want a quiet and peaceful atmosphere, I would recommend the Upper House. Its close to the financial district too, so good for executives on business. The rates are quite expensive, and some writes that its not worth what you are paying for, but even if I was not upgraded, I will still be satisfied with what I paid. The Upper House will be my home in Hong Kong, where I can get away from the crowd and spend time in peace and comfort. It is a hotel that makes you feel very special!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Lonnie Rice","date":"2013-07-10 05:11:08 +0300"},{"content":"I stayed in the hotel for the first time over the New Year. The management and team provided a fantastic personalised stay. Having been fortunate enough to travel significantly, and being a graduate of the hotel school at Cornell, it's not often I'm impressed, but I'm glad to say I was pleasantly so at Upper House. The staff are friendly, accommodating, and preemptive of guests' needs. The rooms are well furnished to a very high quality, and contain everything a guest could need. I very much enjoyed my stay and look forward to returning in the near future.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nia Watsica","date":"2014-04-15 21:01:08 +0300"},{"content":"The room is stunning. It is about as well appointed as any hotel room I have stayed at. The service is impeccable and all in all just a wonderful experience. I hope I have to stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Yvonne Smith","date":"2014-02-25 16:49:01 +0300"},{"content":"This is an oasis in a crazy and wonderful part of the world, you whiz and whirl around Hong Kong all day and get back to a brilliantly designed environment that i just did not want to leave. The rooms are truly exquisite in every possible way and the staff are brilliant !! Upper House is a 15 out of 10 for me i have stayed at some of the best hotels in the world and this is one of my favourites particularly for business, it all just works ..beautifully ! Enjoy..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kimberly King","date":"2015-03-31 11:55:04 +0300"},{"content":"We ended our 4 week travel around Europe with a one night stay at The Upper House and it was a the perfect way to end a massive and slightly exhausting trip. We only wish we could have spent more time there! Very spacious and we had the lowest end room. Bathroom was amazing with a beautiful bath with great views. Their maxi bar is a great idea - you get free water, beer, soft drink and snacks. Other hotels could definitely learn from this, as well as the free wifi which was reasonably fast. The concierge was very helpful when looking for a place to have dinner but we ended up in the hotel's 1 Michelin starred restaurant - which was wonderful (I'll review this separately). It's definitely one of the best rooms we've ever stayed in and if they had a pool and spa then it would have been one of the best hotels. (There are other hotels close and I think you can get access to their pool - maybe for a cost.) We're already thinking about when we can come back to Hong Kong just so we can stay at The Upper House! Would highly highly recommend!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Elijah Leannon","date":"2015-10-03 18:22:23 +0300"}],"public_likes":[],"vacancy":false,"description":"Cadogan is a classic Edwardian townhouse hotel, provides comfortable elegant five star hotel accommodation and service.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}