{"title":"Joshua Tree National Park","name":"Hidden Valley Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":34.01722,"lon":-116.16167,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12925,"country":"United States","city":"Twentynine Palms","state":"California","reviews":[{"content":"We stayed in a \"master tub suite\" and the room was very nice - it did in fact look just like the pictures on the website with contemporary furnishings and soothing colors. The soaking tub was comfortable for two and the separate shower and bathroom were very spacious. The bed and linens were comfortable and the room was quiet. The hotel had a very comfortable level of service - as much or as little as you wanted and everyone was very friendly and helpful. Although some reviews and travel books I've seen mentioned negative things about Napa as a town, we liked it. There were cute shops, lots of nice restaurants and bars, and pretty, walkable streets. Apparently, a lot of work has been done since it flooded some years back. It may not be a typical tiny California wine town, but I wouldn't consider it very \"urban\" either. The hotels also seem to be a much better value than in places like Yountville. I think we got a much nicer room for the price at Avia than we would have in the picturesque wine towns. Avia also has a nice location within walking distance of everything in the town. We did not try the restaurant.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Elise Wisoky","date":"2013-05-07 10:01:54 +0300"},{"content":"Enjoyed the room, and entire stay. If you are in Napa area, a must. Be sure to visit Domaine Chandon in Yountville!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Moriah Bartoletti I","date":"2013-09-21 23:57:33 +0300"},{"content":"Avia is an ultra modern hotel, located right in the heart of Napa's downtown. Great location and amenities, unlike any other hotel I had seen. Concierge was available throughout the day and was very knowledgeable of which Wineries specialized in which types of wines as well as which required appointments for tasting and which were public. This saved us a lot of time locating our top priorities to visit. Rooms were comfortable and quiet, but the lobby was a social scene in the evenings. Nice mix! Food in the restaurant was very good and the ambiance was relaxed. Really a great hotel. I would definitely recommend it!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Idella Eichmann","date":"2014-11-28 00:40:11 +0300"},{"content":"We stayed here in may 2010 for a few nights...Its a beautiful hotel very clean and in a great location! So close to all the wineries! The staff were very helpful and suggested some great wineries to visit! The hotel room was decent size and I loved the bathroom!! awesome shower! We will definitely stay here again! Cheers!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Marty Beer","date":"2013-05-20 10:14:38 +0300"},{"content":"We loved the AVIA Napa! This was the first time in Napa for my boyfriend and I. Originally we wanted to stay at another hotel, but it booked up fast so we decided to go with the AVIA. I'm so glad things worked out that way, because we had the best time! The room was fantastic and so was the location. Everyone was extremely kind and helpful, and the concierge helped provided us with tips and passes for free tastings at the wine salons downtown. Mostly everything was within walking distance, which was ideal for us as we didn't want to deal with driving or paying for a shuttle. I cannot say enough about the beautiful room. The swivel TV was a perk- you could adjust it to watch from pretty much everywhere in the room (including the bathtub). The only slight downfalls were the view from our room (walls from both windows) and excessive noise during early hours (many bottles clanking together around 5 AM and construction/drilling noise). In the grand scheme of things, the positives far outweighed the negatives. We intend to come back in the summer and stay at the AVIA again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Magali Beahan","date":"2014-02-06 03:17:21 +0300"}],"public_likes":["Donnell Halvorson","George Schmidt","Hilbert Heller V","Brooke Simonis","Edwin Halvorson"],"vacancy":false,"description":"Hidden Valley is the first campground after the West Entrance Station.  45 sites.  There is no water available and motorhomes and vehicles longer than 25 feet are not permitted.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}