{"title":"Rum","name":"Camping Cabins","address":null,"directions":"At the campsite","phone":null,"tollfree":null,"email":"RumKabins@gmail.com","fax":null,"url":null,"checkin":null,"checkout":null,"price":"£22 per night (up to 2 people)","geo":{"lat":57.01021,"lon":-6.27506,"accuracy":"APPROXIMATE"},"type":"hotel","id":24608,"country":"United Kingdom","city":"Highland","state":null,"reviews":[{"content":"Our trip began as a two day trip and ended up being a week long trip!!! This hotel is a great value the rooms were very reasonable and there was a lot of things on site to do. The roller coaster rides are a must even though I think they are a little pricy. If you like taking risks the SKY JUMP is a MUST. FYI the sky jump costs around $100-$120. The Top of the World restaurant has the best view of Vegas and the food is great. The shops on site have everything you would want from clothes to drinks and more food and some specialty stuff like a candy store and a spa. We are not much for gambling but after we learned craps and roulette from a good and patient dealer we got hooked for a little while. The concierge was very helpful in getting us information and tickets on shows. I highly recommend the ULTIMATE VARIETY SHOW. It is a great hotel and the room prices are very, very well priced especially for Vegas.","ratings":{"Location":4.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Claud Moen","date":"2014-12-28 09:44:17 +0300"},{"content":"My now Husband && I traveled to Las Vegas to be married and chose to stay at the Stratosphere Hotel. I first chose this hotel because I did not plan on visiting the \"Strip\", i found very reasonable rates and there were no exorbitant holds for incidentals or resort fees for unnecessary amenities. We stayed Monday night (September 5th, 2011) in a SELECT ROOM. I booked through TripRes.com and got the room along with TWO UNLIMITED TOWER RIDE PASSES for $90. Unlimited Ride Passes are $34 each regularly so this was a great deal. The room itself was great especially for the price paid. It looked exactly as pictured and was clean. We were on the 9th floor, Room 022 and I did not request a view. The second night after getting married we stayed in the Oasis Suite. They allowed us to check in early around 11am. When I walked in I was floored. Let me throw in that it is suppose to be a non-smoking suite but it smelled like smoke upon entry. Other than that the room was all we wanted and more. There were so few pictures available for preview so I wasn't exactly sure what I was getting myself into but I was pleasantly shocked. It was a very romantic room. Comfortable King Bed that we did not want to get out of. Two flat screens, one in front of the bed and the other in front of the Sleeper Sofa. Small table for two to dine romantically. The Jacuzzi was accessible from the room as well as the bathroom and it was huge and very relaxing. The bathroom altogether was huge and elegant. I've included plenty of pictures so you can see for yourself. We did not utilize any of the restaurants but made frequent trips to McDonald's which is located on the 2nd floor. Regular McDonald rates, Dollar Menu included and they stay open all night. The morning in the Oasis Suite we ordered BREAKFAST IN BED FOR TWO which came to only $39 with all taxes, charges and gratuities included !!! Now I think that's great. The food was upstairs quickly and EVERYTHING was delicious. We ordered French Toast, Cheese Eggs, side of Fresh Strawberries and 2 Orange Juices. The previous morning we ate at Denny's which is less than a 5 minute walk from the Hotel. We had breakfast for two there for only $17. All in all for what we went for the Hotel was great. I will add that we had no problems getting to and from the airport as we paid for Round Trip Shuttle Transportation upon arrival in Las Vegas. We rode with Ritz Transportation however there are various shuttles all lined up at the Baggage claim for your choosing. It was $32 ROUND TRIP for the two of us to be transported to Stratosphere. On the morning of departure they were there on time and yes they do pick you up 3hours before your flight's departure as it is a shared ride and most airlines have a check in time limit. There is a store on the 2nd floor that sells alcohol at a reasonable price along with other snacks, beverages and inexpensive souvenirs. Also a 24 hour Gym on the 2nd floor as well. The only negatives that I will state about the Hotel is that we felt that the pool didn't stay open long enough. It closed at 8pm and we NEVER had the time to visit. There were no Microwaves in either room. The Oasis Suite had a refrigerator but a Microwave would have been nice. Lastly this hotel has no business center which presented a huge inconvenience for us because we had no way to print our TripRes.com itinerary in order to claim our ride passes. They have a couple of computers on site however there is a minimum of $5 charge and they also place a $25 hold on your credit card. I will add that the staff at the Ticketing counter was helpful in resolving this problem. All in all it was a great, comfortable and romantic stay and we would surely stay again especially in the Oasis Suite.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Ernestine Kutch","date":"2015-03-14 23:03:08 +0300"}],"public_likes":["Hayley Hermiston","Wade Boyle"],"vacancy":false,"description":"Two wooden cabins are available, each with 4 single mattresses. These are fully insulated, with solar lighting.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}