{"title":"Los Angeles/Downtown","name":"Ace Hotel DTLA","address":"929 S Broadway","directions":null,"phone":"+1 213 623-3233","tollfree":null,"email":"enquire.dtla@acehotel.com","fax":"+1 213 623 6163","url":null,"checkin":null,"checkout":null,"price":"From $199","geo":{"lat":34.041494,"lon":-118.256879,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16630,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We spent 2 nights at the Doubletree before heading over to Rio Grande, PR. It has a central location with easy access from the airport and to Old San Juan. It is also only a 3 block walk to Ocean Park Beach. Perfectly clean -- and I am a clean freak. One of the staff here said it was renovated 2 years ago when purchased by Hilton. All of the staff is super friendly. The pool area is nice with comfy towels and lounge chairs along with a jacuzzi. The hotel is in a heavily populated area so things are pretty compact and there is not much of a view due to the tall buildings all around. They have done a good job of putting palm trees, etc around to make it feel less \"citi-fied.\" There are many restaurants within walking distance so no need to drive around. We enjoyed \"Silk\" --they serve sushi, and chinese cuisine. Parking is a bit much at $20/day valet or $15 self-park, but comes with the terrifory. Oh yeah, and the warm cookies are to die for!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Alvah Hodkiewicz","date":"2014-01-31 08:14:57 +0300"},{"content":"Stayed here 1 night pre cruise and everything was what we hoped it would be. Never met a more friendly and helpful hotel staff. Although our upgraded rom wasn't quite ready when we arrived we were given some water and the famous warm cookies and we sat outside for a few minutes in the delightful surroundings of the pool. The room was great, everything you need and very modern. The supermarket across the road was a bonus for buying toiletries etc., to take on the cruise. We walked around the corner to Bebo's Cafe which was full of friendly locals(always a good sign) and we enjoyed an excellant, reasonable meal and a half pitcher of Sangria. We then headed back to the hotel and had a drink under the stars around the pool along with other people who were using the pool or just sitting around. Only thing that could be improved is that the service at breakfast was a bit slow, but we were on holiday so that didn't realy matter. And an added bonus was that we got to meet the charming and very handsome Jose (operations manager) who told us all about his island of Peurto Rico which he obviously loves. Thanks to everyone at the Doubletree.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Octavia Olson","date":"2015-08-11 14:45:24 +0300"},{"content":"This is by far the nicest and least expensive hotel in the Cantado area. It is two very short blocks to the beach and the neighborhood is very safe. Our room was spotless and modern, with a design that made great use of the space. You get a microwave, fridge and safe along with great Neutrogena bath products. The place is so modern and beautiful with a fabulous pool. Be sure and ask for Miguel Isaac, an assistant manager. He is so helpful and knows the area well. We left some items there and he helped get them back, a great person and a great hotel!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Rhea Rowe","date":"2013-03-10 02:35:13 +0300"},{"content":"After scoring such a great deal on Travelocity, we couldn't have guessed that this hotel would have been as wonderful as it was. The newly renovated rooms are very clean and wonderfully appointed (w/ fridge and microwave), our breakfasts at Michaels and Under the Trees (both on the property) were on point and reasonably priced, and most importantly, the hospitality of the staff (especially Yodil, Peter, and Miguel) was comforting and delightful. It's approx a 3 block walk to the more quiet \"locals\" beach and 4-5 to the main strip of resorts and casinos. For us it was not worth the $300-450 more to stay on the typical resorty main strip (note that most \"resorts\" on the strip seemed older and much less contemporary than this hotel). Pool was small but clean and while families were there, it was certainly not overrun with kids like others. Ask for Yodil Caban, the General Manager, and he will make sure that your stay is outstanding. These folks don't just talk the customer service game, they live it. As they told us, the smaller size of the hotel allows them to be more personally attentive. It's a $0.75 bus ride to Old San Juan or a quick $12 cab ride at night (note that cabs are more expensive at night so it was probably cheaper during the day). If you're in Old San Juan and want a great dinner in a posh, elegant space, check out Marmalade. Expect at least $40-50 per person, but the chef clearly knows and loves great cuisine (note: this is not local Puerto Rican food, but delish nonetheless). Enjoy!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Vivianne Rodriguez DVM","date":"2014-03-21 08:19:48 +0300"},{"content":"Clean, comfortable room, great bed and shower, friendly and responsive staff. There is a huge 24-hour supermarket across the street and the beach is a short 3 block walk.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Nellie Kemmer","date":"2014-06-21 20:29:12 +0300"},{"content":"well ... where to start? all the bad reviews are true! On the positive side, most of the staff is friendly and will go the extra mile but two of the receptionists could do with more training on how to greet/deal with customers and the waiter who served us the first (and only) time we ate at the restaurant could gain on honesty. In term of location, I understand it is a great place for surfers as it is close to many spots but that's it. Although many other interresting places (suggested in their handbook) are from reachable distance if you have your own transportation and are planning to do some sightseeing. On the other side, as we tour the hotel on our first day there, we realised (from the view from the restaurant) that it appeared to be still in construction ... however other bits tended to prove that it was either old or badly maintained. A case in point is \"the whale\" a small slide for kids in the pool area. The paint on it is totally faded and in some area the steel even shows. Another review mentionned the plumbing system, and I thought come on, that was until I realised I could hear my neighboor shower, flush their loo ... and that the pressure of the water in the shower also changed if my neighbour was having a shower at the same time. The fact that I could hear all this was a good indication of the soundproofing as well ... paper thin walls and doors and noisy a/c made my nights there virtually sleepless. Oh nearly forgot ... what they say about the critters in and outside the pool is true too ... in the shower next to the pool we were greeted by a cosy spider (in full swing in its wide web) and a dead cocroach and inside the pool ... an unidentified amphibian. I stayed in Puerto Rico for 10 days and I went to three different hotels, this one was the worst ... and for that price, I will not recommend it to any one I know!!!","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Davonte Botsford","date":"2013-03-08 21:31:27 +0300"},{"content":"The view is without a doubt breathtaking. And that's also without a doubt the only good thing about this place. From the disappointing and unwelcoming staff, the lack of maintenance, smelly rooms (and not good flowery smell), torn fridge in the room to the vase of old dirty water and dead flowers at the Front Desk this whole experience was simply HORRIBLE. The \"tongue\" of the whale at the pool is literally black, the stairs leading to the pool are covered with a green moss like $@!#% (slippery) and the pool itself is dirty and full of leaves. The lobby area is very dirty, the floors very dusty. No elevators, and the stairs handrails very rusty and sticky. None of the staff has a uniform, their wear anything they want, any color, any style, and the housekeepers are wearing nurse uniforms. Very unprofessional. And in fact the musty stench in the rooms was so horrible that we could not stay at all. We ended up having to move to another hotel. So please do not waste your time and money. Do not even consider this place. It looks NOTHING like the internet page!!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Tomasa Ryan","date":"2012-01-02 21:14:23 +0300"},{"content":"service and welcome was great. not from there im from michigan somebody recomendme there and i love it have fun good price. good understood. wao a maissing. i recomend this place 100%. and im a manager in hotel too. radisson hotel in grand rapids michigan. so i know whats a good service and stay is. love it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Summer Bechtelar","date":"2013-08-30 07:46:58 +0300"},{"content":"Let me just say that this was our first trip to Puerto Rico and we LOVED it here. Loved it so much that we have had a REALLY hard time adjusting to home again and we can't wait to come back soon. As far as the Embassy Suites: Pros:1. The room is a suite. Anyone with small children knows this is important. We could put the kids down for bed or nap and still be in our living room talking and that was great. 2. They serve free breakfast every morning and than we only needed a small lunch or snack before dinner. 3. They have a managers reception at night with snacks, juices, pop, and drinks. We stopped here every night before we left the hotel for dinner. It was a great before dinner appetizer that helped hold all of us over before our later dinner. 4. The beach was beautiful during the week. The Embassy Suites section was nice and it was great to have chairs, towels and umbrellas at the beach. 5. The pool, although crowded, was nice and perfect for the kids to play in for hours while I could read a book. Cons: 1. It's not that clean people. We have traveled to a lot of Embassy Suites and this one is by far the dirtiest one we've stayed at. At first glance the rooms look clean, but then you start looking in the corners, at the carpet, under any furniture, closer at the fixtures in the bathroom and you can tell that these rooms haven't been deep cleaned in a LONG time. Gross 2. One the weekend it was crazy crowded. We had to wait 20 minutes in the breakfast line, and same for managers reception. It was hard to find seats and could barely find anywhere around the pool. That thing that was the worst was the cleanliness at the meals during the busy weekend. For example, the bacon tray had more bacon hanging outside on the counter than in the actual tray. I looked at my husband and said is that supposed to be decoration or something? It was gross and wouldn't pass food codes for sure. I understand that they are busy on the weekends but then that shouldn't surprise them, and they should bring in more staff to handle the bigger crowds. 3. The front desk staff were not great. They were friendly, but always talking to other co-workers and I felt bad interrupting them. I would go down there and ask for towels to be delivered to the room, it never happened. 4. We pre-paid for our trip on the embassy website and it said it covers all taxes and fees. They racked on more than $300 worth of taxes before we checked out. I went to the counter and showed them my receipts and they weren't willing to budge at all. So frustrating when you prepay for things. If they have a \"special tax\" then they should add that in when you prepay. Overall we again LOVED PR, an amazing island with great culture and even better Puerto Rican food. I highly recommend going to see El Morro fort, the El Yunque rain forest, going to Luquillo beach and check out all the food stands, and our favorite going to Old San Juan and spend the day there. As for the Embassy Suites, I wouldn't be that excited to stay there again. It worked for us mainly because we were traveling with small children but I would not be that excited to stay there again. Honestly I would stay somewhere closer to Old San Juan...","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Elaina Morissette","date":"2014-01-27 07:53:20 +0300"}],"public_likes":["Mrs. Mckenna Kassulke","Marion Rowe"],"vacancy":true,"description":"Opened early 2014 in the historic United Artists building that was built in 1927 for what was then a maverick film studio. Includes free Wi-Fi and air-con. Terrace Suites are 633 square foot and include a private kitchenette, private terrace; some have Ace x Rega RP1 turntables and acoustic Martin Guitars.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}