{"title":"San Diego/Old Town-Mission Valley","name":"Ramada Mission Valley","address":"4380 Alvarado Canyon Rd","directions":null,"phone":"+1 619 281-2222","tollfree":"+1-800-905-3206","email":null,"fax":null,"url":"http://www.ramada.com/hotels/california/san-diego/ramada-mission-valley-sdsu/hotel-overview","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.7802,"lon":-117.09929,"accuracy":"APPROXIMATE"},"type":"hotel","id":25303,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"My husband and I spent 10 nights at the Doubletree in Mission Valley it was just okay and for the first time I had to keep calling to get things resolved. I requested a refrigerator 2 months prior to our arrival. I called to confirm the request and was assured it would be in the room upon our arrival. After our 10 hour flight no fridge. We were told they were all sold out and that we may not get one. After about 2 hours, we did get one. We kept getting calls about having no water for 2-3 hours each day for the majority of our stay. One night a pipe broke and water was shut off. We could not shower nor flush the toilet. Then when water was restored for the rest of the hotel our room was not turned back on and we were til midnight before we got water restored. This again was after repeated calling. They did give us a free breakfast the next morning for our trouble however, we really rather of had a shower that night. Then one day we got back after being out all day and our room was not cleaned. I had to call and the maid came and did clean our room. It was not vacuumed the whole stay and the tub was not very clean. The pillows were not comfortable at all and the bed was just okay. BEWARE OF THE INDOOR POOL DECK it is slippery. Oh and bring towels because they sometimes run out and you might be left dripping wet without anyway to get dried off. We were charged for parking when we didn't even have a car the whole time we were there. It was resolved but it should have never been added. People working there are not very friendly nor do they act as thought they are happy to accommodate your needs. We will not stay again. Sorry the free cookie (which we didn't get) is not enough to entice us to go back. Yes, it is in a nice location trolley across the street not many places to eat but you can shop at Food 4 Less down the street if you want snacks and fruits.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":3.0,"Value":2.0,"Service":2.0},"author":"Devin Keebler","date":"2012-02-08 15:57:18 +0300"},{"content":"I stayed here for a work conference and thought the hotel was very good. It is not very close to the downtown area of san diego, but there is a metro stop directly across the street from the hotel with easy access to all the San Diego attractions.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Mr. Lupe Maggio","date":"2014-05-10 20:21:20 +0300"},{"content":"The rooms are a bit outdated, but I found the room quiet and the bed comfortable. The facility is very nice and the staff pleasant. The exercise room is large and has more equipment than many hotels. My single complaint is that maintenance issues are frequently found, very much like staying home. These were mostly little irratating things like the sink faucet was difficult to turn off, the rubber covering on the eliptical machine was detached and hanging loosly. The most irritating maintenance item was that one of the elevators had a button that worked very poorly that went to my floor. I stayed four days and all of these small issues remained. I still enjoyed thed stay and would stay here again. Nice people and a nice place.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Mellie Emmerich","date":"2013-09-19 08:42:49 +0300"}],"public_likes":["Erwin Carroll","Trenton Hessel"],"vacancy":false,"description":"Hotel with swimming pool and complimentary continental breakfast.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}