{"title":"Altrincham","name":"Mercure Altrincham Bowdon Hotel","address":"Langham Rd, Bowdon","directions":"Follow signs to the M56 Manchester Airport and come off at Junction 7. At the roundabout at the top of the long slip road turn right onto the A56. At the next set of lights turn right into Park Road. This leads into Langham Road and the Hotel is approximately one mile further down on the right hand side.","phone":"+44 161 928 7121","tollfree":null,"email":"h8198@accor.com","fax":null,"url":"http://www.mercure.com/gb/hotel-8198-mercure-altrincham-bowdon-hotel/index.shtml","checkin":null,"checkout":null,"price":"From £48","geo":{"lat":53.37808,"lon":-2.35202,"accuracy":"APPROXIMATE"},"type":"hotel","id":594,"country":"United Kingdom","city":"Bowdon","state":null,"reviews":[{"content":"My favorite type of hotel is the kind that makes you feel like you're staying in an incredible home, without any traces of those standard, cookie cutter rooms that are a dime a dozen. I prefer something that offers a distinct personality but also a calming sense of familiarity. That said, I hereby declare that the Hotel Andra in Seattle is the Tina Fey of the hospitality industry - alluring and cool and quirky and fun, all rolled into one. It's a rare find that offers exceptional design, ample space, distinct character, and stellar customer service. I came across the Andra via my secret weapon, aka my friend Steve who just happens to work for the Seattle Convention and Visitor's Bureau. With a prime location in the heart of Seattle's Belltown area and moderate price range (under $200/night), I knew we were off to a good start, and after poking around their website, the vibe and decor seemed like the right match too. I was instantly drawn in by the sleek lighting, clean lines, and tasteful color palette of muted blues, greys, and taupes, with touches of Scandanvian inspiration. The Andra was our last stop during our recent honeymoon vacation, and prior to checking in, I had just made my detour to Cupcake Royale. So as I approached the reception desk with a box of treats in hand, in lieu of the standard welcome, the person behind the counter launched into a bit about how nice it was for me to bring him cupcakes. I played right along - I love it when people loosen up and goof around like that, especially people who work in the higher end of the hospitality world, where more often than not you'll encounter some pretty stiff attitudes. The front desk staff seemed to think they were in a improv group, with me as their special guest star, so score one for the Andra. Score two was finding out upon check in that we'd been upgraded to a suite (thanks to the little Upgrade Fairy, also known as my friend Steve who had put in a call to the manager). Also, the timing couldn't have been better in terms of being granted additional space - we'd accumulated a lot of goodies over the past week, and found ourselves in a serious repacking situation, which meant needing some room to spread out. Wish granted: a corner suite with a spacious living room area that included a flatscreen TV, giant desk, and full length mirror, along with another flatscreen TV in the separate bedroom. The bathroom was also really cute and stylish, and the stash of Face Stockholm products made me a very happy girl. The Andra proved to be the perfect end to our trip - so if you're headed to Seattle, this is the place to stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Constance Koss","date":"2013-04-13 10:05:24 +0300"},{"content":"The hotel looked disappointingly ordinary from the outside, but once you get into the small lobby area, the atmosphere is stylish and cheerful. The room was extremely spacious, with a good desk area if you needed to do some work, and a great marble surface for making hot drinks. The bed was very comfortable, and the plasma TV screen and furnishings were modern and stylish. The staff were courteous and helpful at all times. My only criticism was the room service from the Lola restaurant. Not only did they deliver the wrong order, but it was over-salted and over-priced. They did however give me a full refund without quibbling when I complained. The hotel is in a very central location, and I would definitel recommend it to anyone who wants to stay in downtown Seattle.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Warren Monahan","date":"2014-01-10 19:18:12 +0300"},{"content":"My girlfriend and I stayed at the Andra over New Year's Eve. We booked a \"package\" that included a small suite, champaign, and a couple of other add-ons. If you are interested in exploring Seattle, the location is excellent. It is close to night life, good restaurants, and other points of interest in the city. We didn't interact much with the staff, but when we did, they were fine. We had no problems at all, and found the lobby and room decor to be pretty cool. On arriving, we found our room had a view of a building immediately adjacent. We asked for another room and were accomodated. We did not find the hotel overly noisy (although we were out pretty late ourselves). While we didn't really put the Andra to the test, we were satisfied with our experience and the value received for what we paid.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Lester Miller","date":"2015-07-05 15:23:22 +0300"},{"content":"We just returned from a 4 day stay in Seattle at the Hotel Andra. We had the studio queen. The rooms are not huge but they are BEAUTIFUL, Trendy and perfect - Like staying at the W but without the insane cost. Our room was 169$ a night booked through the hotel's website. It is in a perfect location near all of the great areas. We walked everywhere. There are awesome restuarants right nearby in the up and coming, funky neighborhood of Belletown, like - FlyingFish (HIGHY recommend), Toi, great Thai, Mama Mexico, Assagio (next to the hotel). I absolutely LOVED Seattle, loved the location of this hotel and would absolutely stay there again. The beds were the most comfortable and luxurious I have slept on outside of the W. The rooms are funky, the people are so nice and friendly and helpful. The rooms remind me of a room at a Spa - very calming and serene. The lobby is cool and trendy, yet cozy. The bar is great... The area is perfect - great for walking east to the VERY COOL area of Capital hill, or to the dowtown water front, it is also right near the shopping district and very close to the Space Needle... it's all you could ever want.....","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Janelle Wolf","date":"2013-12-20 03:16:25 +0300"},{"content":"This is a great hotel in a great location. We could walk to Pike's Market, the Space Needle, the Monorail, the Waterfront, shopping, bars and restaurants in no time flat. The hotel does not have some of the amenities as other luxury hotels (in-house spa, pool), but it has a lot of character in the style of the old luxury hotels, like the Drake in Chicago. Unlike some of the other reviews for this hotel, the staff was extremely friendly and helpful (maybe the Management responded to the negative feedback). My only complaints were: the street noise during weekday commute hours (windows need better insulation) and both of our room keys kept demagnetizing. Otherwise, the Suite was very spacious and comfortable. In fact, I have never slept in a more comfortable and cozy bed. Bathroom is small, but cute and Art Deco-like. The decor in general is very new and Ikea inspired. Valet parking was quick, efficient and friendly (always asked if we needed directions). I highly recommend Lola's (located in the lobby) for breakfast and a nightcap. There was absolutely NO onion smell. I definitely would stay here again.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Paris Hodkiewicz","date":"2013-06-05 19:27:08 +0300"},{"content":"We really loved this hotel. The main building is beautiful although we were staying in one of suites in the garden. Another review here mentions the smell of mould in one of these, but this problem had gone by the time we came here in autumn 2011. The suite itself was beautiful, huge bedroom, flatscreen TV, small private patio area screened by shrubbery, beautiful and large bathroom with spa bath. And so quiet and peaceful, with a walk through the garden in the morning for breakfast in the conservatory. It was also spotlessly clean. It didnt serve evening meals but had a bar. 10 mins walk from Bologna station but so what? Nothing much around the area to speak of but we found a nice local restaurant (can't recall the name!). It was only a few minutes on the underground into the centre of Rome. Would highly recommend this hotel to anyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Antonietta Friesen","date":"2015-11-05 00:34:18 +0300"},{"content":"If you are going to use a last minute agent to book this hotel then I suggest you choose another as you will be treated as second class citizens. I booked through Expedia, on arriving at hotel we was shown to a basement room, very dark and extremely small, I certainly not what you would expect from a 4* hotel. On requesting an upgrade for which we were prepared to pay for, we were told the hotel was full. Later we found out this was not true. The whole experience made sure we left our room after breakfast and did not return until we were exhausted from seeing the wonderful sights of Rome. I would not recommend this Hotel to anybody; there are far better hotels to choose from.","ratings":{"Service":1.0,"Cleanliness":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":1.0},"author":"Lolita Zulauf","date":"2013-01-21 08:12:02 +0300"},{"content":"This hotel was listed as a 4 star hotel but it is not a 4 star. I read about the beautiful views of the water and thought that would be nice. Our view was the parking lot and the train crossing. The trains come through about once and hour, so there is no restful sleep when you have one of those rooms. The room was quite small, but the bathroom was a good size. There is no dresser in the room. I also found it odd to have the coffee machine in the bathroom, which doesn't seem very sanitary. The hallways are dark and dreary and look like they need a good cleaning. Our son lives in Seattle and we were going to drive his car back to the hotel in the evenings and park it there, only to find out there was an outragious fee to park there. They don't let the guests park there for free even though they have a huge parking lot. The one good thing about the Edgewater is that they have a very friendly and professional staff. We will not stay there again.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":3.0},"author":"Beatrice Fadel","date":"2015-02-03 04:47:59 +0300"}],"public_likes":["Alene Gusikowski I","Blanche Parisian","Herbert McGlynn","Lillie Schumm","Neva Jewess","Elisha Stanton","Katlyn Konopelski"],"vacancy":false,"description":"A 3 star hotel located about a mile from Altrincham town centre but quite close to Hale Village","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}