{"title":"San Francisco/Union Square-Financial District","name":"The Donatello","address":"501 Post St","directions":"at Mason","phone":"+1 415 441-7100","tollfree":null,"email":null,"fax":null,"url":"http://www.shellhospitality.com/hotels/donatello_hotel","checkin":"3PM","checkout":"12PM","price":null,"geo":{"lat":37.7879,"lon":-122.4103,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26213,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Highly recommend this hotel - entire staff from Sales & Conference Services to the Valet, were easy to work with, knowledgeable, polite, friendly, welcoming, etc.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jeramy Ferry","date":"2013-11-11 00:40:31 +0300"},{"content":"Spring package is an unbeliveable value including valet parking and breakfast. Arrived to check in and the gal (new, limited training) was unable to locate my reservation. After 10 mins, she found it and proceed to go thru the details in a very slow manner, suggesting I join their Golden Circle program. Well, I was already a member, and needless to say, their reservation neglected this. Upon presenting my card, she attempted to find a room upgrade, but the manager on duty stepped in to speed up the process (line-up was growing). In a very unpleasant tone, he advise no other room was available. Breakfast also involved a long wait for a table, not that they were full, but under staffed. Modern facility, but service is far inferior to Shangri La hotels in Asia.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Ignatius Kulas","date":"2014-07-22 11:43:37 +0300"},{"content":"No details left unturned, from Valet check-in to luxurious room. Bathroom was beautiful with features such as heated bathroom floor, inlaid TV in mirror, large tub and shower. Suite had everything imaginable, including shoe kit including polish and brushes. Push button drapes opened to view of the downtown city location. Full bar included any type of both non-alcoholic and alcoholic drink and BC wines. Expresso coffeemaker and kettle included for tea and coffee. Room had great light for reading and a large business desk with laptop plugins and adjustable lighting. Fresh fruit was left in room after turndown service. Would rank this among top hotels I have stayed in travels throughout North America.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Tyreek Hickle","date":"2012-12-18 19:51:36 +0300"},{"content":"I stayed at the hotel in April 2009 so it had only just opened. The underground arrival is slightly weird but very efficient and I was escorted up to my 'upgraded' suite. I had book a deluxe corner king with balcony and was given a suite that, whilst beautifully appointed, had the most odd proportions and NO balcony. Many of the things one comes to expect from Shangri-La in Asia were in place - I took breakfast in my room each morning and it was beautifully presented and perfectly prepared, the bathroom was almost as big as the sitting room and was wonderfully appointed. The bedroom had a huge (50\"?) wall TV. It was so huge that the only place from where you could properly view it was in bed! When you take the elevator to the lobby you find yourself in a rather strange granite sided 'void' or that's at least how it feels. I took lunch one day at Market and it certainly lived up to Jean-George's East Coast reputation. In summary, certainly worth the special deal that I booked but will find it difficult to justify the racj rate of anything close. It's a very good addition to the Vancouver scene and may help bring the standard of other 'wannabe' properties (q.v. the Grande Residences at Sutton Place) up to scratch.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Kurt Barton","date":"2014-04-25 04:00:09 +0300"},{"content":"The hotel was very nice, new and clean. Internet was included, but there was no breakfast. Also the hotel was kind of in a sketchy area of town. Ok if you need to be close by the airport, but I wouldn't walk around there.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Kendrick McClure","date":"2014-01-14 17:47:58 +0300"},{"content":"I stayed at this hotel for two weeks while attending a class in Phoenix. The room was very comfortable. The breakfast was great and the weekend bartender Janessa was very nice and would go out of her way to make things enjoyable for someone far from home. I enjoy a couple drinks in the evening to break up the grind of being on the road. I avoided the bar during my stay during the week because the weeknight bartender seemed to be only interested in a tip and didn't have the customer service skills like the weekend bartender Janessa. This is a great place to stay just eat out during the week.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Zander Jast MD","date":"2013-06-29 14:16:52 +0300"}],"public_likes":[],"vacancy":false,"description":"94 deluxe rooms, the most spacious accommodations in San Francisco. Elegantly decorated with original Italian art, Travertine marble, Venetian glass and European antiques.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}