{"title":"Paris/15th arrondissement","name":"Mercure Paris Tour Eiffel Grenelle","address":"64, boul de Grenelle","directions":"Dupleix Station, Metro 6","phone":"+33 1 45 78 90 90","tollfree":null,"email":"H1598@accor.com","fax":null,"url":"http://www.mercure.com/gb/hotel-1598-mercure-paris-tour-eiffel-grenelle/index.shtml","checkin":null,"checkout":null,"price":"€125+","geo":{"lat":48.85054,"lon":2.29237,"accuracy":"APPROXIMATE"},"type":"hotel","id":21653,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I was traveling on business to Indianapolis this month (Oct 2011), and was unable to locate a good hotel rate downtown (the Colts were playing that weekend), so stayed on the north end at the Embassy Suites. The lobby was very nice, with efficient check-in, clean room and bathroom and a simple, but good, breakfast. Maybe because it was a Sunday night and/or low occupany rate, that the only \"hot\" breakfast items were omelets - no sausage, pancakes, etc. However, it was fine and was not a big deal. I like Embassy Suites and always enjoy my stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Timmy Metz","date":"2015-09-19 05:20:56 +0300"},{"content":"Our son graduated from Indiana University, Bloomington in May of this year. I began my hotel search in January. I thought that was enough time....wrong! All hotels anywhere remotely close to the school was booked solid. If there were a few rooms left, the price to accommodate all my family members was almost enough to pay another semester at IU! To my dismay, I search and searched. Finally I found Embassy Suites-North in Indianapolis. It was a drive to the University, but I didn't mind because the price was somewhat reasonable and the staff was awesome! Lassandra, one of the cooks at the food court, was amazing! She always greeted you with a smile in the morning and her omelets were to die for! Also, Supervisor, Debbie Flemming-Little at the Front desk, was very nice. When we checked in she was the only person at the front desk, but she handled our family and the other guests checking in with skill and finness.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Turner Bode","date":"2012-02-15 02:57:45 +0300"},{"content":"The hotel of choice for our Indy business travels. Staff treats guests like family, notably, our breakfast chef, Lassandra. She has a way of making every customer feel special and at the same time accurately and efficiently handle our breakfast orders.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Miss Benedict Langosh","date":"2012-11-30 21:33:44 +0300"}],"public_likes":["Erich Koss","Marilie Borer","Foster Runolfsdottir"],"vacancy":false,"description":"Not to be confused with the other Mercure, this one is not far away but in quite a different setting, facing the busy Boulevard Grenelle and the overground Metro 6 line. Neither as quiet nor as modern or comfortable as the other Mercure. On balance it is one of the cheaper hotels in its class close to the core tourist centre of Paris.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}