{"title":"San Francisco/Civic Center-Tenderloin","name":"Hotel Bijou","address":"111 Mason St","directions":"at Eddy","phone":"+1 415 771-1200","tollfree":null,"email":null,"fax":"+1 415 346-3196","url":"http://www.hotelbijou.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7845,"lon":-122.4096,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25595,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed one night at the Chancellor and enjoyed the great location, access to the trolley, room, and delicious breakfast. The staff was very friendly and helpful. Our room, located on the backside, was very quiet while our friends' room, located on the front side, was noisy with trash trucks visiting at various time during the night. Try and request a room off the street. Check the website for specials. The Chancellor is a great value and lived up to its reputation on Tripadvisor.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Nina Koepp","date":"2015-06-26 12:16:42 +0300"},{"content":"I have to echo the many other favorable comments about service and value. If you are staying in SF and need access to the business district this is the one. (I travel worldwide and stay in many expensive five star hotels.) My colleague needed a razor after the hours of the small hotel gift store and the clerk immediately sent out for one and it was brought to his room. Although the clerks were not too knowledgeable when I asked about restaurants with specific cuisines both clerks offered to help with one handing me a Zagat book and the other looking up information on the computer. The waitress at the breakfast restaurant anticipated my needs perfectly. The hotel is about 94 years old so don't expect contemporary and fancy decor, but do expect a very fine intermediate level business class hotel. I noticed that the hotel displayed 2005 and 2006 awards from Tripadvisor. I expect that the award for 2007 is in the mail.","ratings":{"Overall":5.0},"author":"Uriah Gutmann","date":"2014-11-23 02:11:54 +0300"},{"content":"We recently spent a long weekend at the Chancellor hotel. We thoroughly enjoyed our stay. The staff is very professional and courteous. The location is great as it is close to Union Square and the Powell Street Bart Station & Muni stops (Cable Cars, F-Line streetcars, and buses). You can easily walk to the hotel from there. So you can take the BART from either Oakland or San Francisco airport and get off at Powell Street and the hotel is less than 1/3rd of a mile away. The room was comfortable for two people. It was very clean and maintains the charm of an historic building. The bathroom is small with good space utilization. We asked for a room on a higher floor and stayed on the 12th floor (there are 15 floors). You could hear the street noise with the window open but it wasn’t bad at all. I had my laptop with me and the Free WiFi service was easy to use in the room. There is also a computer with an internet connection & printer in the lobby for guests to use. We ate breakfast at the restaurant which had excellent food and service; a great way to start the day. We would definitely stay at the Chancellor again, however due to the lack of air conditioning we would only stay during cooler weather.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Scarlett Green Sr.","date":"2015-01-10 15:20:02 +0300"}],"public_likes":["Margarete Shanahan","Bernardo Hartmann","Cheyenne Gislason","Ariel Cremin IV","Anabel Breitenberg"],"vacancy":true,"description":"Hotel Bijou is inspired by San Francisco's rich cinematic history, adorned with movie palace stylings and Hollywood portraits, and features a mini movie theater in the lobby.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}