{"title":"London/South Kensington-Chelsea","name":"Holiday Inn London Kensington Forum","address":"97 Cromwell Rd, Kensington, SW7 4DN","directions":"tube: Gloucester Road","phone":"+44 871 942 9100","tollfree":null,"email":null,"fax":null,"url":"http://www.hikensingtonforumhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4942,"lon":-0.1851,"accuracy":"APPROXIMATE"},"type":"hotel","id":16447,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Very good value/money. Clean, tidy rooms with working air-con and automatized blinds. Bathroom fully equipped with utensils like shower gel, shampoo etc. Daily changed towels.Tv connected with speakers in bathroom and wardrobe. Good location - only 4 stops from the city center. Great breakfast with fresh juices, large selection of appetizers. There's terrace at the top floor. It's a pity there's no bar up there because apparently You can't hang out there with your own drinks. There's pleasant young fellow at the reception - he showed us the way to the supermarket and some fine pub.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Merritt Oberbrunner","date":"2015-05-02 16:08:28 +0300"},{"content":"With so may choices of Hotels in Rome and literally hours of searching for a Hotel in Rome we were lucky to stumble across Relais 6. After reading previous reviews I felt confident to book for our stay. Our experience with the staff was excellent from the beginning to the end. From arranging transportation, tours and early check in their was nothing the staff could not do and with a smile! Although not in the city center it was convenient to all locations, we enjoyed the nice quiet area that the hotel was located in. The hotel itself was one of the CLEANEST hotels I have ever stayed in. And the staff the Friendliest, the language barrier was no problem and they were so nice and helpful. The breakfast was fantastic with many different choices. If you choose this hotel you will have no regrets. It was a pleasure to stay at the Relais 6, I hope to visit again in the future.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Ashley Schowalter","date":"2015-07-03 23:52:58 +0300"},{"content":"Excellent time although the weather was hot and it was late September when we were there would not recommend going in July or August and it was packed.Take comfy shoes and lots of deoderant as the bus journeys are quite an experience and even when its full more people pile on, it gets very friendly ! Take plenty of money as lots of tours only take cash although it did say they would take cards .......we had to go to the bank twice for cash and we only went for 4 days.We did all the usual sights plus the open top bus which we thought was a bit naff , some of the the info coming through the headphones didnt match the sights you were seeing. I found our Hotel on tripadvisor and it was spot on, Great place to stay and just far enough out of the centre to be able to have nice relexing evenings after hectic days in central Rome.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Jarrell Jewess PhD","date":"2012-02-12 21:26:58 +0300"},{"content":"We would recommend this hotel to anyone when visiting Rome and the nearby attractions. The buses and the local public transport was easily accesible and very useful when travelling in and out of Central Rome every day. Also in the WW2 museum which was particually interesting to our son who found this really interesting as they opened specially for us. The breakfast provided was really tasty and had something for everyone to eat from cereal to croissants!!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Talon Bergnaum","date":"2015-11-08 02:56:06 +0300"},{"content":"This was our first trip to Rome,the Hotel and staff were fantastic nothing was too much trouble, every one we came into contact with were lovely,our room was great, the whole of the Hotel was great,we just loved every thing,the area not too far from the centre, we used to get the 90 bus to the Termini which was four stops away, but you could stay local in the evening if you have a busy day sightseeing, with good restaurants, wine bars, bars and cafes just a stroll away in a good residential area.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Nyah Lesch","date":"2013-03-10 17:14:24 +0300"},{"content":"We stayed at Relais 6 for the first night of our tour of Italy in Feb 2011. Prior to beginning our trip, I had second thoughts about staying here as I realized that there wasn't a lot of information available. In fact, the limo driver (a Roman native) who drove us from the airport to the hotel said he'd never heard of Relais 6 before, or even been to the neighborhood. Fortunately, Relais 6 is an excellent hotel and we had a great stay. Its rather low profile meant that there weren't many other guests, allowing us to fully appreciate its tastefully decorated and spotlessly clean interiors. There were plenty of antiques and old knick-knacks, even a small WWII museum. Room: We booked a standard triple room which felt a little cramped (though the size was probably par for Rome) . Bed and HVAC were good. TV was small and had mostly local channels. Service: Front desk staff were polite and efficient though a bit aloof. Other staff were very friendly and accommodating. Location: Relais 6 is located in a quiet residential area. It's the nicest building along the whole street. There's a pizzeria 5 minutes away by foot (which gets packed during weekends) and there're bus stops a couple of minutes away. It took about 20 minutes to get to Termini station by bus. Overall, Relais 6 offered us great value and I would recommend it to fellow travelers, though I'm also keen to keep it as one of Rome's \"hidden gems\".","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Andrew Sporer","date":"2015-01-17 03:14:37 +0300"},{"content":"If you don't mind, or enjoy being just a bit out of the city center, this is a fantastic hotel. You will need to take the bus for about 10 minutes to get to the sites. However, the quality of the hotel and price makes it worth the effort. Our room, on the 4th floor, was large, clean and had a great view of the quiet, upscale neighborhood. The staff was friendly. My two daughters, 16 and 12 slept on the pull-out sofa, which was comfortable. There are a few restaurants within walking distance that are good.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mrs. Cesar Roberts","date":"2013-03-27 18:25:23 +0300"},{"content":"We had free breakfast daily - access to pool and gym - wifi was okay - a little unreliable but still good - staff were friendly - location was a little far from downtown - about a 10 dollar taxi ride - overall this hotel offered a clean facility and room.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Lexie Luettgen","date":"2012-04-23 20:34:23 +0300"},{"content":"Really a value hotel where you just need a room to sleep after lots of working in Singapore. Room is clean and good enough space, Staffs are friendly and always provide help whenever you approach them. Good restaurant on the door step in case you just want to feel you stomach. Will sty there again for sure.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Micah Rolfson","date":"2014-06-29 03:55:10 +0300"}],"public_likes":["Odie Jerde"],"vacancy":true,"description":"4 Star hotel near Kensington High Street with 906 rooms offering the usual Holiday Inn services","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}