{"title":"Three Rivers","name":"Sequoia River Dance Bed & Breakfast","address":"40534 Cherokee Oaks Dr.","directions":null,"phone":"+1 559 561-4411","tollfree":null,"email":null,"fax":null,"url":"http://www.sequoiariverdance.com/","checkin":null,"checkout":null,"price":"$95-120","geo":{"lat":36.4193,"lon":-118.918,"accuracy":"APPROXIMATE"},"type":"hotel","id":30131,"country":"United States","city":"Three Rivers","state":"California","reviews":[{"content":"We stayed at Hotel Thirty Thirty for three nights in august 2010 and we enjoyed it a lot. The room was tiny but enough for us. The staff was really friendly and the concierge gave us very good help with tickets and tips. The location is great, close to Empire State Building. Only negative thing is that I sent an e-mail to the hotel in advance, and I had to send another three emails to get them to answer. From my first mail to their answer it took about 2 months.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":4.0,"Service":4.0},"author":"Cletus Huel","date":"2015-06-04 04:14:40 +0300"},{"content":"Fantastic Location and room was very comfortable. I arrived late at night and was greeted warmly. The room I had was very spacious and modern and the bed very very comfortable. The hotel is situated close to buses and underground, could not have asked for a better spot . Proved to be excellent value for money. When I return to NY I will return here. Something to improve: provide free internet. It was a hefty 13.95 for 24hours....Starbucks down the road is free if you buy a coffee.!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Lucious Purdy","date":"2015-06-29 14:53:18 +0300"},{"content":"Service sucked. Our room did not get cleaned. When we called down for fresh towels we never got them. We were promised a queen size bed and they gave us a full size bed. We were also disappointed that the room lacked basic things such as a cup to drink water out of. Location was good but other than that it was not worth the price.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":2.0},"author":"Helen Ryan","date":"2014-05-22 13:28:34 +0300"},{"content":"This was my first stay at Hotel Thirty Thirty. I had a wonderful experience. Incredible staff, great room, perfect location, and a great price. I will stay here again and will recommend the hotel to friends and coworkers. Thank you!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ebony Reichert","date":"2013-08-18 21:56:21 +0300"},{"content":"As I was travelling with my 75year old mother we had booked a twin room, when we arrived we were 'upgraded' to a 1 bedroom & living area with a couch, I was told sleep on couch or a roller bed could be brought in! Corridor carpets were covered in plastic which made a noise when walked on, builders were in rooms with doors open sawing, drilling & creating dust that got everywhere. I spoke to another guest who was being moved to another hotel & was told by woman receptionist that I had spoilt that guests experience of the hotel. I asked to speak to the manager at this point & was told that she was the manager. We decided to find another hotel that was not a building site, could accomodate our needs & allow us to speak to other guests! The two reception staff we spoke to were unhelpful, churlish & belligerent not the customer service we were told to expect in New York. The bell boy was the most helpful pleasant person we could find at this hotel & we wish him luck.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Marguerite Altenwerth","date":"2012-07-29 15:19:35 +0300"}],"public_likes":["Rosina Fay I","Dr. Elza Cruickshank","Allene O'Kon","Miss Joana Keebler","Floy Ferry","Magnus Beahan","Destiny Parisian","Cyrus Mann","Wilton Strosin"],"vacancy":true,"description":"5 rooms and one 3-bedroom, 3-bath home.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}