{"title":"Malibu","name":"Malibu Shores Motel","address":"23033 Pacific Coast Highway","directions":null,"phone":"+1 310-456-6559","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":34.03732,"lon":-118.67711,"accuracy":"APPROXIMATE"},"type":"hotel","id":17310,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"My husband and I recently attended a Wedding of 70+ people at this resort. We were somewhat apprehensive about staying at a resort that was less than 4 1/2 Stars as we had always been warned to avoid these. This was our 4th trip to the Mayan Riviera & we booked 1 week at the Allegro Playacar & 1 week at the Barcelo Maya Colonial. We were quite amazed at the quality of the food, the best we have had at any resort we have ever stayed at. Cudos to the head chef! We only ate at the Buffet however as never had a chance to make it to the a la cartes. (Note: To book the a la cartes you MUST book 1 day in advance). We were not disappointed at all as we were so impressed with the Buffet restaurant. Such variety! Great presentation! The rooms are very basic but we found them to be adequate. TV's are rather antiquated. Though no one goes on a trip like this to sit in your room and watch TV, it would still be nice to be able to get the weather channel. Don't count on it at this resort! Poor reception, bad picture quality and very little channel selection. A dresser would be nice and a FULL shower curtain or shower door would improve matters as well. Yes, the pool water was cold but when we were there they had just had a stretch of cooler weather. As always, it was great once you were in! The pool activities were great and the activities co-ordinators were AWESOME!!! The Beach area is very small but you can walk a long way down passing resort after resort & will eventually come upon open beach. We particularly enjoy walking on the beach and were not disappointed here. We walked 45 minutes in one direction before turning back to head \"home\" and could have gone further. The grounds are beautiful and extremely well maintained. Staff are very friendly and accommodating. More bar service during the daytime would be a good thing. We quite enjoyed the location. It is a 20 min walk to Playa del Carmen in 1 direction & approx a 3 min walk to a fair sized Plaza in the other. This is a very small resort & we found it had a lot more charm than some of the larger resorts we have stayed at.. In summation, would we recommend this resort to others; we already have. Would we stay at this resort again; absolutely! Would we return to the Barcelo; not likely.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":2.0,"Location":5.0},"author":"Mr. Syble Leannon","date":"2015-05-29 21:28:23 +0300"},{"content":"We had the best experience at the Allegro Playacar. The hotel has little huts and each hut has 4 rooms. The rooms are smaller but big enough to live in and really how much time do you spend in a room? You have your own patio with table and chairs and a hammock!!! It is clean and the staff are great. I left small tips $2/day... each day and they give you ten star treatment.There was one night where a man was way too drunk; he fell and his head was bleeding, the staff came quickly and took care of him with dignity and respect. The food was awesome with lots of variety. It's hot and very tastey for some who are watching there calorie intake and for someone who isn't!!! I felt very safe.We brought four children with us and I let them do what they wanted because I felt so safe. I would stay there in a heart beat again and again. You are close to a little market; one block to the left, the bank and starbucks. Also you can go to Playa de Carmen (5 minutes away) and to Cozumel; a 30 minute ferrry ride from playa de carmen (great place to shop and snorkel!!!). Do the Mayan Village/ cenote /Chichen Itza tour with George and Noltours; a five star tour.You can stilll climb this pyramid, one of the last few. Bring little gifts (from your culture) for the Mayan children it will be the best tour/reward of your life. The hotel has lots to do (Spanish lessons, dance classes, yoga, water volleyball, water/land aerobics, water sports etc... and the beach is great. The sand is like no other your feet will touch and the water many shades of blue.. There are still a few shells to find. A few sand bags in front of the beach but you can still enjoy it. If you like buying stuff on the beach there is enough of that but they don't hound you if it's not your thing. Parasailing is fun, safe and not expesive at $50 and you can go as many as three at one time. It is the best hotel I have stayed in and I have spent half my life in Mexico. Don't listen to the negativity (nothing can make those people happy) just go and enjoy!!!! Lori P. from Canada-January 2009","ratings":{"Overall":5.0},"author":"Peter Kshlerin","date":"2015-03-05 14:00:59 +0300"},{"content":"It was a great deal for the price we paid. The room was nice and neat, Stuff was very nice and helpful. Food is available all day by the pool, The italian restaurant a great place to eat, When we arrived we paid extra to move to a room close to the pool and beach...big mistake they have blasting music from 10am to 6pm. we mencion this to the people in charge nothing was done, the age group at the place was 30's and up, the music was good for a spring break type environment.. was absolutly crazy....the only reason I will never go back to this hotel P.E.C NYC","ratings":{"Service":5.0,"Cleanliness":3.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Garrison McClure","date":"2013-06-06 14:14:31 +0300"},{"content":"The best features of this hotel are its swimming pools, gardens and friendly staff and service. Rooms are spartan with very little storage but kept spotless. They are trying to restore the beach area but in my opinion the beach sucks. If you are a beach lover then try a different area of the Mayan Riviera as the hotels around the Allegro all have the same problem with lack of beach area, some worse then others. Playa del Carmen, a 5 min cab ride or 20 min walk, has the type of beach as shown in brochures and has great restaurants, beach bars and a vibrant nightlife. The hotel has a very international clientele and ambiance and again, the service and friendliness of the staff sets it aside from other properties. I would highly recommend this hotel for its value and location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":2.0,"Location":4.0},"author":"Walker Okuneva","date":"2012-05-12 09:35:20 +0300"},{"content":"We just got back from celebrating our honeymoon at the Allegro Playacar. We stayed there from May 25-30. I was a little concerned about going to this resort after reading some of the reviews. However, it really was a great place to stay for honeymooners, families, or just with friends. We had notified the resort that we were going to be honeymooner's at the time of booking and the resort upgraded our room (closer to the beach!), gave us vouchers for free 10 minute massages at their spa, a breakfast meal brought to us one morning, and a fruit basket in the room at no additional cost! The resort was kept very clean. The grounds were beatiful! Our room was upstairs and for the most part was a great room. The A/C worked great. The maid service did an excellent job of keeping the rooms clean. The safe worked fine. The only small complaint is that the matress was a little harder than I'm used to. The buffet was average quality. It was not great but by no means was it horrible. On the Monday night that we were there they had a Mexican party and the food was really good. The snack bar down by the pool was good. The two reasturants, The Italian and The Mexican were excellent! You have to make reservations for those two but it is worth it. The hotel always had something to do if you wanted or you could just relax by the pool or beach! The entertainment at night is fun. The resort is close to 5th Avenue and the ferry to Cozumel. There are large sandbags on the resort's beach, but on the bright side it created a pool that people and children could play in without the crashing of waves. If you really want to see an undamaged beach (like I really did), Playa Del Carmen has beautiful beaches that you can walk and swim in and it is only minutes away by cab ride.. This was a great resort and we would recommend it to anyone as a great vacation spot!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Tremaine Homenick","date":"2015-03-07 06:11:18 +0300"},{"content":"The first thing I will tell u is dont judge this place strictly by the reviews, I was pretty apprehensive at first. Wasnt sure what to expect...but then we got there and I was pleasantly surprised at how nice it was. The staff were nice, but I have to be honest, I was afraid to talk to anyone who wasnt front desk staff because I wasnt interested in a time share! I asked someone where the bathroom was, and 5 minutes later he was still inviting me to a \"special breakfast\". Also dont buy any tours or excursions from the hotel they claim they have the best prices, but if u walk 3 minutes to the plaza up the road the prices are about $30 - $50 cheaper!! Definately go to Xel Ha, its amazing!!! You also have to go into Playa del Carmen, its about 5 mins from the hotel, and spend the day shopping and sightseeing. Grab the ferry into Cozumel, you wont be sorry! There is a bar there called Mr. Chiles that has $1 Coronas!!!! Even if u are not a big drinker, u cant beat $1 Coronas;) Which brings me to the nightlife in Playa Del Carmen, if u are a party animal they party till about 5 am there! The resort tends to quiet down after about midnight. The size of the resort was ideal, not too big, not too small. I liked that it was a short walk to anywhere, the beach, the restaurants, the theatre...and the rooms were comfortable. I LOVED the hammocks on each balcony. Also loved the oragami the maids did with the towels each day. We had a nice king size bed with a mattress pad on it that made it fairly comfortable. My only real complaint would be the food, but honestly I think thats just foreign food for ya, we ate both on the resort and off, and sadly the McDonalds we grabbed on the way home from the airport in CANADA at 4 am was the best food we ate all week:( I guess the fruit was okay, but I wouldnt reccommend eating too much of it! The beach was a little beat up from the hurricaine, they had sandbags in the water a little ways out, but quite honestly, the water was nice, and the beach was great for sunbathing. I would reccommend this hotel to anyone who is looking for a low budget, good quality holiday.","ratings":{"Overall":3.0},"author":"Libby Rutherford","date":"2013-06-07 12:19:00 +0300"},{"content":"My family stayed at the Allegro Playacar from March 6-10th. Before going, I read all the reviews and thought maybe some people were just \"complainers\" when they mentioned all the bad things. Well, take note! I knew what we were getting into and I know you get what you pay for, but this resort is not worth spending your money on. We had three rooms, and as requested, we all got lower floor rooms near each other. Out of the three rooms, only one room was in working order. My parents switched rooms the second day because of a dripping, non-working air conditioning unit (among other things in their room) and my sister tried switching rooms due to a rattling air conditioning unit. And when my sister tried to switch rooms after my parents vacated their old room, the front desk tried to give her that room! As for the entertainment, I have to say what entertainment? I've been to other 3 star resorts in the Riviera Maya, and have been far more impressed with the activity staff than here. I hardly ever saw them walking around during the day and the shows at night were horrible! At the other resorts I've been to, you would know their names and faces by the end of your stay. Not the case here! Also, I really wanted to like the food and thought that it couldn't be THAT bad. Well, it was. Cold food at the buffets and almost the same version of food every day, just mixed with other things. Again, I wasn't expecting a lot, but this was terrible! Good things - the pools were nice and being able to walk into Playa del Carmen was nice. (We needed to walk to town to get any type of entertainment!) The resort overall was in need of a lot of care. I will not recommend this to anyone and hope if you go, you don't mind wasting your money on a very poor 3 star resort.","ratings":{"Service":3.0,"Cleanliness":2.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Roger Blick MD","date":"2015-07-29 06:36:59 +0300"},{"content":"Stayed in this hotel 4 years ago, had a really nice stay for 2 weeks. I wanted to book this hotel again, until that hurricane (I believe Wilma) had other ideas. So, this year dec 2007-jan2008 I booked again... What a mistake! Had a room next to the theatre and nightclub which meant we stayed up till about 2am every night! The beach is completely gone apart from about 1m. We had no hot or even warm water for the whole stay (8days), we did complain every day... The last day they asked us to move room, which we refused. Upon arrival we were unable to go into our room because the lock didn't work, took about 2 hours before that was fixed... The only thing that was really good was the food, that was about it.","ratings":{"Service":4.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Kamille Okuneva","date":"2012-01-07 09:37:38 +0300"}],"public_likes":["Kaycee Beahan","Lane Franecki","Elva Mills","Tobin Sauer","Lee Pfeffer","Jamarcus Zulauf","Bryon Lynch","Cecile Runolfsdottir","Lester Huels"],"vacancy":false,"description":"Located across from Surfrider Beach, this motel is more well-suited for families than most Malibu hotels.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}