{"title":"Blythe","name":"Days Inn Blythe","address":"1673 E Hobsonway","directions":null,"phone":"+1 760-922-5101","tollfree":null,"email":"robalitoramos@gmail.com","fax":"+1 760-922-4870","url":"http://www.daysinn.com/hotels/california/blythe/days-inn-blythe-ca/hotel-overview","checkin":"3PM","checkout":"11AM","price":null,"geo":{"lat":33.611005,"lon":-114.575441,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3786,"country":"United States","city":"Blythe","state":"California","reviews":[{"content":"We decided to stay here for a quick family trip (only 2 nights) due to location and price (under $50 for 2 nights!). We love Downtown and the prices are so much better here for just about everything. We originally booked the Cabana Suites because the rooms looked really cute. Once we parked and saw the somehwhat \"sketchy\" area, we asked for rooms in the Tower instead. This was no problem and we got 4 (out of the 5 we needed) of our rooms together on the 9th floor. All were large, clean and had a far off Strip view! There was a cute little loveseat with a coffee table, a nice desk, a huge dresser and adorable iron-work lamps. I think the decor was maybe a \"Cuban\" theme. Beds were simple, nice linens, lots of pillows and very comfy. Old TV. Coffee maker! My only complaint would be the pretty small bathroom and closet off to the side. Shower was good with lots of pressure and hot water. Ok toiletries. Safe did not work. Casino here is small but with lower gaming tables. Spent hours at the $1 roulette table! Awesome amazing steakhouse here too, called the Flame. A must try! Would stay here again but not in summer as they don't have a pool. Close to everything on Fremont Street too! A great stay at a charming, Old School Vegas hotel!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Milan Kuhic","date":"2014-03-19 03:58:56 +0300"}],"public_likes":["Miss Murray McDermott","Caesar O'Kon"],"vacancy":false,"description":"Free breakfast and Wi-Fi, pool, pet-friendly.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}