{"title":"Blaenavon","name":"Oakfield B&B","address":"1 Oakfield Terrace, Varteg Road, Blaenavon, Torfaen, NP4 9DS","directions":null,"phone":"+441495792829","tollfree":null,"email":"enquiries@oakfieldbnb.com","fax":null,"url":"http://www.oakfieldbnb.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.7694,"lon":-3.0843,"accuracy":"APPROXIMATE"},"type":"hotel","id":3740,"country":"United Kingdom","city":"Blaenavon","state":null,"reviews":[{"content":"Our second stay at this property, and enjoyed it very much. I was there on business/conference, and they have everything you need. From the high end steak house, Hyde Park, to a great sports bar. It's convienent to most things, and the staff is very helpful and friendly. I wanted to check in early, and they were very good at getting a room cleaned to allow me to do so. Will stay there again when in Daytona.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Conor Yost","date":"2014-06-28 02:22:32 +0300"},{"content":"I picked this hotel after reading reviews for it versus other hotels in same area. It did not disappoint. First, it's huge. The combination of South and North Towers and all the restaurants make this a great place to stay and a good daily walk! Check in was a breeze, got a room after 5 mins and I was early at 12:00pm!! Got straight to the room, nice average hotel room with an amazing view of the ocean and all the happenings that go on around this hotel. Had a problem with AC and had repairman there in 10 mins after the call and he went out of his way to fix problem and give me some tourist advice. Beautiful beaches and so many fun things to do around this hotel , that I would stay again. My rooms were clean, the hotel was clean and I had great service the entire trip. Made a girls weekend great!! Tips for this hotel:: stay oceanfront, it is definitely worth the extra money. Also check out earlier than the 11:00am checkout. We waited for a long time for bell service and our car . I've heard we had over 200 rooms checking out at one time. A possible solution for the hotel would be staggering check out times to ease the wait. Otherwise I enjoy the hotel and will be coming back with my family to stay again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Hank Rau DDS","date":"2012-08-05 06:31:24 +0300"},{"content":"We went here for a conference a couple weeks ago. The website made the property look real nice, but in this case perception was not total reality. The lobby and reception area along with the conference facilities were nice and some had been redone/renovated recently. We had a cabana room since we were travelling with little ones and needed the extra space. We got the rooms for the conference special price so it was in line with what we are used to paying for a room but I would not have paid \"retail\" for it. As for in room amenities, there were none. The TVs were older, no microwave, and the furniture a little dated. We had to pay $10 a night for a mini fridge. In it's heyday this was a jewel on Daytona Beach, and it still had some of its old glory but the shine had faded.. Being oceanfront by the boardwalk and next to the Ocean Walk Village was really cool. Having a place to sit outside in the evenings and chat and watch fireworks and listen to the band in the band-shell was neat too. I've stayed at less pricey hotels on the beach or near the beach (like across the street) that were way nicer for the money, even some with kitchens and true \"suite\" layouts. This property needs some updating/modernizing to compete and regain its position. Hilton as a brand has a particular reputation and I am sure if Conrad Hilton were around to see this property he would not give it very high marks at all. Would I stay here again? Maybe, for a weekend getaway sans kiddos or if the muchkins are a little older and not in cribs and on formula. I still wouldn't pay full price though...and $20/night to park is CRAZY if you pay \"retail\" for the room. Check that, it's crazy period. There's more I could say to be critical but I'll stop as I read some other review about conferences and elevators and I hate redundancy.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Brett Wintheiser III","date":"2015-03-25 10:47:08 +0300"},{"content":"We got a very special deal on this hotel. Not sure what to expect when we arrived. They could not have been nicer. The check-in reservationist (Ms Peetrie) was extremely helpful. Even though we used the self park option the valets were very helpful with information. The cleaning ladies went out of their way to help us. By far it was the best hotel experience we have had. They seemed to really care we enjoyed our stay. Our thank you to them.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Wilber Hilll","date":"2014-07-21 03:57:56 +0300"},{"content":"Stayed at this hotel june 2-3. Long wait to check in. When we got to our room there is no balcony as advertised. room was very dated and there was mold in the shower. Pool bar was nice albeit rude help and overpriced food. Doc bales had friendly staff but 60.00 for 2 people for breakfast was a bit pricey. tried numerous times to get service in sports bar but staff was busy with one another and ignoring guests. For the money we payed we will not return to this property if ever in Daytona again.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Miss Mervin Mante","date":"2014-02-25 17:20:50 +0300"},{"content":"A recent conference in Daytona Beach took me to this area and the Hilton Daytona Beach. I was excited to be in Florida with warm and beautiful weather during my week stay! A few years ago I was invited to Daytona Beach to explore the possibility of bringing meetings to the area. At the time, the hotel was flagged as an Adam’s Mark. Several years ago it was rebranded to a Hilton. This is a very large hotel, located directly across Atlantic Avenue from the Ocean Center (convention center and arena), and Peabody Auditorium. The hotel itself can accommodate various size meetings. The hotel does not have shuttle service to/from the airport but there are private companies and taxis that offer airport to hotel service for approximately $18. The airport is just minutes to the hotel. I was greeted by very professional and friendly staff at the HiltonHhonors line (no waiting in the other long lines) and was off to my room in the south tower in just a few minutes. I had breakfast coupons and everything I needed for my week in Florida. My room was two double beds as no king bedrooms were available, even with my gold Honors status. There was a large group at the hotel which no doubt used many of the rooms. My guest room was showing a need for a refresh, and a bit cramped with two beds. However, the spectacular and most incredible view of the beach and ocean quickly made up for any room needs. I enjoyed the mornings rising to beautiful sunrises, and the beach. The beds were very comfortable and typical Hilton beds. The bathroom was a bit small and compact but adequate. The one problem I encountered a few days was the terrible water pressure. Later in the week it seemed to improve. I must say the staff at this hotel is superb! They greet you in the public areas and ask if they can help you with anything, or will direct you to where you need to go. One afternoon I arrived back at my room and noticed it had not been cleaned. A quick call to the hotel guest services promptly resolved the issue. I was very impressed with the hotel staff; they are some of the best in the industry. I was very impressed with the front desk/check-in staff and how helpful and friendly they were! Great people!! The breakfast coupons entitle one to the full buffet or you may order from the menu. The buffet was very good and offered the typical morning breakfast fare. Knowing I did not want or need to eat so much for breakfast each morning I opted for the menu selections on several days. The restaurant staff at “Doc Bale’s Grill” were top notch and very attentive! This venue is only open for breakfast from what I could tell. I must say the breakfast buffet seemed a bit on the high-price side at $19.95 per person. However, it does come with beverage choices and all-you-can-eat. Over all my stay was incredibly great! In fact, I had a hard time leaving! The weather, paired with being on the beach is just a bit of paradise! Other related comments about the Daytona Beach area. The Ocean Walk Village is located directly next to the Hilton, and is a complex of two hotels (including the Hilton and Wyndham) and shops. I must say this “shopping” complex is nothing more than a collection of fast-food style restaurants, with a couple retail shops. I was disappointed in what it had to offer. The shops along Atlantic Avenue are your typical beach/surfing shops that cater to the tourists. If you’ve seen one, you’ve seen them all as each offers the same basic line of “tourist trinkets” and clothing. If you are searching for anything in the line of local art/craft/photography, you are not going to find it along the beach area shops. Overall, my experience in Daytona Beach and at the Hilton was great! For a destination to relax and kickback, and enjoy the weather and beach, this is it! If you have a car, Orlando is just an hour away.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Miss Jarred Mertz","date":"2012-03-23 22:06:45 +0300"}],"public_likes":["Jakob Halvorson","Trevion Block","Audreanne Lynch","Melissa Hammes","Meredith Fay","Kattie Wehner","Griffin Cronin","Thelma Gutkowski"],"vacancy":true,"description":"Family run friendly bed and breakfast accommodation in the World Heritage Site","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}