{"title":"Offa's Dyke Path","name":"The Bell Inn","address":"Redbrook Rd, Redbrook","directions":null,"phone":"+44 1600 713612","tollfree":null,"email":"Info@thebellinnredbrook.co.uk","fax":null,"url":"http://www.thebellinnredbrook.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.78375,"lon":-2.6726,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21052,"country":"United Kingdom","city":"Redbrook","state":null,"reviews":[{"content":"After reading a number of negative reviews, I was afraid the Park Plaza may have deteriorated since the 1980s when I had been there for several meetings. I decided to book anyway because I got a great rate and the location was fairly close to where I needed to be. Wow, am I glad I did! The hotel has been kept up with new carpets, drapes, fresh paint, and renovated bathrooms. The bed linens were beautiful and comfortable. Everything was spotlessleslly clean. In other reviews I noticed people complaining about noise/thin walls, but my husband and I did not notice anything like that. Our 3-day stay was quiet and thoroughly pleasant. We would definitely come back. Tip: If you want to park and leave your car for the duration of your stay, you can save by using the self-parking garage across the street, but be aware it does not have in & out privileges.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Larue Jacobs","date":"2012-07-08 18:25:16 +0300"},{"content":"No tea, coffee etc in room, front desk staff helpful. Rooms big but thats about it. Parking very expensive.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":2.0},"author":"Liliane Graham","date":"2013-03-24 11:57:55 +0300"},{"content":"This hotel is in a great location. However, the hotel rooms need to match the lobby by being updated. The furniture looked like it was taken from a garage sale or off someone's curb. The bathrooms need to be updated and looked dirty even though it was clean. The woodwork was very worn and looked dirty as well as the wallpaper being torn in spots. The heating and windows need to be replaced with more efficient ones since there was a horrible draft and the thermostat needed to be turned up to accomodate the draft. You could hear everything going on outside as it was noisy. The bellmen and parking attendants were very friendly and helpful.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":5.0},"author":"Enrico Legros","date":"2015-10-17 16:43:33 +0300"},{"content":"Very nice, but very old hotel! Has been kept up nicely, and is very ornate. Lobby is breath taking!! Only problem we had, was the toilet was so close to the tub, made it difficult to use it. Oh, and the prices for room service are astronomical, so be prepared to pay a lot for that luxury. Where the hotel is located is really close to good eats, so no worries there! Plus, they do offer a shuttle bus tour of Boston that I highly recommend! You need to book ahead though, it fills up quickly. Very reasonable prices though.","ratings":{"Overall":4.0},"author":"Myrna Bauch","date":"2013-07-28 03:30:43 +0300"},{"content":"I booked this hotel for Thanksgiving weekend via Priceline. Then after reading reviews here, I was initially disappointed, especially given comments about the small bathrooms and poor service (I went with my wife and children, ages 4 years and 6 months). Our experience was fantastic. To address my initial concerns, I'd say that the bathrooms were small but that the service was very good (special thanks to Ari, who worked the front desk). Further, the other folks at the front desk seemed courteous and helpful when approached by hotel guests. A few comments about the Deluxe room we stayed in...The room was well-maintained (not 4-star quality, but I wasn't expecting this). Bathrooms, as others have noted, are tiny, and the tile floors could use a little refurbushing. When I asked about why the rest of the hotel was updated but not the bathroom floors, one of the employees indicated that the tiles were untouched to retain hotel's \"charm.\" For me, the small bathroom size was not a big deal, but I can see how it might alter the experience for some. Regarding amenities, we weren't a frequent consumer of the hotel's ancillary offerings. We didn't use the business center (not free), breakfast (expensive), gym (I'm building a tire, if you know what I mean). So, buyer beware. The hotel's lobby is fantastic. Christmas decorations were already up, and there is plenty of seating - several guests were reading newpapers or enjoying take-out dessert. Very spacious and luxurious setting, all in all. Parking is $40/night at the hotel. I opted for the covered parking across the street (where Maggiano's guests park) because it's slightly cheaper at $31/night. Last but not least, the location is perfect. The Arlington station (green line) is less than a block away. Boston Common/Public Garden is a block or two away. Chinatown is a 10-minute walk (with kids). And there are several dining options either inside the hotel (McCormick & Schmicks, Melting Pot, Ben & Jerrys) or within 1 block (Smith & Wollensky, Finale for dessert, PF Changs, Maggiano's, Legal Seafood). I'd stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Lisa Kulas","date":"2015-02-16 04:07:17 +0300"},{"content":"Possibly one of the worst Starwood properties I've ever stayed in. While the lobby is convincing enough that this is a worthy hotel, immediately upon entering my room, I realized that this hotel was completely overrated. I'm usually pretty laid back about this sort of thing, but I'm pretty sure my first apartment in Chicago, after I graduated from college, was nicer than this. Bathroom is decaying and its clear there's been no attempt to even attempt an upgrade (the fixtures are all cheap and old). TV is circa 1990. Room generally feels old and dirty (see attached pictures of bathroom and window shade). Gym smelled and many pieces of equipment were rusty. Other comments on this site regarding the general lackadaisical attitude of the concierge were right on, although the front desk staff was helpful. Overall, I fully understand why the other Starwood properties were sold out and this one wasn't (even at almost half the cost!).","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Walker Grimes","date":"2013-09-22 21:31:30 +0300"},{"content":"Although this is one of the \"Historic Hotels of America\", it is definitely in need of a facelift. Good points: comfortable beds and pillows; courteous staff; good location to shops, restaurants, subway. Down side: no coffee maker in rooms; rooms are very dated and poorly maintained. The bathrooms are very tiny for American standards, along with dirty, cracked caulking, poorly draining tubs - you get the picture. Also, they appear to be very stingy with toiletries. I went two days in a row with one bar of soap for the shower and sink until I swiped another from the housekeeper's cart. After four days here, still am not provided with another body lotion. Time for another swipe...Rooms are noisy. On the 11th floor, the traffice noise is quite noticeable (and there are a lot of sirens in Boston). The fire alarm system malfunctioned - although it DID NOT AWAKEN us to evacuate (which is worrisome), the very loud announcements that it was OK to reenter the building did. Then we were in bed thinking what the heck - what if there had been a real fire??? Obviouisly, my first choice for another stay.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Connie Pfeffer","date":"2015-03-29 23:26:16 +0300"},{"content":"We stayed here for two nights at the beginning of August as our original hotel had overbooked and moved us to here. At first I was a little apprehensive as it was a lower grade hotel but can honestly say that it was the best thing that could have happened. Our stay was to take a look around the city and as such the hotel was in the best location possible. All the resturants and cafes around the hotel (Underneath) were great and were ideal no matter what kind of meal you were looking for. The service in the hotel was very good and the receptionist very cheerful and helpful. The room had everything we needed apart from a great veiw but it was OK. Everything worked in the room and a blown lightbulb was replaced very quickly. Overall a great location and very nice hotel for the money paid.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Aurelie Hessel","date":"2013-03-27 16:12:28 +0300"}],"public_likes":["Miss Dedric Lind"],"vacancy":true,"description":"Accommodation and food services","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}