{"title":"Tenby","name":"Celtic Haven Resort & Spa","address":"Lydstep, near Tenby","directions":"Located on the A4139 between Tenby and Manorbier","phone":"+44 1834 870000","tollfree":null,"email":"welcome@celtichaven.co.uk","fax":null,"url":"http://www.celtichaven.co.uk/","checkin":null,"checkout":null,"price":"From £25 pp pn","geo":{"lat":51.6509,"lon":-4.7663,"accuracy":"APPROXIMATE"},"type":"hotel","id":30018,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"If you are going to stay at the Pier House you must stay in one of their spa rooms. They are in a seperate building where the spa is on the first floor. All of these rooms have recently been redone. They are large and spacious, they have wood floors which I love and they have huge luxurious bathrooms. We love the veranda/balcony - sitting out there and drinking coffee and just relaxing is the best. The Pier House is centrally located - walking distance to everything. The staff is always very friendly and helpful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Shakira Welch","date":"2015-03-28 18:51:52 +0300"},{"content":"Excellent hotel. Would definitely stay here again. As far as beaches go in the Keys, theirs was excellent. Great location right on the water and on Duval Street. I would highly recommend this hotel.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Rooms":5.0,"Service":5.0,"Location":5.0},"author":"Blake Okuneva","date":"2012-01-26 11:25:18 +0300"},{"content":"Can you get any closer to Mallory Square? Can you get any closer to the beach? No... Pier House has great location for sure. The staff was super friendly and helpful. Our room was decorated in the region's style. Fun street signs marked the pathways between the different buildings and destinations. The drinks were a little expensive, but it's a resort and expected. Hard floors were perfect for getting sand in the room and lush plants were perfect in creating the island feel. Definitely a safe place to stay, too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jodie Hudson","date":"2015-11-26 10:02:31 +0300"},{"content":"We stayed in a harbor-view room with sailboats outside the patio. It was kind of other-worldly when I was awakened in the middle of the night by a dog on one sailboat barking at a cat on another sailboat. I've told that story quite a few times since. We also thought it was interesting that so many of the descendants of Hemingway's six-toed cats can be found around the property as we strolled around it. The location was also close to Mallory Square and much of the nightlife.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Ms. Brandyn Berge","date":"2013-10-10 17:26:37 +0300"},{"content":"We stayed here with 3 other couples for three nights, our first time in Key West. The hotel was beautifully decorated, & great bathrooms. A nice, small beach & pool, & an outstanding location. Right off Mallory Square, & most of the popular bars & restaurants. We all agreed we'd stay here again if we ever return to Key West.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Hank Streich","date":"2012-07-23 06:55:11 +0300"},{"content":"After a long beautiful drive from Miami, what a great place to settle down for a week...We loved our choice. The Pier House is in a perfect location. Once we got checked into our room, the only bad thing I can say is we didn't get a king bed like we requested. The front desk tried to accomodate us but we were fine with our 2 double beds. We were just happy to be away and in the sun and feel the Key West vibe. The rooms were clean and very comfortable. The private beach is fabulous, nice sand and a great place to hang out and relax. The pool is clean and open 24 hours. Make sure to take a mid night swim! We loved to finish off our nights at the hotels little bar \"The Chart Room\" we met great people. Make sure to meet Captain Dan. He took great care of us all week. Made fresh popcorn and made excellent drinks. We learned alot about the locals at this little bar....This vacation was filled with great memories and this hotel is where we would definately come back and stay. You cant get a better location. We didn't have a car the whole week and we didn't need one. Get ready to walk, or rent a bike which is a great experience. Loved It!!!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Myles Lind","date":"2014-03-30 16:00:32 +0300"},{"content":"Fantastic accommodation, clean & well appointed rooms. Centrally located with lovely pool & beach. Would return in a heartbeat. . . enjoy if you go!","ratings":{"Overall":5.0},"author":"Pansy Bahringer","date":"2014-01-13 06:15:27 +0300"},{"content":"Stay at the Hyatt next door...cleaner, bigger rooms, ELEVATOR and great staff! It's worth an extra $$ a night. Main building has two floors. If you are on the second floor and you anticipate use of a cooler, stroller, etc. during your stay good luck! We found out the hard way - lugging a stroller up and down stairs for 3 days. First mistake was not to use the bellman, not knowing an elevator did not exist we figured it should be easy enough to get our belongings to our room. Apparently that was a snub to the bellman as he was very rude to us the remainder of our stay. More than once we nearly took a spill down the stairs. However, the night crew seemed to outshine the day crew as the night crew was very nice and hospitable. Room was VERY small and had, what appeared to be ants. They had made an effort to update, but only went part way so their efforts seemed more like a poor attempt to cover up obvious deficiencies in the building rather than upgrading to \"Resort-Like\" atmosphere (new baseboards were already falling off the walls). I wont even get into the 2 dead roaches which were in the downstairs hallway for the last two days of our stay. Overall - Great beach (when construction is not going on), Rude Day Staff, Insects, Small Rooms, No Elevator and a poor attempt at upgrading","ratings":{"Service":1.0,"Cleanliness":2.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":4.0},"author":"Leatha Howe","date":"2014-06-12 18:22:06 +0300"}],"public_likes":["Fiona VonRueden III","Milton Mertz","Judson Lindgren","Davion Hickle"],"vacancy":false,"description":"Celtic Haven is a family-run holiday cottage resort on the picturesque Pembrokeshire cliff tops near Tenby. Many of the pretty whitewashed cottages date right back to the 12th Century and on-site facilities include an Elemis spa, Waves cliff-top restaurant, a headland golf course and leisure club with an indoor pool. The Pembrokeshire Coast Path is a short stroll away and many of the cottages are pet friendly.","alias":"Celtic Haven Cottages","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}