{"title":"Buena Park","name":"Knott's Berry Farm Resort Hotel","address":"7675 Crescent Avenue","directions":null,"phone":"+1 714 995-1111","tollfree":"+1 866 752-2444","email":"reservations@knotts.com","fax":null,"url":"http://www.knottshotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.840345,"lon":-117.998552,"accuracy":"ROOFTOP"},"type":"hotel","id":4397,"country":"United States","city":"Buena Park","state":"California","reviews":[{"content":"My husband and I spent our anniversary and my birthday weekend on March 2nd. 3rd. and 4th. at the Harvest Inn in St. Helena, CA. It was truly one of the nicest places we have been to, and we have traveled extensively. It was charming from the moment you entered the driveway. It was like being in Shangri La. The entire staff were fantastic, friendly and always willing to go the extra mile. Congratulations on your dazzling customer service. Everyone made us feel so special. We had a beautiful room that overlooked the vineyards with a jacuzzi on the deck. We just relaxed and unwound. We went to two great restaurants. One was Tra Vigne in St. Helena and the other was Bistro Jeanty in Yountville. Both had great atmospheres and delicious food. We had lunch at Hurley's in Yountville, which was fun. It was funky and had a great outdoor patio. We will certainly return to this lovely spot. We hated to leave and get back to reality.The fountains and gardens create such a peaceful environment. Great for the body and soul! Harvest Inn has become one of our favorite places. Same time, next year!!!! Esther & Jerry Moran","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Delilah Glover","date":"2013-04-15 11:37:06 +0300"},{"content":"My fiancee and I have stayed in many world-class hotels and the Harvest Inn was one of our favorites. The room was absolutely beautiful - from the oversized fireplace to the gorgeous napa area photographs, we felt we never wanted to leave. But the staff was so helpful in guiding us to the best wineries, we couldn't have enjoyed ourselves more. I","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Orlando Steuber","date":"2012-02-06 03:24:43 +0300"},{"content":"My friend and I stayed this past weekend at the beautiful Harvest Inn. From the time you drive up you get the sense of being far away with the trees, vineyard and inviting Inn. The Inn was dressed for the holiday season and it just added to the atmosphere. Highly recommend getting a room that faces the vineyard- they are amazing! Roomy, comfortable bed and beautiful linens. We put the fire on and enjoyed our champagne just after arriving. Doors open out to a patio to enjoy the expansive view of the vines. The breakfast as also really nice! Warm tasty quiche, eggs, cheeses, fruit, cereal warm and cold, and all the breakfast drinks. The staff at every level put their best foot forward to ensure you were happy, comfortable and satisfied. I can't say enough about the service. I highly recommend Harvest Inn- fabulous location to the best restaurants and town. Wonderful for couples, girlfriend getaways, or work (if you have to :-).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Janae Harris","date":"2015-03-15 09:47:15 +0300"},{"content":"This was our first time to stay at the Harvest Inn. We chose it from other reviews and photos online. It was so much nicer than it looked on their web site. It is many buildings, tucked away amongst lots of trees. What a peaceful place to stay, yet it is close to the all the wineries, shops, and restaurants in St. Helena. You won't be disappointed!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Marjorie Davis","date":"2014-09-25 12:30:03 +0300"},{"content":"We stayed for four nights and it was not long enough, that is for sure! The location is great, right in the middle of Napa! The grounds of this resort are immaculate, the room we had which was a Vineyard View was incredible. We were within 5 minutes of some of the finest restaurants in the area and we hit 4 out of 5 of the top in St Helena! We are already planning our return trip.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Mariano Braun","date":"2015-09-16 03:13:22 +0300"}],"public_likes":["Mrs. Tracy Kshlerin","Kailey Johnston","Ena Hammes Jr.","Simone Reinger","Ms. Krystal Kovacek","Nicolas Mitchell","Wallace Kub"],"vacancy":true,"description":"Knott's Berry Farm's on-site hotel. Special features include deals to the theme park, special entrance to the park, complimentary shuttle to Disneyland, and special themed Snoopy rooms complete with tuck-in service provided by Snoopy himself. Great for kids.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}