{"title":"Swansea","name":"Tan yr Eglwys Cottages","address":"Church Road, Cilybebyll, Pontardawe, SA8 3JR","directions":"Easy access from the M4, Neath / Swansea","phone":"+44 1792 863367","tollfree":null,"email":"rees.lloyd@btinternet.com","fax":null,"url":"http://www.walescottagebreaks.co.uk","checkin":null,"checkout":null,"price":"£","geo":{"lat":51.72672,"lon":-3.82077,"accuracy":"APPROXIMATE"},"type":"hotel","id":28958,"country":"United Kingdom","city":"Rhos","state":null,"reviews":[{"content":"Upon most encounters with slovenly appearances, most would amend, fearing the thrifty and gaping caverns of dues to be paid. However, there is a crossing point: precisely where this slum seemed to have leaped off the pylons of great hotels, creating a tourist-friendly New York stay into paralytic asphyxiation of horror. It looms precariously on it's two-star rating. The distraught condition of drug predators and illegals cramming their holed guts into the trickling walls probably purchased the minimal rating. To this corroded stature of suckitude, I may ask to command you a simple trot away, scorchingly applying pressure to the gas pedal. First off, the \"lobby\" is a tight and small space... just like the stairway/room/elevator. Our room had no form of heating in the brutal cold of Manhattan. The bathroom door did not lock, \"great\". The bed was FILTHY!! STAINS! STAINS! HAIR ON THE BED! My goodness... there is no standards for this dump. The doors have stains... i don't know what it is? Mold? Feces? Basically, the room we had checked in online for about half a week was canceled the first hour we were there and the whole hour we were there was trying to book another hotel.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Roel Konopelski","date":"2014-05-11 12:16:46 +0300"},{"content":"Wow, the reviews are so bad, I feel like I need to stand up for this place. Look, it's not the Four Seasons, but for the price, it's really a decent place. We were close to everything, from sightseeing to shopping to dinning to the broadway shows. Rooms were small, but clean. The front desk agents there are super friendly and having wifi helped. So my friends and I had a good time and saved a bunch, so it was all good.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Aidan Kuhlman","date":"2015-02-24 13:52:39 +0300"},{"content":"better to sleep on the street you do not have a lobby and extra charges for everything if been there once you will never come back there","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Manuel Hudson V","date":"2013-12-20 11:20:06 +0300"},{"content":"I booked this hotel to be next to the place my girlfriend was interviewing at. We walked into the room and wanted to vomit. There were worn spots and stains on the sheets and urine staining (clearly from decades of men missing the toilet) on the bathroom floor, and a spongelike mold growing out of the \"drain\" of the \"jet\" tub. It was absolutely disgusting. AND...even though we walked in and walked right back out.....they would NOT refund our money. It was worth it to call hotels.com and find a great place at Broadway Plaza Hotel for only $10.00 more a night. I would stay very very far away. Bed bugs, urine, and who knows what other things lurk here. I've stayed in placed with cockroaches and ants crawling the walls that were better than this place.....","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Camden Durgan","date":"2014-11-07 00:05:13 +0300"},{"content":"Finally I found somewhere I could write a review about this place to save others our pain. I see now on their website they have renovated somewhat. WE were NOT told at the time of our booking they were in the middle of renovations. Courtesy would at least grant that and give us the choice. Hopefully they have changed their ways but after reading latest reviews perhaps not. Towels were dirty, bathroom floor was dirty and room was dirty. I had to clean the bath before I could use it. Bed was hard, bedding disgusting. Glad it was a brief trip. They tried to put us in a room that had just been painted and the window didn't open at first. Then we asked for another room which had patches of carpet on the floor. Forget this hotel if you are light sleeper, tile floors line the hallways and suitcases rolling on the floors are noisy as is anyone walking by. We were on a tight budget and had to be in NYC that day. For around $170 at the time what a rip off!!!! I will go without food and save money to stay in a decent place and thankfully we have since found other hotels better quality for a cheaper price. Oh and yes there is no elevator and if they didn't have my credit card number I would have left on arrival after seeing the foyer!","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":1.0,"Rooms":1.0},"author":"Dr. Kay Bednar","date":"2015-09-27 11:56:53 +0300"},{"content":"The other reviews scared me, but I already booked this place before I read them. I don't know about all the other rooms, but our room was pretty nice (not huge), but was very comfortable. I requested a room with two queen beds and not only got 2 queens, but two singles as well! Really cool! The T.V. was small and not very many channels, but hey, we weren't there to watch T.V.! Great location. Nice folks working there. If you go there, request room 309. That was ours. Not bad at all.","ratings":{"Cleanliness":3.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Rita Jacobi","date":"2014-07-16 09:14:07 +0300"},{"content":"Was expecting hotel to be poor if not terrible after reading reviews on trip advisor. Was not prepared for what we discovered. Nobody even heard of the hotel, bugs in the rooms, rooms not cleaned, leaking toilet, very noisy etc and the receptionist advised us we were getting the best room in the hotel. A joke ! Don`t know how they are even allowes keep this place opened. Awful !!!! We spent very little time in the hotel but still would not dream of reccomending it what so ever. Worst hotel I have ever come accross !!!!!!!!!!!! Don`t book it !!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":5.0},"author":"Dejuan Feil","date":"2013-04-07 10:29:26 +0300"},{"content":"Our recent stay to this hotel was like going camping. Someone else booked this room for us. First of all we got there in the evening. We were not sure at first if we were in the right place because when the cab driver dropped us off we thought we were walking through the back door of a restaurant. We checked in took the elevator, which only held 3 small people to our room. The hall itself was so narrow two people had to take turns walking down them. Our room had no air on upon arrival, had to open the window to plug in the AC. In the room we had to take turns walking around because it was so small. We found smashed roaches on the wall, no soap, toilet lid, shampoo, no place to put toiletries in bathroom, had to ask for towels, looks to be like they had water leaks down the walls, had a dressing table but could not use it because the stool was between the table & bed and you could not pull out the stool. Make sure if you book here that your clothes are pressed unless you like ironing out in the hallway on attached to wall iron & board. NIGHTMARE!","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":1.0},"author":"Rosemary Hessel","date":"2015-01-22 03:14:03 +0300"},{"content":"This hotel was the worst hotel I ever stayed in. The room was dull and cramped. The sheets were dirty and the walls stained. The staff entered our room while we were out shopping and moved us to another room. The packed our belongings in bags and moved us from two to one claiming there was a plumming problem but I demanded to see our old room to discover it was already let to new people. We had to call the police to sort the problem out he said it was a bad hotel and we should not have been there. Then on our last night I was confronted by a huge mouse in the lobby!!! The hotel manager was abusive and hung up the phone when we complained. Don't stay here. Lisa","ratings":{"Overall":1.0},"author":"Jesse Kessler","date":"2015-12-24 06:27:31 +0300"}],"public_likes":[],"vacancy":false,"description":"2 self catering cottages,  sleeping 6 and 4-5 respectively.  Located in a very quiet hamlet, above the Swansea and Neath Valleys.  4* graded cottages, free Wi Fi, off road parking, cycle storage.  15 minutes from the M4 at Neath or Swansea.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}