{"title":"Mull","name":"Isle of Mull Hotel","address":"Craignure, PA65 6BB","directions":null,"phone":"+44 1680 812544","tollfree":null,"email":"isleofmull@crerarhotels.com","fax":null,"url":"http://www.crerarhotels.com/ourhotels/isle_of_mull_hotel/","checkin":null,"checkout":null,"price":"twin room from £65","geo":{"lat":56.4761,"lon":-5.7153,"accuracy":"APPROXIMATE"},"type":"hotel","id":19326,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"Staying at Hotel Curious was ideal for a quick trip to BCN. It is within walking distance to almost all of the sites worth visiting and close to a metro station for the few places not within walking distance. The room price was an good value for the location and included breakfast. The modern decor was fun. Also, given the location I was surprised by how quiet it was.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Tamia Block","date":"2015-04-18 23:01:02 +0300"},{"content":"I visited this hotel based on reviews. What a mistake. The only positive thing about this place is its location, it's smack in the center of everything. Rooms are tiny, there was no fridge where you could put at least a water bottle inside during really hot days. Rooms are not soundproof, you could hear everything!! There is no storage space, no cupboards, just a chair and a couple of hangers on a steel rod. The mattress was horrible and furniture in general was on the cheap side. Bathroom was tiny... tiny... tiny... and the shower leaked. The room was very dark and because we were in the back part of the hotel we had to keep the light open at all times. Breakfast was really lame nothing was really fresh. Staff were were utterly and highly indifferent. The problem is that I did not get what I payed for and mind you this hotel is not at all cheap!!!! I've been to 2 cheap-so-to-speak-hostel type hotels like this one, one in Berlin and one in Madrid and they are of the same standard but half the price of this place!!! I'm trying to think of something nice to say, but I can't. Overall I would not recommend it.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Lyla Vandervort Sr.","date":"2013-02-28 02:01:27 +0300"},{"content":"I stayed at the hotel for 9 nights: 1. The rooms are not soundproof. a) on my second night I could hear a couple arguing LOUDLY in the evening on my floor, in their own room (not in the hall). It went on for at least an hour and the front desk was called by another person on the floor; b) if there are children staying at the hotel, you can hear them - running and screaming in the hall and in the stairwells (while you're in your room) early in the morning; c) people can hear you have loud sex at 3am. I don't care that you're having sex. I care that it's 3am. 2. Realistically, it's a step up from a hostel. It's clean and people are friendly, but don't count on things like an alarm clock or an actual bed (the mattress sits on a metal frame). My bed squeaked every time I moved. Nor should one expect a closet (there's flimsy storage along one wall - shelves / rod with hangers). 3. The bathrooms are tiny but bigger than the ones I've experienced in London (UK). My shower didn't close properly and leaked. Nevertheless, the housekeeping staff cleans everything up by 1pm and you have a clean bathroom with fresh towels. 4. There are no 'do not disturb' signs for when you want to sleep in. 5. the breakfast provided was not my favourite (croissant, savoury rolls, cured meats, cheese, 2 types of cereal, hard boiled eggs some days, coffee from a machine, orange juice and yoghurt), however there are few options available in the vicinity with most places opening at 10, if not later. 6. AMAZING location. Steps from las ramblas, the boqueria, two metro stations and plenty of history. There's a bakery a few doors down, great restaurants near by and the Carrefour express is only a couple of blocks away on las ramblas for simple groceries like water and snacks (I wouldn't recommend the Dia grocery across the street from the hotel, they don't have the best selection) 7. Again, really great, friendly staff. The front desk people spoke english and french so it made my stay easier. Also, the housekeeping/ kitchen staff spoke english. Other: free wifi in all of the rooms and a computer in the lobby (free use). I would recommend this hotel for a shorter stay.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Madelyn Funk","date":"2012-04-19 03:20:30 +0300"},{"content":"We spent 2 nights in the Curious for 88Euro/night breakfast included. The room was very clean, spacious and well equipped, only a safe was missing (and the minibar for all those who like minibars, what we don't). The location is very central, just 50m off the Rambla and the Barri Gotic. Unfortunately, the building structure is so old and not re-done, that when you neighbour goes for a shower, you have the impression he stands on top of your bed, and we had a neighbour enjoying taking showers early in the morning.... Furthermore, the reception staff was not really helpful, nor smiling. Last but not least, if you expect vitamins in form of fresh stuff like fruits on a breakfast buffet, then do not expect it at the Curious. There are only white bread bakeries, sugar-stuffed convenience junk and cold coffee. Overall, good for small budgets, but not really pleasant in all aspects.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":5.0},"author":"Prince Zulauf","date":"2014-07-06 09:49:46 +0300"},{"content":"Parrot Key Resort is a nice little oasis on in a strip mall area just outside of old town Key West. There is a Walgreens next door. I did think there was a waterfront that was more than a dock and some jet skis, however there wasn't even a bench or a spot of sand on their waterfront. That said, the place is nice..the rooms large and mostly quiet with nice bathrooms. There are a number of pools and a small bar where some food is served up util 7PM. The drive to town and to most restaurants is only about 5 minutes. So the most compelling thing for me was that the price was very good for a nice, clean, and pretty base to visit Key West.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":2.0},"author":"Loyce Hilll","date":"2013-05-01 08:33:35 +0300"}],"public_likes":["Jamey Greenholt","Alyce Gerhold","Jackie Bednar","Miss Cynthia Brekke","Stone Price","Ocie Towne","Adaline Glover","Amina Frami"],"vacancy":false,"description":"The hotel overlooks Craignure Bay and is about 1/2 mile from the ferry terminal.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}