{"title":"Holyhead","name":"Boathouse","address":"Newry Beach","directions":"Near marina","phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.boathouse-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.316656,"lon":-4.645088,"accuracy":"ROOFTOP"},"type":"hotel","id":11795,"country":"United Kingdom","city":"Holyhead","state":null,"reviews":[{"content":"Small but well designed rooms on a quiet side street. Who stays in their room in Paris other than to sleep anyway? The shower has 6 cool water jets and a ceiling rain head as well as a hand spray. Near Montparnasse theaters, a fresh fish restaurant across the street from Le Dome bistro. Front desk staff was incredibly helpful with unique recommendations for dinner and macarons. The RER is a direct train from Charles de Gaulle that deposits you about a 5 minute walk from the hotel. We traveled with another couple and the small lobby was a good place for us to hang out. 20 mins walk to Musee d'Orsay, Notre Dame etc. This hotel is in the 6th arr but across Blvd Montparnasse is the 14th arr.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Isabella Schneider","date":"2013-07-11 18:39:43 +0300"},{"content":"I have recently returned from 4 wonderful days in Paris. I stayed at the APOSTROPHE HOTEL It is very nice modern boutique-type hotel. The rooms are comfortable had wonderful art details The staff are friendly, attentive and they seem to anticipate your every wish. All that I can suggest is that next time that you are going to Paris you must stay at the APOSTROPHE HOTEL. Me i Looking forward to staying there again !","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Danny Rippin","date":"2013-04-02 21:41:43 +0300"},{"content":"Lovely lovely lovely. The Jardin du Luxumbourg is your backyard, there are great bistros and restos nearby. The service is attentive and sweet. Very clean and comfortable rooms (the bed! oh the bed). I'd stay here again in a heartbeat.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Olin Connelly","date":"2015-10-07 12:41:11 +0300"},{"content":"My friend and I plan to stay in this hotel in April. I booked a room through Hotels.com. The listing claimed a Standard Room with \"2 Beds only\" however, I received my reservation confirmation and it claims: Preferences*: Non-Smoking, 2 Beds Room details: This nonsmoking guestroom has 1 full-sized bed with triple sheeting. I guess it will be luck of the draw if I get a room with 2 beds. I suppose this is more of a complaint about Hotels.com posting misleading room descriptions. But I hope the Holiday Inn can be accommodating and provide me a room with two beds so my friend and I don't have to alternate sleeping on the floor.","ratings":{"Overall":3.0},"author":"Loyal Kulas","date":"2012-11-28 03:39:57 +0300"},{"content":"The hotel is very clean and house keeping comes everyday to replenish towels, coffee, take out trash ect. and each night upon returning the room looks exactly the way it did when we first checked in. The hotel staff is friendly. I know using priceline.com sometimes your flight times will not correspond with hotel check in times but we were able to drop off luggage and continue with the day. I called the hotel later that day (before the 3 PM check in time) and requested a room on a higher floor if possible and the staff was very friendly and helpful. I would try to get a room on a higher floor if available (we were able to see the top of the 1 World Trade tower from our room) because there are buildings on every side and it looked like views on the lower floors might be limited. As far as amenities it was everything we needed. Coffee maker and free coffee, iron and ironing board, TV (basic cable and I think HBO), very comfortable bed, Heat/A/C unit below the window with a thermostat on the wall which is not annoying or creaky but makes a nice sound at night which helped me sleep and drowns out any outside noise, there is a vending and ice machine on the 2nd floor and a restaurant on the 1st floor (I didn't eat there so I won't comment on it but I know it was open early in the morning but closed when we returned around 11 PM). There are a couple of computers that you can stand up and use right by the elevators but I wouldn't expect to surf the web or anything. I guess they might come in handy if you forgot to print some tickets, itinerary or needed to check your email real quick. The area is very quiet at night and on the weekends which was fine with me (no outside noise, slept great) because you are a 2 minute walk from the Fulton Street subway station that gets you anywhere in the city at anytime of the day or night. There is also a 24 hr CVS right up the street if you need to pick up anything that you might have forgotten or might be prohibited to take on a plane. I enjoyed the area overall though. You are a very quick walk from Wall Street, Trinity Church, Federal Hall, World Trade Center Site ect. The only thing I would suggest is that if you are in Midtown you probably should eat or get food to bring back up there because after 9-10 PM a lot of the restaurants in close walking distance to the hotel are closed. There are a few places open but your selection is very limited. The bottom line is that it is a Holiday Inn, not the Plaza, so you shouldn't expect a ton of amenities but the area is safe, the rooms are clean and you will sleep good.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mable Emard","date":"2012-04-02 03:51:40 +0300"},{"content":"We stayed in a double room, which was incredibly cramped, but for Manhattan I dont think you could ask for much more - we got a good rate and booking was easy - booked on labour day weekend for the sunday night (booked on Saturday) and was pretty effortless. The bathroom was pretty average and the hand towel railing kept coming off the hooks, other than that the hotel was quite clean although the staff were not that friendly. Pretty average, but ok if you stopping in for a night or two.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Hillary Cormier","date":"2014-04-18 11:07:29 +0300"},{"content":"For my second time, I was sleeping in new york city while visiting the city. I was here for visit the city with some of my friends. The location was alright. I mean, this is in the business district, so a lot of restaurants and shops are closing after 6 pm during the week days, but there's a lot of subway near the hotel. The room is small but, you're NYC and for the price is perfect, we were 4 in the rooms and it was ok. The room was in perfect condition, we didn't see any bedbugs or anything and I don't have any feedback for my friends, so everything was clean in the room. Great staff too, always available to answer a question... Also, you should check the indian restaurant just the next door to the hotel, really a good choice! For the price and for the location this is a great hotel... I didn't have the chance to try the restaurant so I can't help you with it. The internet works really well too.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Eliane Kilback","date":"2012-06-24 00:46:40 +0300"},{"content":"The room is small. This is the only flaw. The service is excellent. Everything is clean. Also, the price is pretty good considering the location.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":2.0,"Location":5.0},"author":"Jaylen Robel","date":"2014-04-02 04:52:03 +0300"}],"public_likes":["Thea Bernhard","Jason Nitzsche","Mr. Cortney Torphy","Jillian Auer","Zetta Jaskolski","Bertram Kihn"],"vacancy":true,"description":"Pub, hotel, good food,","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}