{"title":"Paris/15th arrondissement","name":"Hotel Mirabeau Eiffel","address":"35 rue Sebastien Mercier","directions":null,"phone":"+33 1 40 58 14 81","tollfree":null,"email":null,"fax":null,"url":"http://www.hotelmirabeaueiffel.com/en/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.84405,"lon":2.27968,"accuracy":"ROOFTOP"},"type":"hotel","id":21651,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"The hotel was clean and the staff was very helpful and friendly. The pool was wonderfully clean and spacious. The DJ was delightful and we thoroughly enjoyed our visit. The hotel was close enought to the Pier that we caught the fireworks on Saturday night, what a sight over the beach.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Bailee Willms","date":"2013-11-08 23:38:50 +0300"},{"content":"The Plaza Ocean Club Resort is by far one of the best places we have stayed at during our stay in Daytona Beach. The staff was very helpful. Ashley at the Front Desk was great and offered us an upgrade to have an ocean front room and we liked the room so much that we even booked an extra night. Room is big and has a kitchenette, great balcony and view is beautiful, Pool is great along with the bar and restraunts. Staff very friendly. This is definitely worth the deal you get and pay for and staying one night is just not enough :) We will be back!!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Giovanny Adams","date":"2013-08-18 05:54:04 +0300"},{"content":"After having a horrible experience at a hotel a few doors down, we walked in to the Plaza Ocean Club hoping they had a vacancy. Lucky for us they did. The front desk girls were so pleasant and efficient and we were in our room within 20 minutes. The rooms were very clean and all of the hotel staff were so friendly. We had a wonderful time pool and beachside - this hotel was everything we needed!!! But, I will reiterate again - the staff made a huge impact on us returning. We will always check here first!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Phyllis Simonis","date":"2014-12-05 14:51:49 +0300"},{"content":"We live a little south of Orlando and booked our room at 1pm for a last minute getaway that night. We booked through an online site where you don't know the name till you pay, we got a GREAT deal! I didn't expect they would give us such a nice room, I didn't expect a decent view at all, but I was wrong. We got a room on the 8th floor with a wonderful view! The balcony was a good size, my whole family could fit out there at once (me, dh, 3 kids). The hotel was literally just a few steps from the ocean. The pool was large and the kids loved it. The rooms where rather spacious too, we where only staying the night but a family would be comfortable there for a week. I highly suggest this hotel to everyone!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Mary Legros","date":"2014-04-20 20:41:44 +0300"},{"content":"After a late arrival from the airport, we were greeted by cockroaches and a dog barking in the next room. We were moved to a different room which had dingy carpeting, peeling moldy walls in the bathroom, rusty bathtub, old worn sheets and towels and pigeon droppings covered the balcony. There was the smell of cigarette smoke everywhere. There were water problems each day - broken pipes. The hotel staff did their best to deal with these problems, but the building is in very bad shape. This hotel needs a major renovation.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Enos Fisher","date":"2015-04-02 16:43:16 +0300"}],"public_likes":["Ulices Hoppe","Carmela Yost"],"vacancy":true,"description":"Though it is off centered, It is new, clean and somewhat affordable","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}