{"title":"Yosemite National Park","name":"Porcupine Flat","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":37.807335,"lon":-119.564855,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33898,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"I cant believe the negative reviews. Place is Perfect!! I can't believe that people complain about this place. My wife and I (2735 yrs old) went there on the first part of our honeymoon from June 1st through the 6th. I cant say enough about how great this place is. We paid for the Royal Service and it is worth it for the private pool (3 months old) and private beach alone. Our room was fine but it really shouldnt matter too much because you should not be in it much. Lots of activities to do but we mostly sat around in the thatched roofed palapas that surround the Royal Service Pool (there are over 25 so it was no problem getting one everyday) or hanging out on the incredibly comfortable beach beds. We also got massages on the beach almost every day for about $30 for 30 minutes. I went Scuba diving at the oil wreck for free one day as well. The food and drink were good. Alcohol was very accessable. We had a six pack delivered to our room with in 10 minutes of being there and they also brought in Champagne and fruit on a couple of occasions. The restaurants are fine. I dont know what all the complaints are about. I think that poeple dont realize that they are in a different country and things taste different. Diet Coke is different so why wouldnt pizza and steak be different. I think this is what causes people to complain. The buffets were great for lunch and we had the private breakfast area for Royal Service each day which was great. At night we liked the Italian, Chinese, Japanese, Mexican and even the Grill which was right on the sand. If you are looking for an amazing food experience this may not be for you but we always enjoyed what we had and got plenty of it. We didnt go for the food anyway you should be there for the beach. The lobby is fun at night but the night life isnt great but we were so relaxed we were in bed by 11:30 almost every night.The beach is pure white sand, very large and bright blue water. Dont know what the compliants about it being rough were or the seaweed. I did notice those people that did complain while they were there. They paid for Royal Service and I guess expected a Butler to be chasing them around all day. Not going to happen. We did not see ours more than 2-3 times because we didnt need much. If we had he would have been there. If you dont ask you wont get. I saw a couple in the Royal Service Area complaining that they ordered two pots of cofee one reg. one decaf and they got a pot of cofee and a pot of hot water. DUH the instant decaf is in your room. Service was great at all times. We brought about $200 to tip with and used it all plus some. We tipped everytime we ate, scuba diving, Horse back riding, drank at bars etc. Overall this was a great hotel and I walked past alot of others along Bavaro beach and there was no comparison. Actually as people from other hotels walked past this one they would always stop and point because it was that much nicer. If you want to relax go here and dont listen to the people that compain becuase the are out of their minds and frankly were very embarrassing to be around. Please feel free to contact me if you have any questions.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Electa Stokes","date":"2014-07-10 01:53:13 +0300"},{"content":"Amazing Wedding!!! We got married at the Paradisus Punta Cana!! It was sooo amazing! It was the most beautiful wedding ever. The first week of our stay our friends came down with us, my husbands parents came fro 3 days and for the wedding. The wedding was on the 6th day and our friends and family left on the 7th day. The 2nd week was our honey moon. We had awesome weather, it only rained for 1 and a half days at the very beginning. The first week the afternoons got clouded over but it was nice to have a break from the sun by then anyway.The room we had was royal service, building #30, room 2303, I swear the best room and location, we were right on the beach.I have some tips for you.... If you like budweiser beer, which we do, you have to really push for it to get it , b/c they like to sell their Presidente...which is fine to, but we love our Bud! lolThe Royal Service is worth it for sure, you get way bigger and better beach towels, they make your dinner reservations for you, you get a better and fresher breakfast and just better service all around. But the main thing you pay for is the room location, which is close to the beach. The trains that drive around are awesome for getting drunk and then going on tour! We had a blast!Go to the lobby bar and ask 'Socrates for a Polka Polka!!! He is the best bartender and is the only one who knows what this drink is. It is the best drink ever!I have tons more I could tell you so email me if you wanna ask any q's!beks_roper@hotmail.com","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Zoe Mosciski","date":"2015-06-01 15:00:24 +0300"},{"content":"Nice place but if going with teenagers, please read on Pros: excellent beach, food is very good (there are nine restaurants, all are very good, so why do some of us Americans get so ugly and obnoxious if we can't get a table at one of them?), junior suite room is better than most (although beds and pillows are hard.) Weather was perfect. Service is good. Relaxation is a definite possibility, if you can avoid........Cons: too many drunken teenagers smoking too many all inclusive cigarettes. Lots of smoke everywhere. Parents should beware of the disco (opens at midnight) that was filled with drunken smoking teens (average age 15 to 16?) with porn playing on tvs. Some employees were also approaching kids with offers of drug sales. This is a hard place to relax with teenagers.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":2.0,"Rooms":4.0,"Location":-1.0},"author":"Arielle O'Reilly","date":"2014-03-20 06:37:13 +0300"},{"content":"Awesome Vacation This was our first time to an inclusive and it was awesome. I don't know how anyone can write a negative review about this resort. The hotel employees were very helpful and prompt. The food was very good with plenty of variety. All restaurants were fairly easy to get into with the steak and Mexican restaurants the best for us. Breakfast was great everyday with many different choices. Bar drinks were fine. Presidente beer tasted better early in the week, it's not primo.The beach is definitely incredible and the pool magnificent. Activities were plentiful. My teenage and early 20s kids were never bored. SCUBA diving lessons were included and appeared well managed. The golf at COcotal was very good. Actually better than expected with no problem getting around in 4 1/2 hoursteeing off at 8:30.Off property excursions are pricey. Don't swim with the dolphins. Rather tacky and wastes a half day for 20 minutes in the water. However, the ATV excursion was awesome.We will definitely be back.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Leopold Monahan","date":"2013-02-15 05:05:26 +0300"},{"content":"Fan-Freaking-Tastic Best beach, pool is realy nice, food great. You can't expect everyone in the world to speak english. Lots of French folks. Will be going back again and again. A few US$ bucks as tips goes a long way. Everyone freindly. Lots of topless women and man thongs so be open minded and respectful of other cultures please (don't stare). Remember you are representing the us down there. Walking is good for you so enjoy it, bring good walking shoes. Get round trip transportaion to and from the airport prior to going.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Tyrique Parker","date":"2014-09-06 05:27:18 +0300"}],"public_likes":["Mara Dietrich"],"vacancy":true,"description":"Porcupine Flat is located off of the Tioga Pass Road and offers 52 tent and RV (up to 24' in length) sites from July through early September on a first-come, first-served basis. Creek water only, must be treated before drinking.  Vault toilets are available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}