{"title":"San Diego/Downtown","name":"Bristol Hotel","address":"1055 1st Avenue","directions":null,"phone":"+1 619 232-6141","tollfree":null,"email":null,"fax":"+1 619 232-0118","url":"http://www.thebristolsandiego.com/","checkin":null,"checkout":null,"price":"$150-$200","geo":{"lat":32.71627,"lon":-117.16349,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25158,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"This is the only Hilton property in New Orleans that if you want to cancel, you must do so 30 days prior to arrival to avoid cancellation penalties. The Best Rate is basically an \"Advance Purchase\".","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Mozell Johnson","date":"2012-02-22 09:00:16 +0300"},{"content":"I read many of the reviews before booking this Hampton Inn. Some were all praise; some were a bit brutal. Based on the location and the many compliments of the staff, we booked a room for one night after arriving in New Orleans from a trans-atlantic cruise. As previously stated by others, the staff were friendly, professional, helpful, and knowledgable about New Orleans. We arrived early (9:30a.m.) and checked in. A room was not ready, so Bryan, a super nice and cheerful bellhop, securely stored our luggage while we set out to wander the Quarter. We returned around 2:30p.m. and retired to our room for a rest from a lot of walking. The room was a standard room with a king bed which was quite comfortable. Our view was of the building next door. I imagine that is basically the view from any room due to the location among other high rise buildings. Yes, the furniture did show some signs of wear with a few dings and dents. However, it was nothing monumental. We enjoyed having a flat screen TV, a microwave and a refrigerator in the room. The bathtub surround showed some age and discoloration; but again, truly nothing worth complaining about. The breakfast offerings were quite good and had a multitude of choices; eggs, sausage, gravy, fruit, yogurt, cereal, etc.. The afternoon cookies were a nice treat also. All in all, a really good night's stay in a great location.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Roscoe Hagenes","date":"2013-04-24 15:22:14 +0300"},{"content":"What a pleasant surprise. We were prepared for the worst for the hotel room and ended up being very happy. The room was small, but clean. And this is what matters the most to me. It was just a two block walk to the French Quarter. We were advised not to walk from the French Quarter after dark, but we went back to room fairly early and went ahead a walked. Never had any trouble. They also offered a breakfast that was pretty decent. We will stay here again if we get the chance to go back......and the price was excellent!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Arturo Lubowitz","date":"2013-12-29 00:10:42 +0300"},{"content":"Good location and nice safe hotel and rooms. In room safe was nice. Lots of space. Hot breakfast was fair with waffles and eggs. Wifi was consistently very slow. My main complaint was that there is no possible self parking option and the valet parking added $26 a day to your bill. We felt ambushed by this mandatory charge and cut our stay short. Maybe the other hotels do the same thing but we will not be returning to this hotel again when we drive to New Orleans.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":3.0,"Value":2.0,"Service":3.0},"author":"Brook Keeling","date":"2013-10-23 00:19:16 +0300"},{"content":"The rooms are huge and the building is classic and has a lot of charm. The price also includes microwaves, refrigerators, wifi, and a huge spread for breakfast in the morning - eggs, meat, biscuits, waffle makers, fruit, cereals, breads, etc. The location is awesome too - 2 blocks from Bourbon St. without being in the middle of the craziness! I did have some trouble with the staff. My luggage was lost and I didn't get to the hotel until 11pm - without luggage. The sign in the room says to come to the front desk for a replacement of any toiletries you forgot. So, I went to the desk for some basic necessities. The guy actually laughed at me and said \"why would we have those? There is a CVS down the block.\" Ummmm, ok, thanks, you have a sign that indicates otherwise... The next morning I needed to make a business call and my cell phone only had 2 bars of reception. I called the front desk to ask about the long distance rates. The response I received (after trying to call twice) was \"I have no idea.\" On the last day, I called down to see if I could extend my check out - I called SIX times before someone picked up. Also, no one told me I needed a key to get into the front door after 11pm (or where to insert it) so I stood there bewildered one night until I found the hidden slot to put my key in.... Anyway, the hotel itself is great and I would definitely go back, especially since I rarely need the hotel staff, this time was an exception. Also, I think they are short/poorly staffed because when I was waiting for a taxi, there were at least 6 people around me in the waiting area filling out job applications... So, bottom line, it's a great place if you're self-sufficient!!","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Rosalinda Morar","date":"2012-02-13 22:59:14 +0300"},{"content":"We stayed for 4 nights In December 2010. The hotel is located just a couple of blocks from Canal Street. We stayed in a 2 double bed room on the 12th floor. There were several lifts which were quick and also required your door key to operate. We had good nights sleep and did not hear any street noise whatsoever. This was one of the main reasons why we chose to stay outside the French Quarter. The room was very spacious it included flat screen TV, room safe, in room free wifi, A/C unit. The bathroom was fine, but a bit dated. The breakfast which is included in your room rate was better than expected. It included cereals, eggs, bacon, bread, bagels etc. It was constantly replenished whilst we were there. We walked everywhere from the hotel, the French quarter is just on the other side of canal street, The world war 2 & ogden museum are only about 10 - 15 minutes, and the aquarium is also close. We had a great time in New Orleans the New Years eve fireworks were good. The city was even better than we expected, we only have fond memories and would love to go back at some stage in the future. Not only does the city have some outstanding sights to see but the food is also very good. It was great to sample gumbos, po boys, beignets (from cafe du monde), praline etc. We had our best dining experience of our trip in MiLa which is located very close to the hotel. A visit to New Orleans is essential!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Xander Mohr","date":"2015-09-02 06:23:52 +0300"},{"content":"From the time we were greeted by the front desk, we were made to feel like a valued guest. We arrived at the hotel a bit early and had to check our bags. We requested a room on a high floor and got it. There were no negative remarks to our request or going in the back room to discuss. When we finally got to our room, it was clean and larger than I would have guessed for a Hampton.( front desk staff member called to see if everything was ok). The breakfast area is located in the 4th floor dining area as well a computer and large screen TV. The hotel also has free wi fi throughout the hotel. Breakfast is the typical Hampton Buffet Breakfast. There is a gym on this floor also but I did not use it. Parking is costly, we did not rent a car. We took a cab which is $33.00 flat rate to the city(plus tip). Cabs are plentiful in front of the hotel if you need a ride to the airport. I think there is a Shuttle for $20.00 per person from airport, since there were two of us, it was cheaper to use a cab. Hotel is located 2 blocks from Canal Street..cross it and you are at the beginning of the French Quarter. There is a CVS on the corner to pick up odds and ends. On week days the hotel opens up to an office building with shops and fast food places to eat on the second level.. I would recommend this hotel and would stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Stella Osinski","date":"2013-08-08 14:02:48 +0300"},{"content":"We were in NOLA Easter weekend 2010 and we chose the Hampton Inn on Carondelet as our base. We stayed here for 2 nights and generally pleased with our choice of hotel. The room was spacious and the king bed comfy. We liked the fact that the room came with a microwave and a mini fridge. Internet was also complimentary. The only thing we didn't like was the bathroom. It was too small and it didn't have a bath tub. The bath amenities were also rather basic. The hotel offers a daily complimentary breakfast from 6am to 10am. We are not fussy eaters so we felt the food was adequate. A choice of breakfast cereals, sweet breads, a waffle station, fresh fruit, yogurt, a hot food station, fruit juice, tea and coffee. The breakfast room is spacious and comfortable -there's a big flat screent T.V. in the room and the hotel's only computer is located in there also. Note that tea and coffee are served all day long from the breakfast room. The hotel is in a safe location and less than a 5 minute walk to the French Quarter. There is a CVS store just around the corner on Carondelet and Canal so handy for snacks / drinks, and the St Charles Streetcar goes pass the front of the hotel also. Overall we were fairly happy with our stay. We would stay here again providing the room rates stay competative.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Larissa Daniel","date":"2012-11-01 17:53:43 +0300"}],"public_likes":["Rex Waters","Mr. Jermaine Zieme"],"vacancy":false,"description":"A contemporary and casual hotel, the Bristol features an unusually large pop art collection.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}