{"title":"London/South Bank","name":"Southwark Rose Hotel","address":"47 Southwark Bridge Rd","directions":"tube: London Bridge","phone":"+44 20 7015-1480","tollfree":null,"email":"info@southwarkrosehotel.co.uk","fax":null,"url":"http://www.southwarkrosehotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.5057,"lon":-0.0951,"accuracy":"ROOFTOP"},"type":"hotel","id":16348,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"This is not a five star We recently stayed at the Riu Taino and it is definitely not a five star hotel - not even close. Overall our trip was pleasant - beautiful beach, great staff, moderately decent food but we definitely did not feel that we received good value.Good points:- close to airport- beautiful and well kept beach- all aspects of the facility are within a quick walking distance- excellent staffChallenges:- the beds are like sleeping on concrete and the bedding is poor at best- the food is moderate and quite boring - they serve the same thing again and again...- their advertising is misleading - there was no child care center on site and no restaurants on site - only 2 buffets - although the buffet indicates otherwise- don't even think about sleeping before midnight as the pounding of the disco is everywhereOverall, our trip was pleasant but they should be clear on their advertising as we felt mislead and they should drop the rating to a 3 star.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":2.0,"Rooms":2.0,"Location":-1.0},"author":"Mrs. Suzanne Gleichner","date":"2012-12-16 08:14:10 +0300"},{"content":"not a four star We stayed at the Riu Taino Jan 13 thru Jan 16. This was my first time visiting the Dominican and probably the last. I have stayed in several Riu hotels in Mexico and Jamaica and have always loved what the RIU offers, my mom even wears their staff shirt!We thought with a Riu it has to be nice, wrong. I hate when reviews drone on about the negatives so let me keep it simple. I'll start with the positives. The beach is amazing, just beautiful. The water was chilly, but I expected that for this time of year. There was always plenty of beach chairs so you could always find somewhere nice to sit. There is a flea market at the end of the beach, but if you're not a haggler don't go. I would rather pay the extra dollar and shop in peace at Carribean Street. They have basically the same merchandise. If you think you'll be warm in the pool, guess again. The pool was to cold to swim in, I only got in once, after several daquiris.The drinks were always tasty but the bartenders could care less how long it takes to serve you. They also speak very little English and do not make an attempt to let you understand them. no salt for your margherita is not in the Spanish language. My biggest problem with this resort is how indifferent the staff is about pleasing you. I'm not pampered by any means but they are very rude. The cashier in the hotel gift shop was upset with me because after asking her to sit items to purchase off to the side, she rang them up anyway. I told her i would come back in an hour with the money she rolled her eyes and gave me dirty look. She told my friend to tell what size t-shirt she was looking for so she would quit unfolding them!Upon check-in we were told the room would not be ready for an hour. We ate and cameback. We were taken to our room but the maid was still cleaning...we watched her clean for 20 more minutes! The room was very small with one double bed and two twin size beds! Do you go on vacation to sleep in a twin bed? The room was mustier than the usual smell, but fortunately I had brought an air freshener. The fridge in our room kept things luke warm with no temperature dial. It was on the second day we realized you had to wedge it up against the wall to keep it shut!Europeans seem to out number the Americans here. I'm not sure why but they seem to be the rudest here than I have ever experienced. They cut in front of you in line and bump into you as if you weren't even there. We found a wallet one day and tracked the people down ourselves. We weren't sure the hotel staff would bother returning it. They rewarded us with two Italian bottles of champagne! They were probably the nicest people we met whole time.These problems were only a fraction of the things that went on. I think this could be a great resort with a little time and effort, but it definitely needs improvement both physically and with the attitudes of customer satisfaction. I hope this has been helpful. I wish we had shopped for a better place. Maybe you would be better off at the Palace.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Susan Windler IV","date":"2012-06-17 10:12:49 +0300"},{"content":"I love Riu Taino It`d take thousand of words to say how amazing is this hotel, but all I can say is that Riu Taino is the best hotel in Punta Cana. There are hotels bigger or newest than Taino (it was built in 1991) but the atmosphere there is incredible. It seems to be a big family, all the employers are really friendly,all, even the managers are amazing, Santiago, Franklin and Luna are the best.They are the hole day walking around the hotel,rooms,pool,beach.bars,restaurants, asking the clients if everything is ok (I never saw that in any hotel), if they need something to improve their holidays.Thank you so much, Riu Taino, I`ll come back there.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":-1.0},"author":"Clarissa Homenick","date":"2015-11-15 12:05:15 +0300"},{"content":"Great Experience at Riu Taino Our family (2 adults, two teenagers) stayed at the Riu Taino February 18-25, 2005. We had a wonderful time and would go back. Our only prior experience in Punta Cana was at the Barcelo Palace, and we would rate the two as roughly equivalent, with the Riu Taino having the edge for liveliness and staff friendliness, and the Barcelo having slightly better accommodations and food. We arrived at the Riu Taino on a Friday mid-afternoon. Since we did not take a charter, we arrived at the hotel by taxi (arranged in advance through Coco Tours, the local agent of TNT Tours) not tour bus, so there was no crowd at check in. We had scoped out the room locations in advance, and had e-mailed the hotel prior to arrival for a room closer to the beach. The hotel had e-mailed us back, indicating that they could not guarantee location, since it was their busy season. We initially were assigned to a room at the back of the property (near the Naiboa), but after some persistent (but nice) urging, the reception staff located rooms opening up the next day closer to the beach. The reception staff, particularly Rossy, was very helpful and attentive, and spoke English very well. We moved the next day, and were very happy with the location. We had two rooms on the second floor, which worked out well since our teenagers were right next to us.  We liked the bungalow set up of the Riu Taino, rather than large buildings like some other hotels. Our one complaint about the rooms (hopefully the Riu management reads these reviews) is that they really need updating, particularly as to curtains and bedding. We are more interested in the beach, pool, restaurants, etc., and did not spend much time in the room, so this was not a big deal to us. The cleaning staff deserves kudos for dealing with the mess left each day by two teenage girls. We made sure to leave a few dollars each day as our way of thanking the cleaning staff. The restaurants were satisfactory, but nothing special. We thought the food was a touch better at the Barcelo Palace, although we certainly never went hungry. We really liked the fact that food was available almost any time of day (until about mid night). When the main dining room is closed, you can get hot snacks, fruit, coffee, soda, etc. at the pizza restaurant on Caribbean Street or at the main bar area near the pool. There are two seatings, since the main restaurant is not large enough to accommodate everyone. We were assigned to the 8:30 seating, which we initially thought we would not like, but didn't try to change and actually ended up liking the late dinner (we would get a late afternoon snack at the bar to hold us over). We exercised the same caution with buffet food as we would in the U.S. We stuck to the hot food, fruits, pizza and breads, and stayed away from the salad bars and cold food. (The salad bar and cold food looked fine, just our self-imposed caution.) We did not experience or hear anyone else complain about any of the illness problems that have garnered a lot of attention. The hotel was extremely clean, and they seemed to go out of their way to keep it that way. We didn't notice a flying or walking bug the whole time. The food definitely reflected the European clientele, with a number of hot dishes with a Germanic tone to them. We would have liked to see more grilled to order fish and chicken, rather than grilled foods prepared in advance and then set out in pans. There was plenty of red meats, but we are not heavy meat eaters, so we can't attest to the quality. The clientele definitely was heavily European, with a large percentage of Germans, some French, and a variety of others (Italy, Eastern Europe, etc.). There was a heavy contingent of wild and crazy English speaking Canadians (is there any other type?), but just a few Americans. Contrary to some reports, the Germans were just fine, but somewhat more reserved, which could be misinterpreted as rude. Our casual observation was, nonetheless, the closer you got to the buffet, the more likely you were to have a close encounter with a German senior citizen coming back for more.  The Europeans smoke incessantly, which we also observed at the Barcelo Palace. It was shocking to see mid-teen Europeans chain smoking in front of their parents. The ventilation was good everywhere except the disco and the bar off the lobby, so this was not a huge problem. The animacion staff, particularly Rigo, Rosa, Jimy and their boss (never did get his name) were great. For us, this was the key difference which likely will cause us to return to the Riu Taino over the Barcelo Palace. The pool area was a buzz of activity, and the staff extremely energetic and friendly. I never got the feeling that anyone was looking for a tip, although we handed out plenty of tips just before we left to thank the animacion staff for making our trip so great. The beach is beautiful, although less intimate than the Barcelo Palace. We had a particularly windy week, so we ended up spending more time at the pool than we had anticipated. The pool chairs were reserved early (by 8 a.m. they were gone), but that was not a problem for us since I got up early each morning for a run on the beach. For you runners out there, the beach is more suited to running than at the Barcelo Palace, since it is wider with more of a water line (so you don't have to run on heavy sand). Having run a half-hour or so in each direction, I can attest that the Riu Taino has the best beach in sight.  We did not spend much time at the other Riu hotels. The Riu Palace looked beautiful, but was too fancy for our tastes (we go away to dress down, not dress up). The Riu Bambu was much newer, but we liked the location of the Riu Taino, which was closer to the beach and Caribbean street. We were much more comfortable letting our teenagers stay out late at the disco on Caribbean street since it was just minutes from the Riu Taino, but farther from the Riu Bambu. Our only complaint, if you call it that, is that the Riu needs to exercise closer control over the independent vendors they allow on the property. We had a bad experience with the hairdresser (for braiding) on Caribbean Street, which has a booth at the pool. We were willing to pay more than the braiding at the market down the beach, for the convenience of having it done at the pool. The braiding was not the way my 14 year old daughter had described (probably a language problem), but when we asked them to correct it, they wanted to charge us another $20. The money was insignificant, but we objected to paying more just to get it right. The owner of the hair salon was extremely aggressive, going to the extent of trying to get the manager of the Riu Taino to force us to pay. Fortunately, the manager, a very nice guy from Spain, backed us up 100%.  Also, the hotel allows outside vendors into the hotel lobby once a week to show their wares, mostly jewelry, cigars, paintings and tee shirts. This is fine with us, but we felt uncomfortable since the vendors were aggressive in trying to get us to buy. This is fine when this happens at the beach market, but not on the hotel property. These minor complaints, however, hardly detracted from our overall experience. We would rate the Riu Taino a solid 4+ star (by Punta Cana standards), and it would be a 5 star with a little cosmetic updating. We will be back for sure. BW from Rhode Island.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Lilyan Ortiz","date":"2015-10-17 21:06:55 +0300"},{"content":"Enjoyed my vacation at Riu Taino Just returned from a week at the Riu Taino in Punta Cana. Despite the weather, we really enjoyed our vacation. Upon arrival, our room wasn't quite ready so, we grabbed a couple of drinks in the bar. Imagine our delight when we did get our room and we were upgraded from a regular room to a suite. The room was gorgeous and very, very clean. Our housekeeper Lucia did a super job eveyday and left us towel swans and flowers everyday as well. It was a noce touch that did not go unnoticed.The resort itself is just gorgeous and very clean. It was nice to have access to the other Riu's as well. The beach is beautiful and clean. One day when we were walking on the beach, we saw a local up at the top of a 50 foot palm tree getting coconuts. It was pretty cool to see...once in a lifetime kind of thing.The staff at the Riu Taino is amazing , pleasant and try very hard to help. Despite reviews I read before I left, they're English is not as bad as other reviews say...be patient...they are listening to many different languages day in and day out.The food is plentiful and very tasty. I ate just about everything. I had a bit of upset stomach one day but, my boyfriend was fine the whole time.All in all, we had a great vacation and I would recommend the Riu Taino for anyone's vacation!!! Have Fun!!!!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Elmo Cassin","date":"2015-04-26 04:58:43 +0300"},{"content":"loved rhe resort!!!! Travelled to Riu Taino in April 2002 with girlfriend and parents ,was a little apprehensive as you know how picky parents can sometimes be.Let me tell you from the time we got there the place was all class very quick check in very organized rooms were nicely appointed in room bar with liquer dispensers were a nice touch. Grounds were absolutely lovely I for one am a very picky eater cannot eat fish allergic reaction shellfish actually but there was a abundance of choices every night,ranging from chicken to beef to pork and pasta no shortage of options for the picky!! Beach was incredible just how I remembered it way back in 1987 just like paradise Animation staff very outgoing and friendly always with a smile on their face and a willing Hola!  Loved it so much that we went back the following year in February and got engaged proposed to her on the beach on Valentines day,reception was great settting everything up decorating the room with ballons etc.  Went to Paridisus Playa Conchal this past February a little more refined more dining options but basically the same quality food but for the price I would recommend Riu Taino,fiancee and I did not know we found a diamond in the ruff !!!  Going back in April of 2005 look for the guy at the pool bar with the 64 oz Tim Horton's mug!!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Angeline Dibbert","date":"2015-12-06 15:31:24 +0300"},{"content":"tHE Best Hotel I have EVER been at Rui Tiano is one of the best resorts i have been at. The rooms are beautiful with a maid that always leaves flowers by or bed or a chocolate. Everything at that hotel is about the guest. The workers are friendlier than ever and are at your ever need. Dont be scared, you will make a lot of friends. The pool, and ocean are beautiful. This resort is along side 4 other of it's sister resorts and you can travel freely from each. There are 5 shows at any givin night to attend. The shows are really good, and funny and beautiful. There is deffinatly a show for every single person. They have amazing water sports. Not a lot of places include everything, but they really do, and whatever they dont include, you can buy it for very cheap. Every night a bazaar comes to one of the 5 resorts and you can hagal items for just about any price. I think there were 2 or 3 resteraunts to attend but my party didn't even go to one because we were perfectly happy with the buffets, filling everyone's needs. I truely recomend this vacation for everyone. Everyone will love it!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Caitlyn Harris","date":"2013-12-26 18:30:32 +0300"}],"public_likes":["Mr. William Kshlerin","Tevin Gibson","Kevin Stark","Rodrigo Oberbrunner","Liza Batz","Madilyn Jacobson","Oscar Jacobson","Mollie Blick"],"vacancy":true,"description":"A boutique hotel less than 200 metres from the Thames. Air conditioned rooms with en suites, meeting room facilities.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}