{"title":"Death Valley National Park","name":"Texas Spring","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$14 per night","geo":{"lat":36.45916,"lon":-116.85451,"accuracy":"APPROXIMATE"},"type":"hotel","id":7394,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Just back from 3 nights and 4 days at the Hotel Maydrit- it was excellent!! The hotel is located in a quiet residential area on the outskirts of the city- a perfect location for relaxing, sunbathing and taking nice walks! We arrived at 2pm when the shuttle wasnt operating- but it was only 15 euros including the airport supplement which isnt bad at all! Just make sure you have the hotel address or a little map of its location printed out as the taxi driver hadnt heard of it- but found it with his sat nav! The hotel is lovely, very clean and definately of 4 star standard! Our room was impressive, the air con worked perfectly and there was an English tv channel. The beds were sooo comfortable and soft! All the staff were very helpful- the staff at reception printed off maps for us to walk to the nearby shopping mall which was only 10 minute walk away. The bar and restaurant staff were also lovely and very helpful. The pool area was great! The pool was bigger than it looks in the photos- about 10m long and has 4 sunbeds and plenty of room to lay your towel down to sunbathe. There is also a lovely garden area just next to the pool with comfy chairs to lounge on while having a drink or a snack. The metro station is about 5 minute walk away up the street and it costs 1 euro 50 to get to the city centre, the metro was clean and very easy to use! There is also 2 little shops close by to buy water/ drinks/ snacks/ ice creams and there is a cheap Chinese restaurant right accross the street. There is a shopping mall about 10-15 minute walk away with loads of shops including H&M, Zara, Primark and also has restaurants and fast food such as Burger King and McDonalds. Ive seen that people have commented that you have to pay for internet- if you check the computers sometimes theres time still left on the counter and so me and my boyfriend found we were able to use the net for free quite a few times! :) I would definately recommend the Maydrit as somewhere that is calm and tranquil compared to the busy city- however the city is only 20 mins away by Metro to pop in and out! I had a lovely long weekend sunbathing and relaxing and would go back anytime!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Colby Nolan","date":"2014-09-12 14:43:31 +0300"},{"content":"Stayed 4 nights in October 2010. Immaculately clean. Very sharp and modern. Easy set up Wi-Fi for each room (EUR10/day). Big bed, fantastically comfortable and great pillows. Stayed in 2 different types of rooms. One on lower floor had a bath, upper floor had better view but no bath. Both large rooms. Small fridge with mini-bar in room. Air con good. Big screen LCD worked fine. Hotel generally quiet at night. About EUR20 by taxi from the airport. Write down the address beforehand as most taxis do not know where it is. 5 minute walk to the Metro. El Capricho station is about 20 minutes ride to the centre of town. Breakfast was good and thorough. Dinner menu limited but the cuttlefish entre was divine and the steak was very good also. I believe there are a couple of restaurants nearby but I did not try them. The front desk staff and at least one in the restaurant spoke english fairly well. No gym unfortunately but a park is 5 minutes away if you need to go for a walk/run. There was a pool but being autumn it was covered so I did not try it. I stayed here for work and can recommend the hotel. If you are sightseeing and shopping in Madrid however you might want to stay closer to town.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Amos Waters","date":"2012-10-17 14:54:42 +0300"}],"public_likes":["Telly Pacocha","Rowland Hickle"],"vacancy":true,"description":"(Closed in summer). Located at sea level, Texas Spring has 92 sites with water, tables, fireplaces, flush toilets, and dump station. Texas Spring is first come first served with self registration. From March 17 through April 15, Texas Spring is designated primarily for tent camping with a limited number of RV sites. For the summer, reservations for the two Texas Springs campground group sites are available by calling (760) 786-3247.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}