{"title":"Inveraray","name":"Inveraray Youth Hostel","address":"Dalmally Road, PA32 8XD","directions":null,"phone":"+44 1499 302454","tollfree":null,"email":null,"fax":null,"url":"http://www.syha.org.uk/SYHA/web/site/Hostels/Inveraray.asp","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.2318,"lon":-5.0765,"accuracy":"ROOFTOP"},"type":"hotel","id":12229,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"Dont be mislead by some hotel booking website - it's absolutely not a 5-star hotel. The staff service is to be improved: they first offered me a room with poor view, but actually i've booked a deluxe room via travel agent (and of coz paid more); I called the front desk and soon found out this was their 'mistake' and they offered me a room with city view, which was much nicer. Generally the room is quite small, breakfast.....emmm simply edible. I would have brought my own towel if i know the bathroom towel is of such a bad quality.","ratings":{"Overall":3.0},"author":"Imelda Renner","date":"2015-07-20 04:34:55 +0300"},{"content":"We have travelled to Singapore many times and this is our favourite hotel. Only open about a year, it's a great position at Clarke Quay. There's a covered walkway from the hotel which brings you to the river and all the nightlife of Clarke Quay -including a great sate restaurant. The first time we stayed at the hotel we were given a non-smoking room which smelled so overpoweringly of smoke we couldn't stay in it. The staff were incredibly polite and helpful and gave us a far superior room with their apologies. The second time we arrived at the hotel at 6am after a long flight from Europe, and the staff accommodatingly found us a room by 8am. The hotel has a glorious swimming pool and serves great snacks and drinks from the pool bar. The rooms on both occasions were clean and with really comfortable beds - although the pillows were a bit hard- and a lovely shower with the biggest shower rose we have ever seen. You might pay a bit more to stay here, but it is worth it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alverta Littel","date":"2013-09-19 09:45:36 +0300"},{"content":"Park Hotel Clarke Quay is nicely located away from the busy city limits, coupled with the fantastic view from the Crystal Lounge, its a wonderful way to spend the weekends. It is within walking distance to some of the water drinking holes in clarke quay as well. Team has been very attentive to all needs in all parts of the hotel, warm serviceis being given be it to a local or to internationial guests. Highly recommended to peopole from around the world to give it a try, you will not regret it.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Henri Toy","date":"2013-12-14 08:40:02 +0300"},{"content":"We stayed 2 nights here on a stopover from Europe. We arrived after a long flight and were delighted to be given an upgrade. The staff were fabulous, so friendly and helpful and polite. The room was on the 10th floor and very nice. Really comfy bed although the pillows were too thick and hard but we got used to that. The decor was beautiful and the bathroom lovely with an excellent shower. We had a great view over Clarke Quay. The room was very quiet and cozy. We also had free wifi in our room. I'm not sure if they all do, or if it's just he rooms on the 10th floor that get that, but they have free wifi in the lobby as well. The location was great, we were able to walk everywhere we needed to and it's close to the metro for longer distances. The breakfast was excellent. the pool was gorgeous and I also had a poolside spa treatment which was very relaxing and not too badly priced for a hotel based spa. Overall we had a great stay and strongly recommend this hotel to others. It's only 1 year old and is lovely, clean and modern. The staff were the friendliest of all the hotels we stayed in for our 2 month holiday, I can't speak highly enough of them. I have noticed other reviews have mentioned rude staff, so maybe they have been told to pick up their act, but we really were impressed with the staff's professionalism.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Creola Dickens MD","date":"2014-02-01 11:12:46 +0300"},{"content":"I Stayed in this hotel in Mid May 2010 for 3 nights. I Stayed in Superior Double room and I Felt so comfortable in this hotel. I ordered the room in No Smoking Floor. The hotel so clean n service from the receptionist was good enough… (sadly with no smile in their face…. ) The bed and the shower was so good. The room internet access is chargeable Taxi order was so easy and the front man always ready to get us a cab. We can reach this hotel from the nearest MRT Station (Clarke Quay) for approximately 15 minutes by foot. And we can enjoy the river view along our way to the hotel. To get a breakfast in the morning you can walk across the street to the UE Mall and you can find delifrance coffeshop in there. The’re already open in 7AM. I will be back to this hotel someday. but, please give the guest your smile... :p","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Bella Beer MD","date":"2014-05-15 03:56:00 +0300"},{"content":"We booked a superior room and stayed on fourth floor which is a smoking floor. We got this room even after asking for non-smoking room as non-smoking rooms were occupied when we checked in at evening. However, the room was smoke free while the smell of smoke was prominent in the passage. There is no bath tub in the room and no free drinking water. The room is modern and we loved our stay in this hotel. This hotel is 5 mins walk from Clarke Quay which has many dining options and popular night spot in Singapore. Please ask Hotel reception for short cut to this place. Swimming pool is gorgeous. Overall, I recommend this hotel for singles or couples and it offers good value for money.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Salvador Gutmann","date":"2012-04-24 13:50:20 +0300"},{"content":"This was a wonderful hotel situated in the best area, in my opionion, in Singapore. It is in Clarke quay beside Robertson quay. The rooms are spotless and the bathroom and mini-bar well stocked. The staff are extremely courteous and friendly. Compared to other hotels which I researced this hotel was one of the best in relation to reviews and price. We never used the restaurant or the pool as we were too busy sight-seeing and as most of the restaurants in Clark quay and indeed Singapore are overpriced we tended to eat at the hawker centres etc....They are inexpensive and the service is quick. Mostly everything is cooked as you stand. Do buy duty free once landing at the airport as alcohol is a rip-off. Cost of a pepsi is aprox £5 at a pub and this does not include any alcohol. Beer is around £7 for a glass (not pint). The GRT is only a 15 min walk away and is necessary to get around. It is easy to use and inexpensive.Certainly if you want a very clean hotel at a good price (for Singpore) stay at PARK HOTEL CLARK QUAY. Go to the Fairmont Hotel for the best view from the highest hotel in Singapore. The new Asia bar. Happy hours until 9pm . So much better than Raffles.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Rachael Gutmann IV","date":"2013-01-20 06:11:24 +0300"}],"public_likes":["Wilbert Schmeler","Sigrid Gutkowski","Zoey Robel","Thomas Schmitt","Selena Hettinger"],"vacancy":true,"description":"28 bed SYHA hostel, with beds costing around £9-15 per night.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}