{"title":"Death Valley National Park","name":"Mesquite Spring","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$12 a night","geo":{"lat":36.96229,"lon":-117.36875,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7390,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Brother and sister run pension. Both were incredibly nice and patient with us. The other guests were mostly families or older couples traveling, no wild party people. My Mom and I travelled together in Turkey and this was our first stop. We unfortunately found quite a bit of mold in our bathroom which created a slight smell, but we were given the option to move into a different room. Given everything and the prices of other hotels/pensions in the area, I recommend (not highly recommend, just recommend) this pension.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Garfield Goodwin","date":"2013-11-12 16:21:48 +0300"},{"content":"i stayed in this hotel for 1 week and all i can say is that it was outstanding ! it was so clean , all the staff were very polite,generous and helping , i stayed in a very comfortable room , amazing view , and also great weather . the bathroom as clean too and the person at the reception was very helpfull , i was very confused of getting out of the area tofind the nearest area out and the receptionist gave me his number , helped me out , gave me a map and also called a cab for me . i really enjoyed staying there and hopefully someday i will come to turkey but not for a business flight it will be a holiday for me and i will come to this hotel !!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Julia Sipes","date":"2012-05-28 09:41:54 +0300"},{"content":"Saw this hotel labeled as a \"find\" in Frommers. What an understatement. We walked everywhere from this fabulous location, enjoyed cocktails on the rooftop terrace and slept comfortably. Though you had to pay, the shuttle to the airport offered by the hotel was extremely reasonable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Olaf Durgan","date":"2013-03-18 11:26:27 +0300"},{"content":"Ok, so for anyone looking to visit Istanbul here is what I have to say: You definitely want to stay in Sultanahmet area...since it is the location of all the historic places...plus you have the Gran Bazzar near by, and it is just very typical!! And in order to have the perfect experience in Sultanahmet and in Turkey in general I recommend 100% OCEANS 7 HOTEL....it is the best in the world!! I stayed there the second time I went to Turkey...keep in mind the first time I went to a 5 star hotel in Taksim....but Oceans 7 hotel was far better!!! The staff is so niceeeeeee, they helped us with everything...they even called the airline for us when we had a problem, they were always prompt to help us and to make sure we were happy!! They always had a happy face!! The rooms were very clean, the cleaning lady is the best and she is always around...so no matter how late you leave your room she will be there to clean it! Breakfast was excelent...we even had an special breakfast the day we left...kind of like a going away gift!!! I mean if you want to stay in a beautiful, typical, friendly, super clean hotel and perfect location in Istanbul...that is the place!!! Oh...did I mention that the location of the hotel is so perfect that we never even once had to take a taxi....we walked everywere...even to the Bosforous!!!! I am 100% satisfied with this hotel and will recommend this to anyone out there who wants to have the perfect experience in Istanbul, Turkey! Teşekkür ederim Oceans 7 Hotel!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Andre Veum","date":"2012-03-15 14:28:52 +0300"},{"content":"Ocean,s7 Hotel is only a 3 min walk from Aya Sophia, Blue Mosque, Basillica Cistern, and the Sultanhamet tram stop. Gulhane Park, Topkapki Palace, and the Archeology Museum are also about 5-8 minutes away. Grand Bazar and other Sultanhamet attractions are all about 10 min away. Rooms in hotel are very clean and suitable size. View from the terrace level is great, nice touch.All over the hotel is very well maintained.Staff is very friendly.Guy at the desk gave us realy great aria suggestions.We recommend this hotel to whoever visits Istanbul.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Montana Lueilwitz","date":"2014-06-08 20:44:58 +0300"}],"public_likes":["Anibal Lueilwitz","Dario Vandervort III"],"vacancy":false,"description":"(Year Round). Located at 1,800 feet 3 miles from Scotty's Castle, Mesquite Spring has 30 sites with water, tables, fireplaces, flush toilets, and a dump station.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}