{"title":"Inverness","name":"Beach Cottage B&B","address":"3 Alturlie Point, Allanfearn, Inverness, IV2 7HZ","directions":null,"phone":"+44  1463 237 506","tollfree":null,"email":"info@beachcottageinverness.co.uk","fax":null,"url":"http://www.beachcottageinverness.co.uk/","checkin":"14.00","checkout":"10.00","price":null,"geo":{"lat":57.517827,"lon":-4.147631,"accuracy":"ROOFTOP"},"type":"hotel","id":12239,"country":"United Kingdom","city":"Allanfearn","state":null,"reviews":[{"content":"We had the misfortune of believing that (according to their website) this would be a great place to hold our annual reunion. So we, and quite a few others, rented rooms which included a suite to gather in and webcast from (for those who could not attend). To begin with, we had asked for early check-in yet had to wait for hours in the lobby so they could \"clean the room\". When we got to the suite it reeked of chlorox, yet it wasn't clean. There were ants all over the place (this was in the \"newer\" section). When we told housekeeping about the ants, they just came and sprayed more chlorox which did nothing to the ants. The refrigerator was dirty and wobbly, and the cabinet doors wouldn't close because they fit so poorly. The kitchen area floor was dirty, and housekeeping did not give us clean glasses each day, instead they just rinsed (no, not washed) the ones we had from day 1. We had to use the shampoo samples to wash our cups and glasses ourselves. The topper for us came when we tried to hook up a laptop, and discovered no wifi connection. Wouldn't be a problem, except that we had only taken the suite so we could gather to webcast to those who couldn't attend. The hotel staff lied to us day after day saying that someone was on site working on it, that it would be fixed later that day. Well after 6 days of waiting we were finally told by the company that services the internet for Ramada Gateway/Westgate that the internet was down due to a broken part, which for some reason was not available. Had we known, we would never have taken the suite, in fact we would not have taken the hotel. Seems we are the ones who got taken. They only gave us a credit of $20 a night. Seems strange to me that they would charge us $.25 a minute to use the lobby computer, yet not credit us for that same amount because it was not available in our suite. Stay here again?? Not on your life!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":2.0},"author":"Opal Mayer II","date":"2012-07-09 09:25:45 +0300"},{"content":"Great bang for your buck. no complains here. Cant beat the price! swift checkin and out. thanks","ratings":{"Service":5.0,"Cleanliness":3.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Candido Shields","date":"2013-05-18 20:11:01 +0300"}],"public_likes":["Mr. Arvilla Parisian"],"vacancy":true,"description":"Bed and breakfast on the shores of the Moray Firth with two guest rooms both with sea views.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}