{"title":"Los Angeles/Downtown","name":"The Standard","address":"550 S Flower St","directions":null,"phone":"+1 213 892-8080","tollfree":null,"email":null,"fax":null,"url":"http://www.standardhotels.com/los-angeles/","checkin":null,"checkout":null,"price":"$99+","geo":{"lat":34.050233,"lon":-118.256982,"accuracy":"ROOFTOP"},"type":"hotel","id":16631,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We stayed here as a layover between flight and cruise. Hotel is in a good location (close to airport and cruise terminal) but there is no shuttle bus to either, meaning $20+ taxi rides are compulsory with many drivers adding extra charges for large parties and baggage. Our room was described as a 2 bedroom suite, but was actually a living area with sofa bed and a bedroom with two small double beds. Having a party of 5, a 2 bedroom suite would have been more than suitable, but the doubles weren't big enough for two people to sleep comfortably meaning 2 of us were made to sleep on the VERY uncomfortable sofa bed (so uncomfortable in fact that we ended up taking the cushions off the sofa's and sleeping on them on the floor for 3 nights, something you don't want after 23 hours of travelling.) There were not enough towels, cups, tea/coffee or pillows and it took three calls and a visit to reception for them to provide us with these. When we asked about the beds we were told that we would not receive help due to booking through HOTELS.COM. The bathroom has no natural light so is very dark due to the lack of artificial lighting also. Our room was 623 opposite the elevators, something that made it noisy at night. Can't complain about breakfast, acceptable especially seen as it was free! There was plenty of loungers at the pool but the pool itself was dirty and cold. Laundry facilities were good. Don't recommend the Outback Steakhouse. Our server was rude and incompetent and lost our debit card! She was never around to assist us and the food was very disappointing. Have stayed at many budget hotels that have been more pleasant that this, a hotel that claims to be part of the Hilton group. Being a Hilton Honours member I am very disappointed with this stay and won't be returning due to the reasons above.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Adonis Friesen MD","date":"2014-06-06 22:24:06 +0300"},{"content":"I used my chase visa card only once in puerto rico, to pay for my embassy suites hotel bill in December 2011. 3 months later (last week), an individual in PR began spending $1000/day on the card until visa canceled the card. I do not have proof that it was an employee at that hotel. But I find this very suspicious. If no one else complains of the same thing, call it a fluke. On the other hand, the hotel was actually very nice. The lines at breakfast were long, but the food was good. The pool area was great, the beach area was also a nice touch. Overall I would stay there again, but I would watch my credit card bills closely.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":2.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Chelsey Lindgren","date":"2014-07-29 06:37:45 +0300"},{"content":"The staff very helpful close to the beach and shopping. In and out quickly from the airport. I can't say enough good things about this place. The rates were good and the happy hour up to par.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Stephan Rogahn V","date":"2014-12-11 20:43:28 +0300"},{"content":"The hotel was in pretty good shape, the lobby was well kept and had some beautiful fish tanks to admire when you walk in. Didn't spend too much time in the casino but the staff was helpful there and throughout the hotel. The manager's reception in the evening was fantastic! The drinks were *strong* and they had popcorn and chips and salsa -- keeping everyone happy. The breakfast in the morning had omelets to order or buffet and we had our fill. The only area that needed some improvement was the room, that had seen some where and tear. Overall, it was a great value!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Daphnee Shanahan","date":"2014-09-06 23:17:33 +0300"},{"content":"The Embassy Suites is located convenient to the San Juan airport -- it takes three minutes to get there from the airport and ten minutes to get back, thanks to the configuration of the highway system. As another reviewer mentioned, there is no hotel shuttle (there don't actually seem to be such things for any of the properties), and a taxi will cost around $12-15. Parking at the hotel is chaotic--there was never a problem getting a space, but it seemed like we were constantly behind drivers who couldn't work the gate and then insisted on going the wrong way upon entering the garage (it wasn't just us -- we noticed the garage staff seemed a bit bewildered by this behavior, too). Parking, at $16 a day for self park, is less than I've paid at other hotels in the area. I stayed there with my parents between Christmas and New Year's, at the height of the busy season. The hotel was a bit overrun with college swimming teams in town for winter break training, and the fact that the hotel was bursting at the seams showed quite a bit: the line at breakfast and at the manager's reception / happy hour in the afternoon were both incredibly long (forty five minutes for the latter). The first day we were there, the staff seemed to be overwhelmed; by the time we left, systems seemed to be in place to deal with the madness. The hotel is not on the beach - the beach is about a ten minute walk away up a side street. There is a section of Isla Verde beach reserved for guests at the Embassy Suites (look for the flag), where a staff member will provide you with beach chair, towel, and umbrella. Restaurants in the hotel are a bit pricey--we ate at the bar the first night because we arrived late, and the prices were on par with a restaurant in Old San Juan, even if the service and quality was not. There's an Outback Steakhouse in the hotel, which is one of the most expensive places in Isla Verde to eat -- ask at the front desk (not at the concierge stand -- the concierge is a private company) for recommendations for local restaurants within walking distance. There's a Pueblo grocery store next door for basic provisions.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Nils Lowe","date":"2015-06-27 13:25:35 +0300"},{"content":"we loved this place, beautiful grounds, great pool, happy hour, gym, fantastic breakfast. a real surprise as we had been delayed in san juan for a day and were not sure what to expect..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Otho Mann","date":"2014-04-01 00:44:28 +0300"}],"public_likes":["Kenneth Mosciski","Drew Heathcote","Norwood Lakin","Cynthia Boyle","Devonte Treutel","Salma Langworth II","Miss Ethyl Moore","Stephany Bergnaum"],"vacancy":true,"description":"Trendy hotel with designer rooms and a bar and swimming pool on the roof. There is also a West Hollywood location.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}