{"title":"Santa Monica","name":"Viceroy Hotel","address":"1819 Ocean Ave","directions":null,"phone":"+1 310 260-7500","tollfree":"+1-800-670-6185","email":null,"fax":null,"url":"http://www.viceroysantamonica.com","checkin":null,"checkout":null,"price":"$300+","geo":{"lat":34.00818,"lon":-118.491,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26498,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"We stay often in the LAX area and the Westin is one of the best hotels at LAX. It now has the added advantage of having The Daily Grill downstairs. It is nice to be able to get a reliably good meal in the evening after a long flight and then proceed to your room. My earlier dissatisfaction with this location has been remedied by recent changes in furniture and replacement of carpets, etc. I think you will enjoy the Westin LAX.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Wyman Oberbrunner","date":"2015-05-23 05:29:22 +0300"},{"content":"Would highly recommend this hotel without any reservations at all - every aspect of my stay was perfect, from the quick and convenient shuttle bus to and from LAX, ease of check-in, fantastic room rate, comfort of room - including multi-channel TV, extremely comfortable bed and bathroom amenities. The lobby shop was great and there was an ice-maker and drinks vending machines on every floor. Also liked the free boarding pass printer in lobby and the excellent staff including John the Security Man who couldn't have been more friendly and helpful when I was locked out of my room. There was no problem storing quite a lot of luggage for as long as I wanted and there was a bus stop within close walking distance with frequent buses to Santa Monica, Culver City and West Hollywood. Previously, we've always stayed in West Hollywood, but because our stays in LA were just one-dayers this time, we chose an airport hotel, but got the bus into Santa Monica and West Hollywood for the day. Looking forward to our next stay in LA at Westin LAX!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Triston Howell","date":"2015-08-24 17:02:41 +0300"}],"public_likes":["Kenya Johnston"],"vacancy":false,"description":"The Viceroy Hotel is perfect for travellers who are seeking an ultra-hip experience and don't have any budget restrictions.  One block from the beach, and few blocks south of the main part of downtown Santa Monica, the Viceroy still is able to command $300+ per night because of its status as &quot;One of the 50 hottest hotels in the world&quot;.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}