{"title":"San Francisco/The Avenues","name":"Geary Parkway Motel","address":"4750 Geary Blvd","directions":"at 12th Ave","phone":"+1 415 752-4406","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":37.781,"lon":-122.4704,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26141,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We just had the pleasure of spending 4 wonderful days in this fantastic property. The worst part of the trip was checking out and having to leave. It really feels like a home away from home. We have stayed at over a dozen Fairmonts and this is our favourite. However, this is not a place for rug rats. There is no pool with slides or restaurants with crayons and balloons.The staff are wonderful especially the concierge department. We were able to get a reservation at Gary Dankos with only 2 days notice, thanks to Kari the concierge. The location is great and the complimentary Maserati Quattroporte was something else. I can't wait to go back....","ratings":{"Cleanliness":5.0,"Overall":5.0,"Rooms":5.0,"Service":5.0,"Location":5.0},"author":"Garnett Schmeler","date":"2015-05-27 06:10:04 +0300"},{"content":"The hotel was very clean, nice and modern. The hotel staff was very helpful and nice. They give you a one day pass to the spa, which is incredible. The area that the hotel is in, there's not much going on. The subway is very close to get to main attractions. The Sagrada Familia Church is beautiful and is a must see. It's not even a block from the hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":3.0,"Rooms":4.0},"author":"Lucinda Thiel","date":"2013-11-23 14:42:00 +0300"}],"public_likes":["Rudolph Blick"],"vacancy":false,"description":"This former dive has been completely remodeled with clean rooms, nice televisions, microwaves, blowdryers, irons, and mini fridges.  Reasonable prices, safe and neat - the owners have put a lot of effort into making this motel quiet and nice.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}