{"title":"Bakewell","name":"Bolehill Farm Cottages","address":"Monyash Road Bakewell","directions":"2 Miles From Bakewell","phone":"+44 1629 812359","tollfree":null,"email":null,"fax":null,"url":"http://www.bolehillfarm.co.uk/","checkin":"15:00","checkout":"10:00","price":"from £180","geo":{"lat":53.2023,"lon":-1.7192,"accuracy":"ROOFTOP"},"type":"hotel","id":1507,"country":"United Kingdom","city":"Derbyshire","state":null,"reviews":[{"content":"We really liked the Trump and after doing the rounds of all the themed hotels on the strip were pleased that we had opted for what is a much quieter and more classy hotel. There is no Casino and it is right at the end of the strip, they do however run a complimentary shuttle to the Wynn and Cesars Palace and it is not like there is not enough choice when it comes to Casinos in Vegas! Our room was fantastic, huge with a mini kitchen, sofa and table and fabulous bathroom with whirl pool tub and walk in shower, twin sinks and even a tv built into the mirror. Valet parking was complimentary and although they charge a $19 a night 'resort fee' which gives access to wi-fi we were aware of that when we booked so it was not a surprise to us. We didnt have a great view as we overlooked a half finished hotel but we could watch the strip light up at night. We got a fantastic rate for this hotel which made it great value for money, if you were paying the full advertised rate you would expect everything we experienced and probably more.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Margarett Doyle","date":"2012-01-24 16:39:17 +0300"},{"content":"Our family and friends booked the Trump for our son's 21st birthday. From the moment we arrived things went wrong. We had booked our rooms (3) directly with the hotel and one week prior to arrival we called and canceled ONE NIGHT of our reservation. Upon arrival the hotel had no record. After about an hour they finally found the reservation (they claimed they were changing booking systems) and finally cleared us for our rooms. We checked our bags curbside (we had all driven in) and went to our rooms. After waiting an hour we started to call the front desk to find out where out bags were. No one knew. We called several times and could not get a decent explaination. Our bags finally arrived after almost 2 hours and with no appology or explaination. The afternoon of our second day our 21 year old son called to say his key wasn't working and when he went to the front desk they explained that the reservation was only for one night. We then discovered that all 3 rooms were \"turned over\" as the wonderful front desk staff had only corrected THEIR reservation mistake for one day. After a visit to the manager the hotel did solve the problem but I would never stay at another Trump property. It is not worth the frustration! If this is the common Trump experience I would watch for a bankrupcy notification.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Bernadine Torp","date":"2014-05-09 23:34:33 +0300"},{"content":"when we checked in, they told us that they have no strip view rooms available even we had booked two months ago. they actually tried to sell us a larger room with no view by an extra charge! how is that? we had to complain several times until they gave us the strip view rooms (there were still plenty available)... Beds are poor, she shift down on the head's side of the bad. the beds are shorter than the frame. the rooms are large and nice. it's also not at the strip (what you can see an the map as well but just to mention). staff is quite rude and unfriendly (specially the check in clerk. strip view you can forget. they charge extra money but you see nothing. it's fully behind the treasury island. The first room we got smelled strongly like smoke. hotel has a bad reputation in Las Vegas. Is known as arrogant and rude staff!! funny, this was also our impression we got of the hotel. finally, you only can do valet parking and always have to wait. if you're waiting for a taxi being organized, it could happen that they just to skip you because there's a other customer behind you they like more. if you finally try to catch your own taxi (after seeing two leaving empty), these odd hotel guys start to tell you off. how cheeky! I tell you... we took our own cab and I told this guy to show more respect. we have several gold cards too but we probably do not wave them around all the time...! this hotel should think about this. Only go there if you get a special rate. it’s far away from the strip and really offers a nice room only. venetian is much better.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":2.0,"Value":3.0,"Service":2.0},"author":"Aliyah Reinger","date":"2015-08-22 06:15:43 +0300"}],"public_likes":["Cameron Reinger","Chaz Schmitt","Alexanne Mueller","Trudie Marquardt","Annabel Mohr","Rhea Kling I","Sarah Grimes","Ms. Claudine Skiles"],"vacancy":true,"description":"Our eight Peak District self-catering cottages are converted farm buildings set in courtyard surrounded by spectacular rural landscape yet only 2 miles for the Peak District Market town of Bakewell","alias":"Peak District Cottages","pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}