{"title":"Geneva","name":"Hotel Formule 1","address":"Route de Meyrin, 01210 Ferney Voltaire, France","directions":null,"phone":"+33 891 705 254","tollfree":null,"email":null,"fax":null,"url":"http://www.accorhotels.com/gb/hotel-2257-formule-1-hotelf1-geneve-aeroport-ferney-voltaire/index.shtml","checkin":null,"checkout":null,"price":"31€","geo":{"lat":46.24684,"lon":6.09388,"accuracy":"ROOFTOP"},"type":"hotel","id":9905,"country":"France","city":"Ferney-Voltaire","state":"Rhône-Alpes","reviews":[{"content":"We had never stayed at this chain of hotel before, but were pleasantly surprised. It was not only decorated beautifully, but extremely clean. My family liked it so well that during our cross country vacation, we changed some of our reservations to stay where one of these hotels were available.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Freeda Crooks","date":"2014-08-28 14:09:38 +0300"},{"content":"Previously stayed at 8181 Shadeland at the Hilton Indianapolis North directly across the street. Bad experience - would never stay @ that Hilton again... HIGHLY recommend this place though! Great lobby, beautiful interior - friendly staff. Redesigned rooms - free internet - free breakfast - free hot drinks and meals in the evening - and even free popcorn! w00t!!! Definitely a plus and the rate was $83.95 e-Saver vs. Hilton @ $150/night + internet. plus no free food, drinks, etc. Oh also has a microwave and fridge in the room - Hilton did not.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":2.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Kameron Padberg","date":"2014-04-10 14:14:39 +0300"},{"content":"We were in Indianapolis to visit family and friends and decided to try drury's new hotel in Castleton. We have stayed at the drurys in Marion, Il and was very happy. The Hotel was very nice and very clean except when childen would come down for popcorn and spill it all over the floor. Our room was lovely except we had to have the blankets changed!!!!!!! We always take a black light with us to check for dirty linens and it paid off. The staff took care of the problem right away. Thank you very much.... All and all we will be staying there again but I will have my black light in hand!!!!!","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rubie Wolf","date":"2012-11-07 02:47:03 +0300"},{"content":"As a newer hotel that's close to the corporate offices of a business I visit regularly, I was excited to stay here for the first time last month. The hotel gets very high marks for staff enthusiasm, courtesy, friendlieness, and helpfulness. Being a newer hotel, it was spotlessly clean. I liked the breakfast area, although it did get a bit noisy when the \"rush\" hit about 8:00 a.m. on a Saturday morning. The room was similarly clean and comfortable. The wireless internet connection (free) was useful. I also liked their simply-put, straight-forward internet privacy policy (\"You have no expectation of privacy...). No beating around the bush there--wish others would spare us the jibberish and just come out and say what is obvious: on an unsecured, free wireless internet network connection, you don't have any privacy! There was just one problem, and I discovered later that a colleague who has stayed here twice experienced both times on this visit. I did not get my wake-up call, which made me late for a meeting. That is unaccetable, especially when I asked the front desk about the reliability of their wake-up calls. My back-up system for awakening (the hotel's very cheap alarm clocks) proved equally inadequate. The alarm did go off, but was so quiet that it couldn't be heard and didn't do the job. I'm not that heavy of a sleeper, either! It may be a little problem to some, but it's enough to put them on my \"one more chance\" list. I'd like to stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Aaron Schmidt II","date":"2015-03-19 03:17:18 +0300"}],"public_likes":["Lorena Hansen","Hallie Goodwin DVM","Nannie Rosenbaum","Vallie Koepp","Izabella Kautzer","Rhea West","Anastasia Heidenreich","Leopoldo Bednar","Alexandrine Johnston"],"vacancy":false,"description":"Right behind the airport on the French side. Inexpensive but still a good standard since it belongs to the Accor hotel chain.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}