{"title":"Beverly Hills","name":"The Carlyle Inn","address":"1119 South Robertson Blvd","directions":null,"phone":"+1-310-275-4445","tollfree":"+1-800-322-7595","email":null,"fax":null,"url":"http://www.carlyle-inn.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.056531,"lon":-118.38407,"accuracy":"APPROXIMATE"},"type":"hotel","id":3423,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"I just returned from spending three days in Boston with my son during winter break. The staff couldn't have been accomodating and friendly. Our room (two doubles) was just great - very comfy beds (lots of pillows), clean attractive rooms and spacious enough for two. The fitness area has very up-to-date equipment and is suitable for all your basic needs. Pool is spacious, clean and great for both kids (somewhat shallow) or adults who want to swim laps. Our package included breakfast which was wonderful. A buffet variety hat would more than meet anyone's appetite needs. Close walking distance to many attractions: Theatres, Various Restaurants, Chinatown, Faneuil Hall, Quincy Market, Aquarium or to the Boylston T stop Green Line. We took a tour of Fenway Stadium - loved it. We would definately return again to this Hyatt!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Reilly Stanton","date":"2015-05-04 03:22:48 +0300"},{"content":"Our stay at the Hyatt was excellent. Even though we booked the rooms via Priceline, the staff provided excellent services. We got a room on the 20th floor with beautiful views of the city and the water (maybe because we were their Gold member). The bed was so soft and huge for two people. The location is convenient within walking distance to everything: Chinatown (2 blocks), subway (red line is right around the corner), movie theaters (couple of blocks), opera house (just across the street), Boston Common, Fenuil Hall, Quincy market, shopping centers, North Street to the Old North Church and little Italy. By the way, if you like Italian food, try Antico Forno (93 Salem St, North End). The food was absolutely delicious, and the price was very reasonable. The only thing we didn't like about Boston is that the parking fee was outrageous ($26/night for self parking underneath the hotel). Use this one. Don't use the one across the street. It is not cheaper ($25/night). Be aware of the parking attentant at this parking lot. We used them the first night. The guy said that it would be $22/night for overnight parking. But when we went the next morning to get our car, the attendant demanded $25. We disagreed and paid $22. He didn't like it, but let us go. They changed their price on the board the next day. We parked our car in the garage underneath the hotel for the rest of our stay. No trouble after that. Overall, we highly recommend this hotel to everybody.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Patrick Kertzmann","date":"2012-08-10 04:42:12 +0300"}],"public_likes":["Johan Green","Gregory King","Adele Kautzer","Buford Hackett","Mrs. Aileen Bruen","Tyrique Schmeler","Mr. Waino Langosh","Brionna Yundt PhD","Jackeline Konopelski"],"vacancy":false,"description":"Suite accommodations.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":true}