{"title":"Helensburgh","name":"Commodore Hotel","address":"112-117 West Clyde Street, Helensburgh, G84 8ES","directions":null,"phone":"+44 1436 676924","tollfree":null,"email":null,"fax":null,"url":"http://www.innkeeperslodge.com/lodgedetail.asp?lid=91","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.00481,"lon":-4.74472,"accuracy":"APPROXIMATE"},"type":"hotel","id":11376,"country":"United Kingdom","city":"Helensburgh","state":null,"reviews":[{"content":"this is my second time to stay in ibis hotel bencoolen. the first time i was with my husband and young daughter, and i hardly noticed the lack of space. but this time my second daughter tagged along, so with the four of us in one room, it was a bit of a squeeze. well, i guess you get what you pay for. the downside of the hotel was definitely the small room and absence of closets (there were a lot of shelves though), as well as hardly any space in the bathroom to put your toiletries and stuff (not even a ledge in the shower to put your shampoo). if you're a shopaholic planning to buy bags and bags of stuff from singapore, you might not have any room left to walk on in the room. but, i must admit that the good points of the hotel do outnumber the bad ones. for one, the room was *VERY* CLEAN. a big thumbs up in my book! the last time i stayed there was two years ago, and the level of cleanliness didn't change at all. even the floors still looked brand new! the room had pretty much all of the basic comforts of a hotel... a nice flat tv, comfy bed, kettle, coffee and tea, towels... water pressure was excellent. plus, their free wi-fi was working perfectly, and the room also had an international electric outlet for appliances. loved it! this hotel is good if you're travelling with friends, or solo on a business trip. it's good for small families too, but a word of caution: very young kids could get tired just from walking from the hotel to the nearest mtr station (bugis) which is around 15 minutes away. you have to cross EXTREMELY crowded street markets to get to bugis junction (HOLD ON to your kids, the markets can get really packed!!). plus, you have to contend with the unmerciful heat and humidity while walking on the street, and boy, hot, sweaty, tired kids can really take on stress-inducing levels of whining and complaining! after that, we decided, what the heck, let's forget the mtr and just take the taxi! it helped that taxis regularly came and went outside the hotel, so that saved a LOT of our sanity. if i were travelling without kids, though, i wouldn't mind the walking distance that much. it can get pretty tiring having to lug all your shopping bags from bugis to the hotel (as i said, it's a good 15 minute walk in the heat... well maybe 10 minutes if you're fast), but the good side is that there are loads of neat sites nearby, like the national library, religious temples, and hawker centers. if you're a bit of an adventurer or wanderer, then you will have a lot to explore. and oh, the 7-11 and guardian convenience store right outside the hotel were big plusses, too!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Lela Schumm","date":"2014-11-27 13:40:21 +0300"},{"content":"We found the hotel Ibis to be a very clean modern hotel, the facilities and room we had were very clean and roomy enough, the food was excellent along with the service, we found the staff to be very friendly and it was a great priced hotel in Singapore, the only downfull was that we found it a bit noisy whilst trying to sleep.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Roman Brekke","date":"2013-05-12 02:07:11 +0300"}],"public_likes":[],"vacancy":false,"description":"The biggest hotel in town with rooms from £55. Refurbished in about 2004. On the sea front about 1/2 mile from the town centre.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}