{"title":"San Diego/La Jolla","name":"Embassy Suites San Diego-La Jolla","address":"4550 La Jolla Village Dr","directions":null,"phone":"+1 858 453-0400","tollfree":null,"email":null,"fax":null,"url":"http://embassysuites3.hilton.com/en/hotels/california/embassy-suites-san-diego-la-jolla-SANLJES/index.html","checkin":null,"checkout":null,"price":"$200-300","geo":{"lat":32.87447,"lon":-117.20831,"accuracy":"APPROXIMATE"},"type":"hotel","id":25194,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"We stayed at the Maydrit twice during our recent Spain vacation. We chose it because of it's airport shuttle and proximity to the metro. The staff, facilities and rooms were all excellent. Our only criticism is that the airport shuttle has very limited hours (7AM-11AM and 7PM to 11PM.) As a result, we had to take a 20 euro taxi ride to the airport instead.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Leatha Jaskolski","date":"2013-03-06 17:40:21 +0300"},{"content":"We booked this hotel because it was close to the airport and cheap -- a recipe for disaster. We were thrilled to find it located in a quiet residential neighborhood just a few steps off the Metro. The hotel was cool, sleep, very modern. We were able to get dinner in the area at midnight and there was a free shuttle in the morning. I will definitely consider staying here next time I visit Madrid even though it's a bit off the beaten path. Small drawback was no wireless in the room but there were terminals in the lobby.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Anthony Pfeffer","date":"2015-08-26 00:16:10 +0300"},{"content":"Recommended by a friend and now after my stay I would recommend to every one. Excallent location (walking distance from colosseum), Really BIG & clean rooms with kitchen and value of money. I stayed with my family including my 1.5 year daughter. Although care taker although was not able to speak english but was very helpful. /Alok","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ashleigh Conroy","date":"2015-04-10 17:06:06 +0300"},{"content":"Up to this trip to Rome I got to know the Italian people very friendly and helpful (I visit Italy several times a year and also have some friends living there). So I was really taken aback meeting this unfriendly lady in casa del'arte not!!! Although I told her the time of my arrival weeks before my arrival (by e-mail) she claimed not to have known about my arrival time (there is no reception in this accomodation). My knowledge of the Italian language (acquired at school, by traveling to Italy and through my friends who are native speakers) was sufficient to converse with the Roman people but one - with the lady in this accomodation it was neither possible to talk to neither in Italien, nor English or German. According to the hotel description the accomodation offers a luggage deposit for 2€ --> this information is not true! Instead the lady referred me in a quite unfriendly tone to the luggage deposit in stazione termini. Location: only a few steps from the metro and bus station; but the homeless people gather around the hotel all day drinking schnaps and at nights you have to reckon to get awakend by the bell (of course I didn't open the door, but I guess the homeless people tried to get into the warmth) Breakfast: a $@!#%, a croissant and coffee (thermos flask) served outside the room because the establishment has no breakfast room. coffee was sometimes ok, sometimes absolutely unenjoyable. once they seemed to have forgotten to do the washing up because the day after I could find remainings of the coffee in the cup. I could proceed my list with negative impressions but I guess this description gives you an expression what awaits you there. To sum up, I can say Rome is a beautiful city (December is perfect for sight-seeing!) with great sights and friendly people and I am sure to return there soon - but next time I definitly won't choose case del'arte!!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":2.0},"author":"Connie Quigley","date":"2012-05-01 06:34:08 +0300"},{"content":"The location is great. 20 minutes from Disney with lots of restaurants and shopping nearby. The units are outdated and need some work. They are fairly clean but because they are so old, they seem less clean. The breakfast is free and very basic: cereal, small bagels, toast. Coffee is bad. Free wifi, but sketchy in rooms; good in lobby. Staff was very helpful and eager to please. If you get it for around $35 per night, you can't beat the value. If you pay the normal $69, then I would go someplace better. Definitely worth the money.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":3.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Mr. Roy Lubowitz","date":"2014-06-25 11:06:19 +0300"},{"content":"We had visited Disney World 6 other times in the last year prior to this trip, half of those times staying at another nearby 'cheap' chain hotel. We needed to take our dog with us on this last-minute business trip, so we picked the Red Roof Inn and booked on hotels.com since it was the same price as the other affordable hotel that isn't pet friendly. We arrived and checked-in with no issues. The late-night attendant was very friendly throughout our stay and always took the time to say hey when he saw us passing by. When we arrived to our 2nd floor room, I noticed it was humid, even though the A/C was turned all the way up. So, we requested a new room and was moved next door with no questions asked. The A/C worked fine in the new room, plus it had the added bonus of a fridge, which was very handy. There is construction going on across the street on the back side of the hotel, but it didn't really bother us. I did notice that the pool side was a bit noisier at night because of Hwy 192 traffic. The room layout was typical for a budget hotel, but was still clean, although a bit damp. But you're in Florida, so that's to be expected in a hotel with outside entry. We didn't request housekeeping every day, but when we needed to just change out towels, the housekeeping staff was very quick to bring us new towels. We had to extend our stay last minute by a few days, so we booked a new reservation on Hotels.com for a extra days and had no problems getting the staff to allow us to remain in the same room. We didn't make use of the shuttle to any of the parks since we drove, so we can't really give a review on that. The breakfast was typical 'continental' breakfast style - packaged pastries/muffins, cereal, juice, and milk. Overall, we enjoyed our stay and would stay there again if we needed to stay in the Kissimmee area again. Definitely recommend if you have a pet you're bringing with you and want to find a budget hotel.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Kyler Howe","date":"2013-02-02 18:42:12 +0300"},{"content":"My family stayed here for our trip to the Disney and Universal parks. Not a fancy four star resort but the room was quiet, clean, and perfect for relaxing a bit and catching some sleep before another day at the parks. I can't see spending a ton of cash for a resort when your going to be in the theme parks all day. The staff was friendly, helpful, and did everything in their power to make sure our stay was comfortable. Will definitely stay here again!","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ms. Idella Kirlin","date":"2014-05-16 03:21:15 +0300"},{"content":"I had stayed in budget hotels in the area before. As the quality of accomodation, some hotels were better and some of them worse than Red Roof Inn. But none of them had the greater staff than this hotel has... The rooms look very old but not the furnitures actually. The bed spreads and towels are worn out and may have big holes on them. The carpet was the worst to me because it felt so dusty even though they vacuumed regularly. In a hotel like this, the people make the difference. The first morning -after a very long flight- we were late for breakfast. The lady who is in charge didn't even mind bringing all the food and stuff back from the kitchen, just for us! And the continental breakfast was much better compared to ones I had before. It contained Bagels, Danish, bread, jelly, Peanut butter, cream cheese and butter. There was always good coffee available in the breakfast / reception area of the hotel. I enjoyed going there in the evenings to have coffee while watching the news on the big screen. We had to change our room to a deluxe and this was no problem either. As soon as a room became available, they gave us a deluxe room. I believe Raza is the guy behind the success of this hotel. He is a real problem solver. He does his best to make your stay a pleasent one... Also, the location of the hotel is good with restaurants and even Publix market all in walking distance. If you feel like having a really big breakfast or any other meal, just a few steps from the hotel is the Bob Evans where you can have some great food served by wonderful ladies there. The shuttle company Metro, which they have contract with, is not a very good one. We tried only once and took a cab the next days. Roundtrip to Magic Kingdom costs USD 40.00, from airport to hotel costs USD 45.00 As a result, when you pay less, you expect less, so this hotel is a friendly budget hotel with clean sheets, good breakfast and nice people. I may go back there again in the future and hope they change their carpets soon.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Rodrigo Abbott","date":"2015-06-11 02:41:34 +0300"}],"public_likes":["Jacynthe Waelchi","Kailee Ward","Cara VonRueden","Jarret Rau","Henri Borer","Carlos Schmidt","Cleveland Sanford"],"vacancy":true,"description":"All-suites hotel.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}