{"title":"Farnborough","name":"St Michael's Abbey","address":null,"directions":null,"phone":null,"tollfree":null,"email":"info@farnboroughabbey.org","fax":null,"url":"http://www.farnboroughabbey.org/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.296585,"lon":-0.749649,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":9086,"country":"United Kingdom","city":"Farnborough","state":null,"reviews":[{"content":"We stayed 4 nights while in San Diego sightseeing and playing golf. This is a great basic family motel, and by family I mean family run, father and son an for 34 years! The rooms are clean and white, and whilst not spacious they are fine for a couple. breakfast in the courtyard was a great start to the day. Be sure to ask the office staff for restaurant recommendations and \"coupons', we walked to dinner every night in a very safe area and really enjoyed the restaurants we visited. Customer service is their watchword, staff never far away which helped when i had a little tumble one morning, no damage done!! Next time we are in the area we will stay there agian, the value is fantastic.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Stefan Keeling","date":"2013-01-27 05:21:03 +0300"},{"content":"I was looking for a reasonable motel for a weeks stay. Normally, I would do quite a bit of research. After all it's easy to find a good expensive hotel; but takes more work to find a less expensive one. There was something about the web site that attracted me, so I booked without further ado. We weren't disappointed. I won't waste time talking about the cleanliness and attentiveness of the owner and staff. They've been well covered. The thing I liked about it is the location, just across the street from a marina in between Harbor Island and Shelter Island. Our only transportation was bicycles; and the bike trail along the bay to downtown started only a block from the Dolphin. The bike lane on Nimitz Blvd made it easy to get to Ocean, Mission, and Pacific Beaches, as well as the bike trail around Mission Bay. Tip: The desk clerk tipped us off the first night to Mitch's Seafood practically across the street along the marina. We went back 3 times for the beer battered fish sandwich and fish tacos.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Myra Rolfson","date":"2014-06-25 16:58:33 +0300"},{"content":"Sheet thread counts? Mini bar? Movie channels? Potpourri? Time and temperature projected on my ceiling? Bath soap in wrapping paper fit for a mother's day present? No frilly accessories needed for me, thanks. My first stay at the Dolphin last week before a 6AM flight was comfy. Clean & firm bed, a clean bathroom with hot, pressured water, wifi internet, quiet sleep and morning coffee available are all that I need in a room. Dolphin provided all of that, a wakeup call, and an airport taxi call. Many would describe my room at the Dolphin as spartan college dorm style. I don't spend much time in my room when traveling. There was plenty of service from the staff. That included answering all of my questions via email when I was selecting my room, as well as doing their best during my brief stay. Ilikeit and will be back for my next early morning flight out of San Diego.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Sonya Labadie","date":"2012-09-28 14:17:02 +0300"},{"content":"We stayed here for one night as we were going to concert Pros: The staff were very friendly Breakfast/parking is free Inexpensive Cons: The walls are paper thin and you can hear everything in the rooms next door Very cramped, small rooms. Rooms do not feel safe or secure enough My partner also cut himself with something on the bed. There was about 30 mins of slight panic whilst we tried to find the offending item. It turned out to be the pillow zip. We were not happy.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Kellen Wunsch","date":"2014-02-04 14:30:21 +0300"},{"content":"Tom Bodette only wishes he could provide clean comfortable rooms like Dolphin Motel. You will rarely have the opportunity to stay at a place like the Dolphin Motel. First off this is very much a no frills place. Nothing fancy here folks. You will find the Dolphin in an excellent location, steps from the sea, fishing boats, dining options, and cute homes. Enough can't be said about the staff, homey, and genuinely friendly. You will likely meet the owner, I chatted with him several times. This is an older, well maintained place that is extraordinarily clean. You can practically eat off the floors inside and out. Parking is included with your room rate too. The rooms are fairly small, glossy white walls, frig, a place to hang clothes, shower with wildly high water pressure...you could power wash your boat with this thing. No tub. The walls are thin, you will hear your neighbors on occasion, this is a quiet place though, and will not pose a problem for most. A modest breakfast is provided near some outdoor tables, with umbrellas, it can be a very laid back sociable scene if you choose to get involved, or you can relax in solitude. Bottom line, for the price, location, cleanliness, and hospitality, you will seriously have a hard time beating this place. Although this is far from a 5 star hotel, for the price and everything else considered, I give it 5.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Anya Simonis","date":"2012-01-27 09:12:01 +0300"}],"public_likes":["Lila Schinner","Amiya Hammes IV","Brendon O'Hara Jr.","Bethel Roberts","Dusty Wyman","Casimir Hammes MD","Shanna Hahn"],"vacancy":false,"description":"For something a bit different, why not stay in a Benedictine monastery? Male visitors may stay in the monastery itself and share the monks' daily lives. Separate accommodation exists for female visitors and families. All such visits must be pre-arranged and are entirely at the discretion of the monks themselves.","alias":"Farnborough Abbey","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}