{"title":"San Francisco/Union Square-Financial District","name":"Marriott Union Square","address":"480 Sutter St","directions":"at Powell","phone":"+1 415 398-8900","tollfree":null,"email":null,"fax":"+1 415 989-8823","url":"http://www.marriott.com/sfous","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7894,"lon":-122.4083,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26231,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I stayed at the Jane Hotel last weekend in Manhattan. The bellhops met me at the curb and helped me with my bags, and the check-in staff was great, and even let me into my room a few hours early. When I got up to the room (the elevator is a bit slow) I admit I was shocked at how small it was. But then once I realized that I would be in this room for a few shorts hours each day (from about 3am to 9am) I figured who cares how small it is. It still had A/C, a tv, a bed, some shelves, a bathrobe, slippers, a huge mirror, and drawers. The bathroom down the hall was constantly being cleaned, and best of all, the showers and toilets had complete privacy behind a locking door. The bar on the first floor was a wild scene every night, but up on the 5th floor I wouldn't even know it was there. I liked that they also brought me free water and ice every night when I got back to the hotel. I will definitely be back here next time I'm in New York City.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Johnny Little","date":"2012-09-12 23:47:12 +0300"},{"content":"This hotel is in a great location & is great if you want to stay in Manhattan on a budget. I stayed at the hotel for a couple of nights before I took my first ever cruise & I loved it. The rooms resemble a ships cabin (although the cabin I had on my cruise was much bigger, lol). The room I stayed in was the size of a queen size bed, literally. But it had everything I needed. Air conditioning, flat screen TV, radio, even a bathrobe & slippers which came in handy because the bathrooms were shared. The bathrooms are kept very clean & the showers & toilets are in individual locked stalls. The restaurant & bar on site are excellent. The staff is very friendly and helpful. They even have one of those old elevators with a pill box capped operator manning it. As a solo traveller I would definitely stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Sigurd Stracke","date":"2012-11-29 02:30:51 +0300"}],"public_likes":["Rahsaan Greenholt IV"],"vacancy":true,"description":"A trendy San Francisco boutique hotel. Formerly the Hotel 480, this hotel has been completely renovated to become a Marriott.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}