{"title":"Nice","name":"NH Nice","address":"2-4, Parvis de l´Europe. 06300 Nice","directions":null,"phone":"+33 4 92008000","tollfree":null,"email":null,"fax":null,"url":"http://www.nh-hotels.com/nh/en/hotels/france/nice/nh-nice.html","checkin":null,"checkout":null,"price":"From 99€","geo":{"lat":43.70778,"lon":7.28304,"accuracy":"APPROXIMATE"},"type":"hotel","id":20421,"country":"France","city":"Nice","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"The hotel has a lot of perks for families traveling on a budget. The breakfast buffet and evening receptions (Mon. - Thur.) we wonderful and saved us a ton on food. We brought our dog with us and the hotel was very pet friendly. The cleaning staff was also very diligent and our room never went a day without being serviced, even when we didn't remove the \"do not disturb\" sign until 3pm. The fitness center was a big plus too. The only downside I'd give to the hotel is that the walls are kind of thin and you can hear everything in the hallway and that the internet was a little slow. But as far as hotels go, I think those things are minor. We will be staying at this hotel again when we are in the Dallas area.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"Cleora Grady","date":"2014-02-17 18:38:40 +0300"},{"content":"Three story facility with security doors, pool, BBQ area laundry, day room, internet, free computer and breakfast. Located just off of the loop just a few miles east of I 35. The Good: Staff went out of teir way to accomodate. Stayed two nights and each day departed before the 7 am breakfast. Staff made sure cont breakfast was available prior to dearture. Hotel and grounds were spotless. Never saw cleaning staff and room was always clean. Starbucks,CV (?) Pharmacy, hamburger an sanwich shop adjacent to property. Full kitchen. Extra storage space for your gear inside of the hotel The bad: Well not really, but there was a house with burgler bars next to the property. Parking areas well lit and no security threats noted. Will need to drive to most restaurants. The Ugly: none noted. Summary: Stay with pleasure. Easy freeway access yet no freeway noise. If the hotel is dog friendly (?) lot's of area to walk. Rooms were spacious and updaed tv's. Excellent value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mrs. Braeden Goodwin","date":"2014-03-17 02:18:23 +0300"},{"content":"My friend booked this hotel for his business event in Dallas and I went along for the ride. We were actually kind of excited about this hotel because it was such a great deal and being a Hyatt we were expecting great quality and service. After the 4+ hour drive we check in and get into our rooms, ready to wash off a bit and realize that the water coming out of the faucets is a dark brown color and smells of sewage. I was mortified. We checked both sinks and the shower and actually got video footage. Then we called the front desk and asked if they were aware of any problems expecting them to be apologetic and maybe even having us move to another hotel. No reaction. They said they'd send someone up to our room. No one ever came so I went downstairs to try to find some potable water. When I turned on the faucet in the ladies down stairs-- same thing! Disgusting. I asked the front desk person if they knew of any plumbing problems and she said no but called her manager. When she was finally able to track someone down by phone he said that yes by the way they had shut the water off earlier in the day and this happens. We should let the water run a while and it should be fine. We never received an apology. No one ever checked up on us to find out if the situation had been resolved. Nothing. Very, very disappointed. And disgusted. How does this happen? Really?","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":2.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":1.0,"Location":3.0},"author":"Irma Morar","date":"2015-06-06 18:44:56 +0300"},{"content":"This hotel use to be an Amerisuites and was old and needed updating badly. It is super nice now..Modern decorations..the beds are very comfy.. Nice Big flat screen TV. Free continental Breakfast..","ratings":{"Overall":4.0},"author":"Ronaldo Veum","date":"2012-07-04 19:37:25 +0300"},{"content":"Stayed at the Amerisuites for one night with boyfriend. The hotel is really clean although I did receive a double room when I reserved a king room. The problem was fixed very quickly.The room was clean although in no way shape or form a suite in my opinion. There is a wall that separates the bedroom from the sitting area and I found the room the smallest suite I've ever seen. The kitchen is functional with small fridge, microwave, and stove. However, the problem is insulation. We heard every noise going on outside from the construction, the people upstairs, the people walking by outside in the hallways. There is no insulation to guard against noise. Didn't get a good nights sleep at all. The heating unit is one of those in the wall units that only heats the immediate area which wouldn't be a problem if Texas was not having an ice storm that day so it was freezing! The breakfast buffet was decent as long as you don't mind warming it up. There are very few restaurants nearby and the staff is not very knowledgable. I would not return but may be economical choice for business travelers","ratings":{"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Service":2.0,"Rooms":2.0},"author":"Casimir Murazik","date":"2012-02-28 02:14:54 +0300"},{"content":"We were not very familiar with Dallas but we felt right at home with the help of the the people at the Hotel Lumen. The staff was super friendly, especially Nikki. The restaurant was just ok. In general the hotel was in great shape, very well maintained. When we were ready to leave Nikki arranged a car to the airport, she is a gem!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Zena Reynolds","date":"2012-07-20 13:33:41 +0300"}],"public_likes":["Josh Gerhold","Otilia Carter"],"vacancy":false,"description":"Located in the ‘old town’ part of Nice, this hotel offers a gym, sauna, swimming pool and complete luxury.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}