{"title":"Malibu","name":"Topanga Ranch Motel","address":"18711 Pacific Coast Hwy","directions":null,"phone":"+1 310-456-5486","tollfree":"+1 800-200-0019","email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":34.0328,"lon":-118.84613,"accuracy":"APPROXIMATE"},"type":"hotel","id":17312,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"Check In The check in was problem free. You are met with a welcome drink and walked to your room. Your luggage follows shortly after Rooms I would recommend asking for a ground floor room. The upper floors have thatched roofs and are apparently very musty and damp. The standard room is set up with a bed/seating area with a television and mini-bar, and then a seperate area in which there is a wardrobe and mirror. We thought the rooms were nicely decorated, but the bathrooms could perhaps do with a little updating. We liked the terrace area with tables/chairs and a hammock. We had no problems with air conditioning. The hotel provide an iron, ironing board and hairdryer, so you have no need to pack any of those items. There is a safe in the room which is free of charge too. We spent little time in the room, we would watch tv (The Warner channel!) while getting ready for the evening, it was adequate for our needs. GHD hair straighteners do not work, due to the voltage in Mexico - you are better off taking a cheaper pair & leaving them to heat up. Pool/Beach There is an activity pool, and a larger pool. There is always something going on at the activity pool e.g. volleyball, water polo, aquarobics. There is also a bar area within this pool, which is nice. The other pool is more for sunbathing/relaxation. It is generally not as busy. The beach is badly affected by recent storms, but the sandbags were fun to sit on and there are still enough loungers for people to enjoy the beach. Food & Drink Breakfast: Every type of pastry you can imagine, a toast machine is available, lots & lots fresh fruit, cereal, juices, smoothies, continantal style breakfast, eggs, sausages,. The coffee served at breakfast is delicious. Lunch: Lunch is sometimes served at the buffet, but mainly served at the snackbar near the pool. They have a barbeque going from about 11am - 3pm at which fish, beef, hamburgers, hotdogs, chicken, pork and even barbequed vegetables are served. There is also the snack bar for salads, natchos, pasta and various other meal options. Dinner: Served at the buffet or A la Carte restaurants (Italian & Mexican). We did not enjoy the Mexican so much but the Italian food was amazing. The Buffet also have theme nights, e.g. Oriental, mexican etc. There is a carvery with chicken and beef, pasta, various salads, lots of types of bread, chips, hotdogs for the kids, chicken and beef marinaded, potatoes..there seemed to be something for everyone. Pizzaria: There is a Pizzaria by the pool area open all day with many different pizza types, this was good for a snack or light lunch. Drink: The drinks were amazing. Named brands and a lovely cocktail menu. I recommend the Mai Tais. Self serve pepsi and fruit punch machine for non-alcoholoic refils during the day. The barstaff will also bring drinks to you while you sunbathe. I never had a problem with the bar queue Entertainment There are various types of entertainment during the day including xcooking competitions and water activities. We mainly relaxed during the day at the other pool so can't really comment on this, but the entetainment at night was fun - there is a large stage and seating area. We saw many shows (Mexican Hacienda, Carribean Show, Mr Allegro) and the costumes, lighting music and dancing are very professional. I enjoyed and thought that the staff worked very hard to make the shows entertaining. Disco/Bars The disco was a disappointment. the Disco plays bizarre music asuch as 'YMCA' and 'In The Navy'. It is also very small and not at all like a disco/nightclub. It does open until 2am though. Usually, we would go out for the meal, watch the Show, and then go to the Amber Bar (next to Reception) and then back to the room with drinks. If you are hoping for a resort with an exciting night-scene, this may not be the hotel for you. There is a nightclub tour to Cancun you can go on for $50 however. I think that runs once a week. Staff I found all the staff to be brilliant. We could not fault the maid service (and their towel origami!) and when we phoned for a repair, a repairman was at the apartment within ten minutes. The waiters and barstaff cannot do enough for you, and the gardners are constantly maintaining the land. The Animation Team are fun. They work at the pool all day and then at the night shows too. The only staff I have an issue with are the Reception staff. They are rude and often unwilling to help with problems. All in all we had a wonderful holiday and found it to be better than the 5* in Mexico (Bahia Principe, Tulum) we went to last year. Aside from the Bathrooms and nightlife which are only small details..our trip was perfect.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":2.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Angus Kautzer","date":"2014-07-05 22:59:05 +0300"},{"content":"After many hours of reading everyones revieves I decided to stay here. This was a last minute trip and I was traveling with my husband,2 teenage daughters(20 and 18),my son 14,and my 11 year old daughter. I booked every thing through Expedia. We flew with US AIrways which was a big mistake. Never on time,and then they made us miss our connecting flight and then gave us another flight one hour away from our original destination home.But back to Allegro, our reservations included two rooms, one of which turned out perfect, while the other presented several problems for us. The room did not have enough beds as we had requested, the air conditioning didn't work, and the room was handicapped equipped which we did not need, not to mention the room had a bad smell. However, the next day we were moved to a better room which fullfilled our requests. The rooms weren't incredibley large, but we were never in them during the day. The showers are not enclosed, so water typically spills onto the floor. The staff was very friendly and everyone spoke very good english, along with several other languages. My teenage daughters also found the male employees to be quite attractive. The food was good depending on the day. They served different food for every night of the week, some nights better than others. The pool side entertainment was great, along with the hotel's nightly shows. We were rather impressed by the various perfomances we saw each night. The hotel also has a kids club which hosted activities for kids all day nad all night in order to keep the younger guests entertained. One of the drawbacks to the hotel is their timeshare presentation which lasts three or more hours, despite the promised ninety minutes. The hotel grounds are beautiful and the beach was nice despite the large sandbags which we found a way to play on. If your accustomed to fancy dinning and upscale rooms, this is probably not the best place for you. We would however, probably stay there again, although i would like to try staying at a different hotel.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":2.0,"Location":5.0},"author":"Judah Turner","date":"2013-07-24 15:48:26 +0300"},{"content":"My new husband and I decided to book our honeymoon at the Occidental Allegro Playacar and it's one of the best travel decisions we've ever made. Since we were honeymooners, we made sure our travel agent alerted the hotel as such so that we could take advantage of the complimentary honeymoon priveledges the hotel offers. It's not much, but the hotel gives you a priority checkin (which we think was the representative escorting us through the property to our room), fruit basket, spa services discount, and breakfast in bed one morning. It was all perfect. Once we checked in, we were escorted to our room to wait for our bags to arrive. Well, we were starving, so we just took off to the pool to find some snacks. On the way there, we passed by The Pizzaria which was great! The pizza was hot, fresh, and tasty! After our quick slice, we headed over to the Snack Bar. OK - where I come from, \"snacks\" are things like chips, fries, chicken nuggest - you know, small portions of finger foods. Nope! This place lays out a whole spread at the snack bar. It was great! Everyday we noticed that there was always a beef, chicken, pork, fish, and vegetarian entree choice plus a potato dish, pasta dish, and a steamed vegetable. There was a full salad bar to make your own fresh salads and a grill off to the side which served fresh burgers, hot dogs, and a chicken or pork dish plus french fries. Oh yeah, there was a mini nacho bar with chips, cheese sauce, fresh pico de gallo, fresh guacamole, and cevice. It was great! After our first \"snack\", we headed back to our room to unpack and change into our swimsuits. Once down at the pool, the real relaxation began. (We opted to hang out at the activities pool everyday. We may not necessarily be the type to participate in every activity offered, but we certainly enjoy watching everyone else participate. Music is played at the activity pool and there's a swim-up bar there as well.) We hung out at the pool for a while then went to the lobby to try to make dinner reservations. I don't particularly agree with the whole reservation scheme since you're only given a choice of 600pm, 730pm, or 900pm to dine. I've been to much larger all-inclusives in the past that have ala carte restaurants and they use a first-come first-served seating policy that works just fine. You go when you want to eat then decide if you feel like waiting for a table or not. I guess it didn't much matter with our stay at the Allegro since we were able to get a reservation at our preferred time (730pm) each time we tried. Of the two ala carte menus, I preferred the menu at The Mexican over the menu at The Italian, though the food at both places was outstanding. We ate at the main buffet for the Oriental night and we also ate at the Mexican Fiesta. All of the food was delicious. Neither me nor my husband had anything we didn't like. Don't get me wrong, we're not talking gourmet-quality here, but it was all good. So, regarding our room. It was large, clean, and beautiful. We decided to go for a garden-view room since we knew we'd be spending every day-light hour at the pool enjoying the view AND the fresh air! Plus, it looked like all of the ocean-view rooms were situated near the pool and you know how water carries sound! We were assigned in building 41 which was just perfect. Right about in the middle between the pool and the main buffet. I will have to agree with some other reviews that the beds are a little hard but it is NOT due to the cement platform. They are just FIRM mattresses on the beds. The cement platforms are to help with hurricane rebuilding, not the \"cheap Mexican shortcut\" that others have claimed it to be. The vanity seemed to be newly remodeled with a fashionable bowl-style sink and round-framed mirror. The closet area could use drawers instead of shelves, but we didn't have any problem finding space for all of our things (10-days worth!). The bathroom houses only the toilet and tub/shower. Its just the right size for what you need to do in there. We had a second-story room which meant we had amazing cathedral ceilings all the way to the top of the palapa roof. If I had to guess, I'd say those ceilings are at least 25-30 feet tall! Truly magnificent. On our front porch was a hammock (which came in handy for siesta time) and a small table with 2 chairs. The whole set-up was really cool. There are only 8 rooms to each building (4 on the bottom and 4 on the top) and that gives the whole hotel a village-like feel. The grounds of this property were absolutely immaculate. I've included pictures so you can see for yourself because I'm not really sure how to describe it without sounding redundant. I've also included pics of the lobby building which the hotel fails to show on their website. I don't know why cuz the lobby is beautiful. Also, this staff was one of the friendliest staffs we've ever had the pleasure of being served by. Anytime we passed a staff member walking about the grounds, we were greeted with eye contact, a smile, and the appropriate verbal greeting for the time of day. We also liked the staff uniforms. They were neatly pressed and professional looking but also carried a tropical vibe. It was our first stay at an Occidental property, but if this is how they maintain all of their resorts, we'll look for an Occidental the next time we take a vacation. We only had 3 small annoyances. They really are quite petty as none of them had ANY bearing on our ability to enjoy our vacation. Here they are: 1. THE TIME SHARE HASSLE: We were approached by a rep on our first morning to attend the \"VIP Breakfast\". We've traveled around enough to know that the hotel staff doesn't want to eat with their guests just for the heck of it, and we didn't suddenly become a \"VIP\" out of no where and for no reason. If you can't realize that, then I'm sorry for you. If you're not interested in hearing their pitch, politely tell the rep that you are there to spend time with your family, husband, wife, boyfriend, girlfriend, friends, or whomever you're there with and you would prefer not to deviate from your plans. It worked for us and we didn't hurt anyone's feelings or act like those \"Ugly Americans\" everyone expects us to be. 2. THE PHOTOS WITH ANIIMALS: The hotel has a professional photographer on site that goes around and takes pics throughout the day. If you've ever been on a cruise, it's kind of like that, only each day they bring in some kind of exotic animal and push for you to have your picture taken with it. They don't want to seem to take \"no\" for an answer, so I found that telling them I was allergic seemed to steer them away successfully. You don't have to pay them to take the picture, only if you want a print out. 3. NOISE FROM THE ROOM NEXT DOOR: As I said before, we were on the second floor with those amazing cathedral ceilings. Well, on our second to last night, a family with a BABY was checked in to the room next to us. We quickly learned of the disadvantage of the palapa roof - no effective sound barrier. At times it sounded like that darn baby was laying in bed with us. Fortunately, the baby didn't cry too often or for too long so we were able to still enjoy ourselves. There were times that we could hear our neighbors conversations and TV clear as day, but that was only when we were in our room which was not very often. *NOTE: The beaches of Playacar (and much of the Caribbean coast of Mexico) were severely damaged at the hands of Hurricane Wilma in 2005. The government is doing the best they can to assist Mother Nature in rebuilding the beach. REMEMBER - THE LACK OF BEACH SAND IS NOT THE HOTEL'S FAULT! That said, there is still plenty of soft white sand and chaise lounge chairs to go around. Enjoy it and save your complaints for things that the hotel CAN control.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Milford Pfannerstill","date":"2012-12-22 11:33:32 +0300"},{"content":"We came to Allergro from March 21-30 for 9 days. We loved it. We stayed in a room right by the pool. The beds were firm but fine. The rooms were upgraded and there were tubs put in as well as new very modern sinks. We loved the food. For lunch they served steaks and spanish pia and lots of grilled hamburgers and hotdogs and fries. People from the Royal Hideaway wanted our barbaque they smelled it. They were coming over to use our beach it was better.We had great drinks we brought our own thermal mugs and tiped every other drink. We had top of the line liquior. We brought our own towels and we used them because we worried about losing them. We went on the lobster cruise out of Cancun which was great we loved the lobster the drinks on the cruise were just okay order wine or beer. We had a fabulous time at the resort everyone was so friendly I brought a welcome gift for the maid a set of Rosary beads and a sterling silver belt and she also got tips she was very happy her name was flora a sweetheart. I would definately go back the breakfasts were super anything you wanted was there. We tipped the girl making eggs too at the end Lita she was also very nice. I took 350 dollars in singles and they worked out great so remember to take dollar bills. We went over to town to the beach one day but the beach right there was just as good. The hotel packed a lunch and sodas or beers whatever you want for free 6 of each. I took cancun express from the airport it was 95 for two in a private van it was very very pleasant and they were very professional. Bought crocs(35 plus charms 3.50) sandals the hottest shoe in the UK now and bought a leather duffle at Playacar for 104, at the airport it was 300 dollars great deal at the golden duck in Playacar. Its 50% off there bags now so if your going aviod the junk and buy something you'll keep.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Sabryna Bailey","date":"2013-11-06 05:31:46 +0300"},{"content":"We stayed at the Allegro Playacar Jan 17-31. Check-in was at 3:00, but we weren't given a room until 5:00. We didn't feel it was too big of a deal as it gave us time to explore the grounds, have a few drinks and get some food in us. The grounds at the Allergro are absolutelty beautiful, some of the prettiest weve seen, they should have more pictures of the grounds on their web-site. We had an upstairs room with a palapa roof. Room was average, we did have a issue with the screens, as they were torn and pulled out of the frame in areas. One call and Manuel from maintenance replaced them. We preferred having the windows open verses air conditioning in the evening. You will need a sense of adventure if you choose an upstairs room as there will be little lizards crawling about up high. They seem to stay up high and wont hurt you. There was no mold or musty odors, the bathroom did have a strong urine odor at first, but our maid Wilma took care of that. We found the staff to be very friendly and eager to please, some of the best we've ran into. The staff makes this resort. We found the food very good, and a good selection to choose from. Drinks were fair to good. The beer was on tap, sometimes flat, sometimes fizzy, sometimes very good. I drank mine with some ice cubes and lime, and almost always enjoyed it. After the first day, and a tip or two, the bartenders knew our preferences and they also knew where to find us for refills. We booked in Nov. and knew the beach was lost in Dec. but decided to come anyway, because it looked like a small laid-back resort, and are glad we did. We like the location as it is only a 15-20 min. walk to town. They are working on restoring the beach area, you could see a difference every day. You do have the timeshare people to deal with. We told them the first day we weren't interested and they really didnt bother us until the second to the last day, then it was visit a little and another no. This isn't a 5 star resort, but we didn't pay 5 star prices for this stay. We feel we got our moneys worth, and would go back again.","ratings":{"Overall":4.0},"author":"Lindsay Smitham","date":"2015-04-28 20:53:39 +0300"},{"content":"No beach! All photos of the resort are either prior to last years Hurricanes or of the Allegro on Cozumel. When I arrived (Sat 12/2) there was only about 20 ft of sand from the stairs (leading to the beach) to you end up in the water. On Friday the pool and the beach access was closed due to parts of the resort wall starting to fall into the ocean. When asking customer service to make arrangement to access the beach from the resort to the south (sister resort, owned by the same company) we were told no we can't help you. The customer service rep then told us that we can visit the public beach in downtown Playa ($10 round trip cab fare), but did not offer any way or compensation to get there. Rooms: The rooms sport very firm bed and have a lovely basement smell will take about 3 days to air out (or you just get immune to it?). We notice that water was leaking out of our bathroom light fixture. We called customer service twice before for maintenance showed up to look at it. Maintenance went upstairs to check it out the problem, we received no follow up and assumed it was fixed. The next morning I woke up at 5am to what I thought was rain outside. Nope, my investigation lead me back to my bathroom to find water leaking out of the ceiling light fixture faster than before (filled up a trash can in less than 1 hour). Food: The food was no more than average and was very repetitive by the third day. I will say all the wait staff and bartenders do a pretty good job of keeping you happy. Must love Cats There are several stray cats roaming the resort, these cats enjoy singing between 1am and 4am ( I met many others that enjoyed the cats). Keep your expectations low and will will not be disapointed.","ratings":{"Service":1.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Niko Emard","date":"2012-07-11 00:43:58 +0300"}],"public_likes":["Mariela Trantow","Camron Berge Sr.","Nia Langworth","Lacey Upton","Felipe Sawayn"],"vacancy":true,"description":"30 ocean-front cottages located across from Topanga State Beach.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}