{"title":"Death Valley National Park","name":"Mahogany Flat","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"Free","geo":{"lat":36.23099,"lon":-117.06787,"accuracy":"APPROXIMATE"},"type":"hotel","id":7389,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Stayed here for thanksgiving. We were supposed to have a non-smoking room but the room they gave us was clearly a smoking room. When we asked to change rooms, they gave us a lot of attitude and said things like, \"well, its a non-smoking room and someone must have smoked in there\". When I said that there was an ashtray in the room, the front desk person said that someone must have requested it. I found it interesting that one could request an ashtray in a non-smoking room. They finally moved us, but in the transition, I left a pair of shoes behind (my fault, of course). By the time I realized they were missing, the shoes had \"dissappeared\" from the room. The front desk said that housekeeping did not find any shoes. Yeah, right! To make the stay less inviting, housekeeping staff yelled at each other down the hallway as they cleaned at 8:00am each morning. It made it rather difficult to sleep to say the least. The ONLY positive thing that I could say about this place was that the location was perfect for getting around and right next to the street car stop. I'm not terribly picky about hotels, but the attitude of the staff as a whole would dissuade me from staying at this place ever again.","ratings":{"Overall":2.0},"author":"Mrs. Dallas Pacocha","date":"2015-03-24 07:55:36 +0300"},{"content":"Not the best hotel in New Orleans, but for the price not bad. Friendly staff, easy valet parking. Room could use plenty of updating. Best Feature: Shower heads are not water-saver type, Showering is like it used to be yeasr ago ....","ratings":{"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Service":3.0,"Rooms":1.0},"author":"Shanon Herman","date":"2012-07-09 01:23:05 +0300"},{"content":"We stayed at the Colunms the 4th of Feb thru the the 6th and let me tell you this place is the best! From the location , the beauty of this old classic Mansion, the bar, the food, the staff ....It has it all! We were here for my sons wedding (which he had right on the lovely front porch) The area is surrounded with beautiful historic homes We took a hour walk & just loved looking at everything! The trolley runs right in front of the Columns so great for getting around if you don't want to drive. You can walk to some area restaurants & the best little Wine Bar is just donwn the street! But you really don't have to leave at all because the bar in the hotel is very popular with guests & just folks looking for a cool place to enjoy a cocktail. The food here is delicious They serve breakfast( included with the room) Also lunch. dinner ,& lovely appetizers! The rooms are clean & comfortable furnished with the era of the home. Word has it there is a resident ghost ! The staff is friendly & helpful! The feel of the place is grand, eclectic,yet homey! So if your looking for a place that has it all this is where you need to stay!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Reuben Brekke","date":"2014-06-24 20:56:59 +0300"},{"content":"NOTE: I did not stay at the hotel, I only went there for the champagne/piano brunch with a group doing rehab work in New Orleans. The piano player was great; played throughout our meal. The food and drinks were fantastic from start to finish, and while it was expensive, it was definitely worth it. So, again, I cannot speak to the quality of the hotel, but the brunch is amazing!","ratings":{"Overall":5.0},"author":"Kenny Legros","date":"2013-09-05 23:22:15 +0300"},{"content":"My 3-night stay at the Columns was fine. As a former New Orleans resident, I had been to bar on the first level of the Columns many times and was excited to check out the guest rooms. (Even if you don't stay at the hotel, definitely check out the bar. The bar has great happy hour deals, gorgeous Victorian decor, and a huge columned porch with a nice vantage point over St. Charles Ave.) I stayed in the $120, \"cozy\" queen on the 2nd floor. The room and bathroom were small (the bathroom was really small) but clean, and as plain as can be. Compared to the great ambience downstairs, I was kind of disappointed by how spartan the guest rooms were. The bed was a fine size for me (5'8), but my 6'4 companion was uncomfortable in it. Be advised that the rooms do have a serious \"old house\" odor, but it adds to the character of the place. The staff was helpful and friendly, but the service was very no frills. One perk is the guests-only balcony upstairs, which I thought was great for relaxing with a drink and a book. Overall, I thought the room was a bit overpriced for what I received, and if I stay here again I will definitely pay a little more for a nicer room. I think that in the future I will just stay elsewhere and come back to enjoy the porch for happy hour, but the great downstairs area is enough to make me consider returning.","ratings":{"Overall":3.0},"author":"Jazmin Schaden","date":"2012-12-09 07:02:57 +0300"}],"public_likes":[],"vacancy":false,"description":"(Closed in winter).  Mahogany Flat is located at 8,200 feet in the Panamint Mountains and is accessible to high clearance vehicles only. Depending upon road conditions, 4-wheel drive may be necessary. The campground has 10 sites, tables, fireplaces, and pit toilets.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}