{"title":"Paris/8th arrondissement","name":"Hotel Pershing Hall","address":"49, rue Pierre Charron 75008 Paris","directions":null,"phone":"+33 1 58 36 58 00","tollfree":null,"email":null,"fax":null,"url":"http://www.pershinghall.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86908,"lon":2.30223,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21847,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"this place rocked. super chill, super cool, secluded and not near any other hotels or homes or shops or anything really; it was nice to literally be so far far away from anything or anyone. i see some of the bad reviews say that the resort/rooms are old. they're not that old, and who the f cares anyways, they don't advertise as some swank resort so dont expect mod furniture. everything seemed nice and clean to me. and the staff. OMG, they were all extremely happy people. super nice people. and yes, they do charge a 25 dollar per day resort fee, but that means 1) you dont have to tip anybody hahahah and 2) you get tons of free stuff like parking, shuttle service, towels, coffee and tea. its not that big of a deal honestly. the main reason i chose this place was b/c its off the beaten path and its the closest resort to Big Beach and Little Beach, which are THE beaches to go to in Maui. you can walk on foot for about 15 minutes and be at these amazing beaches; super convenient. probably the best vacation i've had in a while, and i travel extensively :) maui rocks and makena def contributed to the good vibes.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Rigoberto VonRueden","date":"2014-07-21 02:36:22 +0300"},{"content":"I had some really unpleasant experiences when my wife and I had our honeymoon back in March this year. The male staff in the front desk asked us to present the booking confirmation email letter to him for check-in. He looked so impatient as I had taken quite a long time to find out the letter from our bags. Since then, he didn't smile at all, and had a poker face toward us, and very impatient to our questions regarding the hotel facilities and internet access. I understand his job may be stressful. But his behavior just made us feel unwelcome, disrespectful and upset after a long and tired flight trip to Maui and this quality of service is unacceptable as it is a 4-star resort. In addition, the room is clean but a bit old and certainly update is needed. Other staffs are really friendly and helpful and I would like to say thank you for their quality service. Overall, the location and the facilities of the resort are good but the front desk service we received were really bad and disappointed.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Lourdes Bruen","date":"2014-05-26 03:06:01 +0300"},{"content":"For our second trip to Maui, we booked a 7 night stay at a major chain resort at Wailea, Maui, HI. Because of false advertisement of policy at the chain resort, we checked out of the chain the next morning . . . things were not looking good. We used our Frommer's Guide to try to find another resort on Maui for our next 6 nights. Frommer's listed this resort, formerly known as Maui Prince as an 2.5 star rating at the end of its list of resort listings. Going down the list and fearing that we were going to have to hotel hop (Kea Lani could put us up for 4 nights), we finally got to the end of the list and this listing. From the moment the reservationist answered our call, everything went \"right.\" Even though she didn't show an availability for 6 nights, understanding our dilemma, she put us on hold to speak with upper management and successfully secured us a room with balcony for the entire 6 nights for around $300 per night which included 24 hr. internet service, resort fee and valet parking (as we found at the chain all of this is very pricey). Given our situation (Maui for 6 nights and no lodging), we left the chain and headed south fearing what shape 2.5 stars meant. When we pulled into the resort, we thought for certain we were at the wrong place . . . it was beautiful, just like you would imagine an Hawaiian resort, the grounds beautifully landscaped. We were greeted at the entrance with leis, the first we had received since arriving in Hawaii. We went to the front desk and Ron greeted us warmly and seemed to know in advance of our prior troubles (my husband was still fuming about the chain) and entertained us with assurances and calm. At 9 a.m. our room was not ready and we certainly understood that since we had made the reservation 30 minutes earlier. In the meantime, Ron encouraged us to have breakfast and use the property while the room was being readied. We were greeted to a changing room with full bath, so that we could use the pool and beach and our valuables were safely locked up for us. The lobby areas were refreshing, breezy and really pretty with great Koi ponds. From the moment we pulled into the resort, our vacation was saved and wonderful, thanks to the Makena Beach & Golf Resort. The room with a giant balcony and oceanview was large and roomy and all amenities (coffee make, mini-frig, hairdryer, safe) were provided Our room was bright, clean and airy. We noticed that the rooms will be being redecorated during 2011, but our accommodations were great, very pleasantly appointed. The layout of the hotel and rooms are great, all the rooms seem to have an oceanview and through your room entrance, a view of the gorgeous mountainside. The gift-shop had everything one needed and was very reasonably priced. They stock sodas, chips, cookies, beer, and even stocked my favorite Merlot. There is also a coffee bar (Starbuck's coffee) with freshly made picnic foods, here the hotel offers a complimentary local newspaper Monday thru Saturday. All service was friendly, expedient and excellent. I ordered room service coffee every morning, breakfast on the balcony and late afternoon cocktails (and the room service staff seemed to anticipate my call). They seemed to know who I was and what I wanted. The food on site was excellent. An extraordinary breakfast buffet was available with inside/outside dining everyday. The Molokini Bar & Grill for the evening was excellent, some of the best food I've eaten and Celia, our waitress, was a sweetheart. The oceanside spa was excellent and had a great massage by well-trained therapist, I melted into nirvana while inhaling a wonderful aroma under a soft ocean breeze. The beach, ah, one of the largest in Maui. Unlike the chain resort with no real beachfront, the Makena Beach & Golf Resort fronted a very big and deep beach. We stayed at the Kea Lani in 2001 and this 5 star at the time fronts a very small beach but big pools - why go to the ocean to sit at a pool; we have a pool at home. And location, location, location: at the very end of Wailea, but this is a good thing too; it is the last resort along resort-row, just above Makena Beach and Oneloa (Big Beach), making it away from the most congested tourist and shopping traffic. I can't say enough good things about this resort, we felt truly pampered during our stay and have now been introduced to the Preferred Hotel Group, we will look for them again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Tressa Ward","date":"2015-08-16 16:59:21 +0300"}],"public_likes":["Flavie Pagac","Miss Monserrate Cartwright","Mylene Jast","Alexandro Goodwin V","Omer Kling","Bessie Bogisich","Alisa Heller"],"vacancy":true,"description":"Charming five-star boutique hotel with a secluded patio and lush vertical garden.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}