{"title":"Culver City","name":"Courtyard by Marriott Los Angeles Westside","address":"6333 Bristol Pkwy","directions":"3 miles north of LAX, visible from the 405","phone":"+1 310 484-7000","tollfree":"+1 800 321-2211","email":"phirneisen@rimcorp.com","fax":"+1 310 590-2593","url":"http://www.courtyardlawestside.com","checkin":null,"checkout":null,"price":"Rates range from $139 for a room with two queen beds to $299 for a one-bedroom suite","geo":{"lat":33.98065,"lon":-118.39217,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7060,"country":"United States","city":"Culver City","state":"California","reviews":[{"content":"I stayed at the stratosphere with two friends because we found a great deal on Expedia for flight and hotel. The room was clean and nice. Sufficient if you aren't going to be in the room much. The location was on the end of the strip but easy access to a bus if you want to get to the center of the strip and don't want to walk a mile to get to it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Stan Herman","date":"2013-05-25 20:32:54 +0300"},{"content":"Stayed here for two nights as part of a trip to where we also stayed at New York New York and the Monte Carlo. The main reason for staying here was to get free access to the tower so we could go up in the day and at night. I stayed here previously in 2004, but it does seem to have gone downhill a bit. The staff were great, but it definitely seemed to be a budget bus tour hotel. It is a bit out of the way of the main strip, with a number of unfinished hotel/casino's inbetween. We stayed in a Stratosphere Select room which was recently refurbished very tastefully and to a high quality. There are limited restaurant choices - a 50's style diner that served mostly burger type food, and an italian that was fairly expensive. There are plenty of fast food outlets, so first night we grabbed a pizza and ate in our room, and the second we got a taxi down to the main lively area of the strip ($15). The room prices make the place attractive, but we'd recommend paying a few dollars more and staying further down the strip (i.e. Mandalay Bay to Treasure Island area).","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":2.0},"author":"Estevan Oga","date":"2012-10-26 20:10:43 +0300"},{"content":"Awesome hotel for the price! The room was nice, clean and quiet. Only wifi isn't free in the hotel :-( Otherwise we had a great stay and i can recommend the hotel! With the Shuttle Bus it is only a few minutes to the other hotels (one advise: use the express bus at peak times!) and also to Fremont Street.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Miracle Bahringer","date":"2014-08-01 10:57:00 +0300"},{"content":"Got a killer package deal on Travelocity, so we thought we'd give it a try. Was very, very pleased with the experience at the Stratosphere. Got one of the recently renovated rooms on an upper floor, and it was awesome - it actually looked just like the pictures posted on their site. Room was clean, functional, nicely decorated, and aired out. The bed was fantastic - big cushy new mattress with high quality bedding and lots of pillows. And maybe I just got lucky, but the hotel seemed quiet for all four nights I was there - no amatuer young drinkers stumbling and \"woo-ing\" up and down the halls, and no objectionable noise to speak of from the street. Elevators were fast and kept spotless. The casino was a lot of fun, and seemed to have a wide variety of patrons (everything from Jersey Shore candidates to Midwestern types). I wouldn't say the slots were loose per se, but the money seemed to last a bit longer here than on other places on the Strip. Drink service was good - the drinks were weak as water, but they kept them coming quickly and were very friendly. Actually, all the staff I encountered, from the cleaning crew to the conscierge, were very friendly and efficient. And while I think the $8 per night or whatever they charge for a \"resort fee\" is lame, it does include unlimited passes to the tower observation deck, which provides a surreal view, night or day. As for the location... yes, it is kind of isolated. But if you plan well and are prepared to shell out a bit for the bus, monorail, or taxi, you'll be fine. It's probably too far to walk to the \"good\" stuff on the Strip, and I wouldn't advise walking to downtown under any circumstances, unless you're with a large posse of sober ninjas that could take on all the toothless and tweaking street people swarming that particular stretch. The Strat is somewhat of a self-contained city, anyway (with tons of onsite shops and conveniences), and you can probably take care of the majority of your wants and needs within the confines of the property. Roxy's Diner had great food, and the little Mexican place upstairs was pretty good, too. There's also a McDonald's and Starbucks onsite if you just need something fast. I can honestly only find one fault with the Stratosphere, and that's the bar soap they provide. The lotion, shampoo, shower gel and conditioner are fine, but that bar soap was useless and vile. Seriously - that's my only gripe about the place. Will absoutely be back to stay and play here. I hope everyone else has the same good experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Jadyn Ankunding","date":"2014-10-22 01:56:14 +0300"},{"content":"As you walk into the hotel, you will smell stale tobacco smoke and the smoke will follow you during our entire visit. The smoke can be tasted in the food and beverages purchased on the first floor of the hotel. I went with three other women, two came down with bronchitis due to heavy smoke exposure (they are none smokers). Absolutely no ventilation. The hotel is not near the action, too far off the strip to enjoy the Vegas experience. If you leave the hotel, you must take a cab or walk through a rough area of town. One can walking to the Monorail a few blocks away -so that is an option. Do not take the bus!! The buses fill up quickly, the drivers are rude and you must have the exact change to board or buy a ticket. Plus, the bus will $@!#% part of your day, getting to your location. Claustrophobia doesn't begin to express the bus ride, its also dirty. There is not a microwave or coffee pot in the room. Actually, I did not find the hotel had anything to offer that I couldn't find at a hotel at the strip. By the time we paid for a taxi cab to take up to shows and leave a tip, we could have paid for a room on the strip, and had greater access to events. I will not return to the Stratosphere.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":1.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":1.0},"author":"Ms. Devyn Parisian","date":"2014-06-03 11:03:52 +0300"},{"content":"Our experience in this hotel was a complete disappointment, especially if compared with the one we had in an another Las Vegas hotel last year. We booked a non-smoking room and payed an extra to have a room with the view...we were given a smoking room with the view on the parking and they were not able to change the room till the day after so we had to sleep there for one night and they even refused to give us back the extra money we paid for the view for the first night. The personnel at the reception were not helpful and treated us as fools. Apart from this rooms are clean and price not high but the hotel is far from the main attractions.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Location":1.0,"Rooms":2.0},"author":"Burnice Braun V","date":"2014-05-06 08:41:36 +0300"}],"public_likes":["Kallie Grady V","Jovany Gibson","Adelle Breitenberg","Jovani Mohr","Dr. Freeman Carter","Van Emard","Maritza Jones","Garland Gaylord","Chaim Fay"],"vacancy":true,"description":"Opened April 2008, this hotel features 260 spacious rooms and suites in addition to 10,000 square feet of flexible meeting space and a full catering department.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}