{"title":"Derry","name":"Derry City Independent Hostel","address":"44 Great James Street","directions":null,"phone":"+44 28 7128-0542","tollfree":null,"email":"derryhostel@hotmail.com","fax":null,"url":"http://www.derryhostel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.00007,"lon":-7.3257,"accuracy":"APPROXIMATE"},"type":"hotel","id":7780,"country":"United Kingdom","city":"Londonderry","state":null,"reviews":[{"content":"The Chancellor was the perfect place for a week-end Christmas get-away. Great rates included free parking. Wonderful, nicely decorated room with a view of the Christmas tree in Union Square. Cable car access across the street, fabulous food and shopping within walking distance. Really great front desk, bellman and cleaning staff. What more could you ask for?","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dixie Connelly","date":"2013-05-07 02:00:57 +0300"},{"content":"This was my 2nd stay at The Chancellor, and it was just as amazing as my first visit! It was my birthday weekend, and we were welcomed with a lovely bottle of wine in our room. The decor is so pretty, and the location is ideal for holiday shopping. So nice to recognize a few of the employees from 2 1/2 yrs ago. That shows to me that management treats their people right, and it shows in their treatment of their guests. I highly recommend The Chancellor to anyone wanting a romantic getaway hotel location!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Blaze Bernhard","date":"2013-10-06 20:17:48 +0300"},{"content":"A wonderful hotel, great location in a safe, CLEAN area near everything from great restaurants to shopping to public transit to tour starting points. The room was lovely & very clean. Room Service for breakfast (on my birthday) was wonderful. We asked the concierge for a restaurant recommendation and he seemed to know minute details of nearly every place in the city and we ended up at a great French place 5 minutes away. Would definitely go back to the Chancellor!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Damien Nicolas","date":"2014-02-05 17:36:13 +0300"}],"public_likes":["Ladarius Von MD","Lilliana Nolan","Ena Emmerich","Zechariah Fahey","Kiley Kilback","Roberto Braun","Jacques Hudson","Ariel Braun"],"vacancy":true,"description":"A friendly, independent hostel, run by two backpackers who have been traveling around the world for quite some time themselves. The hostel actually consists of three separate houses, all spread out within walking distance of the old town and the Bogside murals.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}