{"title":"Offa's Dyke Path","name":"Leighton Arches Caravan Site","address":"Welshpool","directions":"East of Welshpool on B4381","phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.6555,"lon":-3.13072,"accuracy":"ROOFTOP"},"type":"hotel","id":21039,"country":"United Kingdom","city":"Forden","state":null,"reviews":[{"content":"Obviously been a grand hotel in it's heyday, BUT, that was a long tome ago. The pictures are great but it's quite a bit shabbier in reality. Plus Point, the staff were really friendly and gave \" GOOD OLD AMERICAN SERVICE \". I HAVE STAYED IN PLACES A LOT WORSE BUT I REALLY DID EXPECT BETTER IN AMERICA.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Sabina Shields","date":"2015-09-26 07:53:23 +0300"},{"content":"Was here for business and stayed Friday and Saturday nights (November 4 and 5, 2011). Was in Room 708, I think. Had a king bed. Room was very warm. Kept the heater turned off. I am usually a very sound sleeper, but the noise from the hallway and the street were unbearable. The windows have absolutely no soundproofing from the outside noise. Every car, horn and person was heard at all hours of the night (and I live in NYC!!). On Saturday night, there was some party in the club on the ground floor. It was packed, and the loud rap music was blaring. I could hear the THUMP THUMP THUMP of the music. I called downstairs about 1 am and was practically laughed at when I requested if they could do something about the noise. The room itself was mediocre, at best. Small, outdated bathroom, with sporadic hot water. There were two phones in the room. Neither worked. Twice I stopped at the front desk asking them to be fixed. Good thing my iPhone has a built in alarm, as I could not request a wake up call. Skip this place. Not worth it.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Ara Wintheiser","date":"2015-12-27 15:12:22 +0300"},{"content":"The Boston park plaza boast of history. However the rooms and the foyers need need carpets and decor. Furniture too needs replacement. Bedding was comfortable and sleep quality is good. The room needs better sound insulation . restaurants on site are good.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Henri Hayes","date":"2012-03-29 17:15:57 +0300"},{"content":"My stay was not a happy stay, room is ok, no thermostat, tiny washroom, hot water is on and off phenomenon,rude staff, stuffy room...way too expensive for this...","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":5.0},"author":"Virgie Watsica Sr.","date":"2012-01-12 00:40:38 +0300"},{"content":"Hotel is deceiving on first blush! Large, opulent, historic lobby...tiny, less than well appointed rooms, paper thin walls, NO WiFi/internet w/out ridiculous fees (what century are we in?), difficult to find/reach plugs in the room (many did not work) and staff who are not uniformly knowledgeable or helpful. So many little things added up to one major (and expensive!) disappointment, and I would not recommend a stay here.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Evan Hodkiewicz","date":"2014-04-26 16:43:08 +0300"},{"content":"What a great staff and location! We were very pleased with our room and the friendliness of the staff. We were upgraded our second night (because we decided to stay another night) to a king suite. It had amazing views and was spacious. Kelly & Carlos were terrific! Would highly recommend to anyone who appreciates colonial charm rather than a \"cookie cutter\" hotel chain.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Reyes Rippin","date":"2013-07-12 21:55:15 +0300"},{"content":"An unexpected trip to Boston required us to find a room for the night. Trough trip advisor we got a room at the Park Plaza for $240. When I asked if we could reserve the same room for the next night, the rate would be $575! When we arrived at the hotel, we were upgraded to the tower level. When we arrived, the room looked as if it had been used for a meeting in the afternoon (room service trays outside the door and notes on the desk). Other than that the room was very clean. The bed was very comfortable -- but we could not control the room temperature -- even pushing the temp control down to 64, the room never went below 75. As a business traveller, I have a personal beef with high price hotels that charge for internet. We were only in the room for 10 hours, I did not want to pay $10.25 to send out two e-mails. Usually, there is a common area where internet is available. Such was not the case at this hotel.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Cory Huels","date":"2013-01-11 03:23:32 +0300"}],"public_likes":["Elwyn Stanton","Jordane Wunsch","Lorenza Stroman","Mrs. Herminio Heidenreich","Loyce Yost","Delilah Hayes","Cora Denesik","Seth Herzog","Marcelo Hane"],"vacancy":true,"description":"Campground","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}