{"title":"San Francisco/Golden Gate","name":"Laurel Inn","address":"444 Presidio Ave","directions":"between California St and Sacramento St","phone":"+1 415 567-8467","tollfree":"+1-800-552-8735","email":"thelaurelinn@communehotels.com","fax":"+1 415 928-1866","url":"http://www.jdvhotels.com/hotels/california/san-francisco-hotels/laurel-inn","checkin":"3PM","checkout":"noon","price":"$159-$209","geo":{"lat":37.7876,"lon":-122.4466,"accuracy":"APPROXIMATE"},"type":"hotel","id":25804,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I was there over Mother's Day week on business. So the Inn was a great choice. The location was ideal to the convention center, 5 minutes tops. Grocery store down the street and 7-Eleven right across the street. It was a one bedroom apartment w/extra perks. I took advantage of all the services. Free phone calls, use of the computer (free Wi-Fi), breakfast (when I didn’t feel like cooking), washer/dryer, workout room (when I wasn’t exhausted from work, shopping or site seeing). The staff was super. I met each one every day while I was checking my emails. My laptop took a dive the second night so I was in luck that they had one to use. The bed was comfy and the pillows were great after a long hard day. TV in both rooms was convenient, the safe in the room was a great addition. Since the Inn was keyless it made getting in so much easier and safer. My only set back was no tub for soaking my tired body, but the shower head made up for some of it. I am planning another trip and I will be coming back. I also book for others and will use this Inn again and again. GREAT PLACE….","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Reese Goodwin","date":"2012-04-22 17:17:26 +0300"},{"content":"My daughter and I took a trip to Boston and stayed at The Inn for 5 nights - I can not say enough good things about the stay. We stayed in a suite which was fabulous! It was like home away from home -the decor was exquisite, the amenities are top-notch, the hospitality-amazing! The location is ideal for everyone and everything- so lovely- I would never stay anywhere else and will recommend The Inn to anyone I know that is traveling to Boston for a stay. I will definitely be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Concepcion Bartoletti","date":"2013-10-03 15:35:07 +0300"},{"content":"We stayed at the San Agustin over the weekend of the Festival of Merce, which was a great experience and added a great carnival atmosphere to the city. The hotel is in a great location, just 50 metres set back from the Ramblas which means it is very central but also just a little set back to avoid the noise. The reception is clean and welcoming and the reception staff were extremely helpful, not only with the rooms but also in providing maps, advice on travel and sightseeing and booking tickets. The rooms were nice, we had a top floor attic-style room. The room was clean, roomy and fairly well equipped, it had all we neeed as somewhere to sleep, shower and dress. Breakfast was fine, it was the usual mix of breads, pastries, cold meats and cheeses plus scrambled eggs and sausages, plus drinks, toast etc, all on a self service buffet basis. We didn't eat in the hotel restaurant so we can't comment on this, as you'd expect there are hundreds of places to eat all around the city We loved Barcelona and if we go back there again we would definitely book the San Agustin again. Top sightseeing - the harbour, the fenicular railway and cable car in Montjuic, La Sagrada Familia, the Ramblas. The open top bus ride is well worth doing.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Albert Mante","date":"2015-10-12 14:52:48 +0300"},{"content":"Beware.... bed bugs This hotel is located on top of a bus station, with buses running from 6AM to 9PM. Nowhere in the lodging information does it mention this. While the hotel was decorated nicely my traveling companion and I got a serious case of BED BUGS. These 2 issues ruined our vacation,needless to say.","ratings":{"Service":-1.0,"Business service":3.0,"Cleanliness":2.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":2.0,"Location":1.0},"author":"Mr. Samanta Ullrich","date":"2012-04-10 15:24:24 +0300"},{"content":"The room is too small and needs to repaint, bed is not comfortable to sleep and even there is wifii its too hard to access","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Location":3.0,"Rooms":2.0},"author":"Mose Yost","date":"2013-11-24 04:16:52 +0300"},{"content":"I book this hotel at the last mi ute through latestays.com that provides a better price then agoda and more accurate picture of the place you will stay. This is not a tourist place and dont promote this place as it. Its a transit hotel with a good location. Near mrt so easy to reach from the airport, 15 minutes by walk from orchard and the walk is in interesting since you will discover the university of art and other i terting things. You cannot get lost the way is really easy. You are near little india too. The other good thing you have near by a 7/11 and restaurants open 24 hours. Regarding the hotel i didnt expect much but at least you can get some sleep or rest after a busy day. You can hear everything from your room you hear people walking in the corridor and the other rooms on the same floor. I didnt find any sleep at all since this hotel even at 3 o'clock since to be busy by short stays guest \"guy with girls.\" The room was small 20 sqm, the shower with the toilet but good point hot water but no pressure. They provide free internet that i needed this one reason i stay there coz in singapore they charge crazy prices for internet. So free internet is good when its working! It was working but u need to setup the password every twenty minutes. So annoying. I didnt upload any pictures since you got all already here. So please dont stop there for tourism, for one night transit its ok.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Bessie Murray","date":"2014-04-26 05:27:12 +0300"},{"content":"I booked this hotel on agoda.com, very reasonably prices, superb location. But, this is not for a family vacation. All rooms are extremely small. Surprisingly the rooms and bathrooms are very clean and maintained well. LCD TVs in all rooms. It is located very near the Little India MRT. Very close to Mustafa Plaza a 24 hours hyper market. Loads of Indian restaurants. The only 2 good things about this hotel is its location and its hygiene.","ratings":{"Service":2.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":5.0},"author":"Stuart Nitzsche","date":"2013-07-05 21:00:34 +0300"}],"public_likes":[],"vacancy":false,"description":"Built in 1963, this renovated hotel has a comfortable yet fashionable interior. Each room is spacious and similar in size to a studio apartment with some even having kitchenettes.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}