{"title":"Joshua Tree National Park","name":"White Tank Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":33.98506,"lon":-116.01659,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12930,"country":"United States","city":"Riverside County","state":"California","reviews":[{"content":"Veri nice boutique hotel in the heart of Tsim Sha Tsui. Highly reccomended for couple, groups of friends or solo travellers looking for something nice with great price and nice location. They do not have a restaurant, but you can find nice places close to the hotel ( I really enjoyed the Agnés B. Café, 5 minutes walk from the hotel).","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jordy Rolfson","date":"2012-07-22 02:02:49 +0300"},{"content":"We booked this hotel a few days before traveling and this was during the peak festive season, between X mas and New Year - so wouldn't say \"value for money\" but it far exceeded our expectations. The hotel is centrally located and close to all the hot spots on Kowloon. The MTR station is a short 5 minute walk from the hotel and offers excellent connectivity to all places in HK. The rooms were clean. The bathroom impressed us - was a decent size, good shower with hot water and the complimentary toiletries. The rooms could have been a bit bigger, but not complaining as we spent a short time there. No restaurants in the hotel for breakfast...but the Delifrance restaurant that is less than 50 mtrs away served us well. The aircon was very cold even after setting it to the highest temperature. However, the hotel staff provided us with a room heater to keep us warm.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Buford Weber","date":"2015-01-27 08:35:40 +0300"},{"content":"This boutique hotel is situated at a very convenient location and nearby Tsim Sha Tsui MTR station. On our first day, we actually have difficulty locating the hotel. Once we have manage to get our orientation of the hotel location, it is very to move around. The hotel is parallel to Cameron Road. There are many small roads that can lead to the hotel from Nathan Road. Personally I prefer to use Humphrey.. If you come from Granville Road then you have to turn right into Carnavon Road, pass Cameron Road on the left and Prat Avenue is the next road. The hotel is located on the right hand side of the road on Prat Avenue. Look out for \" Neway \" signage at the top and you will be able to spot the hotel. If you come from Tsim Sha Tsui MTR station, walk pass K11 shopping mall pass Hanoi Road and you will come to a cross junction. Prat avenue is just 12 o'clock down the road. The hotel is relatively new and the room is clean and quite spacious.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dixie Krajcik DVM","date":"2015-08-09 03:32:38 +0300"},{"content":"I didn't give the hotel 5 stars because there were some repairs going on our floor, at least they allowed us to sleep well. This hotel was clean, people at the front desk were EXTREMELY helpful and friendly, always making sure everything was in order. We had absolutely no problems (other than changing some doors and fixing some patches of carpet on our floor to make it nicer--a good sign). Also, since we have 2 pre-teen boys, the free wi-fi access on the computers near the elevators were a BIG plus! Lots of things to see near the hotel. My soon had a tummy ache and I was able to get him some tasty PHO accross the street. We would definitely come again! NOTE: this hotel is actually in Kowloon, and easy to miss","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Tito Kihn","date":"2014-03-30 12:31:34 +0300"},{"content":"As soon as you enter the cool, calm fragrant reception you can breathe a sigh of relief. The staff our pleasant and helpful, the hotel is quiet and calm the perfect antidote to the madness and mayhem outside. Great location, easy to get to the metro and the star ferry terminal and of course Nathan Road and the great boutique shops of Granville Road. We stayed 4 nights at the Butterfly and loved it.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Victoria Paucek","date":"2015-01-05 18:36:39 +0300"}],"public_likes":["Rylee Hoeger","Roderick Farrell"],"vacancy":false,"description":"Located along the main park road, close to the North Entrance Station.  15 sites.  There is no water available and motorhomes and vehicles longer than 25 feet are not permitted.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}