{"title":"Offa's Dyke Path","name":"Valeside B&B","address":"Bella Vista, Tremeirchion Road, Bodfari LL16 4EG","directions":"B5429, Bodfari","phone":"+44 1745 710495","tollfree":null,"email":null,"fax":null,"url":"http://valeside.wix.com/valeside","checkin":null,"checkout":null,"price":"Sgl £50, dbl £75, twin £80","geo":{"lat":53.22236,"lon":-3.36295,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21030,"country":"United Kingdom","city":"Denbighshire","state":null,"reviews":[{"content":"My mother and I stayed here for a bridal shower that was in the North end...so nice! Beautiful location, very close to restaurants/North end. Staff could not be more helpful and pleasant. I was sad to leave...would definitely recommend!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Betsy Lowe","date":"2015-08-20 17:19:52 +0300"},{"content":"The convenience of this hotel can't be beat! It is the first stop on the Old Trolley Tour (a great way to see the city if you're a first time visitor), has a metro stop at the front entrance, is conveniently located across the street from a large variety of quick food stops and restaurants, AND offers scenic views of the Wharf. It is located next door to the aquarium. The water taxi stop that goes to and from the airport is located adjacent to the side entrance of the hotel. The water taxi offers a unique and fun method of transportation that is uniquely Boston! Also, the taxi is highly reasonable and efficient. There is a Starbucks on the ground floor serving light breakfast fare and most Starbucks beverages- a great quick breakfast stop for us! The location, friendly staff, and knowledgeable hotel concierge truly make this hotel an excellent location for anyone visiting Boston, but especially those that have never been before. Our room (located down the hall, away from the lobby, and with a water/Wharf view) was clean and comfortable; however, it was not quiet. The noise from the lobby echoes, (including lobby music and typical lobby hustle/bustle sounds), can be heard while in the room. The walls are extremely thin, so much so that we could clearly make out conversations from our neighbors. The Wharf, although scenic, is also quite noisy. Every morning, throughout the day, and sometimes late at night, the loud horns from the boats coming and going are easily heard. If you're up and out early, and out late, sightseeing and enjoying all Boston has to offer, this noise might not be a problem. After all, we didn't come to Boston to sleep and lounge in the room. The pro's definitely outweigh the con's here; Overall, a great place to stay in Boston!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Damaris Graham","date":"2012-10-01 07:09:37 +0300"},{"content":"We were a family of six ages 5 thru 70 staying one night and we all had a wonderful experience here. Easy walk to Faneuil Hall, the North End and the Aquarium. Short taxi ride to the theater district or Newbury street. Excellent staff and service. The children had lots of fun using the pool after dinner when there's not a lot for young ones to do in winter. Rooms were very clean and comfortable. Breakfast buffet was plentiful and very good. We'd stay again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Earnestine Nader","date":"2013-12-16 11:46:08 +0300"}],"public_likes":[],"vacancy":false,"description":"2 dbl (one ''en suite''), 1 ''en suite'' twin.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}