{"title":"San Diego/Downtown","name":"Gaslamp Hostel","address":"546 3rd Avenue","directions":null,"phone":"+1 619 366-9134","tollfree":null,"email":null,"fax":null,"url":"http://www.gaslamphostel.com","checkin":null,"checkout":null,"price":"Rates are $25 for dorm rooms and start at $60 for private rooms","geo":{"lat":32.711,"lon":-117.16219,"accuracy":"APPROXIMATE"},"type":"hotel","id":25152,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"The Embassy is in a great location because its near casino and the river walk.. Also, close to the WWII Museum.. The hotel over all is pretty dirty or worn. The hotel has great colors and decor throughout the building and foyer. As typical the breakfast is good at Embassy along with free drinks at happy hour.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Elda Ortiz","date":"2012-04-06 03:13:43 +0300"},{"content":"This ES was very different than all the rest. No atrium as rooms were to outside as it seems as this was a Roadway Inn before and it has the same appearance. Rooms were terrible as we were up on floor 13 and went outside to go to the room. This was not acceptable. Got a room inside but not that much better. Stayed in two separte rooms while there and both had that not clean look and feel to it. This is why we always get extra sheet to sleep on and this time it was very necessary. Broken fixtures and mold looking dirt on and near vent. Toilet paper on sink because anchor for holder broken. Refrig freezer door bot there and refrig hot. Terrible stay especially charging $200+ a night for rooms but they were all sold out for the festival. Women taking off heels as NO sidewalks were terrible. Sink hole right outside EM on Julia st. Breakfast crowded. Business Center had no pens.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":4.0},"author":"Mr. Aurore Ondricka","date":"2013-12-03 13:03:16 +0300"}],"public_likes":["Zackary Pfeffer","Dallas Friesen","Lavern Weissnat","Chris DuBuque"],"vacancy":false,"description":"Hostel with easy access to the historic Gaslamp District. They have 4-bed and 6-bed female and co-ed dorm rooms as well as some private rooms.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}