{"title":"Paris/18th arrondissement","name":"Kube Hotel","address":"1-5 Passage Ruelle","directions":null,"phone":"+33 1 42 05 2000","tollfree":null,"email":null,"fax":null,"url":"http://www.kubehotel-paris.com/en/page/kube-hotel-paris-18.1.html","checkin":null,"checkout":null,"price":"€190-2,500","geo":{"lat":48.8864905440121,"lon":2.3588204383850098,"accuracy":"APPROXIMATE"},"type":"hotel","id":21679,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"As a Professional Travel Consultant, I am very critical in my reviews of hotels and resorts. The Grand Wailea seems to never disappoint us. My brother was married at the GW years ago and returns annually for his anniversary. I have celebrated my last several birthdays at this property and found it to be lovely. My Honeymoon couples and special occassion clients receive VIP treatment and a high level of customer service. Very nice Spa and gym, and as with any resort, some of the restaurants are ok, and some are great. Overall, I send my clients to the GW with confidence and plan to return myself in March 2012.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Shyanne Mraz","date":"2015-06-09 07:40:53 +0300"}],"public_likes":["Pierre Brown PhD","Elva Donnelly","Demetrius Reichel","Amie Willms","Kristy Romaguera","Clementine Romaguera II","Alba Ebert"],"vacancy":true,"description":"Stylish and atmospheric, the Kube Hotel exudes a high tech and luxurious decor. All the rooms come equipped with individual air conditioning, digital door opening, multi-function computer (DVD, CD, TV screen), cable TV, ADSL Internet, strongbox, mini bar, and fully equipped bathroom. As its name might suggest, the rooms feature some sort of cubism design and even the bedside tables look like ice cubes. Go out at night in your very own hotel, with a DJ spinning in the bar nightly, as well as being Paris's first-ever ice bar.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}