{"title":"Paris/17th arrondissement","name":"Renaissance Paris Arc de Triomphe","address":"Avenue de Wagram 39","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.marriott.com/hotels/travel/parwg-renaissance-paris-arc-de-triomphe-hotel/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.87708,"lon":2.29714,"accuracy":"APPROXIMATE"},"type":"hotel","id":21677,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"The hotel itself and the views from the Grand Waiela are beautiful, however if you aren't into hanging out with other peoples screaming children I don't recommend this hotel. Everyday the parents of kids go down to the pool and save all the chairs with towels. They are gone by 8am-ish. If you try to use one you will be quickly told that little Jimmy is on his way! They claim to have an adult pool but no one regulates this - not even the adult hot tub. There were also never any towels at the pool after the peek hours of the day (after 4pm). You can call housekeeping but no one will come. Not to harp on the kids, but I tried to make a spa appointment and was told that I could not be booked anytime during my four day stay because they had several \"little girl\" birthday partys to accommodate. At the prices of the spa I couldn't believe it! We were there for a conference my husband attended so we only paid a small portion of the bill but if I were coming out of pocket $600+ a night I would have been highly upset!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":2.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Jude Erdman DDS","date":"2015-04-14 17:04:34 +0300"},{"content":"The Waldorf Astoria lives up to its name. It has a the wonderful feel of Hawaii and is set on its own peaceful side of Maui. The Waldorf is surrounded by tropical gardens and manicured grounds. Its gorgeous! The staff were very courteous and friendly. There were torrential down pours and power outages for a few days during our visit to Hawaii and the Waldorf went beyond the norm to comfort all its guests by giving out complimentary ice cream and massages in the spa. All of the restaurants at the hotel were wonderful. The exciting swimming areas are full of caves, hot tubs, and slides and are fun for the whole family or a couple on a retreat. This luxury will cost you a pretty penny though. So for a weekend splurge it is definitely worth it! I would highly recommend this place to anyone looking for a luxurious experience!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Anastacio Turner Sr.","date":"2013-03-25 20:42:46 +0300"},{"content":"For our Hawaiian Christmas vacation,we planned to attend a luau. Everyone said to go to Costco and get luau tickets at a discount for the Grand Wailea,so we did. (We had previously planned to do the Old Lahaina Luau) The hotel is amazing and walking around the grounds was so much fun for the adults and the kids. There are fish ponds and many beautiful photo locations. It was Christmas,so the decorations all over the resort were fantastic! We were greeted at the luau with such charm and friendly smiles,escorted to our table for 9 and shown where to get drinks while waiting for the show to start. They even had lawn bowling and tattoos for the kids,which ours thoroughly enjoyed. The luau served drinks throughout and offered specialties such as pina coladas and mai tais (both alcoholic and non for the kiddies) and then they had the uncovering ceremony at the Emu pit. Finally the show started and the buffet was served. My husband and I had been to a luau before and the food here just didn't stand up at all. It was very disappointing,considering the splendor of the resort and show. I would recommend this only if you were already staying at the hotel,otherwise,spend a few more dollars and go to the Old Lahaina Luau.","ratings":{"Overall":3.0,"Value":4.0,"Service":5.0},"author":"Nathaniel Orn","date":"2012-10-18 21:20:34 +0300"},{"content":"It is the hotel that other family hotels should be compared. We went over the Christmas holiday and spent a week at the property. We left to go to the other side of the island once and was happy to return to the quiet Grand Wailea. The resort is big which made it nice for our children. My wife and I went to the spa on several occasions. We played golf as a family on 3 of the days and then hung around the pool. The restaurants were good. The room service for breakfast on the lanai was good. I liked the place. Maui, however, is too touristic for me. Maui is great for golf and seclusion at a resort. The island has become a mecca for every American. Stay here if you come to Maui. Otherwise, consider the Four Seasons on Lanai and the big island.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Beatrice Dietrich","date":"2012-01-31 05:26:11 +0300"}],"public_likes":["Sally Strosin"],"vacancy":true,"description":"The Renaissance is a thoroughly modern property with floor-to-ceiling windows in the posh Avenue Wagram, just a short walk from Place de l'Étoile. The building was designed by the same Christian de Portzamparc who gave the Palais du Congres its current appearance.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}