{"title":"San Francisco/Union Square-Financial District","name":"Hilton San Francisco Union Square","address":"333 O'Farrell St","directions":"between Taylor St and Mason St","phone":"+1 415 771-1400","tollfree":null,"email":"Guest_Assistance@hilton.com","fax":"+1 415 771-6807","url":"http://www3.hilton.com/en/hotels/california/hilton-san-francisco-union-square-SFOFHHH/index.html","checkin":"2PM","checkout":"noon","price":"$149-$369","geo":{"lat":37.7857,"lon":-122.4108,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26221,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We viewed some of the reviews of the Champions Resort with some trepidation, However we were pleasantly surprised. True the rooms are a bit dated. but they were kept clean and tidy, the maid and staff being very friendly and approachable. The pools , laundry and exercise room are all very good and well kept, as are the gardens and childrens play area. For a budget complex, it is great for a base, after all we spent most of the time elsewhere. We would stay there again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Ms. Rosamond Gaylord","date":"2015-10-17 07:35:50 +0300"},{"content":"This hotel/motel was supposedly rennovated as under new management. Our room was dirty with mould in the bathroom. The air con sounded like to plane taking off so we couldn't use it. We asked for a kettle on the day we arrived (14 night stay) and there were none, and was told to come back next day. We did this every day for the 14 days - became of running joke in the end. Room was also very basic. The pools looked OK but didn't venture in them. The first night we also ate in the bar and the food was revolting and well over priced. The next morning went down early to breakfast and half the containers were empty so for what we had that ended up being very expensive too. We've been to Florida with Virgin Holidays several times and always been pleased so can't see why they have this calibre of hotel/motel in their books. Maybe Virgin should check it out for themselves.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":2.0},"author":"Abbigail Shields","date":"2012-05-06 04:15:39 +0300"},{"content":"We arrived during a torrential rain storm. There was no cover at the front door where we had to buzz in. The person on the buzzer said my card had been declined. I had to plead with her to be allowed to get in out of the rain so I could give her another card. I gave the same card and this time it went through. While we stood in the entry hall, a couple coming down the stairs said \"good luck!\". When we entered we saw what he meant. The window was leaking and there was a brownish puddle on the sill. running down the wall. There was some kind of stain on the bedroom curtains that looked like dried blood. The bed was a thin mat on what looked like a camp cot! We were only staying 1 night so we though we'd just watch tv and go to sleep. The tv only faced the kitchen sink and could not be seen from the sofa (which was filthy) Only a few stations available, half in Spanish. The walls looked like someone had been kicking then with black soled shoes. Needless to say we checked out that same hour. We were willing to face a biblical storm to find a new place rather than stay there!!! Oh yeah good location if you don't care about your health","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0},"author":"Alysa Wiegand","date":"2014-10-12 07:46:24 +0300"}],"public_likes":[],"vacancy":false,"description":"At 46 stories tall, this hotel is the tallest hotel in the downtown area and has excellent views over the city. It also has a heated outdoor swimming pool and jacuzzi, as well as high-speed internet in all rooms.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}