{"title":"Marina del Rey","name":"Ritz-Carlton, Marina del Rey","address":"4375 Admiralty Way","directions":null,"phone":"+1-310-823-1700","tollfree":"+1-800-542-8680","email":null,"fax":null,"url":"http://www.ritzcarlton.com/en/Properties/MarinadelRey/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98493,"lon":-118.45186,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":17599,"country":"United States","city":"Marina del Rey","state":"California","reviews":[{"content":"The location is nice and rooms are spacious. Even though the hotel allows pets the rooms nor the hotel didn't have pet order. The restaurant in the hotel has good pizza and that's about it. Would definitely stay again!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Manuela Spinka","date":"2014-08-03 11:01:45 +0300"},{"content":"Small cramped rooms, lackluster service, great location add up to 3 stars. There for a business meeting I found the restaurants unaccommodating. I guess they're hip, but the idea of sitting on an ottoman and eating off a low table just didn't appeal to me. Waiter didn't offer any other options as the restaurant was short staffed on a sunday night.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":3.0,"Value":3.0,"Service":3.0},"author":"Leonor Schaefer","date":"2015-09-09 11:08:16 +0300"},{"content":"First I admit, I'm a huge Kimpton fan. They just have such a fresh approach, and they have a handle on how to make guests feel special. The Kimpton rewards program (called InTouch) is worth joining. They have a great wine hour along with a non-alcoholic selection for those so inclined as well as for the kiddies. The loaner program of a pet goldfish also was a huge hit. The room decor is trendy and unique. This is the third city where we've stayed at a Kimpton, and our family will seek them out wherever we stay.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Conner Dicki","date":"2014-08-17 10:31:05 +0300"},{"content":"My wife and I stayed here in March 2011. We enjoyed the hotel. The staff was very friendly and helpful with directions and suggestions. We like the free wine tasting. The room was comfortable but a bit small. The staff did an excellent job of accommodating our request for a view. We had a view South down 4th Street. I do not think any rooms have views except of the high rises around the hotel. We ate at Sazerac Restaurant in the Hotel. They had a four course meal for a very reasonable price. We were full by the third course and had the last desert course sent up to our room. The hotel staff and Restaurant staff were very nice about it. My only real criticism was the small fridge was chock full of mini-bar treats and parking costs forty plus dollars per day. We had no room for the delicacies we bought at nearby Pike Market. So I pulled out all the little bottles of Jim Beam and put my stuff in the fridge only to reverse the process at check out. I suspect everyone that stays at the hotel does the same thing.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Aracely Grimes","date":"2015-12-22 10:42:23 +0300"},{"content":"We made the reservation one day before our planned stay at the Monaco, Seattle, and they told us that the only room available is a room with a king bed. I asked if they can upgrade it to two queen beds and they told us they will do their best to accommodate our request. And to our suprise, at our registration, they automatically, upgraded our room to our need and they we very welcoming and inviting. Thank you all staff.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Margaretta Halvorson","date":"2015-06-17 14:26:27 +0300"},{"content":"My husband had to go to Seattle on Business so I tagged along. Hotel Monaco had a special rate and we love kimpton hotels - so we booked. We were very happy! Cozy room with living room and bedroom, lovely bathroom with great products - our little fishy kevin passed away during our stay (not due to anything we did!) but we managed to enjoy ourselves despite this traumatic experience (totally kidding) This is in the center of everything, staff so helpful - and always love the kimpton's wine happy hour. You will not be disappointed with the stay if you chose Hotel Monaco!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaitlyn Hansen","date":"2013-02-19 20:27:27 +0300"}],"public_likes":["Vaughn Denesik"],"vacancy":false,"description":"Guests enjoy ocean, marina or city skyline views from private balconies featured in every room.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}