{"title":"Birmingham (England)","name":"Crowne Plaza Birmingham City Centre","address":"Holliday St","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.crowneplazabirmingham.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47781,"lon":-1.90673,"accuracy":"ROOFTOP"},"type":"hotel","id":3640,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"The Palmer House Hilton Hotel in Downtown Chicago on the loop is a grandeloquent monument to class and Style. The staff was very courteous, and the accomodations were luxurious. The beds were soft and plush, and the bathrooms were new and clean. The bar was very cool and chic, and the food was very good. I will ALWAYS stay at the Palmer House when I have business in Chicago.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Camila Mann","date":"2013-01-06 14:44:18 +0300"},{"content":"If you like some old world charm, this is the place for you. The hotels ceiling is worth a visit in and of itself. There are some rooms with 2 double beds and two bathrooms. Every room I have stayed in was very spacious. It is usually a busy place, but the rooms are quiet. It is located near the park and museums but a short walk from Michigan ave. If shopping is your goal there are many other hotels closer. The biggest negative of this hotel is the location. There are many poor people who hang out near the hotel and it makes it feel unsafe at night. All of the staff are wonderful though and it is a lovely hotel.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Jordy Wilderman","date":"2013-02-16 16:28:10 +0300"},{"content":"From the doorman's loud basso welcome as he flings open the taxi door, to the soaring lobby with the fantastical illuminated ceiling, to the public areas' happy, egalitarian mix of families in shorts alongside locals in finery enjoying a night out... the Palmer House exemplifies a particular broad-shouldered, inclusionary Midwest grandeur I can't imagine finding anywhere else. The location is near-perfect, on the eastern edge of the Loop across from the Art Institute, two long blocks from Lake Michigan. The architecture is big, bold and old, but with ten times the character of some soulless glass tower. The service ethic is top-notch. And rates via Hilton.com are usually surprisingly good. During our stay amid the July 2011 heat wave, a cooler full of complimentary ice cream novelties greeted sun-baked arrivals to the check-in desks -- one of countless thoughtful touches. On Saturday afternoon at Lockwood, the long bar in the lobby, pooped tourists in $@!#%-flops poured down beer and lemonade passed across the cool marble by impeccable bartenders. In New York or Paris there might be some quacking about a dress code. Here, somehow, among the overstuffed leather furniture and the painted, brass and woven peacocks that comprise the Palmer's motif, it all works: relaxed, tolerant, and endlessly friendly. Our room was big and beautifully appointed with numerous updates, including new luxe bathroom fixtures and strong water pressure (often a concern in older properties) and unstoppable AC. About 40 percent of rooms have no view, though -- they face an interior air shaft. Ask if you want one. And for Hilton HHonors elites, there's a big, comfortable lounge on the 23rd floor serving snacks and drinks all day. The Palmer House is the perfect base for Chicago touring, family reunions, business, you name it. Everyone is welcome, and everyone fits in. it's only a little more than the nondescript Hampton Inn in the next block, and it makes any visit to this great town more memorable.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Chance Schroeder","date":"2015-01-06 23:52:15 +0300"},{"content":"Chose this hotel based on reviews.. I was taking my daughter to school(freshman year) and decided this would be the right place based on it's location. the room was small but clean the bed was comfy too.. Hilton does need to stop charging for every little thing such as the high priced internet(20 bucks) and the extremely high self parking I paid more for parking than the full sized rental I had (38 bucks a day) and on top of that the Starbucks in the hotel that normally offers free wi-fi didnt have it either.. the food was costly but thats ok We went to the cafe bakery on the corner and ate breakfast... (get the blueberry muffins but go early)And there are plenty of great restaurants to eat in, other than the hotel.... Otherwise the hotel is close to everything... good shopping on State and of couse Michigan Ave... lively people watching on Wabash... Close to public transportation because if I did not have to have a car to move my daughters stuff... I would definitely take public transportation.... the traffic in Chicago is RIDICULOUS!!! worst than D.C and NYC!! I love Chicago!!! Would I stay again? possibly (By the way the customer service was really accomodating) but I want to try a different hotel every time I come back to Chi town...","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Melissa Rutherford","date":"2015-02-25 14:58:57 +0300"}],"public_likes":["Caitlyn Hettinger","Jovany Legros","Lucienne Dietrich","Ava Purdy","Sadye Considine Jr.","Andre Thompson V"],"vacancy":true,"description":"As nondescript as a Crowne Plaza gets, this hotel was originally built to serve the ICC next door. Despite having been updated since, it still has a somewhat sombre presence.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}