{"title":"Yosemite National Park","name":"Tamarack Flat","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":37.75218,"lon":-119.736683,"accuracy":"APPROXIMATE"},"type":"hotel","id":33899,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"good to great I read the reviews for this resort over several months and was unsure of what I would find. Our conclusion is that this resort is good to great, but I can see why some people don't like it. My wife and I and another couple visited from February 9 to February 13. We stayed in the Royal Service area. I think that if all of the regular rooms were refurbished then you may not need it but we liked it and would use the Royal Service again. We liked the food but its not 5 star; it varies from 3 to 4 star and if you are picky then you might not like the lunch buffet. Dinner was very good in the 4 restaurants we went to and they always had the wine we requested. None of us ever got sick.We tipped as others have mentioned and I assume it helped. Most of the staff is very helpful and friendly.Its true that the bed mattress was a bit stiff. It seemed cheap; the pillows also. But we still slept well and it didn't bother us. The air conditioner worked okay but not great. This was a problem only in that the maid used too much water to mop the floor every morning and our room ended up humid over a period of 4 days. Next time I will pay more attention if this seems to be a problem. The shower head didn't work as good as it should have.We noticed a slight sewer smell in one area of the resort. We know a little Spanish and it helps for sure, especially if you want to do several activites and need to sign up for stuff and ask detailed questions about activities.I can see an American couple that speaks no Spanish and comes expecting 5 star room and food not liking this place at all. As for us, we liked it alot and plan on returning. I agree with everything that is said in the Feb 1 review.Finally, we did not like taking a big tour company bus from the airport to the resort. It took too long both ways. Next time we hope to take a taxi. Even though we left the Paradisus 2 1/2 hours before plane departure, we got there after about one hour to find the airport jammed with people and long lines everywhere. It was confusing. You want to get to the airport on the return at least 2 hours before departure.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Jerrell Cormier","date":"2013-10-19 06:20:45 +0300"},{"content":"WONDERFUL We have been to the Paradisus 2 times in the past 3 years. We are planning a trip there in February and are looking forward to it.The reason I am writing is because I feel guilty that I didn't write after the first 2 times we went to the resort because we had a wonderful time.I feel that those of us who had no complaints don't take the time to write a review because there was nothing bad to say.During our last trip we stayed in the royal service part of the time and the regular part of the resort the first half.The royal service is much nicer because the rooms are much nicer and it is much closer to the beach. The food was wonderful especially at El Romantico. During our first 2 trips we had nothing to complain about except the weather during our second trip which no one had control over. The wind was tremendous which made the beach a little unconfortable. Every other aspect of our trip was great. I am not sure what others expect from this resort by reading their reviews but we are truly looking forward to our trip next month and have booked the royal service for the entire week. I highly recommend the Paradisus in Punta Cana and have done so to many people.I feel the reason you see more negative reviews on this sight than positive reviews is because most people are like myself and had nothing bad to say and had a wonderful experience but just didn't take the time to let others know.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Thaddeus Harvey","date":"2015-09-11 02:35:45 +0300"},{"content":"Paradisus Great Trip..honest review We had planned a trip to Rivia Maya, but, because of the hurricane we changed to Paradisus. My wife and I travel extensively and vacation twice a year in the carribean. We have never been a lover of all inclusive resorts, but, we heard so many wonderful things about Punta Cana and The Paradisus so we took a chance. Our taste in resorts is more for Ritz Carlton or Four Seasons, so we went to Paradisus with some reservation.The Good:The resort it self was magnificent and very clean. The landscaping was extremely well taken care of, it was very lush and tropical. The facilities were very good and pretty much offered anything that you could imagine.The staff were some of the friendliest that I have ever encountered. Everyone was always smiling, and they could not do enough for you. Others have said they move very slow, but, in any island, it is not a faced pace environment. The retaurant choices were very good, offering pretty much everything that you could possibly want.The pool was big and clean, and had very well manicured lndscaping.The beach was gorgeous. White fine sand, and a clean ocean.The Not So Good:Much of the staff barely spoke english. As the Amercian tourist trade has not fully developed (more Europeans and South Americans), the english of the staff was marginal at best. Many did not even know basic english. I had to play charades alot with them. The property is enoumous, and in order to get from the main lobby down to the rooms you would need to take a little shuttle bus. The shuttles were few and far between and sometimes we had to wait 1/2 hour (most of the time we gave up and walked. The walk was substantial and after drinking or eating at one of the restaurants in the main lobby...you dont want to walk.As for the food...it was OK. You never really get fine dining in an all inclusive, so we were prepared. The Italian was good and the Japanese was good. The steak places sucked, and the El Romantico was fair. The buffets creeped me out, as most of the time you were never really sure what anything was. I guess it was catered more towards Europeans, as there were alot of weird looking stuff. The buffet for lunch had mostly what I would consider diner foods. No hamburgers or hotdogs or sandwich's to speak of.But, there was plenty of food, and it was OK..it served its purpose.We went to golf, and played at Cocotal one day. The course was nice, not great. It was very well manicured and in very good condition. Not very challenging, but, anytime you can play golf in the islands it is surely a treat. DO NOT GET ANY FOOD THERE. There were 4 of us, and 2 hadhamburgers and 2 had ham and cheese sandwich's, and all four of us puked the whole round.We golfed at Punta Cana Club one time, and this course was absolutley magnificent. I have played at some of the nicest golf course, and this wwould rival any course. 5 Ocean holes that were spectacular, and the 2 finishing holes rivaled that of Pebble Beach. The villas along the course were unbeleibale. Julio Iglsias lives there as does Oscar De La Renta. The course was about 6500, but, lots of sand, lots of water wholes and large ungulating greens. YOU HAVE TO PLAY THIS COURSE. Cost is $140 which is greens fees and carts. Beware, they have caddies there that try to hook up with you. We took one, and it was a big mistake. Caddies are not neccessary and they dont keep there mouth's shut.Casino was cute. I am a gambler and didnt think that I would have too much fun in what seemed lik a make believe casino. The tables were $5 minimum and $100 max. I can honestly say we had a blast. Met alot of people, drank alot, and at the end of the night you lost or won $100. It was there just to have a little fun, and not to win or lose alot of $$.Royal Service:We took the royal service. It gives you a room closer to the beach, although none of the rooms were beachfront or had good ocean views. It gives you your own part of the beach which includes waiter service (tip the guy when you get there and he will pay very close attention to you, and come around alot. All day long he was bringing us packs of cigarettes and cold drinks). It also gives you access to a special lounge in which you can get internet, and they serve a nice breakfast, high tea, and hors doeurves throught the day. I would say if I waent back I would do the Royal Serviceagain, but, if you dont, it wouldnt be a big mistake.Tipping:Honestly they don't look for it..you dont feel like there hands are out after everything they do for you. But, they work very hard for you and a couple of bucks here and there should be no big deal. The really really appreciate it when you give it to them. We found out they work for about $250 a month and work up to 70 hours a week. If you tip, you will get some special treatment for sure. Children:This is not really a resort for children.I would have to say that I would go back. But, Paradisus is opening a new hotel Dec 20, called Palma Real. We passed it and saw pictures, it looks more like a 5 star facility..maybe I would try that, but, would definetly go back to Paradisus.P.S. Be cognizant of what you eat. DO NOT DRINK TAP WATER.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Ally Ledner I","date":"2015-09-02 11:45:35 +0300"},{"content":"I was hoping to be Pleasantly Surprised .. but I wasn't After reading several reviews before my trip I expected Paradisus to be a bit less than paradise.. I must say that it wasn't as bad some made it out to be. Yes the buffet food is pretty foul and in my opinion they leave meats and cheeses out too much time in the heat (cheese taste pretty funky.. I'd stay clear of it .. and I'm a cheese-lover) but other than that the food in retaraunts was pretty good. However it's not that comfortable eating dinner in long pants in the excessive heat and humidity.. a few are air conditioned (Mexican and Japanese).. Service I thought pretty good apart from the one guy I caught scarfing down the chicken he was supposed to be serving (gross)... The beach and ocean were fantastic which was really the whole reason why I went.. I don't think I would return to this resort however.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":-1.0},"author":"Mr. Mariela Lubowitz","date":"2015-09-27 21:08:37 +0300"},{"content":"Great Value... ...But ultimately, a value. This resort was absolutely stunning with lush gardens, beautifally appointed Suites, long white sandy clean beaches, and a sparkling, big pool.The resort itself is massive, and there is a mass transportation service which is pretty much a golf cart train. Since it is relatively new, the staff have been able to keep up with the maintenance, and it shows. The native wild animals are cats, no rodents. The sky is large and gorgeous.The value part comes in with food and staff. If eating is not so important to you, then this resort woould be perfect. We stayed 6 nights, and we ate well only once, and that was at the chinese resteraunt. The staff doesn't really speak English, so bring your pocket translator. Drinks consist of Pina Coladas and Paradiso's, a kind of slurpee with alcohol. Don't expect 5 star food, it's more like what you'd expect at an Applebees, maybe even less.This is a family resort, so if you don't want to deal with kids, this is not the place for you, although I have to say that I met some fantastic kids who played volleyball with us and were very well behaved. Maybe because they were French- Canadian.Also, make sure to call many times in advance since they double book rooms, and when you get off the airport bus, rush to the counter to check in or you'll be waiting for an hour.I would go back there again, just for the beaches and the rooms. Food is important, but ----, those beaches are beautiful. Just don't go off the resort, because there is so much poverty it's depressing to see on your vacation. Same goes for any of the off- resort activities.Enjoy.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":-1.0},"author":"Cory Hahn","date":"2012-04-19 11:26:06 +0300"}],"public_likes":["Kiara Jakubowski","Reyna Wehner"],"vacancy":true,"description":"Open from June through September, this campground is located off of the Tioga Pass Road near Crane Flat and offers 52 tent sites on a first-come, first-served basis. Creek water only, must be treated before drinking.  Vault toilets are available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}