{"title":"London/Westminster","name":"Corinthia Hotel London","address":"10 Whitehall Place, SW1A 2BD","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.corinthiahotellondon.moonfruit.com","checkin":"15.00","checkout":"noon","price":null,"geo":{"lat":51.5062,"lon":-0.124233,"accuracy":"ROOFTOP"},"type":"hotel","id":16524,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"The best way to describe this hotel: romantic restrained elegance. The rooms are incredible (the standard king comes with a fireplace). the service is great. The spa is great. Even the fitness center is excellent. The hotel is beautifully designed down to the smallest details (like the in room menus, envelopes and key card). And none of the staff accepts tips. even housekeeping. The Elysian has 4 house cars (two 5-series and two 7-series BMWs) that will take you anywhere within a 2 mile radius. The hotel resturant Balsan is very very good. I've eaten breakfast, lunch and dinner there. The Elysian is my new favorite hotel in all of North America. I highly recommend staying here for a weekend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"George McClure","date":"2014-06-28 23:20:32 +0300"},{"content":"This hotel is top notche. All the reviews hit it on the nose. Superior service, there were so many staff around to help and be of service, they were almost imposing. Not there to intimidate you, but they were just everywhere to help. It seemed to be an insult to offer a tip. They did not accept tips. The rooms were some of the best I stayed. The \"sweet\" suite layout was very comfortable for privacy and guests. Guests came to visit, in the living room with the fireplace, and my travel partner was resting in the bedroom. The weather didn't really warrant the fireplace, but with the sliding balcony door, it gave us the breeze of CHI with the warmth of the fireplace. Having a separate half bath was also convenient, and thoughtful. One of the coolest things was the TV, within the mirror in the bathroom. You see the remote and know it goes to something, so i clicked all around the bathroom and WHOA! there it was behind the dual sink mirror. Walked to hugo Frog for dinner, walked Oak Street, Michigan Ave high-end window shopping. Just a great stay! This hotel is a MUST. And we didn't even get a chance to visit the whirlpool/suana/steam rooms.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Sanford Stark","date":"2014-06-12 20:33:01 +0300"},{"content":"My husband and I stayed at the Elysian for our anniversary and I only wish we could have stayed longer. The hotel is beautiful, the decor is interesting yet understated. The service was outstanding. Every person there wants to help you in any way they can. We felt very pampered from the moment we walked through the doors. Our room was large and opulently furnished. There were 3 TVs in the room, including one in the mirror in the bathroom. The towels, robes and slippers were of the highest quality, as were the toiletries, sheets and other amenities. I can't wait to go back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vito Jast","date":"2014-06-15 06:29:02 +0300"},{"content":"I stayed for a week in June another night in July and will be staying again in August for one week. I had a suite and it was outstanding. Furnishings are contemporary, room sizes unusually spacious. I had a fireplace, a balcony and a dressing area. Also a lovely bar area with a bar sink as well as a microwave and two burners for reheating or preparing snacks in your room. The bathrooms have separate walk-in showers and large bathtubs. Everything is clean and beautifully appointed. Exceptionally nice linens and towels as well. Service is always with a smile, but many times the front desk seems untrained. However they always are pleasant and willing to help. Also the room service menu is rather slim. Not usually important as there are so many wonderful restaurants in Chicago, but it matters if you must eat in for any reason. Also the pay per view movie selection is terrible. They must have had some complaints about that as they do have DVDs and players available through the concierge. Another area that is less than perfect is the lighting system. I never got the hang of it, nor did my travelling companion. Lights would go on and off at odd times and were hard to adjust to our preferences. But even with these small \"complaints\" I would rate this as a wonderful hotel. A little polish here and there would make this surpass the finest in the country.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hester Heaney","date":"2013-03-15 10:34:55 +0300"},{"content":"Our family has stayed at some fantastic hotels around the world, e.g., The Milestone Hotel in London, England, The New York Palace Hotel, NY & Hotel Okura, Tokyo, Japan - and I have to say the Elysian Hotel in Chicago, IL, is in a class by itself. From the moment you drive into the surprising and beautiful courtyard (you cannot believe you are in the middle of a major urban centre in America) and are greeted warmly by professional, (unpretentious), welcoming staff - you know you are in for a wonderful hotel experience. The Elysian opened in December '09, so everything is new; but, the property has an 'old world', classic feel with beautiful, contemporary detailing. The fabulous amenities (e.g., restaurants, spa & fitness centre), location (!) and the staff are all tremendous and you will feel at home here. We encourage you to visit their website to see for yourself. Elegant, comfortable and impeccable. It is a MUST-stay!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Mia Bahringer","date":"2015-11-24 10:25:20 +0300"},{"content":"I really enjoyed staying at the Crow's next and would definitely go back! It's a little more difficult to find a place for only 2 nights in Vieques, but they were very accommodating and we had a great room for a great price that didn't break the bank. Some have given negative reviews, but those cheapos need to realize that if they want Ritz-Carlton rooms they'll need to pay for them. There were a few mosquitoes we had to squash, but you're in a tropical climate, so for the price I thought it was well worth it, and I liked the adventurous feel it provided. It's nicely secluded about half-way in between Isabel Segunda & Esperanza. Ample parking, beautiful grounds, great pool area where they serve the continental breakfast, and a spectacular view!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Cora McDermott","date":"2013-12-04 00:18:36 +0300"},{"content":"I had heard that the lower level rooms are not good - I'd like to confirm. Avoid staying in room 105. It's a hot, muggy room with an ineffective AC, a ceiling fan that rattles and barely any privacy. Not relaxing, restful or romantic at all. It's located on a footpath that gets lots of foot traffic, starting in the early morning with chatty guests and staff. You can hear every word while in room 105. Ventillation at windows must be shut in order to have visual privacy. Accomodation and decor of room 105 is Soviet Style (uninspired). The room has a little kitchen area with some pots and utensils. Bathroom is a dank sweatpit - insects love it. We had to have two Raid fumigation treatments in the hotel room during our brief stay and needed to spray bug repellent prior to bedtime to avoid bites. However, staff is friendly and helpful. The ability to use the beach towels, beach chairs and coolers was very convenient for visiting the beaches of Vieques. Location is good for driving to all that Vieques has to offer. A rental car facility is located next door, which was nice and easy. Crow's Nest was a $10 cab ride to and from the airport.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":1.0},"author":"Blair Morissette","date":"2015-08-12 00:48:17 +0300"}],"public_likes":["Ulices Rippin","Kristopher Smitham","Jermey Crist","Raheem Steuber","Kurtis Hegmann","Leola Reilly"],"vacancy":false,"description":"Comfortable hotel with rooms, suites and penthouses.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}