{"title":"Pwllheli","name":"The Studio","address":"7 Innes Estate, Pwllheli.LL53 5RP","directions":"Next door to the Golf Club, Pwllheli.","phone":"+44(0)7729625570","tollfree":null,"email":"marilynselwyn@gmail.co.uk","fax":null,"url":"http://www.pwllheliholidays.co.uk","checkin":null,"checkout":null,"price":"£45 per night for two people","geo":{"lat":52.8789,"lon":-4.4314,"accuracy":"ROOFTOP"},"type":"hotel","id":23388,"country":"United Kingdom","city":"Pwllheli","state":null,"reviews":[{"content":"The Casablanca is my favorite hotel in NYC It's small, comfortable and clean with a very friendly, helpful, and often very amusing staff. We look forward to staying there every year.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Summer Schaefer","date":"2015-09-04 09:37:09 +0300"},{"content":"Wonderful Hotel- Highly recommend! My wife and I just celebrated our wedding anniversary in NYC and stayed at the Casablanca. The hotel is at Times Square and within a short walk of Rockefeller Center; all the Broadway shows; the NYC Public Library; you name it. I don't think we could have picked a better location. The hotel staff were very friendly and helpful- recommending broadway shows and restaurants. Our room (and the hotel overall) was very clean and tastefully decorated. Rick's Cafe on the second floor serves as a place to relax and escape from the bustle of Times Square with coffee, tea, juices and pastries available most any time. We missed the nightly serving of wine and cheese, but I am confident it is nicely done as was the rest of the hotel's offerings.We will definitely stay at the Casablanca again and will recommend to our friends.","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Jennings Mueller","date":"2015-10-02 22:37:53 +0300"},{"content":"We loved the Casablanca We simply loved the Casablanca. The room was small but we expected that in NYC. It was very quiet, very clean and very central to everything. Times Square was just steps away and Bryant Park was not quite 2 blocks away. We loved Bryant Park! What an oasis in the middle of the chaotic Times Square area.The staff at the Casablanca could not help you enough. We were always greeted both coming and going. The compliementary breakfast and wine and cheese were excellent. We loved to come back to the hotel in the late afternoon and unwind in Rick's Cafe before heading out again for the evening.If we go back to NYC we will definitely stay at the Casablanca!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Cleora Weimann","date":"2013-11-02 22:49:55 +0300"},{"content":"Liked it! This is our sort of hotel, small friendly nicely presented and spotlessly clean. Great reception from all the staff who we found very friendly. Rooms are a little small (not untypical in New York) and ours faced the rear of hotel which suffered noise badly from huge neighbouring air con plant (not hotels). In fairness another room was offered but as we were only there two nights and the first night had passed we put up with it. Thats our only criticism, inclusive nice buffet, cheese  wine, snacks and internet. Great location for busy bustling New Yorkt heatre  shopping areas.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":5.0,"Location":5.0},"author":"Kristofer Strosin","date":"2014-03-28 07:55:13 +0300"},{"content":"Beware of website if you smoke Everything good you read about this hotel is true. I counted it was 53 paces from Time Square and you cannot hear a thing unless you are on the smoking patio and you can hear the police sirens now and again. My wife who is a stickler for cleanliness said it was immaculate. One query however. I arrived home today and rechecked the website and they ask for a smoking preference for your room. We chose smoking but when we arrived, we were told that the hotel has no smoking rooms !!! I feel we were decieved and this is tantamount to deception. If I had known that all the rooms were non smoking, I would not have chosen this hotel. Why ask for a smoking preference when there are no 'smoking rooms' ?","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":2.0,"Rooms":3.0,"Location":3.0},"author":"Zachery Grady","date":"2012-06-19 19:23:24 +0300"},{"content":"Loved the Casablanca and the staff Just stayed 7 days at this hidden jewel of a hotel. I knew from the time that I made our reservations over the phone with Jason that this was going to be one awsome hotel. From the time that you enter the beautiful lobby till the day that you depart you are treated beyond excellence. The staff becomes your friends from the moment that they say welcome. Jason, Peter, Luke, Lenny, Yuri, Laura, Daniella and the ones that I can't remember their names go up and above what they are suppose. You are not just another guest.Location, Location, Location they have it. Right in the heart of Times Square. The rooms must be soundproof as once you are in your room you hear no noise from Times Square. Rooms are decorated to perfection and by New York standards they are a nice size. Good water pressure in the shower. Rooms are beyond clean. They sparkle daily !The breakfast every morning is awsome. Delicious pastries, fresh fruit bowls, bagels, juices. Laura and Daniella are such great women. You need for nothing when you are eating. They are always asking if you need anything else. The wine and cheese in the evenings make for some nice quite time. There is nothing one could say negative about this five star hotel. I see why it is rated #2 in the city.We will be back in December 2007 and you can bet the one and only place we will ever stay in New York City again is Casablanca.Joe and Carolyn T.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Viviane Bruen","date":"2013-07-17 05:17:36 +0300"},{"content":"Havens above! It really is a tranquil haven only yards from the manic Times Square. We have stayed in some impressive four star hotels in other US cities but are really glad we acted on the reviews to book into The Casablanca for our first trip to New York. The well decorated rooms are not huge and the views nothing special but , that said, for staff, location, cleanliness, Rick's Lounge and overall ambience this hotel is tops.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Marjolaine Bayer","date":"2015-06-11 02:38:37 +0300"}],"public_likes":["Unique Kihn","Dr. River Grant","Keshawn Klein MD","Enid D'Amore","Marilie Hills"],"vacancy":true,"description":"The Studio a self catering holiday let for 2 persons and is just a stride over the Sand Dunes of Pwllheli Beach.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}