{"title":"San Diego/Downtown","name":"Comfort Inn Gaslamp Convention Center","address":"660 G Street","directions":null,"phone":"+1 619 238-4100","tollfree":null,"email":null,"fax":"+1 619 238-5310","url":"http://www.comfortinn.com/hotel-san_diego-california-CA769","checkin":"3PM","checkout":"Noon","price":"$119-$189","geo":{"lat":32.71278,"lon":-117.15858,"accuracy":"ROOFTOP"},"type":"hotel","id":25159,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"This was a great find. Very good rates. Great location. Hotel is actually an abandoned historic building. Rooms are huge with lots of tall windows. The staff was very good and friendly. The breakfast was excellent. Valet parking was pricey, >$25 per day. There is a public garage less than a block from the hotel so I would recommend using that instead. The hotel is located less than 3 blocks from Bourbon st and the French Quarter. Easily walkable. The Green line Street car passes right in front of the hotel. You can take this street car and connect to the canal street line or simply take it all the way up St. Charles st. Hotel had great wifi, water pressure, clean rooms with nice furniture, awesome bed and even a shopping center connected to the back entrance. I would definitely recommended it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Colt Lubowitz","date":"2013-09-21 08:32:36 +0300"},{"content":"My wife and I stayed for five nights. Our room was very large and quiet. We never heard another guest.. The location is just a couple blocks from the FQ and right on the streetcar line to the Garden District. The breakfast bar has a nice variety of items and is located in a very comfortable setting. All in all, I would not hesitate to stay at this Hampton Inn again. It is a great value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Lenore Koss","date":"2013-12-15 01:15:53 +0300"},{"content":"First let me say that I really enjoy staying at the Hampton Inn because the rooms are usually spacious, the service is great and the free breakfast is a plus. However, upon my arrival, I received horrible customer service as if I were inconveniencing the front desk employee. Initially, it was unclear where the elevators were so I ended up heading to the elevators in the office building and told by someone that I was going the wrong way. You have to use your room key to access all floors, except the lobby, which can be a little annoying. The lobby area and the elevators are a little seedy. Definitely not up to the standards of other Hampton Inn hotels The room is also very small compared to other Hampton Inn hotels. I stayed in a room with a king sized bed and the bathroom is one of the smallest I have seen. It contained a stand up shower (and no bathtub) There was no spacious closet like I'm used to. The TV, closet space, and bureau were all part of one big armoire in the room. I called to schedule a wake up call at 6:30am, which I never received. Then I asked the front desk to call a cab for me. I allowed myself plenty of time. However, even when I got downstairs, I still had to wait for an additional 20 minutes, almost arriving late to my morning meeting. For the first time ever, I decided to use the 100% Customer Satsifaction guarantee. I called several times and left my complaint with an employee who said she would pass it onto the asst. manager. However I never received a return phone call so I called the hotel and reached her and she said they would credit my account. She also hoped that I would come and stay at that hotel again. She is a new asst. manager and says that she is looking forward to improving the customer service at that location, which is definitely something to keep in mind.","ratings":{"Service":1.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":1.0,"Overall":2.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Jay Cummings","date":"2014-12-31 06:07:02 +0300"},{"content":"Very friendly staff. Great location close to the French Quarter. Clean rooms and tasty breakfast.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Verlie Schinner","date":"2015-09-20 16:48:26 +0300"},{"content":"Great location and reasonable price. The only problem was that the air conditioner in the rooms was not able to keep the room cool. I stayed two nights and after the first night I asked for a different room. The staff was helpful and politely granted my request. The second night was better, but during the day the room was kind of muggy. Full disclosure, I was visiting during the first week of August. Maybe the air conditioner will be able to manage the heat in less brutal weather. I plan to stay at the same hotel this coming March.","ratings":{"Overall":4.0},"author":"Leila Upton","date":"2012-12-29 01:16:14 +0300"},{"content":"My husband and I stayed July 19 - July 24 and our only complaint is the shower water pressure is sadly lacking. Everything else was great! The staff is very friendly and accommodating (thanks again to Sarah for printing my last minute tour reservation for me). The room was clean, slightly outdated however, there were workers on the premises making repairs and updates (very polite, quiet workers). I found the people of New Orleans in general, to be very friendly and never lacking in manners. It was a great change of pace from life in Chicago.The Chateau Hotel is a perfect starting point to a magical vacation. I can't wait to go back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Dr. Alec Oberbrunner","date":"2013-09-23 12:09:43 +0300"},{"content":"I went to vist the French Quarter for the second time and brought a friend with me to see it for the first time. I stayed in this hotel previously because I enjoyed the location of it. It's out of the noise, the lights, and the smell of other more party-going areas. I was very excited to stay on the second floor this time (I didn't even notice the stairs last time) and when I opened the door I was pleasantly surprised to see two very adorable beds that had the four poster feel to them (with two posts instead at the head) and though there was no window because of where we were in the building it was still nice. Could have done with another light as we only had one table lamp in the corner but we just turned the bathroom light on. The breakfast the first morning was about 3 hours late, but It's just breakfast. The other days it was on time and great. The people at the desk were helpful and kind and the workers as well always said hello. If you're looking to stay close in the quarter to Jackson Square this is probably the best location for the best price. I called to many other hotels hoping that this would be the cheapest and not booked and it was! I was so excited. The tv was also not working most of the time, but we were on vacation so we didn't need it much at all. There are many nice places to eat and souvenir shops close by to visit. You can catch the streetcar and sit on the wharf next to the river as well with a 5-10 minute walk. Its great. And don't forget to swim in the pool before you leave. Will stop by again, hoping that the huge cockroach we found on the last night will stay gone. They are the misquitos of the south so I can't complain. Recommended stay for sure. Lovely.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Erick Franecki","date":"2012-12-04 09:33:40 +0300"},{"content":"Overal I was rather impressed with the accommodation at the Chateau. The hotel was in a great location but still enough distance from Bourban street to not be affected by the noise. The bed was extremely comfortable and the breakfast in the morning was one of the better we had across America. The only gripe I have is manager woman that works on the front desk was a little rude. When trying to explain something she just talked over the top of me everytime. All the other staff were great, so polite and helpful.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Mina Kuvalis","date":"2014-04-27 02:58:34 +0300"}],"public_likes":["Rachael Anderson Jr.","Demetrius Abernathy","Roosevelt Hermann","Gayle Lueilwitz","Verda Auer","Ms. Emmitt Stroman"],"vacancy":false,"description":"A 100% non-smoking hotel located in the Gaslamp Quarter.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}