{"title":"Death Valley National Park","name":"Thorndike","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":36.2366,"lon":-117.07189,"accuracy":"APPROXIMATE"},"type":"hotel","id":7395,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Just read the other reviews. Don't think the following: \"If i call or email the airport to confirm the airport shuttle (as promised on expedia) that it will ensure that I get a shuttle\" We did this and even though they told us just to call when we arrived (we gave them our flight time and everything)., when we did arrive they said we would have to wait 4 hours to get picked up and that there shuttle only ran in the morning and evening. They told us this even though we confirmed out flight time (in std. and 24-hour time). And, as it turns out, there are days the shuttle doesn't even run, so just because you arrive in the morning/evening doesn't guarentee you the service. if you do get stuck, it is VERY easy to take the metro - it just takes some time because there's no direct line and you have to go south and then back north on the train. The customer service people at the airport metro stop were extremely helpful. They even printed us a map! Also, the hotel is located steps from a metro which made it convenient to go downtown for the night, before flying out the next day. the only reason we chose this hotel was because we wanted our last day of our one-month trip to be hassle-free. screw that. (there was also a sale on expedia -- we didn't pay full rate which is very high).","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":3.0,"Location":4.0,"Rooms":5.0},"author":"Winifred Romaguera","date":"2013-07-29 21:44:20 +0300"},{"content":"This \"bed and breakfast\" is actually a 2 bedroom, 2 bathroom apartment with a kitchen. We rented one of the rooms and another couple who had a small child stayed in the 2nd room. My husband and I stayed here for three nights in August 2010 and paid 50 euro per night. LOCATION: Great location, a 10 minute walk from the train station, 5 minute walk to a metro stop, 20 minute walk to the Colosseum. The street it's located on is pretty quiet at night. There is also a cheap internet place down the street and a few cafes for a light breakfast. ROOM: The room was very spacious, there was a king size bed and a twin for just the two of us. The bed and pillows were very comfortable. The room was clean when we arrived but it wasn't cleaned daily as stated in the room description. We did get fresh towels daily, though. I didn't like having the bathroom separate from the bedroom, but it was only for our use, so it wasn't too bad. BREAKFAST: The breakfast was very meager, no cereal, yogurt, biscuits and cake as described. We did have bread and jam and powdered coffee and hot chocolate was available. MANAGER: The manager was pretty nice when we arrived, but she doesn't speak English. I tried to make it work with my limited Italian. The batteries on our air conditioning remote control stopped working and instead of finding new batteries, she told us we would just have to share the remote control with the people staying in the other room. The morning we were leaving, the manager came at 9 am and she couldn't get in to the apartment with her key for some reason. When I let her in, she was annoyed with me and I'm not sure but I think she said that I had locked the bottom lock of the door (which I hadn't done). It was very strange. She went to clean the room of the people in the other room who had checked out earlier and then my husband and I went to get some coffee down the street before leaving. When I told her this, I could tell she was annoyed, probably because she wanted us to check out so she could leave. But check-out was not until 10, so I didn't care. OVERALL: The Domus Diana is pretty nice and convenient, but the last morning left a bad taste in my mouth with the manager getting annoyed with me for no reason. I would consider coming back because of the cheap price, and great location.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Wilber Ferry","date":"2014-10-28 17:22:53 +0300"},{"content":"It was safe, super-clean, quiet, astonishingly close to the train station, and very reasonably priced. Alessandra, the manager, really took care of my mom and I while we were there, offering great advice and looking up what she couldn't answer. We stayed twice - at the beginning of our trip and on the way out. Our first room was smallish, but reasonably sized. At the end of our trip Alessandra was nice enough to put us (at our promised 50 euro price) into a room that normally goes for 150 euro. This place is simply fantastic. I could almost spit from the front door to the train station, it was so close. If I'm ever back in Rome, there's no searching for hotels for me.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Tiffany Franecki","date":"2013-05-03 18:14:20 +0300"},{"content":"Very poor quality hotel. I was staying in this hotel last weekend for my Disney Parks vacation. We stayed for 3 nights. Here is my opinion. ROOM: Room smelled like bleach. Had to change it to 2nd floor. Smelly air in the other room too. Room had a dirty feeling. Dirty carpets. Not working cable. MOLD in the Bathroom. Hair dryer not properly attached to the wall. Just laying on the sink counter. BREAKFAST: Free danish, cereal, toast, apple and orange juice. There is a pool and jacuzzi there but I did not use it. I was afraid of catching some disease. LOCATION: Good location 10 min from the parks. PARKING: Just enough spaces. OK. PRICE: Good price. WOULD I RECOMMEND IT FOR A FRIEND: Definitely NO. Conclusion: If you just want to sleep overnight and do not care about esthetics of your hotel, this is a good place to stay. Otherwise, find another hotel","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Mathias Adams Jr.","date":"2014-05-25 20:46:12 +0300"},{"content":"I booked this hotel through Southwest when I booked my airline tickets and rental car. First thing I did after booking was read the reviews on Trip Advisor. Of course you get some good & some bad so I was open minded to find out for myself...Big Mistake!!! I'm a very easy spirited person & not a picky bone in my body, besides we only needed a place to sleep. The place didn't look bad when we pulled up (My younger Sis & Mother), neither did the front counter. The only thing noticed was the super strong smell of Chlorine in the dirty pool (as per my mother) but we weren't planning on swimming so no big deal. The guy (Amid?) can't remember his name, was very courteous. He asked us to wait one moment while he went to check the room. He came back & handed us the key. I felt all was well. However, as soon as you opened the door (Room 108) you immediately smelled the mold. As you walked in the room, you could see it EVERYWHERE!!! No joke. We turned around & told Amid we couldn't stay in that room. My chest as well as my Sister's was hurting from breathing in that strong odor. He told us he had one more room upstairs (Room 224) so we took the key & gave it another try. No mold but it smelled of Alcohol and urine (as my mother put it) and the bathroom pure urine. The smell was Horrible. At this point we were DONE!!! We went back and told him we are leaving. He apologized and gave us a cancellation # but said we would have to call to get our refund. It was late (close to 11pm) so he offered us the room for free stating that we would not be able to find a room anywhere else for the night. We declined! Not even for FREE!!! That's how Terrible the rooms were. We drove a few minutes down the street & stayed at Orlando Vista Hotel. What a BIG difference with less than $25 more per night. My advice: Spend the extra $ to ensure your safety as well as your health. A good night's sleep is priceless...in our case, just a few dollars more. Please, of all the reviews you read, Do not go to this Hotel. You WILL be sorry. Take care & May God Bless!!!","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":4.0,"Service":5.0},"author":"Blake Daniel","date":"2012-06-30 23:00:17 +0300"},{"content":"We knew the risk we were taking when we booked a $40 room in an older hotel. It was supposed to be \"Superior King Bed Room\" with a refrigerator and microwave. There was no refrigerator or microwave when we arrived. The very nice front desk clerk told us we could put anything we wanted into the refrigerator in the office. Who would put food in refrigerator that they couldn't see? GROSS. The smell in the room was SO BAD that after an hour in the room, I became physically ill. The entire carpet was wet, which is probably where the smell was coming from. We were moved into a room with double beds, which was uncomfortable for my husband and I. The smell in that room was barely tolerable, but I fell asleep with a wet rag over my face because it was so late that we didn't think we would be able to find another hotel. The next morning, I asked for a refund for the price difference between the room we stayed in and the room I had PAID for ($10 for the refrigerator/microwave and $10 for the room). The best the manager would do was a 10% discount, which wasn't even close to the price difference in the rooms. We even had to jump through hoops for that small amount. IT'S NOT WORTH THE SMALL SAVINGS YOU WILL HAVE! Spend a few extra dollars and avoid this disgusting hotel!","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":2.0},"author":"Terrill Armstrong","date":"2014-05-04 02:07:10 +0300"},{"content":"Pros. Staff is friendly. It is in a great location near a lot of stores. its good price wise. Near other hotels if u don't like this one there is other ones next to it more known ones. Cons. Found dead cockroach. bed sheets were not even washed. Only a few tv channels","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Ray Howell","date":"2012-12-12 09:25:32 +0300"},{"content":"The new management has greatly improved the service and quality , and yet kept the lowest prices amongst the competition. I have made 3 visits since June 2010 and have experienced progressive improvement in quality and service, and more value for the buck. Location is great, swimming pool was clean and excellent staff - very helpful. There has been some positive change every time I visit. It gives an opportunity to save on hotel expenses for a comparable service from competition, the savings can be wisely spent on other essentials and entertainment during the travel. Wi-Fi is working fine no problems.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Fannie Olson","date":"2013-02-27 07:37:55 +0300"}],"public_likes":["Glenna Wunsch","Malachi Moen","Favian Dietrich"],"vacancy":false,"description":"(Closed in winter).  Thorndike is located at 7,400 feet in the Panamint Mountains and is accessible to high clearance vehicles only. Depending on road conditions, 4-wheel drive may be necessary. Thorndike has 6 sites, tables, fireplaces, and pit toilets. Thorndike is free. ATTN: Due to extreme fire danger, campfires are prohibited at Thorndike Campground until further notice!","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}