{"title":"Sonoma","name":"The Lodge at Sonoma Renaissance Resort & Spa","address":"1325 Broadway at Leveroni & Napa Roads","directions":null,"phone":"+1 707 935-6600","tollfree":"+1-888-710-8008","email":null,"fax":"+1 707-935-6829","url":"http://marriott.com/property/propertypage/SFOLS","checkin":"16:00","checkout":"12:00","price":"$495-$509","geo":{"lat":38.27666,"lon":-122.46136,"accuracy":"APPROXIMATE"},"type":"hotel","id":27825,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"Just right! I stayed here during a conference for 3 nights during Feb 2005, paying $145 a night. The hotel is stylish and quaint and tastefully decorated in Deco style. the lobby is nicely appointed with several reading areas and designer mags for guests. The rooms were elegantly simple. I appreciated that the TV was ceiling mounted to maximize floor space with pre-fixed max volume control levels to keep sound levels down between rooms. the walkin closet too is a nice feature!!! The bathrooms were spartan, decorated in white and very very clean!! The bed was great, and the four pillows, were outstanding!!!!!I did not have the chance to test the small pool, but it nonetheless looked clean and inviting. My only complaint was that another group of guests made an extraordinary amount of noise coming and going each morn and evening, it sounded as if they were moving crates of metal poles. Turns out they were a production crew for some resident supermodels that are regulars...i guess the noise was not that bad....I will come back here again....","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Cloyd Ernser","date":"2015-06-17 07:31:37 +0300"},{"content":"Great location if you love Lincoln Rd. food and shops   showReview(1704682, 'full');","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Queen Green","date":"2014-03-27 18:25:13 +0300"},{"content":"If I could give a negative star I would. This place was the worst hotel experience I have had in my life. The sheets were dirty, the carpet was in worse shape I didn't want to walk barefoot in the room for fear of getting fungus, but worst of all is the fact that I left some very important items in the room that were stolen. If you value your possessions don't stay here!!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Rey Koch","date":"2014-06-27 03:36:16 +0300"},{"content":"Simple, clean hotel with very big room with clean bed linen. The hotel is in a short driving distance from the airport and has very good price as it seems that airport hotel close to Miami are expensive. Internet in the room was not working (or very very slow) that was the negative point about this hotel. The breakfast is really good, with a lot of options, good service. I would recommend this hotel for the prices compared to other structures in the area, cleanness of the room and the complimentary breakfast.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Lonzo Walter","date":"2015-12-15 01:02:24 +0300"},{"content":"Stayed here twice in a week due to location. Never felt valued by staff whatsoever. Arrived to airport, rang hotel many times but took roughly 20mins to answer the phone...beware of answering machine. Tranfers were good if you are prepared to wait. On my first visit i left a hooded sweater and headphones in the room, rang straight away after leaving and was told they would be kept for me. On returning, the items were apparently never found. Reception staff were too interesting in texting on their phones than addressing my issue, two staff members grunted at me as we waited for airport transfers...not good enough. As expected, property was never returned. Breakfast was a nightmare...no seats and food was not re stocked after 9.15. When i asked for more bread and butter, i was greeted with a look of dismay from a staff member. Better off bringing breakfast back to your room. Room was fine as was cleanliness, just feel cheated out of my hard earned money. Would appreciate some sort of response to ronanperry@hotmail.com and would like to see some customer service in operation.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Location":4.0,"Rooms":3.0},"author":"Orrin Hills","date":"2014-12-20 03:54:02 +0300"},{"content":"I got an excellent rate for this hotel (around 90 dollars per night) so it was hard to resist even after reading all the reviews on this site, I still put my trust on the fact that is a Marriott and I am very glad I did. My experience in this hotel was good, and I didn't give it 5 points just because I do believe they should updgrade the floors and carpets in the rooms and add a little more \"wow\" factor to the decoration, having said this, the rest of my experience for the 5 nights I stayed was pretty good. These are my observations: 1. The lobby and front area of the hotel is inviting, nicely decorated and has a lot of nice functional spaces to hold meetings with colleagues or other guests. 2. There is a station that has access to coffee to go and water with lime on that area that I found super convenient. 3. Most of the staff (not everyone) were friendly and helpful 4. The courtyard with the swimming pool was actually really nice and enjoyable both, at day or at night. 5. The rooms were really spacious and the beds are very comfortable. 6. The furniture on the rooms is actually really nice (except for the dated sofa) but there is a large HD TV and it is well layed out. 7. Closet space and drawer space are enough and convenient. 8. For me, Internet connectivity is really important, and this hotel had one of the best I have seen in a hotel so far, it was fast and simple. 9. Even when I got a room on the first floor due to my rate, the rooms were reasonably quiet (this is an airport hotel) On the not so great side of things: 1. The carpets need to go or to be changed 2. The decoration in some areas needs to be re-vamped. 3. The excercise room wasnt all that great 4. The breakfast buffett wasn't all that great, so, I ended up just once and went to Denny's (1 minute drive from the hotel) for Breakfast the rest of my time. So, in the end a pleasant experience, and it definitely surprased my initial expectations and I would recommend, specially when it helped me save over half of my bill. Cheers!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Mr. Nikko Hudson","date":"2014-05-11 08:13:41 +0300"},{"content":"I just recently stayed here for an overnight stay. First off, I did not hear any noise even though the airport is nearby. The beds were pretty comfortable and are good for a good nights rest. The rooms are ok, not like the newer Courtyard hotels. It did have a big flat screen TV. But some parts of the room looked a bit dated. Some of the desk agents were not wearing name tags which is a Marriott standard. The hotel itself is ok and I would stay there again if in the area.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Kiley Steuber","date":"2015-03-27 14:50:13 +0300"},{"content":"Nice hotel. Recently renovated. Staff nice. Nice business area. Restaurant onsite. Rather hard to find from Miami Airport - lots of road construction making finding hotel difficult if driving.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Gus Champlin","date":"2015-02-23 01:08:14 +0300"},{"content":"We were at Lake Eve in July 2011 2adults 3 kids excellent suite, all comforts of home all staff very friendly nice bar, pool was great for kids. Lake eve is on bottom of I Drive so quiet but with I trolley stops at lake eve is handy to all attractions, there is a handy Publix department store just 2 stops south on I trolley so we were able to do 2 weeks in Orlando Florida on I drive without the hassle of car rental. So no worries about drink driving or getting lost we had a ball. Would definitely go back to Lake Eve.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Mr. Arianna Stark","date":"2012-08-17 06:27:58 +0300"}],"public_likes":["June Buckridge"],"vacancy":false,"description":"A contemporary resort and spa located just south of Sonoma Plaza. Beautiful and super modern, with a big pool spotted with cabanas, a great place to nurse a hangover after wine tasting, or to cater to your family when the kids just want to have fun. Pets are allowed with a charge, and internet is additional. They have two restaurants.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}