{"title":"Cloverdale (California)","name":"Vintage Towers Bed & Breakfast Inn","address":"302 North Main St.","directions":null,"phone":"+1 707 894-4535","tollfree":null,"email":null,"fax":null,"url":"http://www.vintagetowers.com","checkin":"3:30PM","checkout":"11AM","price":"$145-259 USD","geo":{"lat":38.808651,"lon":-123.017316,"accuracy":"ROOFTOP"},"type":"hotel","id":6169,"country":"United States","city":"Cloverdale","state":"California","reviews":[{"content":"My wife and I stayed at this hotel from May 18 to May 25. We got a nice discounted rate for a garden view room. We were pleasanly upgraded to a deluxe ocean view room at Building 6. The room was very nice and clean. Carpet looks new. The bed was comfortable. The view from the balcony (4th floor) was breath taking. We could see the ocean, the islands of Lanai and Molokai. The hotel grounds are well-kept, as well as the very big swimming pool. The black rock area of the beach is very good for snorkeling. The staff are courteous. There's a complimentary shuttle that will bring you to Lahaina town, where there are more shops and restaurants. During our stay, the guest laundry room is not available. I'm not sure why. It's good we have enough clothes for our stay. The food at the restaurants, as expected are pricey. So we always go to Whaler's Village, about 15 minutes walk, where the restaurants at the food court are cheaper. There's also a grocery where we could buy some supplies. You have to go to Westin for the spa as well. The rentals for beach activities like the cabana, snorkeling gear, umbrella is also a bit pricey, but hey, this is Maui. It's a bit of a long walk from our room to the beach, pool, and the lobby, but we don't mind. We have a very nice view. Besides, it's a vacation, so we actually like the stroll. Overall, we had a very pleasant stay at the Sheraton and would not hesitate to book there in the future.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Carlee Brakus","date":"2015-12-10 19:09:53 +0300"},{"content":"We stayed at the Sheraton Maui in January 2006 for four nights in a ground floor room that was spacious and about 50 yards from the Black Rock beach. We liked our room a lot. The only improvement I hope they have made was the little worn out carpeting. Other than that, we really enjoyed the room which had a living room separate from the bedroom. The facilities were beautiful and had fantastic views of the ocean and Lanai. There were multiple buildings on the property, and each seemed to have great views. We had breakfast at the hotel one time, and thought it was very good though a little pricey. From the hotel, it was an easy walk on a paved path to Whaler's Village for more dining options and shopping. The staff that we dealt with were great -- the valet guys and concierge who helped us booked some snorkeling excursions.","ratings":{"Overall":4.0},"author":"Obie Koepp","date":"2012-10-10 17:39:43 +0300"},{"content":"We stayed in October for 9 nights and had a great time. The grounds are gorgeous, the beach is incredible (both my 7 & 4 year old snorkeled there and saw turtles day after day), the pool is HUGE and they even have a toddler pool area. By the way, do go to Molokini to snorkel...We all enjoyed that day and the snorkeling was great (turtles, dolphins & a shark - very cool). We went to the Luau which was the best I've ever seen (pay the extra dollars for preferred seating), then saw it again from our Lanai a few days later while dining from room service. Couldn't have been nicer. We ate several times at the b-fast buffet and had dinner several times to watch the hula dancers and live music. The tiki torch lighter even took my boys to help him light the tikis. They LOVED it. What more could a mom want but so much attention for her boys! The staff was so friendly and helpful and seemed to really go the extra mile for us. The only thing that went less than perfect was the day we arrived, we found our room to be very dusty and the bathroom needed a little deep cleaning. They sent staff right up to clean it, the housekeeping supervisor called the next day to be sure everything was satisfactory, and then they had free breakfast coupons delivered for the inconvenience. How can you complain when a hotel works so hard to please the customer? That's service at it's finest! As far as I'm concerned, this hotel is highly recommended!!! We will definately return","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Queen Dickens","date":"2012-10-19 19:43:38 +0300"},{"content":"Just got back from 8 days at the Sheraton Maui. It was fabulous. The staff was wonderful and very friendly. The resort itself was beautiful. It was also so clean.. The view from our room (building 3, fifth floor oceanfront) was like a postcard. When we go back to Maui this is where we will stay. We also loved the location. Close to everything we wanted to do, including driving to Hana.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Rooms":5.0,"Service":5.0},"author":"Freeda Ferry","date":"2012-10-20 02:30:03 +0300"},{"content":"We stayed here for 7 nights in early Oct 07. We had a mountain view room in Building 3. The room had 2 queen beds in and was perfectly acceptable and comfortable. This was right in the centre of the hotel - near to the main lobby and wi-fi area, and a couple of minutes walk to the pools and restaurants. We had a wander over to the other buildings to watch the sunset one evening and it was a few minutes walk, but wasn't that bad. The views of the sunset over there were amazing - right over Black Rock. We ate in the restaurant one night for the buffet which was nice, it wasn't gourmet food but was lovely. Everything in Maui seems to shut down and go to sleep at about 11pm, so that's a warning if you like your nightlife! If you go to a restaurant much after 8.30pm you'll find you'll be eating on your own most of the time! The snack bar by the pool did great lunches like Nachos and Burgers but was typically overpriced. The pool and surrounding lawned areas are beautifully landscaped. The beach was lovely - we went snorkelling nearly every day and swam with an amazing family of turtles who got so close to us all the time! I would recommend this to anyone looking to chill out, but remember the daily resort fee and expense of eating out in Hawaii!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Lexie Ratke MD","date":"2012-09-16 02:25:23 +0300"},{"content":"We stayed at the Sheraton Maui Resort from Nov 10-16. This was our 5th trip to Hawaii in the last 7 years. We have stayed at many hotels in Hawaii, including the Ritz Carlton in Maui, and this was one of our favorites. This hotel is fabulous! The grounds are immaculate, the pool is beautiful and the beach is probably the best we've seen. I only have one complaint that I'll get to at the end. First of all, we had a deluxe oceanfront room in Building 6. Anyone who complains about the walk is just a complainer. The walk is not that bad and the views on your way to the beach/pool are beautiful. You do have to take 2 elevators, but they are very fast and it's not that hard to figure out. We had it figured out after the first time. It's absolutely worth the walk to get to Building 6. All the rooms are literally oceanfront with nothing to get in the way of your view. There is the island of Lanai to one side and the island of Molokai to the other side and you can see the lights of Oahu in the far distance. The waves are crashing on the rocks right outside your window. The rooms were pretty good, could definitely be upgraded a little. For the price you pay you expect a walk-in shower, not a shower curtain. It needed a little paint and carpet refresher, but nothing you couldn't live with. We had trouble logging into the high-speed internet in our room, so we called someone to come fix it. We never once complained about it and still we got two food vouchers for $15 a piece for our \"trouble\" to be used at any restaurant on the grounds. The pool was beautiful, very clean and refreshing. Lots of chairs and plenty of room. The resort was pretty dead this time of year, as was the entire island. This is definitely a \"down\" time for them. It was a prefect time of year to go. The beach is amazing. It is all sand bottom with great snorkeling by Black Rock. No big waves this time of year. The beach infront of the Sheraton is the best on Kaanapali. We spent a day exploring the beaches over in Kihei and Wailea (Four Seasons Resort) and the beach at the Sheraton is so much better. We loved that it was a short walk to Whaler's Village area - we ate at Hula Grill twice. We would walk down on the beach and then walk back on the path that is right at the top of the beach. You can walk on the path all the way from the Sheraton to the restaurants in about 5 to 10 minutes. The entire staff was very friendly. The grounds, pool and beach are some of the best we've ever seen. The one BIG complaint I would have is the price of the food at the resort restaurants. We ate dinner our first night at the Lagoon Bar - my husband had an Ahi Sandwich, I had a burger and we each had a Lava Flow drink ($10 each) for a total bill of over $60. We just couldn't believe it. The drinks were not that great and were in small plastic cups. You get twice the amount and better quality at any other restaurant in town for about $7.50. A small plastic cup of soda is $3.75 (no refills). The quality of the food we had was mediocre at best. We only ate at the pool bar once to use our free meal vouchers, otherwise we wouldn't have bothered. Whoever is in charge of running the restaurant portion of this resort doesn't have very good business sense. They would get so much more business if they would lower their prices even a little bit. We're all about relaxing and enjoying drinks, but even we couldn't pay $10 for a small plastic cup of a watered-down drink. We went to Safeway right down the road and stocked up on soda, water, wine, beer and snacks. We would take a small collapsable cooler with water and soda down to the beach every day and fill it with ice and it stayed cold all day. The location of this hotel is perfect. It is a short 5 minute drive to Lahina where there are a ton of amazing restaurants on Front Street. Overall we would recommend this resort to anyone, but would clarify that with making sure not to bother eating there.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Zakary Larson","date":"2014-03-26 20:27:43 +0300"},{"content":"I booked the Sheraton Maui by what I read on Trip Advisor. It had been over 20 years since I was in Maui last and I had no idea where to stay as there are so many choices and many different areas to stay in. I must say I picked an awesome hotel. We were more than pleased with our choice. The beach is big and beautiful. The black rock right out in front of the hotel is the best place to snorkel. My daughter swam with turtles most days. They are very friendly and come into the snorkel area a few times a day to look for food on the ocean floor. It was fantastic. The rock is also where they have a nightly cliff diving event. There is this guy who lights all the torches around the property. Then he proceeds to the black rock and lights the few torches there. When he is done and the sun has almost set, he dives off the cliff into the water below. It does not look that high, but it is a neat thing that happens each night at sunset. The hotel pool is endless. At first you think that it is just one large pool, but then you realize it wraps around the property sort of like a lazy river. It is peaceful and beautiful and my kids had the best time in the pool. Outside the property we found lots of food choices. Lahaina is close by. About a 5-10 minute drive. Lahaina is the cutest area with lots of restaurants and blocks and blocks of shops. We did not eat at the hotel. We had a car and found food in Lahaina or near the hotel. We paid a AAA rate of 305.00 per night plus an 18.00 resort fee. Our room had a great view of the pool and the ocean beyond that. We were pleased with our room (nice flat screen TV) and also were very happy with the hotel's valet. It was only 5.00 a night and the valet guys were very fun and helpful. Our favorite island has always been Oahu, but now we are in awe of the Sheraton, it's black rock, the turtles, Lahaina and the island of Maui. Without a doubt we would return.","ratings":{"Service":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Evan Murray","date":"2013-12-26 02:01:33 +0300"},{"content":"Our final 5 days of vacation were in Maui at the Sheraton. I was really looking forward to checking the property out after having stayed at the Westin 2 years prior. I have never in any of my past travels actually gone through the trouble to ask for a different room. I am typically just happy to be on vacation. =) We had 2 rooms at the Sheraton before we finally landed in Building 6. I really think the rooms need to be re-evaluated as to what their view/description should be. Our first Ocean View was on the second floor and there were multiple plumeria trees growing taller than our balcony. We could only see the beach after standing on one of the chairs on the balcony. I called to explain the issue and they checked into available rooms. They called me back and gave me my new room number in another building and on the top floor (high above the plumeria). We arrived at the new room to find that the view was actually worse. The palm trees were completely obstructing our view of anything (resort, pool, beach) and there was no balcony in this room. This time I went to the desk to talk to them in person and explain that if I was going to receive a garden view room, I would like to at least have my rate adjusted to the garden view rate. We ended up speaking with the evening manager and getting upgraded to building 6. I was a little upset that we were not offered the upgrade prior to spending an hour dragging our luggage around that maze because of our SPG gold status. There was no acknowledgment of our SPG status at check in. Speaking of the Maze... =) I don't know who designed that property but they should have to stay in building 6 just for punishment. It took at least 3 elevators to get anywhere. There were people wondering around holding these little maps they give you at check in. Everyone was lost. It takes a day or two just to figure out what floor or elevator you are supposed to be on to get where you want to go. If it weren't for the snafu on the first day, the resort probably would have been an average stay. The rooms are nice enough though there is only wi-fi in selected public spaces and the pool. The bathrooms were large and clean though they seemed to stop at the tub when they renovated. There is great snorkeling from the beach (great for those leery of snorkeling from a ship in the open ocean). Most of the staff were great. Food prices were typically out of control. We ate in Lahaina quite a bit. They were changing out the lounge chairs around the pool while we were there. The new ones are much nicer and have a cushion. We did have a difficult time finding two chairs together. Lots of people tossing towels on them and then going to the beach. We saw at least 20 chairs in the immediate area that had no one come back to claim the towels. We will be returning to Maui but will not stay at the Sheraton. We found the Westin to be much more accommodating and easier to get around.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":2.0},"author":"Loma Satterfield","date":"2013-06-26 23:59:07 +0300"}],"public_likes":["Catalina Deckow","Breanne Hegmann"],"vacancy":false,"description":"This elegant 1901 Victorian mansion is conveniently located in downtown Cloverdale on a quiet residential street, just blocks from restaurants, shops and the town plaza. Free tasting passes are available for 120+ wineries in the nearby area. All rooms have private baths, central heat and A/C, flat screen TVs, and free Wi-Fi access. A multi-course gourmet breakfast is served every morning, including fresh fruits and vegetables grown at the Inn. The Inn features fine period antiques, luxurious linens and upscale amenities. The beautifully landscaped grounds include a demonstration vineyard, Koi ponds and patio, flower and vegetable gardens and a mediterranean courtyard. Outdoors, guests can enjoy the splendor from a forty-foot veranda, a vintage gazebo or a flower-covered pavilion. Inside, they can relax in the inn’s parlor or library. Cloverdale Municipal Airport is 3.9 miles from the inn and the Sonoma County Airport is 25 minutes away.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}