{"title":"Yosemite National Park","name":"North Pines","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.740003,"lon":-119.564434,"accuracy":"APPROXIMATE"},"type":"hotel","id":33892,"country":"United States","city":"YOSEMITE NATIONAL PARK","state":"California","reviews":[{"content":"I was staying at Tai Hoe for 3 nights, unfortunately during their renovation time. They were renovating some floors above mine (I was on 2nd floor) on 9am-6pm. The great thing about this hotel is the convenient location. It's within walking distance to Mustafa Centre, lots of food hawkers around, City Square Mall, and to Farrer Park MRT station. They don't provide breakfast, but they provide instant coffee and teh tarik in every room. No toiletries, only towels and tissue every day. Room itself was not sparkling clean, but overall it was ok. No bed bugs or smelly odors. You have to pay for wi-fi, and the connection sucks. My room was at the farthest corner and to get a connection I need to stand in front of my door. There are some computers you can use down in the lobby though.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Earnestine Ritchie","date":"2012-05-30 08:19:08 +0300"},{"content":"What is good: The hotel has spent money on fixtures and making the public areas look nice. Cool bathroom fixtures, rainshower etc... and bedroom furnished nicely. Location is very central to the beach, the underground trains and the Gotic Quarter – really enjoyed that. The housekeeping staff seemed friendly whenever we asked for towels or other small items. What they could do better: Service is poor. Hotel is disorganized, less than friendly staff at the front desk. Most inquiries are met with “no, not possible” or “I don’t know”. When passing by the front desk on a number of occasions, we overhead the desk agents in some type of altercation with guests on the phone. Air conditioning in the rooms cannot be controlled by the customer – it was preset and we found it quite cold at times so opened the windows to make it more comfortable. Pillows quite hard and are made out of those tiny pieces of styrofoam like a bean bag. What is unacceptable and why we would not recommend this hotel: Misleading advertising. Hotel website says “free internet”, “king beds” and there are websites selling the property they say, “complimentary breakfast”. Upon arrival, we were told internet is 12 Euros per 24 hours, that there are no king beds. The most unsettling part and a pretty negative last impression for us was upon check out when we discovered the so-called complimentary breakfast was not free. As the front desk agent explained “complimentary” in Spanish translates to, “complimentarios” which means “not included, extra”. Despite our attempts to explain that the English website where we booked led us to believe it was included, we were forced to pay – when we said we would not pay as it was false advertising, the agent immediately said he would call the police. Perhaps this isn’t the first time this has happened. We asked him to have the hotel at least fix the wording on the internet to remove any ambiguity so as not to have this problem in the future. The agent said WE should contact the website company (which makes no sense for the consumer to manage a company’s site and its partner’s sites). 129 Euros later, we left the hotel feeling somewhat taken advantage of. Please check in advance as to whether your breakfast is actually included. Ironically, this breakfast was the least impressive of all the hotel breakfasts we experienced on this trip and the only one we had to pay for since the others were all included. Certainly not worth 10 Euro per person. There are many places to eat within one or two blocks had we known. Other minor issues with the hotel: We needed use of an iron. It took two days to get one since the hotel has one iron for the entire room inventory and apparently it was locked up in another guest’s room and the hotel could not get it back (?). I mention this as a good example of how the hotel doesn’t really make an effort to help guests. Room safes are available but one must pay 2 Euros per day to make sure their valuables are safe. For a four star hotel this seems tacky and somewhat unethical. This was the only hotel in our European trip where we had to pay for a safe. Again, not a four star move in my opinion.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Roderick Bahringer","date":"2012-04-23 05:53:50 +0300"},{"content":"Paradisus is ranked 27th for a reason! A four-star resort? Are you serious? After spending the week of Christmas with our entire extended family at the Paradisus, we found the resort grounds beautiful and well manicured, and we found the staff to be friendly, if a bit slow. Check-in was truly painful and slow, taking well over an hour even though everything had been prepaid. We're fairly patient people, but it was unreasonablly unorganized considered we had been scheduled months in advance. One thing that cannot be overstated is the extremely low quality of much of the food. I'll try to be more specific than some of the other reviews. The Hybiscus was extremely disappointing the first evening. True, it's a buffet. But 100% of the dishes were not being heated in the steam trays. We're talking about fish, shrimp, and meat that have been left at room temperature for hours,....Breakfast was slightly better. Again, everything on the buffet was cold: eggs, sausage, undercooked bacon,.....There was a made-to-oder omelet station which was good if you didn't mind waiting in line.Every order of fish or seafood our party had over the course of the entire week, regardless of restaurant or time of day, was cold, old or undercooked. Every time. I truly wonder how many cases of food poisening are encountered here each week. I'm not complaining about flavor or taste issues here. This lack of quality control will $@!#% people. Other restaurants we found to have the same issues with quality control. Even for individual orders (not buffet), they appear to make everything well ahead of time and just wheel it out when ordered without reheating. The steak house had some of the poorest quality cuts of steak I've encountered. I'm not being unkind here: Very stringy and tough T-bones with more than 60% fat instead of meat. Other cuts our party ordered were of equally low quality with the expection of the tenderloin which was good.We had a special anniversary meal planned the the Japanese restaurant, which required reservations. Of course, the reservation was recorded for the wrong evening and # of people, so we did not get to celebrate the special day as a family, or on the right day.Beware of checkout: The maids reported that one room in our party had hidden a guest in their room, so they charged us for an extra person. Of course, this wasn't true. They would not provide info on how they came to this conclusion - only that the maid said so,...After hours spent making no headway with the front desk, and no management willing to get involved, our party was late to the airport. After surviving the inedible food for a week, and spending thousands of dollars for our family to stay at a resort ranked # 27, to accuse my family of thievery over a few hundred dollars was more than I'm willing to take. We won't be back period. So much for Christmas at the Paradisus. That is our last business with Sol Melia, and good riddance. There are far too many quality resorts that aren't trying to $@!#% and steal from their guests!","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":3.0,"Location":3.0},"author":"Stevie Sipes","date":"2015-02-25 02:54:56 +0300"},{"content":"Better than Ever This was my second time staying at the Paradisus Punta Cana and I was amazed at all the great improvements they have made over the last year (and that is saying alot because it was already pretty spectacular). We stayed as part of the Royal Service promotion that Sol Melia (the owners) run every November where you get a free upgrade to Royal Service. You need to be a member of Club Melia to get emailed about this promotion. The Royal Service is so worth it to us if just for the private pool and breakfast lounge alone. Throw in beach side service in your own private area of the beach and you can see why it is worthwhile to upgrade. Since last year, they have added a new area called the Reserve. I think it is part of their time share plan but as a member of Royal Service you get access to the two fantastic restaurants there. The food is superb and a step above what is available in the rest of the resort albeit the rest of the food isn't too bad at all. We had 5 perfect days of weather and 5 overcast windy days. A few tips to travellers...it is all-inclusive so order your drinks with premium spirits or you will get well drinks. Make your food reservations in advance or when you first get there as not all restaurants are open all the time and some places fill up fast. If you are like us, you want to try as many as possible and then go pack to your favorites again. Golf tee times are only available one day in advance from the hotel unless you go on line and pay a $10 surcharge per person. If you really want to play golf, you should book in advance. If you decide you want to play the next day then book early the day before. Some tips for golf...you get picked up first and then the bus goes to other properties...sit in the front seat so you can get to the pro shop check-in first or you will be in a long line with your other bus mates. Don't worry about your clubs...they will be downstairs waiting for you. It is the DR so a few $$$ and being ready to go will get you on the course first regardless of tee times. The bus returns on the hour from the course so you may want to cut that last hole short unless you want to wait at the course for the next one and waste all that valuable beach time. Every year I bring a couple of hundred in ones. The staff really appreciates the tips and you get great service....you won't miss a couple of hundred so live life large.Do not do the timeshare presentation unless you are really committed. ENJOY!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Gerhard Bartoletti","date":"2012-02-11 02:13:01 +0300"}],"public_likes":["Sarah Zboncak"],"vacancy":false,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Located in Yosemite Valley, this campground is open from April through September, requires reservations, and offers 81 sites for both tents and RVs up to 40' in length. Water and flush toilets are available.  Campsites 111, 113, and 119 are wheelchair accessible.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}