{"title":"Death Valley National Park","name":"Stovepipe Wells RV Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$23 a night","geo":{"lat":36.60545,"lon":-117.14634,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7392,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Such an awesome & trendy hotel! As my husband says : 'Off it's head' Wish we got to stay longer. A surpise or two in our room each day, from lolliops to water to chocolates. Cant wait to get back there","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Miss Alycia Schulist","date":"2015-08-06 06:15:56 +0300"},{"content":"We have just returned from a flying visit to Barcelona to visit family and friends. A great excuse to travel at any time but now having had the \"ME experience\" we are saving the pennies (or cents) at a furious rate so we can head back as soon as possible. The hotel is located just off Avenguda Diagonal, not so far from the \"Gherkin\" building and was easily reached by airport bus transfer and short taxi ride. First impressions at reception were very good indeed. It is a boutique style hotel and the mood is nicely understated - not pretentious but very welcoming. After a speedy check - in we were shown to our rooms on the 23 rd floor. We were very fortunate to be able to have booked a suite and nothing at all disappointed, from the spectacular views of the city to the high quality furnishings and extras provided. All the electronics are Sony, Philips etc. and the bathroom complimentaries are all high quality brands. The hotel provides just about everything in the room for your stay as standard and anything else is just a phone call to reception away. Our rooms also meant that we had access to the \"Level\". This is a lounge on the 25 th floor where guests can avail themselves of complimentary beer, wine, spirits and light snacks which are refreshed throughout the day. It's a great place to meet for breakfast or for drinks before you venture out into the city. The hotel restaurant has recently been awarded it's first Michelin star and we met the chef on a tour of the hotel. He took great pleasure in showing us his kitchens which were prepping up for that evenings sittings. And that also sums up the whole attitude of the staff at this hotel. They are all obviously proud of their hotel and the work that they do in there. If they can do anything for you, it is done well and with a lovely manner. Our stay in Barcelona was greatly enhanced by our stay in the ME hotel - I hope yours will be too","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Reynold O'Connell","date":"2014-05-11 05:34:53 +0300"},{"content":"When you arrive after a day of sightseeing at 5:30pm and your room is not yet cleaned... I leave it up to you to decide whether this is your type of hotel. So now you have to wait out in the passage or the foyer for them to clean the room...! (NO we did NOT accidentally leave the \"Do not disturb\" signs on the door or anything else that could have prevented them from cleaning the room - we were out of the room at 9am) Also have the following comments on the hotel; 1. Rooms on the small side 2. No Tea/Coffee facilities in the room - Room service took 35min to deliver 4 coffees at a cost of around EUR 20 3. No bath - sure the hotel is funcky but a nice bath after a day out is really nice 4. Agree with previous reviewer regarding the light/curtain swithes that can be confusing. I'm in IT and it took me a while to work it out. The curtain slider in our room was out of order. 5. Lighting in the room not suitable for getting any work done. Some people are lucky to go on a work trip or vacation without having to work at night, well I had to and it was very taxing on the eyes. 6. Location is NOT close to La Rambla or Gothic Q as suggested by other reviewers. No quick return to the hotel. Nearest tube station about 3 blocks away. Must say it is nice and quiet. 7. Privacy in bathroom. Guess some guests may find it spectacular - not me. If price is your determining factor, you may enjoy this hotel. Please do not expect old world charm. This is all very modern steel and glass.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":2.0},"author":"Elton Willms IV","date":"2014-06-09 15:13:13 +0300"},{"content":"We (me and my husband ) have been to many hotels all over Europe but I really don't think we will visit this particular one in the future again.We stayed at ME Barcelona between 11/09 to 17/09 during a medical congress my husband had to attend .Our room was viewing the pool and part of the city (it was at the 7th floor) ,but it wasn't the location that mattered at all .The room had only a chair next to the desk and a sofa beside the bed itself . There was no lamp on the desk and the lamp over the sofa didn't work .Also my reading lamp (on my side of the bed ) didn't work .The lighting therefore was very poor for anyone who would like to work or write or read . The only bearable spot to do all that was just ONE SIDE OF THE BED .Beside all this , (and the most annoying ) every time the shower in the room just over our own was used , water was running inside our OWN shower from the ceiling . Shall I mention that TV didn't work ? ( we didn't care about this that much though) .We mentioned the lamps and the shower problem to the concierge ( all of them are very friendly and speak very good english ) and as a result somebody knocked our door once and mentioned the lamps but at that particular time I was resting and couldn't receive him .No second attempt was made after that apparently . To the positive side I will mention that due to a party that would have taken place during our last night at the hotel we were offered a level room (20th floor )to avoid the inconvenience of the noise, where all lamps were working at least and you wouldn't have to fret if your unknown upper level neighbor would think to take his/her shower at the same time as you. Beside that ,breakfast was decent and for all that are kin in modern cold design the hotel is a treat .The area is a disadvantage though , the stench from the sewers was at some points unbearable the minute you stepped outside the hotel gate.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":2.0},"author":"Arjun Turner","date":"2014-09-08 13:41:38 +0300"},{"content":"We stayed here for 4 nights in June having just spent 3 nights in the W Barcelona. We booked on Last Minute.com so got a cheaper price than normal room rates however it was still more expensive than other hotels closer to the city centre. We were wanting a bit of luxury for a week and thought Barcelona was ideal for a part relaxing beach/sun holiday and part city break. We only booked this hotel because it had a pool and a 5* rating. We arrived at the hotel and the check-in queue was enormous so we had a relaxing drink in the comfortable bar area. To be fair check in was quick once we got the front of the queue but the entire foyer area smelt a bit wierd. The place is trying too hard to be cool with dubious colour choices for furnishings and steel walls??!!! Our room was ok the bed very comfortable and we got a good nights sleep (we were woken every morning by the maids at about 9am though). The bathroom had no extractor ran that we could find and after a shower the condensation ran down the glass panel separating the room from the bathroom and left dirty marks on the window ledge. I wouldn't say the room was spotless but it was adequate. This hotel was in quite a poor location - ok so fairly close to the nearest tube station (10 mins walk) and tram stop (5 mins) but a way out of the city. Cabs in barcelona are fairly cheap though so this isn't really a massive issue. The worst part about our stay was that on our last day we were enjoying the sun in the pool area when we were asked to leave due to there being a private party in the area. There was no pre warning or notification of this and we had to get up and tramp down to the beach via the tube to enjoy our last day of sun (I am 5 months pregnant with twins so was hoping for a relaxing day!!!!!!!!) I wouldn't recommend this hotel if you are expecting 5* luxury. If you are happy for 3-4* quality and service in a fairly poor location this hotel could just be for you!","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":1.0},"author":"Miss Abelardo Mitchell","date":"2013-11-27 03:52:23 +0300"},{"content":"... all that glitters, is not gold and the Hotel Me really didn't hit a good note with me. We were here for a business convention and on first look, the hotel and the rooms look great - until you try to utilise them. The hotel is a taxi ride to any tourist areas of Barcelona or a 30 min walk. There is a decent area about 8 mins walk for restaurants but this is NOT a city centre hotel. The rooms are attempting to be model and minimalist but end up being unfunctional and uncomfortable. Here's my room issues: 1. No kettle/coffee maker in the room. Virtually unheard of in a hotel of it's \"class\". 2. Cement floor in room, slippery when wet and cold. Carpets, wood, whatever ... not this cheap alternative. 3. Chair at desk is not a work station chair but a cheap, \"trendy\" plastic design - not good. 4. Impossible to shower without getting the bathroom floor drenched. 5. The wrap around curtain on 2 walls ... whose idea was this? Only one wall is window but the curtain covers both and is VERY slow on it's automatic open/close. Furthermore, it didn't close all the way and left a 3 inch gap for the light to stream in at 6am. 6. There is a control panel for all the lights and AC. Each button pressed done something different, each time. Everybody I spoke to had this problem. 7 Outrageously priced mini-bar and room service (18Euro for a hamburger) and as your miles from anyway, it's a good weight loss hotel! Beds were good, TV was ok, other bathroom facilities good - and their maid service is some of the best I've seen. Other problems. Bar staff are worthless. People waiting to be served, while 2 of them stocked and cleaned, 1 served - very slowly. 5euro for a 330ml glass of tap beer is twice the price of anywhere we drank. Outside the elevators on every floor smelled of toilets - probably because the rooms toilets backed onto that area. Poor ventilation? Breakfast is a very generous 11am finish except at weekends when it's even better at 12noon. Arriving at 11.05 on a Saturday, we were told it was finished. Questioning why, \"because we have to set up for a lunch meeting in this room\". Even though we told her the note in the room said 12, when we checked in we were told 12 - she said there is nothing she could do, even though we could see a full buffet breakfast table and people eating. It was only after demanding a manager that another staff member made a call and let us in - it should not have came to this. Smokers - forget it if it rains, there is no area even remotely or partially covered outside! Overall, this hotel just failed. It has a few good points but it's not comfortable, doesn't provide you a feeling of luxury or a level of relaxation and just feels a bit like they don't know what they're doing.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":1.0},"author":"Abdullah Lubowitz","date":"2012-03-29 11:12:46 +0300"},{"content":"We were booked into the ME for 9 nights, we checked out after 3, staff were very unfriendly and unhelpfull. the rooms are among the smallest Ive ever stayed in. Cannot understand how this hotel got rated with 5 star, no way, 3 star at best..The walls in room were marked, the corridors looked as if thay had never been hoovered. The sockets were loose. On the 2nd day, no one cleaned our room or made bed, we had to ring twice for toilet rolls and towels, The air con did not go down past 23. We couldnt wait to check out, we moved to the arts hotel where we found a real 5 star hotel","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":2.0,"Rooms":1.0},"author":"Kory Schultz","date":"2014-05-19 00:36:42 +0300"},{"content":"A visually stunning hotel. The rooms were compact but very well designed. No hint of problems with smells, music and drains that have been mentioned on previous reviews. BUT - two big problems: 1. After being told that I was entitled to one item of clothing to be ironed per day - complimentary, I gave my shirt to the very charming lady who showed me my room. The shirt didn't turn up until 45 minutes after I was supposed to leave the following morning making me late for a meeting. I also had to make several calls to get the shirt back. 2. The 22 Euro club sandwich and fries was inedible. A disgrace. It doesn't matter how beautiful and stylish a hotel is, if it can't get the basics right - it should and will fail. I would have whole heartedly recommended this hotel at 9pm on my day of arrival - now, I wouldn't. That's why it's a shame.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":3.0,"Location":3.0,"Rooms":5.0},"author":"Curt Nolan","date":"2014-08-09 00:49:46 +0300"}],"public_likes":[],"vacancy":true,"description":"(Year Round).  This RV campground is managed by the Stovepipe Wells Resort. It has 14 sites with full hook-ups and no tables or fireplaces. A swimming pool and showers are available. No Reservations, first come first served.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}