{"title":"Eastbourne","name":"Royal Hotel","address":"8-9 Marine Parade, Eastbourne BN21 3DX","directions":"on seafront by Eastbourne Pier","phone":"+44 1323 649222","tollfree":null,"email":"info@royaleastbourne.org.uk","fax":null,"url":"http://www.royaleastbourne.org.uk","checkin":null,"checkout":null,"price":"from £45 per person B&B£","geo":{"lat":50.7685,"lon":0.2939,"accuracy":"ROOFTOP"},"type":"hotel","id":8495,"country":"United Kingdom","city":"Eastbourne","state":null,"reviews":[{"content":"Stayed 1 night - clean, comfortable and good value for location. Great in house breakfast (extra $$$). Close by all La attractions. Would go back.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Raphael Russel","date":"2012-08-10 04:07:03 +0300"},{"content":"Very close to the Grove for great shopping, and the Farmer's Market. It is different and casual in a good way, and very comfortable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Trudie Wiegand","date":"2013-01-07 15:48:08 +0300"},{"content":"I am a return guest at Farmer's Daughter and love it there. Meets all my needs; location, hygene, internet, staff, rooms, TV, fascilities all 10/10 for me. Sadly for some strange reason when I arrived there had been a 'cancellation' on my booking....not by me!!! There was a record on the computer that a member of staff had cancelled my booking.....so, whilst they could accommodate me for my 1st & second night, they had to find me an alternative for one night and re-book me for the next 7.....not much fun! The manager, Peter, was helpful but the staff member on the desk at my arrival was useless: not much of an apology just a casual announcement that I'd have to find somewhere else to stay on Friday night. She then said she would look for somewhere for me, but forgot or was distracted so when I saw Peter the next day, he was a surprised as me that it wasn't done and had to make plans himself. Booked and paid for my one night stay in a local motel......nowhere near as nice as Farmers Daughter but a solution none the less. All in all, it was inconvenient and annoying but walk in rates were applied as a 'good will' gesture and the rest of my stay went smoothly and I will return again!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Alysa Kertzmann","date":"2012-08-08 13:06:17 +0300"},{"content":"From the reviews, we were expecting a pleasant if quirky small hotel. How wrong could we be! There were three problems, two of them major. The first was that the air conditioning was so noisy (and basic) that it woke us up every time it turned itself on (which was frequently). The second was that there was something in the room, which may have been mildew or some residue from cleaning products or the air conditioning system which caused a strong allergic reaction in my wife. The third was that when we complained the following morning, the hotel was totally unhelpful and devious and our attempts to speak to the management were frustrated at every turn. All we got was a message saying that there was no problem with our checking out and that we would get a refund for the nights we had not used followed by a later message saying that we would not get a refund but that we should arrange a charge back through the credit card company. When we tried to arrange this, the hotel responded by lying, saying among other things that we had not made the problem known to the front desk and that, had we done so they would have sorted everything out to our satisfaction, and then relying on the fact that we had made the reservation over the internet on a non-refundable basis and making it clear that they were going to keep our money. BEWARE THIS HOTEL! Beware also non-refundable deposits in general.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Lola Nader","date":"2014-04-09 03:00:58 +0300"},{"content":"The basic theme of the hotel is a farm and the rooms are supposed to be barn themed with cute curtains etc. The truth of the matter is that the rooms are basic, poorly furnished with basic wooden chairs and a very uncomfortable bed. The general room cleanliness is average but I did notice some left over hairs on the bathroom floor! The rooms are equipped with an LCD flatscreen TV and basic cable, wireless or wired Internet, a coffee machine, small fridge and an iron. That's about it, the bathroom is very basic and the shower is of the old fixed head type so pretty unremarkable. In general this is an obvious attempt to charge boutique hotel rates for nothing more than basic motel standards.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Miss Dortha Howe","date":"2014-01-02 03:21:07 +0300"}],"public_likes":["Theresa Hettinger","Lucius White","Arch Leuschke","Eunice Green II","Gerson Bashirian IV","Lawson Schmidt","Garret Gorczany"],"vacancy":false,"description":"Historic guesthouse directly located on seafront near the pier. The Royal is one of Eastbourne's few remaining original Sea Houses. Popular with tourists and walkers, modestly priced and dog friendly.","alias":"The Royal","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}