{"title":"London/Holborn-Clerkenwell","name":"Swinton Hotel","address":"18-24 Swinton St, WC1X 9NX","directions":"tube: Kings Cross","phone":"+44 20 7837-1451","tollfree":null,"email":"swintonhotel@hotmail.com","fax":null,"url":"http://www.swintonhotel.com/","checkin":null,"checkout":null,"price":"From £55","geo":{"lat":51.5293,"lon":-0.1166,"accuracy":"ROOFTOP"},"type":"hotel","id":16235,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"We had a wonderfull time there and the 4.5 rating is correct. This hotel confirms in every aspect to the reports given through this forum. It answered completely to the picture we had made up. The staff is doing their very best to please you. If there is a problem report it to the front desk and they will try to fix it within 24 hours, according RIU policy, if not possible they offer you an other room. Reminder this might be more difficult when there is full or nearly full occupation. Sometimes they say yes and did not really understand what you meant but just to please you they say yes, be understanding and repeat your point, if nessesary talk to someone else who does understand your language(English or French, better)The pool could use an update(fresch painting) but is well maintained. If you like a peacefull vacation and want rest you will find it at the Macao. All Dutch speaking people visiting this forum who are interested in, personal, non commercial excursions please contact me for further information. Pesonel i would to recommend are Alexandra at the front desk and Antonito waiter/bartender at the pool. We will never forget his motto Oh my God, I love my job ! and believe us, it seems he really does.We had a wonderfull time there.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Odessa O'Conner IV","date":"2015-02-10 18:10:55 +0300"},{"content":"Not bad Arrival: We had no problems with the front desk and were quickly escorted to our rooms without incident.Rooms: Overall, they were average, or maybe a bit below average. I was a little disappointed that our room did not have a king sized bed. It had two fulls pushed together. The sheets did not fit and always seemed to slide off of the mattress. The room was cool enough and we had no problems with the air conditioning. My biggest complaint was the shower. They are very small and the curtain seemed to attack you as you were bathing. Quite disgusting considering that I doubt they clean them often. Another problem that we had was the hot water. It seemed to change temperature five-six times while taking a shower. It was too hot, then too cold, etc. Minibar: Diet pepsi, pepsi, orange soda, mineral water, and a gallon of water...filled occasionally. I am a big diet soda drinker and during the whole week, I pretty much had what I wanted 5/7 days. They also have four bottles of alcohol attached to the wall so you could make your own drinks but we didn't bother.Roomservice: Don't order the nachos (stale) or the club sandwich, that's all I have to say about that. They were both disgusting!Restaurants: This was my absolute biggest complaint. Breakfast was good. They have typical American fare and some Dominican cuisine. The fresh fruit juice is amazing. The only option available is the buffet and it is the same every day. Lunch was HORRIBLE!!! The only option available yet again is buffet. I don't mind it for breakfast, but it gets annoying around lunchtime. They also have the same thing everyday. This is basically pizza (not bad), fries (OK), burgers (disgusting!!!), hotdogs, fruit, bread, and different types of pasta/seafood salads. I attempted to make my own salad one day but they really only have lettuce and tomato slices for a salad. The only option for dressing was thousand island. Basically, it stunk. AND, there was only one restaurant open. I absolutely hated lunch and we ended up skipping it.Dinner was good. The buffet has a lot of options for everyone, and we ended up eating there twice, enjoying it both times. They have a pasta station, and different meats. The menu changes slightly every night, which is nice. Steakhouse was good and I was delighted to discover that they actually had Caesar salads that were quite good. My husband and I don't do Japanese and the Italian restaurant only had dishes with cream sauce or seafood (my husband doesn't eat either). Basically, if you are on a diet don't eat here. Everything that I ate was cooked in grease or butter. Be prepared to be hot since men are required to wear pants.Pool: Never hard to find a chair, well maintained, and beautiful. No swim up bar and the bathrooms are a bit of a hike (they are towards the back of the pool bar).Beach: Beautiful. A bit of sea grass but overall it was gorgeous.Bars: Best bar was the main lobby. Drinks are really good. I am not into top shelf liquor, so that didn't bother me. The frozen drinks made up for it and were delicious. They also have salted peanuts as a snack. Try the Mama Juana. It's a Dominican run that is awesome sipped alone. Yovanney is the best bartender.Excursions: Don't do Bavaro splash or the catamarans (three hour bus drive from hotel, they don't tell you that). We attempted to go to a Dominican restaurant called Jellyfish. Paul in the main lobby suggested another restaurant called Langosta Caribe. I said that this was fine with me. After a 20$ cab ride, it was closed. I was NOT happy!!! We ended up paying another $20 to get to Jellyfish, and $20 for the return home. Casino: Very SMALL.Overall, it wasn't bad for the price we paid. I tend to focus on the negative because it's just there. We had a nice time on the vacation and the staff was very nice. I really think Paul made an honest mistake. The worst part for me was the whole 3 buffets a day. I just can't deal with that!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Earnestine Gerhold","date":"2012-08-20 16:51:46 +0300"},{"content":"Riu Palace Macao delivers again       Balcony View","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Grady Mayert","date":"2014-10-02 16:55:41 +0300"},{"content":"Macao is the best! My husband and I stayed at the Riu Palace Macao for 11 days in June. We were blown away by the cleanliness of the hotel facilities, by the warm and caring staff, and by the beauty of the beach! The atmosphere is warm and casual, but elegant. The other guests were of an older generation, so there was very minimal noise. The hotel and beach looked exactly like it did on their website, so we were actually very surprised when we got there. It exceeded all our expectations!The entertainment department needed a little work, but they were in the process of revamping their programming.We actually became friends for life with some of the staff and with some of the guests. Two staff members gave us gifts before we left. We just took a little time to get to know them.We plan on going back as often as we can. We viewed several of the surrounding hotels, and concluded that Riu Palace Macao had the best mix of luxury and casualty of anyone else.I hope you'll enjoy it as much as we did!Molly and Joel Stroud","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Kayley Strosin","date":"2012-11-07 18:15:17 +0300"}],"public_likes":[],"vacancy":true,"description":"Good value bed and breakfast in the north west of the district.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}