{"title":"Paris/15th arrondissement","name":"Novotel Paris Tour Eiffel","address":"61 Quai De Grenelle","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":48.84965,"lon":2.2837,"accuracy":"APPROXIMATE"},"type":"hotel","id":21654,"country":"France","city":"Paris-15E-Arrondissement","state":"Île-de-France","reviews":[{"content":"Managers reception and cooked to order breakfast is fabulous.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Colton Bernier","date":"2015-06-25 19:25:35 +0300"},{"content":"I travel often but what set this hotel apart was the \"made to order\" breakfast. The cook, Lassandra was pleasant and he food was delicious. Oh and the evening reception was really nice too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Carmella Hickle","date":"2014-10-09 13:56:34 +0300"},{"content":"We stayed for a weekend, booking through Orbitz (normally I'm a priceline/hotwire buyer, but the reviews swayed me to book confirmed here and not take my chances.) The staff was friendly, and accommodating to the fullest extent. As with all Embassy suites, there is a nightly drinks/snack reception, though the snacks consisted of potato chips and doritos one night, with a snack-mix the next. I've seen more lavish spreads at other ES properties, but the bartender was efficient and moved the line quickly. The breakfast was fantastic, nice selection of fruit, pastries, cooked-to-order eggs/omelets as well as french toast. If you did not want to wait, the scrambled eggs were real, not powdered, and cooked with some seasoning. It was a nice touch. The room was typical of most Embassy Suites, the pillows were nice and firm, the bathroom was clean, though a bit small. As with many Hilton properties, the WiFi is not free, not was it particularly fast. (The gentleman checking us in comped it for us!) The atrium, found in many properties, can create a somewhat noisy environment, and it seems like these properties are full frequently. We were tucked away in a corner, so noise was not an issue. The pool area was crowded, and the water was quite chilly, but it was clean and towels were stocked frequently. Being next-door to Costco is a bonus, and you are just down the street from a Trader Joe's and a slew of other restaurants of a variety of gastronomies are nearby. Overall, it was a great stay and we will be back.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Jessica Bogisich","date":"2014-04-02 08:41:05 +0300"},{"content":"We made a last minute weekend trip to Indianapolis and found a lot of the hotels were full. I picked the Embassy Suites based on past stays in other places. Suites are nice with teenagers (2 TVs and free breakfast make life so much easier). Check-in was fast even though it was very crowded. Our room was very nice and clean - perfect. The pool / hot tub areas were crowded but the staff kept it very clean and there was plenty of fresh towels (which is usually a problem at hotels when it's crowded). In the morning the breakfast area was crowded but they had a wonderful large staff to keep up with everything from cleaning the tables to making the food (it was impressive and everyone was smiling - that's rare these days). I can't say anything negative and I definetely recommend it. Plus: I'm a Priceline gal - I use it all the time - I couldn't use it this weekend since all the hotels were full. I paid full price and I don't regret it. WOW - that's something.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Abdiel Dickens","date":"2012-04-14 14:45:06 +0300"},{"content":"Lassandra, Breakfast Cook, makes the Embassy a great place to stay. Love the pancakes in the morning. Front desk staff very helpful and friendly too - my home away from home.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alfredo Jaskolski","date":"2014-06-19 04:26:49 +0300"},{"content":"When we checked in and went to our room, the first thing we noticed was a mound of garbage piled near the elevator. This was several garbage bags, obviously left by a housekeeper as they performed other duties. When we left a couple of hours later for dinner, the garbage was still there, although it was finally removed a couple of hours after that. The second issue we had was that the individual shampoo/conditioner bottles had already been opened and used; new ones were not provided until I asked the front desk for some. Other complaints include: the pool was colder than it should have been, there was a stain on the sheet for the pullout sofa, and the hotel was loud (this is a complaint of design though: atrium style hotels usually are louder.) Internet access is noted as free on embassysuites.com for this hotel, but there was a 9.95 charge. The front desk was very pleasant and accommodating, and the lady working the omelet station at breakfast was amazing (fast and efficient, but fun too. All in all though, I would not recommend this hotel. It does not live up to the Embassy name.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Stacy Douglas","date":"2012-09-10 19:52:43 +0300"},{"content":"My husband and 2-year old daughter stayed in this lovely hotel for the weekend 11-13 April 2008. We enjoyed very much the atrium space, fountains and decor. The room was perfect for us - two adjoining spaces - our daughter was able to sleep in the living area on the couch while we were able to watch movies in the bedroom area without disturbing her. Two downfalls: they do offer a lovely hot buffet breakfast - complete with omelette station. My husband ordered an omelette and could not eat it due to the fake oil/grease they use to 'butter' the pan. Yuck! Also - the second day - Sunday morning - the hot tub was out of service, with no explanation or attention from the staff. Neither of these things would keep me from staying here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Destany Goldner MD","date":"2015-02-16 03:53:06 +0300"},{"content":"As a frequest traveler who prefers to stay in Hilton brand hotels, this is perhaps the most disappointing property I've been to. I'm not one who typically writes bad reviews, but the entire hotel is poorly lit and is way past it's prime. It appears they may be just starting to begin some room renovations whch are desperately needed. The heating unit in my room was the loudest I've ever heard- louder than those window-type A/C units and the heater wasn't even that style- it was a central heating unit that rattled and vibrated all night long. The bathroom was tiny, but the rooms were larger than a lot of the other Embassy Suites I've been to which was a bonus. The very worst thing about my stay was the room next to me had their refrigerator die out on them causing a horrible burnt stench for my entire overnight stay and into the next morning. The fitness center is about the size of a walk in closet at best. The only thing this hotel has going for it is a very friendly staff.","ratings":{"Service":5.0,"Cleanliness":2.0,"Check in / front desk":5.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":3.0},"author":"Edgar Gerlach","date":"2013-08-13 10:07:22 +0300"}],"public_likes":["Dulce Kohler","Heather Kuhn","Amira Lebsack PhD"],"vacancy":true,"description":"The largest Novotel in the world was originally built as a Japanese hotel Nikko, and retains many interesting design elements of the former, like the capsule-style windows, and the Japanese restaurant Benkay. It is by now not ageing that well though and awaits the long-overdue renovation.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}