{"title":"Birmingham (England)","name":"Thistle Birmingham City Centre","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.4851,"lon":-1.89779,"accuracy":"APPROXIMATE"},"type":"hotel","id":3639,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"We stayed at the Palmer House for the first time since it's been renovated, so it's been a few years. We usually stay at Kimpton properties while in Chicago - good rates, friendly staff, the wine hour. But we were going to Lollapalooza, which was only a couple of blocks up Monroe, and I got a decent rate on the Executive floor with self-park included. The hotel has been beautifully redone. The check-in was efficient and friendly. We got to our room - no mini bar. That drives me crazy, personally. Not that I ever use it, but we do like to stuff our leftovers in the fridge! I was not going to pay for a fridge to come to the room. Also - no free internet. I may be crazy, but as a silver HHonors member I believe I had free internet before. You can go to a Hampton and get it - why not the Palmer house? Ugh. The room was nice. Small, but nice. Bed was comfy, they usually are at Hilton properties. The bartender in the executive lounge had no clue on how to make a martini with a lemon twist - my husband ended up with a lime after she asked if he wanted olives. One evening we stopped at the lobby bar, Potter's, for drinks before going to bed, and the bartender had no idea what I was asking for - a wine that was on their somewhat limited by the glass list. I had to point it out. Also - for whatever reason they were not allowing carry out of food that evening. And they were a bit abrupt telling people about it. We had our drink and went upstairs where we had a bottle of wine waiting. When it was time to check out I called the bell desk to have them get our bags - we were going to do some shopping before leaving the city. I was asked (also abruptly) \"are you ready?\". NO. I always call the bell desk when I'm not ready. Then he went to the wrong room. He had to go back downstairs and find out where he was supposed to be going. When we came back for our bags I was told that I couldn't have them until my husband was in front of the hotel with the car. OK. So when he got there, there was a huge line. I finally got my turn, and the bellman who had my luggage moved so s-l-o-w-l-y that I almost grabbed the cart myself. Then he just stood there and let my husband load the car! Ugh. Anyway, it was an ok stay, we've had worse in better places. But we were disappointed in little things. Next time we will be back at a Kimpton property.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":3.0},"author":"Jack Orn","date":"2013-11-09 11:28:16 +0300"},{"content":"Palmer House might be a little bit too big, and it's easy to get lost inside (happenned to us a couple of times in 2 days), but it is very beautiful, and its rooms are clean and comfortable. We stayed in Chicago for 2 days, visited everything we wanted to see, and did not have to take a bus/taxi/subway even once, because the hotel is located, literally, in the middle of everything. Staff is friendly and helpful, the concierge serivce is amazing. Many good eateries all around the hotel, and they do have starbucks, bar and restaurant on premises. I would totally stay here again, and recommend it to everyone!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Kristy Steuber","date":"2014-03-01 20:01:41 +0300"},{"content":"This place has been our downtown Chicago destination for 25 years. It is located cnetrally, still has one of the finest old style lobbies, service is great and when you get a special Hilton room rate, is hard to pass up.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ms. Noel King","date":"2013-02-06 00:03:40 +0300"},{"content":"I stayed at one of the refurbished floors of the Palmer House. This hotel is a wide variety of room sizes and decors so you never know what you will get. My room was HUGE and with modern decor. I enjoyed the extra space but they forgot to update the TV to a larger model. At the end, it was impossible to watch TV from bed because of the distance. The hotel is impressive because it is in a traditional building, but it lacks in the details. This hotel is very big and it is always busy so there is not much care for personal attention to customers. I had the unfortunate experience of ordering a cup of coffee at the lobby area bar. The waitress was very unfriendly, took forever for the coffee to arrive and it was cold. Fortunately, there is a Starbucks in the premisses. Location is very good, close to many stores, but with so many hotel options in Chicago, you can certainly do better than staying at the Palmer House Hotel.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":2.0},"author":"Jaylon Mertz","date":"2015-04-07 16:29:48 +0300"}],"public_likes":["Dortha Tromp","Eric Jaskolski","Bobbie Mann","Jazmyn Harris","Ms. Titus Keebler","Mrs. Zechariah Turner","Ashly Bruen","Savanna Rice","Jackie Sauer"],"vacancy":false,"description":"The conservatively-styled - and little outdated - Thistle faces St. Chad's Cathedral over a busy thoroughfare.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}