{"title":"San Francisco/Chinatown-North Beach","name":"Castro Hotel","address":"705 Vallejo St","directions":"between Emery Ln and Stockton St","phone":"+1 415 788-9709","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$165 per week","geo":{"lat":37.7984,"lon":-122.409,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25505,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"the location of the hotel is grate a lot of restaurants and shops near, the room was clean and comfortable and nice decorated. the cable car in front of the hotel makes a lot of nois and the rooms on the street side are very noisy. The cookies, coffee and tea in the lobby throughout the day is great.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Abbie Luettgen","date":"2014-08-10 22:55:43 +0300"},{"content":"I was pretty sure I was going to love this place when I booked it and I was not at all disappointed. I prefer hotels with character and this one had a little historic charm, lots of modern amenities, and tons of class. When I walked in the windows were cracked to provide fresh air (what a change of pace!) and the room felt breezy and light. I suppose one could complain about the street noise but you can't really chose to stay on Powell St. and complain about the trolley's bell can you! It didn't keep me up. The staff were extremely helpful and I couldn't have felt more at home. I suppose the rooms might be small--I lucked into a free upgrade to a suite and it was spacious and lovely. Can't wait for my next trip back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Anissa Mayer","date":"2012-01-11 01:01:34 +0300"},{"content":"It's central position is great for shopping and eating out which is just as well as there is no restaurant ,just a small bar and the free coffee in the lobby. The rooms are clean and comfortable and the staff pleasant and helpful.Just one irritation though as we booked an important early morning wake up call which never came!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Nyah Gislason II","date":"2013-12-23 02:33:58 +0300"},{"content":"We stayed three nights and found the Chancellor matched the positive recommendations we had read. The location was great for a holiday in San Francisco. The room was very well set up. The availability of complimentary tea and coffee 24/7 in the bar and apples in the lobby showed an interest in customer welfare. The staff were all very helpful. Overall this was a most pleasant stay and for southern hemisphere travellers represented great value for money.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Joyce Oga","date":"2014-05-08 05:59:51 +0300"},{"content":"This hotel needs aircon the rooms are to warm to sleep.The hotel is almost boutique style as it is quite small the other problem is parking there is a small area outside to park and unload your bags but if this is full you cannot double park as there are trams lines that cannot be blocked.they charge $36 to valet park which to us was the only option as not to sure where the self parking garage would be. The hotel is clean and modern and has a nice feel about it.We enjoyed our breakfast in the retaurant plenty of choice on the menu.The rooms are small but big enought to be comfortable as long as you travel light Apart from my two issues I enjoyed my stay at the chancellor recommend if it is cold weather and you have no vehicle!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Yadira Becker","date":"2014-06-05 02:35:46 +0300"},{"content":"I recently stayed on the fifth floor facing busy Powell Street. Although, I did not hear noise from the neighboring rooms, the noise from outside the hotel was unbelievable. I checked the windows twice to make sure they were closed. It sounded like the street was running right through the room. The windows are not double paned and they are useless in blocking out noise. I felt like I should tip the street musicians on Union Square since it sounded like they were playing in my room. Powell Street is very busy and the noise did not diminish all night. There is no air conditioning and the evening was quite warm. I thought I would be saved by the ceiling fan. In theory, this would provide some cooling air and some white noise. However the fan was so poorly mounted to the ceiling, that even at the lowest speed it shook so badly I was certain it would fall out at any moment. Further it had a noisy and irregular rattle that added to the general cacophony. I would suggest that future guests insist on a room away from the street and check out the ceiling fan before settling in. Other than the noise, which as you can gather, was a big problem, I liked other aspects of the hotel. The location is good, and the price, considering the cost of other comparable hotels was quite reasonable. The front desk staff were friendly and helpful. The room was clean and the bathroom facilities comfortable.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":4.0},"author":"Gordon Huel","date":"2012-05-04 23:50:29 +0300"},{"content":"thanks Wes and all your staff for another wonderful stay. once again everyone was gracious and helpful to the max.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Leanne Nicolas","date":"2015-10-08 01:35:12 +0300"},{"content":"We knew nothing of the Chancellor other than reading positive online reviews, and decided to take a chance. It more than satisfied our hopes. We loved walking right out the door to the cable car stop (and could purchase ride passes at the hotel), and being so near Union Square and places to eat. My husband loved being so near Walgreen's and it's 24/7 icees! We used Lorrie's shuttle service both ways and were very satisfied with it as well.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Estella Price","date":"2015-05-12 12:52:33 +0300"},{"content":"We arrived in San Francisco after four days in Vancouver and a week cruising in Alaska. We were left slightly scared by the taxi driver who portrayed the city as a $@!#% hotspot but found it to be one of the best cities we have visited. The hotel room seemed a little small when we first arrived, but if we kept it tidy there was no issue with space. It was clean and had all the facilities we needed. The location is unbeatable, right on Union Square and opposite Saks - the tour bus (if you choose to take one) stops almost across the road. We had a drink in the bar one night and picked up some useful city tips from the bar staff. We both appreciated the use of the computer by reception - free internet to check emails was a nice extra.","ratings":{"Overall":4.0},"author":"Ola Romaguera","date":"2012-08-03 13:36:42 +0300"}],"public_likes":["Sophia O'Conner","Terrill Morar","Fidel Cole","Jerod Labadie","Heidi Gibson MD","Russell Veum","Dell Lynch I","Rowland Bailey"],"vacancy":true,"description":"Fancy a short stay at an S.R.O., well here's one that rents by the week.  The rooms are clean, it's in the heart of North Beach, it's safe &mdash; being directly opposite the police station, and it gets good reviews.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}