{"title":"Derby","name":"Hallmark Hotel Derby","address":"Midland Road","directions":null,"phone":"+44 1332 345894","tollfree":null,"email":null,"fax":null,"url":"http://www.hallmarkhotels.co.uk/our_hotels/derby/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.915715,"lon":-1.464273,"accuracy":"APPROXIMATE"},"type":"hotel","id":7768,"country":"United Kingdom","city":"Derby","state":null,"reviews":[{"content":"My partner and myself stayed in Chancellor Hotel for a week during our summer holiday in the States recently and I've only good things to say about this boutique hotel. I picked this hotel from the fantastic reviews from other travellers in Tripadvisor. There is no regrets thereafter. From the moment I started making reservations, the manager, Wes Tyler has been very very very helpful. As we have driven in from LA, we had done a lot of shopping along the way and one of the purchase was a Tumi luggage which we have ordered in Carmel and to be delivered to Chancellor in SF. So i wrote to the hotel informing them that this luggage might be delivered even before our arrival. One of the reservation officers Kevin Vossen responded to my mail and said he has contacted Tumi and has been told the luggage will arrive in a few days time. It is really nice of him to take the initiative. They also took good care of our luggage when we were away for a few days (we went to vegas). And during those few days during our absence, the stuffs we ordered from Amazon were delivered to the hotel and were delivered to our rooms the moment we came back. There are several big hotels around Chancellor but I love the personal attention given by small boutique hotels. The rooms are beautifully furnished. The bed is very very comfortable and they also has a pillow menu. When we checked in, there was a bottle of champagne and a box of chocolates welcoming our arrival. On the second checked-in, there was a photo frame, with a bottle of champagne too. The frame is a very nice momento from the hotel and It is now sitting on top of my study desk :) The location is fantastic, right in the middle of Union Square and within 10mins walk to Chinatown. Taking the cable car was no hassle at all and all there are tons of shops like Macy's, H&M, Gap are all within 5mins walk! There is also a Victoria Secret beside the hotel. It is also a very centralised location for taking cab everywhere. We joined Dylan's tour and the pick-up point is just around the corner. There are many restaurants in the area so food is not an issue. As we are from Asia, we missed asia food after 2 weeks in the states and we found 2 very good thai restaurants there! We had a really nice time in SF and the hotel we stayed played a big part to our fantastic vacation. We hope to go back again and will definitely go back to Chancellor for sure.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Imani Rippin","date":"2013-02-06 09:06:01 +0300"},{"content":"With just a few hiccups (room request not fufilled right away and initially unfriendly front desk worker - but we think she was new b/c she didn't know much ...) everything turned out great. The rooms were great. Bed comfortable and with the windows open and the fan running - we were comfortable all night. AC-schmasy. :) I would definitely recommend either requesting a room high up (to avoid noise) or a room to the back of the hotel which was much quieter. Our first night they had us on the third floor facing Powell Street (when I asked to be high and back) and it was noisy. However, they moved us the next day and everything worked out. Yes, the rooms were small BUT we've stayed in MUCH smaller rooms in Europe. Our rooms fit our luggage and our snack bag just fine. We never felt crowded. The front desk gave us FANTASTIC restaurant suggestions and easy to understand directions to the tourist sites. The location cannot be beat! And the price can't be beat for the location. Website gave perfect directions to get to the hotel. All in all - great stay for us and we would definitely be back!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Yadira Christiansen","date":"2015-09-21 07:34:57 +0300"},{"content":"We spent two nights (8th and 9th August) at this hotel. Our room was clean and functional, but, as an end corridor room, it suffered from the fact that its entrance door was set at such an awkward angle that the entrance area seemed cramped – so that, for instance, you could not enter the bathroom unless the entrance door was shut. When we stated that we had not been pleased with the room on leaving, we were merely asked whether we had asked for a replacement on arrival, which we had not. We would much rather that a hotel simply gives us of its best unprompted rather than waiting for the stimulus of complaint before yielding up a fair deal. The rooms on the internet, which had lured us in, looked a lot better. We do not think that we got a fair deal. The breakfast arrangements in the restaurant were rather workmanlike. Food was brought and the waiting staff seemed to be constantly checking to see when they could clear away. We had some excellent breakfasts in our hotels in the States, but this was not one of them. Everything is separately charged and the quality is barely adequate, so that the quality to price ratio is poor. The Chancellor is not a bad hotel, but I would not rate it as a good hotel and would not rush to return.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":3.0},"author":"Mrs. Marjolaine Hermiston","date":"2015-02-28 07:51:25 +0300"},{"content":"Stayed here for a long weekend..Due to alte arrival, called the reception adn they could not have been more friendly and accomodating. I understand some rooms may face the back walls, but ours was facing the busy Powell street, and it did not fail to impress us that once the windows were closed, the noise was almost totally blocked. The lack of A/C was no problems at all as it was cold in the city, and there was a ceiling fan available as well. Bear in mind that it is a building almost 100 years old, but rooms have renovated and modern/boutique look...Great services at the reception and by the concierge..A great touch was the always available coffee and tea pots in the lobby...And the location!!!!!!!!...That in itself is worth the stay...","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Junius Waters","date":"2013-12-01 08:05:06 +0300"},{"content":"I really loved this hotel as it s in the middle of everything, yet the room is so queit. The staff are amazing and always there to help you. Free coffee all day. A very nice bar & restaurant offering good food at very good prices. I Will definitely book this hotel if I will be in San Francisco again. Thank you","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Robert Steuber","date":"2012-01-31 11:00:34 +0300"},{"content":"My mom and I stayed here last week in a room on the 10th floor facing Powell Street. We chose this hotel because my husband and I had stayed here about 7 years ago. The location is great. The rooms are very clean and comfortable. When we arrived, there was a box of chocolates and a bottle of wine waiting for us in the room (the wine in celebration of my mother's birthday). We ate breakfast in the hotel restaurant every morning. All of the staff were friendly and helpful. The rooms do not have A/C, but there is a ceiling fan and we found it more than adequate for the current temperatures. In fact, we turned it off at night because it was too cold. I highly recommend this hotel for people who want a clean, comfortable hotel in a great location.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Kattie Bosco","date":"2012-01-21 12:29:36 +0300"}],"public_likes":["Lyric Hartmann Jr.","Mariah Swift","Rodrigo Schoen","Jedidiah Ortiz","Jessie Turcotte"],"vacancy":true,"description":"Part of the Best Western chain of hotels. Sits opposite the Derby Mainline station.","alias":"Midland Hotel","pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}