{"title":"Yosemite National Park","name":"Tuolumne Meadows","address":null,"directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_TuolumneMeadowsLodge.aspx","checkin":null,"checkout":null,"price":"$107 per night","geo":{"lat":37.877474,"lon":-119.333795,"accuracy":"ROOFTOP"},"type":"hotel","id":33886,"country":"United States","city":"Tuolumne County","state":"California","reviews":[{"content":"5 day Getaway We just left the Resort, it was a well rested vacation. When you first arrive to Punta Cana International Airport, there is a $10 entrance tax you must pay. I've read peoples review before I came on this vacation basically people have high expectations, you get what you pay for. Not every member of the staff speaks english, but they are willing to try to communicate with you. Everyone was nice, and very attentive to our needs. During the weekend it was very busy, but during the week days it was peaceful. I came down during the Salsa Congress, lots of dancers, lots of energy, lots of fun during this weekend event. If you stay at the premium hotel (Bavaro Palace) you are allowed to use all the facilities from all the hotels, except the 2 premium restaurants that are not included.If you decide to go to a Restaurant that is above your hotel tier you must pay $20 per person to dine.The trollie that took you to each facility ran every 20 minutes or so maybe a little less, but everything is within walkin distance, it's a nice walk after a big diner. I felt very safe walking at 11pm at night. Be sure to pack atleast $100 singles, to tip people, tipping is a must especially when you want good service, the staff will remember you at each meal. I gave our waiters $3 at each serving, $5 to the maid everyday in an envelope. Bell hop $1 per bag. Bartender $1 per drink.Packing essentials: Sunblock or tanning lotion, bug spray, swim trunks, snacks chips, nuts etc. A bag of chips that cost 99 cents cost 2 bucks here. Coca Cola in the airport was $3 for a 20 ounce bottle. Camara or Camcorder. Room: You can order internet service for a daily fee of $5 not bad at all, cable is $8 per day its not worth getting, you get an additional 3 english channels, and you get to see Bourne identity 10 times in one day. There is a safe in the room, which you set the combination.","ratings":{"Service":3.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":2.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Meghan Lebsack","date":"2015-12-27 17:22:29 +0300"},{"content":"Wonderful vacation What a fabulous resort! Please do not be swayed by the negative reviews on this page. I have stayed at a number of all inclusive resorts and this is by far my favourite!! I can hardly wait to go back...I'm hoping this November!We were a group of 3 single girls all around 30. We have stressful jobs and just wanted to relax and that we did - with a little bit of partying on the side. You have access to the facilities of 3 resorts by staying here and we mixed it up to break the monotony. One day on the Caribe beach, one day by the Casino pool, etc. We visited the casino one night and the dance club - just a 5 minute stumble from our rooms - a few times as well. It was always packed and the music was good. Everything is accessible via the tram that comes by at pretty regular intervals.We had no problems with the food. Lots to choose from and you don't have to make reservations for the al a carte restaurants and you can go to them as many times as you wish during your stay which is something different from other resorts. The wine however...tastes like vinegar, so be warned. But otherwise the staff is friendly and helpful - only ran into one cranky staff member at the pool bar and her continually miserable mood became our source of amusement for the rest of the week.The entertainment staff are not pushy at all which I was happy about. I like taking part in activites as much as the next person...but somedays you just want to lie around and do nothing and thankfully we were never pressured to take part in any of the activites.The room itself was just big enough for 3 of us. 4 people would have been pushing it. But what does it really matter since you are barely ever in there anyways - just to sleep. The bathroom was clean and the water pressure in the shower was better than I get at home!AND to top it all off...I found out I was allergic to mosquito bites while on this trip and had to visit the Centro Medico on the resort for medical attention. The staff was friendly and made me feel so comfortable. But don't be concerned about mosquitos - the girls I travelled with didn't get one bite the entire week!!I don't have one bad thing to say about this facility. It was just great. One of the best vacations I've ever had.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":4.0},"author":"Vernon Koss","date":"2014-03-24 23:40:07 +0300"},{"content":"Wonderful Beach Front Just returned early this morning through SunWing. Left April 13th returning April 20th 2007Had a good time at the Barcelo resort. Would definitely go back. $ in US dollarsResortIncluded 5 HotelsBeach, Caribe, Golf, Casino, and the Palace (premium)Guests of the Beach, Caribe, Golf, and Casino can visit each others buffets and restaurant. Need to pay extra if eating at the Palace's restaurants. I walked everywhere, the landscaping was just amazing.There is a shuttle that looks like a train (I think 3 or 4) that is continuously running through out the day.I would say the average time to walk from one hotel area to the other is about 8-10 minutes depending on how fast you walk.The shops are expensive. Bring everything in your check in luggage if possible. For example. lip balm is 6 bucks at the beach store and 9$ at the resort store. And it was 7$ for a bag of chips, 5$ for a chocolate bar.The nightly shows were good, the usual make fun of the tourist shows. There was a big show every night that started at 10:30pm at the Casino hotel, I did not attend this show. High speed internet was available at the front lobbies of the hotels. 15 min for 3$, 30 min for 5$ and 60 min for 8$BuffetI ate at the buffets the whole week.Food was average.Breakfast rarely changed, the usual, bacon, eggs, toast, some form of potato, fried banana, cereal. Good variety of bread products. You can have a freshly made omelet made for you.Lunch and dinner usually included some variations of fish, pork, beef, and some kind of poultry. A pasta bar is also available. Good selection of fresh produce and dessert.There was a Grill that served pizza and hot dogs from 12 noon to midnight. The menu included a price but the pizza and hot were included in All Inclusive. Beach 3 km of powder sand Kept cleanLots of activities to keep busy withWater is beautiful when the sun is shining.You can walk to other resorts along the beach. There are shops in one area of the beach where you can barter for your trinkets.The animation team were kept busy during the day. There are photographers running around on the resort.Plenty of chairs available, no need to get up early to pick your spot.As well, plenty of trees to provide shade. If you want peace and quiet then stay away from the beach front area in front of the main lobby. Most of the activities happen in this area. WeatherFirst 1/2 of the week was sunny and very hot.Probably averaged 105 F with the humidity.The second 1/2 half of the week was okay. We had spots of scattered showers that didn't last too long. Room in Block 2 Room was standard, starting to show it's age along the ceilingSmall ants would pop up time to time in the bathroom area, but no big deal.Mini-bar was kept full.Room was cleaned everyday.20 US for extra TV stations for the week or I think 5 US a day.Safe in room, digital. you create password on first use.Bathroom include all the necessities. eg. shampoo, conditioner, hair dryer, An iron appeared on the 4th day of my stay. I left tips for the cleaning staff each day along with a gift from the dollar store. CasinoOpen 24 hours. It wasn't busy at the times that I went. I actually left with 75$ that I won on the slot machines.I hope this helps you out when choosing your resort in Punta Cana. I chose the Barcelo because of the activities and because of it's size. Adios","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Jesse Stiedemann Jr.","date":"2015-10-08 21:41:47 +0300"},{"content":"Toronto family has great week in Punta Cana We have just returned from a wonderful vacation in Punta Cana.We stayed in the Barcelo Bavaro Beach Resort for a week. The staff was great, friendly and helpfull. Activities were amazing so were the night shows. Buffet food was above average, the Steak House dinner place was excellent. The beach amazing, with the thousand of palm trees on the silver sand. The ocean water was great and very warm. Our room was cleaned every single day, and the mini bar was stocked every day. I would recommend this place to whoever wants to have a relaxing, great time.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Christy Kilback","date":"2014-04-20 23:34:54 +0300"},{"content":"USA - stay away! My family and I stayed at the Bavaro Beach Hotel Jan. 4-11. There were 9 of us all together. We had booked 4 rooms at the Beach Hotel but upon check in we were told we were going to stay at the Casino Hotel. A down-grade! We absolutely refused to be downgraded when every spanish speaking person checking in at the same time were being upgraded to the Palace. After 4 hours of arguing with the front desk we were told if we stayed at the Casino for one night we would get rooms in the Beach the next day. Our luggage was then placed out on the sidewalk where we waited for the tram. We then loaded our own luggage onto the tram (the only people seen doing this all week) and went to the Casino Hotel. The next morning we were called at 8:30am to tell us we had to check out of the Casino if we wanted our rooms at the Beach. Again we lugged our bags out to the tram and went back to the Beach. There we were told to come back at 3pm and we would be given our rooms. We went all day with no rooms. At 3pm we were told we could have two rooms but would have to come back at 4:30 for the other two. What a waste of vacation time. The treatment only got worse as the week went on. Those so called stocked refrigerators are a joke. After not having thiers restocked for three days my sons called the front desk to request that it be restocked and were told by the person at the service desk that if they were thirsty they could go to the bar. I requested a refund from the Hotel for at least the first two days upon our return. Instead they offered me an upgrade when we booked our next trip. Thats a laugh. Why in the world would anyone return to a place where they were so horribly treated. There are many beautiful resorts on this island. Please please please find another. p.s. We booked our trip through Sky Auction. Their vouchers are apparently not honored. I would suggest not using this site. You definitely don't get what you pay for.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":3.0,"Location":5.0},"author":"Oral Haley","date":"2015-12-22 10:38:54 +0300"},{"content":"You get what you pay for Barcelo Bavaro Beach Resort, Punta CanaRoom 3125October 29-November 5, 2006TNT VacationsAdvertised Price $699 per person all inclusive (with charter flight out of Boston)Actual Price with tax, insurance and express service added $856.65 per personThis was our second trip to Punta Cana, but the first to a Barcelo resort. We booked this trip on a whim due to the incredibly low price. Traveling were my husband and I, our good friends, and their 20 month old.Express Service was worth the extra approximately $30. per person that we paid. When we got to the airport (Logan in Boston) the line for check in was snaked in and out to about 70 people. We walked into the express line with only 2 other families ahead of us. We were seated together as we had requested when we made the reservations. The charter flight down on North American Air was delayed by about an hour because a light was on in the cockpit and it had to be checked by a mechanic. We waited in the plane during this time. This did not please the 20 month old we were flying with. Arival in Punta Cana was HOT. The temp was in the 90鈥檚 with a very high humidity. Make sure you change clothes ON THE PLANE as you will be walking a long distance on the tarmac from where North American is berthed at the airport. After clearing Immigrations and retrieving our luggage, TNT met us and told us where to find our bus for transfer to the hotel. Again, it would have been much more comfortable if we had changed before getting out of the plane.Check in at the Barcelo Bavaro Beach went very quickly. There were ample porters available to help with luggage and we were in our rooms within 15 minutes of arriving. Upon arrival we found out that buildings number 4 and 5 were closed completely and that the entire Barcelo Carrib resort next door was closed down. We were supposed to have reciprocal rights to eat and use the facilities there as part of the Barcelo resorts. We were placed in building #3.The rooms consisted of 2 full size (double) beds, a night stand, chair, small table, ample closet space, locking safe, and dorm sized refrigerator stocked with 2 large bottles of water, 1 Coke 鈥渓ight鈥?(diet), 1 Coke, 1 7-UP, and 2 Presidente beers. In other resorts we have found that replenishments of these items, with an emphasis on your personal preferences, was easily attained by leaving a note and a couple of dollars for the maid. This was not the case at this Barcelo property. Getting the refrigerator restocked here took an act of perserverance. The room also has a small deck with railing with 2 chairs and a small table. We were approximately 250 feet from the beach and a 2 minute walk to the pool, where all of the activites take place, as well as the nearest place to eat or drink.The beach is absolutely gorgeous. We were there at the very lowest of the low season, so there was never a problem getting chaise lounges and plenty of space for ourselves on the beach or by the pool. Punta Cana is ringed by a reef, so there is very little wave action at the beach. It was perfect for the 20 month old, but not so much for those of us who enjoy body surfing. The water temp and clarity was perfect and the air temp so warm that we frequently had to put the chaise lounges IN the water!!This is not a place you want to come if you are looking for gourmet dining. The resort had one buffet restaurant, one steak house and one Mexican restaurant. Of the three, the steak house is the best quality hands down. The Mexican restaurant was a disappointment with the exception of the appetizer bar. This was the best food in the restaurant. The entrees (fajitas) were tasteless. At the buffet there was plenty of food, but the quality of it was lower than what we have experienced before in all inclusive resorts. The fresh fruit was plentiful and perfectly ripe, the roasted chicken was consistently one of the best offerings, and there was usually enough offered in the salad area to make a meal. All of the rest of the meats were drown in tasteless sauces and gravies. There is a pasta bar available for lunch and dinner, but they heat the pasta and whatever sauce you choose (including pesto!) in a pan generously doused in oil. For breakfast, your best bet is the omelet station. The breads and desserts were of generally poor quality. The breads were very dry and hard. The deserts focused more on presentation than taste. For the entire week we were there, the Diet Coke selection of the soda machine was not available, which meant that you had to walk out to the pool from the dining room if you wanted Diet Coke with your meal. If you ordered a Diet from the wait staff, they would bring you regular Coke and just shrug. There is also take away pizza offered by the pool. It was a better choice than many of the lunch foods at the buffet. One other thing worth noting: The baby we were traveling with became sick (ear infections, see below) and despite seeing the doctor on site, the restaurant staff would not allow us to take food from the restaurant to feed him in the room. They finally relented and gave us a paper napkin to use to bring food away. They denied us a Styrofoam container that we saw staff with. This seemed unreasonable and extreme to us.There were supposed to be shows every night, but we only saw one performed at the 10:00 announced starting time. I don鈥檛 know if the rest were cancelled because the hotel was so empty or if they went on seriously late. There is a disco that opens at 11 pm. There is a casino at the neighboring Barcelo Casino Resort, but when we went in, half of the machines were turned off (including ALL of the video poker machines) and there were no more than a half dozen people sitting at slots and table games.There is a train-like tram that runs between the Barcelo resorts so that you can visit and make use of the facilities of all of them, with the exception of the 鈥減remium鈥?Barcelo Palace where you could not eat nor drink as they are a different level resort (and presumably have better food and drink)The busiest bar is the beach bar. The Presidente beer on tap is pretty good. I made the mistake of ordering one margarita. It was horrible. I could not drink it. The tequila they used tasted like rubbing alcohol. My recommendation is to drink rum drinks (the rum is good quality and they are not stingy with it) or the beer. Bottled water is plentiful also at the bars.The service at this resort would only get a mediocre rating from me. At the all- inclusives we have visited before, the service was much better and more personal. The wait staff at the bars would not even make eye-contact with us! Despite tipping and leaving notes, we had trouble with our needs being met by the housekeeping staff. Our friends had a bottle break on the tile floor when the refrigerator in their room emptied itself in the middle of the night, but despite calls to the front desk, the broken glass was not cleaned up until regular rounds the next morning. This was especially problematic for them as they had the 20 month old with them. We did get exceptional service from one server in the buffet restaurant, but she was definitely the exception.We had the occasion to visit the medical center at the resort when the baby came down with double ear infections. The doctors we saw there were tremendous. They were caring and compassionate, and very professional. An office visit and Amoxicillian came to $90.00. Very reasonable. Check out was time consuming and pointless. Since this is an all inclusive resort, there were no added bills to be paid at check out, but you had to wait in an interminable line with only one hotel employee working in order to get a 鈥渃heck out鈥?ticket to board the bus back to the airport. We had our transfer vouchers but the TNT rep could not accept those without a piece of paper from the hotel saying we were checked out.One other thing worth noting: Punta Cana is heavily visited by Europeans. This impacted me in two ways. One, we were in a vast minority of English speaking guests. While the staff at the hotel could understand our needs, I never realized how much the interaction with other guests augments my enjoyment of a vacation. For the entire week I do not think I had conversations with more than a dozen people who spoke English. I realize I was in another country, but I have traveled many times, including another trip to Punta Cana, where there were many more people who spoke English. The other way the make up of the guests made an impact is that the overwhelming majority of guests were smokers. Even on the beach in the open air, we had to move a number of times to get away from the pervasive smell of cigarette smoke.Bottom Line. You get what you pay for. This was a tremendously inexpensive vacation for us. The beach was beautiful, the weather was wonderful, and we were not working. However, after going to the Punta Cana Iberostar, and the Palace Resorts in Cancun, I think I would rather have paid a little more for the added value, service and quality that they offer.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Ethelyn Schumm","date":"2012-05-13 01:02:36 +0300"},{"content":"Never again will I go back. The service was horrible and the food horrendous. We went with a crew of media of a radio station and they all including my room had a leak problem. We all got sick from our stomach because of the disgusting food. The beds were hard as plywood. Most of the staff had attitudes and were unfriendly. I have never on vacation and wanting to come back home so bad.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Camylle Howell","date":"2013-02-09 09:32:24 +0300"},{"content":"Rude staff, dirty, out-dated hotel, don't use this resort! I went with an open mind after reading all of the reviews. I thought the hotel couldn't possibly be that bad. I was wrong. The staff was extremely rude. Tipping did not help. Often the tips were not even appreciated for drinks or dinner, but EXPECTED! I didn't see anyone else tipping when we were there from May 8, 2006, through May 15, 2006, and I assume it is because of the poor service and poor attitudes.We had one waitress who was cheerful and polite. We actually asked her if she was from the Dominican Republic or somehwere else because of how rude nearly everyone else was. Even the front desk staff was rude. We tried asking about the sunfish sailboats (which are supposed to be all inclusive), and were told that there weren't any! We asked further and found that there were approximately two for all five hotels! They would gladly rent you a more expensive catamaran though! We tried asking the front desk other questions and were never given answers. We gave up on that.Our room had a running toilet and a shower head that kept falling. After several attempts to get this corrected, we just gave up. The room was never cleaned well. Sometimes we would get enough towels and wash cloths, sometimes not! It just depended on the day. Our room had the dripping air conditioner and bad sliding door to the patio, along with the ceiling that wasn't quite right in the bathroom, like many other reviews. The hotel definitely needs updating.At the bar area you definitely had to ask for alcohol in your drinks. Even then, if you weren't watching they would sometimes try to skip it. Tipping there didn't help either. We received the same drink from them, even though it had two different names on the menu.I have to say that the beaches are beautiful. The grounds are kept very well, except for our pool area which had a light nearly hanging out into the water with wires exposed!We did take two excursions. One was to the Manati Park which was highly overpriced and the other was on the Caribbean Fesitval. The Festival is a boat where you go snorkeling; that was fun.The food was terrible. The steak house was decent but my husband and I both got sick beginning the night we ate there for the first time. Stay away from the fresh vegetables--no salad, etc. We preferred the pizza over everything else we ate.We have never looked forward to going home so much!","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Roslyn Halvorson","date":"2013-11-11 16:20:33 +0300"}],"public_likes":["Elza Ankunding","Natalie Schroeder","Mrs. Aimee Gleichner"],"vacancy":true,"description":"Open from mid-July through September, Tuolumne offers 69 tent cabins in Tuolumne Meadows.  These tent cabins have wooden frames, a concrete floor, and canvas walls.  Bunks beds, linens, candles, and a wood stove are provided, while bathrooms and showers are located in a central facility.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}