{"title":"Birmingham (England)","name":"Premier Inn Birmingham City","address":"3-6 Waterloo St","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48042,"lon":-1.8996,"accuracy":"ROOFTOP"},"type":"hotel","id":3619,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"My husband and I stay in Kimpton Hotels whenever we can, because they offer excellent value, have fantastic staff, and are in great locations. The Hotel Monaco Chicago is located close to the river in the Chicago Loop, and they offer spacious rooms with a river view that cost just a bit more than their standard rooms. The river view rooms have deep window seats with cushions, and you can relax in the window and watch the river traffic and the scene around you. The staff couldn't have been better; they were cordial, professional, and caring. The hotel is within walking distance of many good restaurants, Millennium Park, and public transit stations.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dortha Okuneva","date":"2015-09-03 17:54:45 +0300"},{"content":"I had to stay an extra night in Chicago for a business trip and decided on Hotel Monaco from the cute whimsical photos of the rooms on TripAdvisor. My check in was smooth and efficient. I was given a room on a higher floor with a wonderful view of the Chicago River. The room was very spacious, with striped walls, plush red velvety curtains, and a giant mirror facing the bed. I loved the cushiony window seat. The bathroom was stocked with nice Aveda toiletries. The location of the hotel was wonderful. Right along the river for a nice stroll, and 2 blocks from Michigan Avenue, where there are tons of shops and restaurants. The hotel offers a Cocktail Hour in the evening as well as coffee in the mornings. A total added bonus!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Alana Koepp","date":"2014-04-04 04:41:13 +0300"},{"content":"Ok, not the regular hotel for a convention, but the price was great. Better to stay there with your girlfriend/ wife. Excelent location, \"kitsch\" decor - but the good type, on purpose. Accessories on the closet were funy indeed. Kimpton is growing fast and with all the merits. I´ve had dinner at big named hotels nearby and - what a difference: unpersonal staff and old, eighties ambience. A little bit of style doesn´t hurt, and, if the price is right, you have a killer deal.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Corine Douglas MD","date":"2013-02-15 15:22:59 +0300"},{"content":"Stayed at the Hotel Monaco September 24th-27th. Had a Queen-Queen Room on the 12th Floor and it was quiet and comfortable. The room was well laid out, large, clean and with a nice touch of luxury. Staff could not have been more helpful and attentive. Located at the river and across from Trupp Hotel always provided some beautiful scenery.The major shopping, located on the Magnificent Mile was fairly close, but required quite a few blocks of walking (bring your tennis shoes) or a $4.00 cab ride. The \"L\" (subway) at the Randolph/Wabash stop is just two blocks away and will give you access to most of the other lines covering most of the city. The hotel will have a major redo this December, but I have stayed in relatively new places that did not look as well kept as this property!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Maribel Mitchell","date":"2015-06-26 14:08:00 +0300"},{"content":"Have stayed in the Hotel Monaco on business a few times about 7 years ago and nothing has changed. And that is a GOOD thing. The decor, style and ambience of the hotel have held up well and are top notch. We were upgraded to a great Riverview room and absolutely loved the window seats and the view from the room. Perhaps the best thing about the Monaco is the location. Right on the bottom edge of the Miracle Mile and at the top of Chicago's Loop district - with easy access to everything - you could not ask for a better locaiton to take in all the city has to offer. You can almost walk to everything depending on how ambitious you are. We walked (with kids aged 8 - 14) from the hotel to the Shedd Aquarium, the Miracle Mile, the Willis Tower (formerly Sears Tower), Navy Pier, etc... and while some of the walks were a bit long (1.5 miles) they went by quickly. Easy access to the \"El\" (elevated train) only one block down the street from the hotel is also a plus as is the immediate access (and view) of the river where you can take water taxi's and sightseeing trips along the river. As in all big cities parking is a bit much ($42 per day) which is in & out access (valet only attached to the hotel) but you can choose to park in a \"self-park\" nearby for approx $30 per day. On this trip, we chose to take the Amtrack train which was a good option coming into Union Station and a 5 minute cab ride ($7.50) to the hotel worked out well. On departure, (back to Union Station) we took a water taxi from Michigan Ave river bridge area (about 1 block from hotel - $2 per person) and the water taxi ride took about 10 minutes to the Madison Ave dock (about 2 blocks from Union Station). So the water taxi ride was well worth it to see the city form a different perspective. Back to the Monaco - the Hotel was 14 stories and we had a room on the 14th floor (1408 to be exact) which was a double queen bed room with PLENTY of space with two window seats to take in the view of the city. In fact, you could sleep on one of the window seats overlooking the river, views of Willis Tower, etc.. (which one of us did and I must say it was pretty cool). The service was excellent and attentive, we never had to worry about a thing. Being a boutique hotel, the Monaco is the perfect combination of medium size and great service. We definitely did not feel like we were \"just another guest\" as sometimes happens in larger hotels. No pool here but who needs one with so much to do in the area. They do have a decent workout room. Short walk to Millenium Park, Buckingham Fountain, Miracle Mile, Theatre District, etc... who could ask for more from a place to stay. And the AAA rate was more than reasonable if you can get it. All in all, one of the best vacations ever and in large part due to the comfortable hotel and location which we were lucky to get. Thanks Kimpton and thanks Hotel Monaco. Our new favorite. We will be back. Note: The Monaco also has sister properties (The Hotel Burnham and Hotel Allegro) in the same area - which I have stayed at while on business years back - and these are similarly well run...that being said, you just can't beat the location of the Monaco. In my opinion, the Burnham is very cool for it's architectural history and feel and the Allegro is somewhat of a \"hip\" style - but each of the hotels definitely deserves a four star rating. Note: While I hate to even mention this subject when speaking of the Monaco...I was quite concerned when looking for places to stay about the \"B e d b u g issue\". We all know it is an increasing problem in many hotels. I can safely say The Monaco has no such problems that we could tell. Totally clean. Trust me, I looked. No problems at all. In fact, teh room and beds were so clean and comfortable, I slept great.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Chesley Jacobi","date":"2012-01-08 03:48:12 +0300"},{"content":"My plan yesterday was to travel by train Washington to Chicago and continue to Arizona. Three hours before departure, Amtrak called me that the train was cancelled. Not wanting to ride Greyhound overnight, I quickly booked a one way flight to Chicago, and figuring that Amtrak owes me a hefty refund, booked the Hotel Monaco, so these should balance out. I was delighted with the Hotel Monaco, this being the third Kimpton Hotel in which i have stayed. I appreciate their sleek, artsistic decor and nice little touches. The staff were most helpful and I was recommended Andy's Jazz Club a few blocks away, where I spent an enjoyable evening. Referring to some of the other reviewers comments, I was on the back of the building and looked into a bick wall. Not a problem - the room was gorgeous. Now I don't mean to be too picky, but for the price of the room I do note these two items: the curtains did not completely close and the bathtub was very ordinary looking. Considering the thoughtful decor and fixtures, I am surprised that they decided to leave a bathtub which looked like the house I grew up in. Small matters - even though my travel plans were changed, my time in Chicago has been very good.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lacey Stanton","date":"2015-01-17 15:07:54 +0300"}],"public_likes":[],"vacancy":true,"description":"As typical as a Premier Inn gets, it is situated in a nondescript 1970s building with simple rooms - but just around the corner from to the St. Phillip's cathedral.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}