{"title":"Inverness","name":"Bazpackers","address":"4 Culduthel Rd","directions":null,"phone":"+44 1463 717663","tollfree":null,"email":null,"fax":null,"url":"http://www.hostel-scotland.co.uk/hostels/index.asp?ID=47","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.47483,"lon":-4.22507,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12237,"country":"United Kingdom","city":"Inverness","state":null,"reviews":[{"content":"Stayed for three nights in the motel part. This is the real retro. I expected to wake up and pull back the curtains and see Vista Cruisers and Ford Granadas in the parking lot. Beds were comfortable. I had no problem with hot water like another reviewer. The place is bigger than expected, The two level motel parts are laid together making two courtyards, with two pools. If you are expecting a Westin or even Hampton Inn experience, this is not it. The bedspreads are ugly, the carpet can be buckled, the tile may not line up perfectly, but for a comfortable bed, a drive-up motel room, and the possibility of catching Legionaires, this is the place. I will be back for a $45 night!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Cassandre Lynch","date":"2012-03-22 23:40:07 +0300"},{"content":"This was my first stay at the Ramada Gateway in Kissimee and I really enjoyed it. I went with a friend and our intentions were to choose a nice, clean, safe and economical hotel close to Disney, and this was a last minute choice, however, a good choice. The hotel is pretty big, with tower rooms on one side and rooms overlooking one of their pools on the other. Unfortunately, we didn't get to really venture out into the hotel and look around and see everything they had to offer, because Disney would tire us out and we'd leave early morning and come back late at night. Before staying here, I read the suggestions that the tower is the place to stay, and that's where we did. The room was nice and spacious for two young females. It came equipped with a fridge, microwave and storage space to put groceries; we definitely made use of each. A problem with our room was the ac...it would come on/off when it wanted. Honestly, the hotel was pretty bare. It wasn't really active; we didn't see it thriving with people, but that was fine with us. The only time we'd see a huge amount of people at one time was in the morning, waiting for the shuttle to Disney parks. There was a restaurant, and a diner type of food area, we didn't try either, due to the fact that we had purchased food at the Walmart, enough to last us the 5 days we were there for. The pool area that is overlooked by the pool area rooms was pretty bare-hardly anyone out there. In addition, I wanted to clear up some things that were said in some of the reviews: 1) Walmart and/or Target are not within walking distance, we actually had to drive about 15-20 mins to get to a Walmart. 2) The outlets (international drive) and universal are not close by. 3) We didn't encounter any \"sticky fingered\" maids, ours were pretty nice. If your intention is to go out to Citywalk every night be prepared to spend around 40$ on a taxi each way from this hotel. All in all the hotel was a great, economical stay, but if you search to have a night life and party it up, this area isn't really the best for that.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Elouise Cremin","date":"2014-11-27 23:44:31 +0300"},{"content":"We stayed at this hotel on a Saturday night after spending the day at Disney. Check-in was effortless. We ate dinner in the hotel's restaurant (both had pulled prk platters):, the food and staff were wonderful and cost the same as our mediocre Disney hamburger lunch. We went back for the breakfast buffet - also very good value. The rooms are older and could use some \"plussing\" (i.e., extra pillows and blankets in the room) but the bathroom is very spacious. What made the stay extra special was the staff. IMO, from the check-in desk personnel to the restaurant staff - Disney of late could take some staff hiring /training lessons from the Ramada Gateway folks. We feel this is a wonderful value and plan to stay here for our monthly Disney/Orlando weekends.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Clare Mante","date":"2015-10-29 09:39:54 +0300"},{"content":"Stayed 4 nights, great position for Diz and close enough to restaurants and shops if you want to walk, reception helpful but didnt use bar or onsite cafe, we went out, fridge in rooms, which were clean and ok for money, we had stayed in several hotels on our 2 week vacation in florida, this was probably best value at $39 per night, i know there is more competition in Kissimmee though.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Freeda Kiehn","date":"2015-10-01 16:48:27 +0300"},{"content":"I just checked out of the ramada plaza hotel on Saturday august 13th. I would like to say that I find some of the reviews misleading and down right rude. I loved my stay. The staff was more than willing to help and accommodate myself two kids and my fiancé. We were due to arrive the Saturday before but ran into a lot of traffic coming from Massachusetts. I called the hotel and told them we were running late. They told me no worries and they would see us when we got there. The check in procedure was very easy and went very fast. We arrived at 2:30am on Sunday. They got us into our room very fast as we were very tired. The security gaurd actually helped us find our room and helped us get in. I would agree it's somewhat of a maze but was happy for the help. We stayed in the motel side that night but decided to upgrade to the tower later Sunday. The room was fine but the kids wanted to use the elevator. The staff was more than willing to accommodate. The pools were very nice and the breakfast buffet was more than worth it having two children. ( kids eat free) the grounds were always kept nice and I saw no trash anywhere. We are already looking to book our next summers stay at the ramada plaza hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Kathryn Price","date":"2012-02-28 17:10:47 +0300"},{"content":"Made a transient overnight stay in this hotel. Luckily I did not book it as our main hotel. Anyway, first, as a positive comment, the front desk guy was very accommodating. Thats about it for the positive. The room, not so clean. The room we were given had the smell of strong body odor, the carpet also had an undescribeable smell. The bedding has a lot of stains on it, which I discovered in the morning(we arrived at 1 am by the way) which gave me the creeps. The blanket and comforter smelled like it has not been laundered. I'm a well travelled person and I have stayed in hotels in a lot of countries and I think this is the worst I have stayed in. As for the price, luckily, I had a discount from where I booked it. It's not worth the price they ask their clients to pay for.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":2.0},"author":"Kassandra Jerde","date":"2013-03-25 01:10:51 +0300"}],"public_likes":["Miss Antwan DuBuque","Gianni Jerde","Theron Miller","Lizzie Buckridge","Jewel Glover","Kacey Reichel","Morris Brekke Sr.","Harmon Herman","Earlene Beer Sr."],"vacancy":false,"description":"Inverness, IV2 4AB, Clean and informal. This hostel is quite small so booking in advance is advised. They have a resident cat called Polly. £ 15 Dorm.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}