{"title":"Birmingham (England)","name":"Macdonald Burlington Hotel","address":"126 New Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47879,"lon":-1.89867,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3645,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"The Palmer House is an historic hotel located in the center of the downtown loop area. It is a block from the art museum, park on the lake and very close to most major downtown theatres, greek town, and the Golden Mile. It is a grand beautiful old hotel with a magnificent lobby. The service is fantastic. Philippe at the concierge desk couldn’t have been more helpful, and my check in attendant was equally wonderful. The rooms could use upgrading to join the rest of the hotels in the 21st century, like flat screen tv's and wireless telephones. The room was great. Although, I must say, in our party of three, the sizes of the rooms varies, so ask for a big room. One of our party was in a room so small they could barely get their suitcase in, but my room was huge, with a hallway to the bathroom. As a Hilton Honors member, I received free internet discounted gym entrance and the opportunity to partake of the free breakfast and happy hour snacks every day. I am HH Gold. The room was nicely decorated and the bed was very comfortable. The TV is not even a flat screen old style. It is a relic, and sat far from my bed, making it tough to see. There was no coffee maker, but they are available upon request. The room safe was big enough for the largest of computers. There are very nice amenities in the bathroom. Water pressure was perfect and the water was hot. The downside of this hotel is the extra charge situation. Everything costs extra. There is no mini-bar because they want you to order from room service. Coffee is $8 plus $2 delivery charge and 21% service charge, plus tax. The gym is $10, internet starts at $14.99 for a few hours and $19.99 for a day. A scotch in the bar was $17 with tax and tip. There are plenty of places to eat in the neighborhood like Au Bon Pain which has a great lunch. You can watch your favorite TV show if you missed its initial run for $4.99 and movies are available at a much higher cost. I highly recommend the Palmer House Hilton. It’s a wonderful old hotel, just watch your wallet!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Armando Walter III","date":"2014-11-17 06:40:59 +0300"},{"content":"My cousin and I stayed here over New Year. The 'el' was so close to the hotel, you can hear it. It's fine once you get used to it, but needs a little adjustment before you do. Our room was lovely, mainly I think because we had a corner room which made it light and airy, with a view down to the lake. Also, because we had two beds, whihc meant it was reasonably sized. We heard a lady in the elevator complaining about the size of here room and when we went past a room beign serived and could see inside it, it did seem quite small. The bathroom was good with great products, the bedding was lovely and the location was fabulous. Most things were well within walking distance. There are plenty of places to eat close by, so no need to starve here. Our complaints were around the lack of... no kettle for tea or coffee making in the room. Why? And wifi was available, but at the most rediculous prices! It was something like £14.99 for basic (good enough to check your emails) a DAY or £19.99 for the faster stuff. As my cousin said - how come most of the coffee shops provide free access while you sip your $2 coffee, yet hotels charging huge amounts of money can't offer the same service? I'd advise you to go for a coffee to check your emails! Our other complaint was about the pool area. the pool is TINY, no changing facilities and the jaccussi was out of order for our whole trip, which was rubbish. We were really looking forward to a nice soak after a lot of walking and were hugely disappointed that it wasn't in working order. That aside though, we had a nice visit. The hotel lobby is as amazing as everyone says - but all manner of people can wander in and out of the area unchallenged, so make sure you lock everything up okay. We recomend the gage, which is on Michigan Avenue for a lovely meal. And finally, you can print your boarding passes out in the buisness centre for free :) The rest of the internet charges are high in there, but it was great to be able to pop in and print off my boarding pass with no hassle at all.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Aglae Hessel","date":"2014-05-15 02:32:36 +0300"},{"content":"Whenever I travel to Chicago, I stay at the Palmer House if at all possible. It is very close to the metro and bus stops as well as the theater district and restaurants. The inside is just beautiful as well. Seems that there are many different sizes of rooms, some are a little small but still comfortable and some are quite large. All are clean and very well decorated. Noise has never been a problem for me at the hotel. The staff has always been helpful. This visit I chose to attend a BlackHawks game...they provided all the necessary details on what buses to take there and back and it definitely reduced my anxiety.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dimitri Krajcik","date":"2015-05-28 17:33:58 +0300"},{"content":"My wife and I stayed just two wonderful nites on the 11th. and 12th. of September. We will be doing this for the balance of our married life. Thanks Palmer House for an outstanding experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cathrine Harvey","date":"2015-12-08 04:39:45 +0300"},{"content":"For our anniversary, my husband and I stayed 3 days 2 nights. Hearing great stories from my grandparents who stayed quite frequently in the 60s-90s, we were very excited. I'm a Hilton Honors member so check in was fast and easy. We stayed on the Executive Floor which is worth the price given all that's included. The service and food from the Lockwood was excellent. We did Tea Time and Dinner with them. Ask for Javier. If you can, buy the Parking package as parking is expensive especially if you're staying more than one night. Locatrion was great. We walked to Michigan avenue for shopping. The room was excellent. We had 2 bathroom and closets which was prefect. The bed was very comfortable. The only issue we had was the sound-proofing as we could occationally hear people above us moving furniture, but it is an older hotel. Overall it was an amazing weekend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Leonora Lehner","date":"2014-03-01 01:00:33 +0300"},{"content":"I stayed here for three nights in October while I was attending a conference, and enjoyed the experience very much. I had booked a pretty cheap rate (it was under $200) and after reading on here that some of the rooms were quite small, I decided to try for the e-upgrade that the Hilton offers in their email confirmations. The one I ended up with was on one of the two executive level floors, and I paid $35.00 a night for the upgrade, which I believe was well worth it. When I checked in I was a little taken aback by the long check-in line, but it moved very quickly. The person checking me in didn't mention my e-upgrade request, so I asked about it and he checked around and found me a room on the 22nd floor. I liked staying on the executive level. It had dedicated elevators, and what elevators they were! They were very old-fashioned, and had an upholstered leather bench to sit on in case you got weary on your ride up. My room itself was very good-sized, it had two double beds and a sitting area with a TV and a comfortable but very worn easy chair, a chair and desk and two tiny bathrooms. I have to say though, I literally laughed out loud when I walked in the room because the interior design was so old-fashioned. The beds were covered with elaborate, tapestry-like covers and the elaborate draperies looked like they came from Marie Antoinette's boudoir. I did check out the hospitality suite on the 23rd floor that was for the executive level guests one night, and it was quite impressive. They had a full bar (non-alcoholic drinks are complimentary) and an amazing spread of hot and cold snacks, including things like cheese and crackers, eggrolls, hummis, etc. I ordered room service a few times and it always came around the time they said it would. I would say the room-service food at this hotel was a cut-above the fare you usually get at this type of hotel. My favorite part of staying here was the lobby, it was just breathtaking, and I don't think I ever walked through it without a big smile on my face. I had lunch in the restaurant just off the lobby one day and really enjoyed it. This hotel seems to be the hub of a lot of activity in Chicago. One day I walked outside to see a huge police presence, and found out that former President Clinton was speaking at a fundraiser at the hotel that day. I later passed the concierge desk and overheard the concierge assisting a guest with getting tickets to an event the First Lady was holding there in the future. Overall I fully enjoyed staying here, but it's not for everyone. I can think of a few close friends who I would never recommend this place to, because they prefer modern W-type hotels. But if you like grand old places, give it a try!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Zora Kuhic","date":"2013-06-23 16:37:53 +0300"},{"content":"I attended a business meeting held at the hotel and had extended my stay by two days to see the sites with my wife . I observed the operation both from attending a conference as well as just two folks staying at the facility. I would rate the overall service, quality of the food,and appearance a reflection of the staff at all levels which i found to be sincere and appreciative.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Nico Gutmann","date":"2015-08-28 07:26:14 +0300"}],"public_likes":[],"vacancy":false,"description":"An luxury hotel in Edwardian style and history to back it, directly facing the New Street station.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}