{"title":"Chamonix","name":"Chalet Vert et Blanc","address":"997 route des praz","directions":null,"phone":"+33 4 50 34 9786","tollfree":null,"email":null,"fax":null,"url":"http://www.vertetblanc.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":45.93812,"lon":6.87844,"accuracy":"ROOFTOP"},"type":"hotel","id":5335,"country":"France","city":"Chamonix-Mont-Blanc","state":"Rhône-Alpes","reviews":[{"content":"I can't say anything more than has already been said. After staying here, staying anywhere else in Las Vegas would feel second rate.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Euna Schmeler","date":"2013-08-09 03:56:16 +0300"},{"content":"The rooms are fantastic. breakfast was great. 2nd time this year to stay at the Encore. Location is one of the best except for taking the tram. Spa and massage great, please try. Love it, I will be back. My only problem where the concierges at the Tower suites, they where not very reliable with dinner reservations.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Zola Muller","date":"2014-12-01 06:34:54 +0300"},{"content":"In a city where there are many choices to indulge your senses the Encore does it with elegance and service. This is one of the few hotels with a casino where the smoking didn't bother me!! And that's saying a lot. Beauty is everywhere. Rooms are luxurious and very comfortable, breathtaking views of the mountains and city from higher floors. Located at the end of the boulevard made this resort quieter than most which I liked, and it was very easy to maneuver around in. The connection under ground to The Wynn through the shopping mall is awesome! The cleaning service, concierge, front desk,, wait staff were all very courteous and prompt. Room service was the only slow service we encountered. Our room overlooked the pool toward the strip and the only con was that we could heard the nightclub music and people yelling even from the 23rd floor. If this would keep you awake get a room facing the mountains on opposite side of hotel. We will definitely stay here again!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Deangelo Fahey","date":"2013-09-04 11:51:31 +0300"},{"content":"Stayed here for 3 nights on Nov 2011. Got a room on the 33rd floor above the swimming pool and facing the strip and golf course. Everything about the hotel is first class. Even the seats to play the slot machines were more comfortable than other casinos. Everything is clean and still feels new. The rooms have floor to ceiling windows, A separate seating area with a work table and couch. The TV sits in between the bed room and sitting area and it swings around so you can see it in either room. Small TV in a huge bathroom. Soaking tub and separate shower. Probably the best room I have been in Vegas.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Jedidiah Wilderman","date":"2014-07-28 14:10:21 +0300"},{"content":"Best hotel in Vegas, small by Vegas standards, nice decor, goog gaming floor, smaller more boutique less diney world like venetian or MGM. Good rooms, double rooms are great, cheap for standard. Good restaurants, pool parties are great, good Cubanas. Good for singles and couples, no kids! Happy days.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Alvis Russel Jr.","date":"2014-12-18 11:45:50 +0300"},{"content":"This was our first stay at Encore/Wynn. We spent a great deal of time in both the Wynn and Encore and were very pleased with the appearance and overall attention to detail. We enjoyed our stay very much and hope to return soon. The Garth Brooks show was fabulous.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Anderson Lind","date":"2015-01-24 10:15:43 +0300"}],"public_likes":["Marilie Roob","Dr. Elenor VonRueden"],"vacancy":true,"description":"Provider of luxury catered and self catered accommodation in Chamonix.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}