{"title":"Death Valley National Park","name":"Wildrose","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"Free","geo":{"lat":36.26585,"lon":-117.18844,"accuracy":"APPROXIMATE"},"type":"hotel","id":7396,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"been to this hotel several times and I noticed the attitude of the mgr and the staff very discourteous went to get a cup of coffee in the lobby and was told very curtly for registered guests only its the last ime I stay there","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Location":2.0,"Rooms":2.0},"author":"Isabel Grimes","date":"2013-09-15 06:02:42 +0300"},{"content":"We stayed at the Sevilla Inn in 1997 as part of our honeymoon. It was our first trip to Florida. The initial part of our stay was quite comfortable. The room was tidy and the rooms were acceptable. We were quite surprised at the size of the pool (it was quite small) and did not appear heated. One night that we were staying there, the alarm went off and we never did understand what had happened. Other than that, the hotel itself was fine. One incident saw them coming to our room to deal with the toilet being plugged and them accusing us of having put disposal women's pads down there, even though my wife had no such need nor did we do such a thing. Unfortunately, the clearest memory of the stay was upon checking out when we were advised that we would be charged for \"ironing burns to the carpet\". We were actually scolded at not using iron boards which were available to the rooms, yet there were no postings seen of such availabilities (we had ironed our clothes over blankets laid out on the floor). Although we had not seen any damages to the carpet, the staff became insistent that they were there and, quite frankly, made us very uncomfortable at the tones of their voices. They charged us $20.00 for the supposed burns, which we did not argue and paid, and we were off. We have been back to Kissimmee a few times since, but have never since considered staying at the Sevilla Inn. I am still not sure if the burns were actually there, but giving them the benfit of the doubt, our biggest complaint was with the manner in which they treated us. They weren't very friendly whenever we had to interact with them.","ratings":{"Overall":2.0},"author":"Vernice Williamson","date":"2013-07-01 06:28:40 +0300"},{"content":"If you plan to spend most of your time out of your room, this place is great. Walking distance to many sites, yet really inexpensive for a center city location. If you want amenities and extras, this is not the place for you, but if you just want a place to sleep and be relatively near a lot of the attractions for a affordable stay, I would recommend this Travelodge. The breakfast was basic oatmeal, cereal, bagels, which is all we eat for breakfast anyway, so it was fine. Might not have the cleanest bedspreads or carpets, but for the low price, it was definitely tolerable. Staff was very friendly and helpful.","ratings":{"Overall":3.0},"author":"Laverne Emmerich Jr.","date":"2012-09-26 09:40:09 +0300"},{"content":"This hotel is great! The staff is of similar quality to a 5-star hotel. I was there for over a week and they were always very pleasant and helpful in making my experience so good. The hotel is very clean and they take great care of the property and the rooms. The bathroom was exceptionally clean and the shower had great pressure and never an issue with no hot water or anything. The free continental breakfast was a great way to start the day - cereal, yogurt, muffins, bagels, oatmeal, juice, and coffee. Also, there was free wireless internet that was very reliable and I never had a problem with it. Travelling on business, these free amenities were a great addition. The location is fabulous - it is literally next to the convention center (less than a 2 minute walk). The hotel is a block away from Reading Terminal market and the subway station. There are a lot of restaurants close by and only a few blocks away from the Art Museum and other Philly attractions. Other reviewers mentioned the homeless shelter; yes there is a shelter 2 doors down but there is not an issue at all. They don't disturb passer-byers and after 5pm when the shelter is closed, there is no one around outside so safety is no issue. This hotel is HIGHLY recommended and I would come back here in a heartbeat.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Eileen Cummings","date":"2015-01-02 16:08:29 +0300"}],"public_likes":["Kieran Gusikowski","Hettie Morissette"],"vacancy":false,"description":"(Year round).  Located at 4,100 feet in the Panamint Mountains, Wildrose has 23 sites, with tables, fireplaces, and pit toilets. Drinking water is available during the Spring, Summer, and Fall. Although it is windy enough that you'll need to take care to secure your campsite, it is still high enough in elevation that it presents more pleasant weather for camping than the valley floor. Being farther away from the more popular areas of the park induces a quieter setting as well.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}