{"title":"Torquay","name":"Torcroft Hotel","address":"28-30 Croft Road, Torquay, TQ2 5UE","directions":null,"phone":"+44 1803 298292","tollfree":null,"email":"info@torcrofthotel.co.uk","fax":null,"url":"http://www.torcrofthotel.co.uk","checkin":null,"checkout":null,"price":"from £50","geo":{"lat":50.4662,"lon":3.5337,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":30637,"country":"France","city":"Hergnies","state":"Nord-Pas-de-Calais","reviews":[{"content":"I have stayed in Key West many many times. This was, by far, the best hotel we have stayed at. The staff are the best, most courteous, overly helpful we have come across. The location can not be beat. To sit at the pool and watch all sorts of boats go by in the Gulf while sipping a nice cocktail is pricless. We found the prices at the hotel restaurant and pool bar very reasonable. We got upgraded to a junior suite with a gulf view which was magnificent. The room was huge and beautifully decorated. I could not recommend this hotel more highly and will find it hard to stay anywhere else in Key West again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alexis Abernathy","date":"2013-02-01 05:42:31 +0300"},{"content":"This is a perfect location in Key West at the very end of Duval next to Mallory Square where the sunset is celebrated every night. Almost all attractions are within a few minutes walk. We had an ordinary room but it was spacious and overlooked the ocean and Mallory Square. It had a King Size bed and sofa bed. The bathroom was good. The provided cosmetics are excellent. We had a good sized balcony overlooking Mallory Square. The service was good. We had no time to test the hotel facilities as there was so much to do in Key West. I would recommend the hotel without reservation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lynn Berge","date":"2012-01-28 17:34:35 +0300"},{"content":"My wife and I stayed here the week between Christmas and New Years. We usually stay at 4 and 5 star hotels. This hotel has a 5 star price but it is a low to average 4 star property. There are other hotels in the same area that I would check out first before opting for Ocean Key. That being said, our suite was very nice with a great view of the ocean and Mallory Square. However, unless you get a room on the 5th floor your views of Mallory Square and the Ocean are likely to be obstructed by the ever growing palm trees. The bedroom had small non flat screen television not consistent with a 4 star property at 500 bucks a night. We did hear our neighbors from time to time. I think the walls could use some sound proofing. The staff, all young people under 30 were very helpful. The Hot Tin Roof, the hotel restaurant was outstanding. The Sunset Pier and Bar, also part of the hotel is a fantastic place with terrific live music. No question, you are in the center of the action at Ocean Key, I just didn't think it was worth the $2,200 for the 4 night we stayed there. There are other nice hotels nearby which have lower rates and which would still allow you to visit Mallory Square, view the ocean, hoist a view beers at the Sunset Pier and dine at the Hot Tin Roof.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":1.0,"Location":5.0,"Rooms":4.0},"author":"Mrs. Maud Bergnaum","date":"2013-07-28 02:57:00 +0300"},{"content":"Ocean Key is in the center of the action and shopping in Key West. However, it is getting a little rough around the edges. In our room were 6 light dimmers, only 2 of which worked as they should. Floor tile in the room and hallways was scratched, chipped and scared. Closet was inconveniently located in the far back of the bathroom.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Erick Heller","date":"2013-04-30 17:19:19 +0300"}],"public_likes":["Shea Tillman II"],"vacancy":true,"description":"Torcroft Hotel is a stylish and friendly B&B. They have 11 rooms including 2 large balcony rooms, 2 deluxe double rooms, a family room and twins and doubles. All rooms are en-suite and have flat screen TVs. Free parking and Wi-Fi. Great breakfasts.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}