{"title":"Santa Monica Mountains National Recreation Area","name":"Malibu Creek Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$45, $225 to reserve larger group campground.","geo":{"lat":34.094819,"lon":-118.712518,"accuracy":"APPROXIMATE"},"type":"hotel","id":37596,"country":"United States","city":"Agoura Hills","state":"California","reviews":[{"content":"I stayed at this hotel with my boyfriend at the time for 2 nights on Valentines Day, it was okay, but INCREDIBLY overpriced for what you get. You can hear EVERYTHING that goes on in the room next door, all night we could hear the couple next door having sex, it was horrible. I accidently left a dress still with tag on in the closet and when I called the next day to have them hold it for me, they said it was no longer there and housekeeping checked the closet and never found it...liars and thieves!!! Also, I needed to get my cell phone which I left in my car, the valet service offered to go get it, which was VERY nice, HOWEVER, the guy left my light on and caused my battery to die, which in turn took the valet 30 minutes to get my car once we needed it in the morning. I would DEFINETLY stay somewhere else and not waste my money here....ps bathrooms crappy!","ratings":{"Service":2.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":4.0},"author":"Hank Grant","date":"2012-04-09 09:05:55 +0300"},{"content":"When I walked into the lobby of the Executive Pacific in Seattle, it was filled with young \"hipsters\" with ear plates and nose rings and tattoos - yawn - hey, youngsters, as an ex punk-rocker, you should know that all that nonsense hasn't really been \"shocking\" since the '80s. Don't worry - we see you. When I saw my room, now THAT was the shocker - old, run down, and most importantly, DIRTY. The grout between the tiles on the bathroom floor was black and mucky. The floor of the shower was filthy with \"foot dirt\". Even the robe hanging in the closet had STAINS running down the front of it! They should be embarrassed at the lack of hygiene in this place - maybe it's \"alternative\" to sleep in a filthy bed, but back in the '80s we did that for free, not for $150 a night. I complained at the front desk and was shown an \"upgrade\" room which was much bigger, but also had a dirty tub, and a filthy bathroom floor. When I pointed this out to the bellman, he said \"Well, it's an old building.\" Pointing to some RECENT black fingerprint smudges on the closet door, I said, \"Lots of buildings are old - this is a DIRTY building - I could take that off right now with some 409.\" I got out of there ASAP and found a CLEAN, big room in nearby Issaquah where the walls are thick enough that I don't have to hear my next door neighbor using the toilet (sorry to be gross). AVOID THIS HOTEL AT ALL COSTS UNTIL THEY SANDBLAST THE GRIME.","ratings":{"Service":2.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Zella Koelpin","date":"2015-09-30 02:09:34 +0300"},{"content":"This hotel is a bit run down, but it's clean and very conveniently located. Free WiFi Internet! Relatively inexpensive. Unusually efficient desk made check-in and check-out a breeze. Two problems: 1. The two elevators are slow so wait times can be significant. 2. Official check-in time is 4:00 PM, so that a room was not available for a check-in at noon.","ratings":{"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":2.0,"Location":5.0},"author":"Laron Kertzmann","date":"2012-12-25 16:43:58 +0300"},{"content":"My sister and I spent two days in Seattle and stayed at the Executive Pacific Plaza Hotel. We chose this hotel because it was affordable and in a prime location. For travelers who are only going to be using thier hotel room to sleep and shower, this is a great choice. It is not a luxury hotel, but a practical choice for active tavelers. Here's what we thought of the hotel: PROS: -Location, location, location. The hotel is across the street from the stunning Seattle Library, and within walking distance of Pike Place Market, Pioneer Square, and the waterfront. -Affordable. Of all the downtown hotels we looked at this was the least expensive. -Friendly staff. The front desk attendants helped us make the most of our stay by recommending restaurants and calling taxis. Also, they offer complimentary maps, and will loan you an umbrella to use for the day. -Newly renovated. The hotel is certainly old, but they have made an effort to update the look with new modern furnishings. The down comforters on the bed were wonderful! -Clean. Although there was a faint smell of old smoke in the hall, our room and bath was neat and clean. I saw no signs of mold or dirt. CONS: -It's Small. The lobby, the rooms, the bathrooms--they're all small. My sister and I were able walk around comfortably, but there's certainly no extra space. I think it would feel cramped if there were more than two guests in a room. -It's a Buget Hotel. Travelers who are used to the luxury of larger resort hotels will be dissapointed. However, as I've said before, if you're only using the hotel room to sleep and shower, it's more than adequate. -It's Old. While they have made an effort to revamp the hotel, there's no hiding the fact that the building itself is old. There was a faint smell of old smoke in the halls and the doors have obviously been painted many times. Carpet, furniture, and bathroom fixtures, however, are new. -Street noise. While street noise will be a problem in any downtown hotel, this hotel doesn't have the thicker windows that many of the newer hotels are installing. The noise wasn't enough to keep us from sleeping. Overall, a great pick if you're looking for a clean, affordable place to crash before hitting the town again. If you're looking for something luxurious or romantic, this probably isn't the place for you. Hope this helps! Enjoy Seattle!","ratings":{"Overall":4.0},"author":"Dominic Eichmann","date":"2013-08-10 08:59:31 +0300"},{"content":"We had 2 nights in this hotel in September before taking an Alaskan cruise and the experience couldn't have been better. An older, moderately-priced hotel, but a better standard of accommodation than we were expecting for the price. The room was spacious, with a king bed, and very comfortable. No view, but we didn't pick the hotel for that. A friendly, relaxed atmosphere. Not as formal as other hotels we stayed in on our holiday, but perfect for this hotel. And absolute top marks to the Concierge, Zach. A welcoming and helpful presence at the front of the hotel. Always ready to ask what our plans were as we headed out sightseeing (and to make suggestions of things to see) and to ask how the day had been as we returned, tired and footsore. But he went further than that. We flew from New Zealand to San Francisco, then on to Seattle, and United managed to leave one bag behind in San Fran. We sorted it out at the airport and were assured it would be sent on the next available flight and delivered to the hotel. That was at 2pm. By about 8pm my wife realised that her insulin was in the missing bag. I went down to reception to ask if there was a way of ringing United at the airline's expense. The receptionist was rather vague, but Zach came over to ask what was wrong, then took over. By then United's normal offices were closed and weren't answering their phone at the airport either. But Zach somehow tracked down a United supervisor and stressed the urgency of the matter. He followed this up twice more before his shift ended at 10pm. The bag was finally delivered to our room at 2am, but Zach's efforts went way beyond what we expected. Since returning home we have contacted the hotel manager and expressed our great appreciation of Zach's assistance. Back to the hotel. A handy location - easy walking to downtown, waterfront, Pioneer Square. The return trip, up some of those steep streets can be tiring though. And having a Seattle's Best attached to the hotel is wonderful as well - those hot caramel apple ciders!!! Who needs Starbucks? Seattle's a lovely city and we want to return to spend longer. And our first stop will be this hotel. We would only look elsewhere if they happened to be fully booked.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Jovany Ritchie","date":"2015-08-15 09:08:08 +0300"},{"content":"We get to enjoy Pacific Plaza Hotel, Seattle, Washginton at least once a year when we go to Seattle in March. (which is not enough). It is a wonderful place to stay. They are very accommodating and courteous. The location of the hotel is wonderful. Great place, great prices, great people!! Once you go, you won't go any place else. Enjoy your stay!!","ratings":{"Overall":5.0},"author":"Kendall Daugherty","date":"2013-09-18 09:01:59 +0300"},{"content":"Nice place to stay My wife and I choose to stay here after a flight from the east coast. We flew in a day early for our Alaskan cruise. We took a taxi from the airport to the hotel but it would be MUCH easier just to exit the airport, turn right and start walking toward the other hotels you can see in the area. You will quickly see the Radisson. It is easily within walking distance from the airport. Our room rate for a single king was $109. I made my reservations online thru Expedia. Our check-in was quick and easy. The staff were very friendly and helpful. The room was very nice and clean. The Sleep Number bed was comfortable. We used the Towne Car service for the 25 minute ride to the Space Needle ($40). A very nice service in a Lincoln Towne Car. The price of a taxi is roughly $38 without tip. We were very pleased with the Radisson and would stay there again.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":3.0},"author":"Quinn Quigley V","date":"2012-06-26 17:10:12 +0300"},{"content":"Good Service. Would go back again Like the stay at the hotel. Comfortable rooms. Ask for rooms on the side of International Blvd. Since the rooms are closer to the airport, sometime you can hear plane taxiing at the gate.As a guest at the hotel, if you are planning on parking your car at the hotel premises, you would have to pay for parking, which was $9 a day. Beware of this extra charge, because the guests are not usually charged for car parking at other hotels.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Anastasia Bogan","date":"2014-10-22 07:32:51 +0300"},{"content":"Good value for downtown Seattle. Would probably rate it a 3.5 star. The service was excellent. The rooms were nice. A little noisy but can be expected for a downtown hotel. All in all, a good experience.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":3.0,"Rooms":4.0},"author":"Jasmin Aufderhar","date":"2012-12-01 01:34:27 +0300"}],"public_likes":["Daphnee Konopelski","Lula Bosco","Juliet Bartell","Ernest Morissette","Norene Green","Cristal Ankunding PhD","Mr. Alexane Murphy"],"vacancy":false,"description":"A vehicle-accessible developed campground located near the entrance off of Las Virgenes Road.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}