{"title":"Rum","name":"Kinloch Hostel","address":null,"directions":null,"phone":"+44 1687 462037","tollfree":null,"email":"kinlochcastle@snh.gov.uk","fax":null,"url":null,"checkin":null,"checkout":null,"price":"£19.50 per person","geo":{"lat":57.01399,"lon":-6.28192,"accuracy":"APPROXIMATE"},"type":"hotel","id":24606,"country":"United Kingdom","city":"Highland","state":null,"reviews":[{"content":"The Stratosphere is an average hotel. It's clean, it's big, the beds are comfortable, the bathrooms are big and well equiped - and it works for staying a few nights at a cheap price in Las Vegas. The only \"bad\" thing I have to say about the hotel is the location. Although it is in walking distance of other hotels of Vegas (like Treasure Island, Venetian and Ceasars) it's not centrical, so to go to the Luxor you will have to take the monorail (that is free). So, in result, I would say that this hotel just makes a good work for the price.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Jaron Runolfsdottir","date":"2013-04-14 21:15:41 +0300"},{"content":"Our room was clean and quiet. We had a pleasant night sleep. If you consider this hotel, please watch out the following: 1. Dinner buffet package meant 2-for-1. We reserved a room for 2 persons with dinner buffet package. However, we were told that the package meant 2-for-1. If you go only one person, it meant you would have to pay full price plus an extra cost for the package itself. I confirmed this with three hotel staff and one just nodded and acknowledge this deceiving deal. 2. Don't bring a tripod up to the Tower even though you do not plan to use it. We were okay not to use it. We were told to return to our room and keep the tripod there first. We asked four hotel staff and no one accepted to hold the tripod for us, so we ended up walking back to our room. 3. Watch out a private party. The view was just okay. There was no 360 view because there was a private party. Of course, they did not tell you that. I guess the nice view was block for this private party. You may like to ask before you spend money going up. If you already pay for a resort fee, just go up anyway because it is included. Overall this hotel was okay, but we do not plan to return due to its deceiving deal.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Anastasia Upton","date":"2012-11-23 22:25:04 +0300"},{"content":"It's far from other strip attractions, overpowered by smoke, could use some renovations, rooms are \"motel-esque\" and very out-dated, and the buffet is overpriced. The hotel is consistently cheap, though...so many people (especially families apparently) stay here. The casino was a good time-beware that the ATM will charge you 16.99 if you use a credit card. The debit card charge is bad as well, but not quite so atrocious. The shows at the hotel are pretty good though, the rides are popular (even too watch), the bars were fine, and the view from the tower is phenomenal. If you weren't staying here, it would cost money to go up to the top of the Stratosphere, but guests can go for free. Parking is easy and free. The check-in experience was good: quick, no line, no problems. The buffet was alright albeit overpriced. I don't think I'll be going back because it's so far from the rest of the strip, and taxis are too expensive.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":2.0},"author":"Eleonore Gulgowski IV","date":"2015-10-04 08:36:10 +0300"},{"content":"The rooms and food were fair, however, I had two bad experiences during my 4 night stay. The first was in the front of the hotel around mid-day. I was verbally assaulted by a vagrant when I declined to give him a dollar. Not just a curse word, but he followed me into the valet area shouting obscenities at me. No staff in the valet area assisted me. The second, and the most troubling, was at the main casino bar around dinner time. A panhandler came up behind my seat and asked for a dollar, as he placed his hand on my shoulder. I gave him the buck, since my cash was on the bar. He then strolled around the bar and exited the building through the valet area. This lack of security will keep me from returning and from recommending the Stratoshere.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":2.0},"author":"Davin Cummings","date":"2015-01-11 17:53:35 +0300"},{"content":"I traveled MARCH 2010! This hotel is situated towards old town Las Vegas. Some would say it's a badder part of town. For me as a single female traveler, it wasn't so bad. Like any place in LV, you will get the odd stare and it might not always feel safe, but it is a great place to sleep. It was quiet, and the the room was very spacious. The bus stop is literally just outside the hotel on the street and I wish I knew that earlier. It's great to walk down The Strip and look back at the hotel. If you stay in the hotel, the ride to the observation deck is included in your room charge. The ride up was terrifying, as I'm scared of heights. But being on top, seeing the whole of Las Vegas lying in the desert, and seeing the famous lights is an absolute must! For all you crazies out there, I definitely suggest to do the rides on top of the tower... It is $@!#% terrifying! Be careful when on the bus and going out of the mainstream tourist area... I wan't to go see some lights graveyard, I'm not sure of the name now and got a little lost. Had to wait a little while for the bus to get back and there was this $@!#% of a dodge guy that came walking up to me in his maroon velvet suit and started talking to me... only in Vegas! When you are a single female, ALWAYS pretend like your husband is waiting for you somewhere. It can get you out of pretty sticky situations. Overall great experience in the hotel. Reception and Concierge were very friendly and helpful and I loved the American Superstars show. Elvis was so handsome, smiling and winking at me! :-)","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Juanita Schroeder","date":"2013-05-18 00:21:42 +0300"},{"content":"I was a little nervous about this property because of reviews I had read but I was extremely pleased with the quality of the room for the price I paid to weekend nights for $123. The room was clean the beds were comfortable had a good view. The entire casino was clean and well kept. We ate at two restaurants the food was good but overpriced. The view from the top of the tower is outstanding. I do not recommend the show Bite! It bit.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Ryan Baumbach","date":"2015-08-26 05:10:53 +0300"},{"content":"First location: Is not in the middle of the strip so you need to walk a lot to reach the heart of the strip but we had a car so for us was not an issue (most hotels have free parking in the strip so you can move freely around the strip without worrying about parking fees). Price: Was very good with a promotion we received by mail. Checking: Long lines, slooow check in and staff not that friendly. Rooms: We get a free upgrade of our room for 3 nights and was very clean and beautiful. No issues here. We left our digital camera in the room, noticing this just after the check out... took about 2 hours of waiting between the manteinance staff and security to get our camera back. If they speed up the check in/out process and the staff complete some customer service training to be friendly then I can say this will be my choice to stay every time I go to the strip.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Lesley Bernhard","date":"2014-10-11 16:56:55 +0300"}],"public_likes":[],"vacancy":true,"description":"The hostel used to be inside Kinloch Castle, but due to the deteriorating condition, it has moved into an adjacent temporary building. It has 8 dorm rooms, each with 4 beds. All accommodation is self-catering, with a kitchen and lounge provided.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}