{"title":"Birmingham (England)","name":"Campanile","address":"Chester St","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.49196,"lon":-1.88631,"accuracy":"ROOFTOP"},"type":"hotel","id":3607,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Plusses outweigh the minuses by far. On the plus side: + immediately on the red line. Could not possibly be more convenient to public transit. Literally steps away. + but you may not even need the subway as the hotel is perfectly central & within easy walking distance of everything downtown. + very fluffy bed in contemporary and meticulously clean room + attentive and cheerful check-in staff (went extra mile for us in several respects) + taxi stand one block away for easy trips to airport or wherever else you may be headed. Minuses: - Breakfast at Weber Grill is mediocre at best. You're better off walking a block or two to any of the surrounding restaurants. (Gospel brunch at House of Blues, for example) - pool is small. (But why swim? You're in Chicago!) - elevator wait times can be a little frustrating - building could use one more elevator. - a little pricey, I guess. Hard to say. Long story short, a lovely stay at a lovely hotel. I won't hesitate to stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Johnathan Jacobi","date":"2014-07-24 11:09:01 +0300"},{"content":"We enjoyed this hotel this winter. The location is magnificent, 2 blocks from the Michigan Ave., less than 20 meters to the Red Line MTA train that takes you virtually everywhere. Nice view (floor 17). The pool is very good and also the business center (complimentary use of PC and printer). Within the hotel there is free wifi.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dax Rowe","date":"2013-11-17 08:22:29 +0300"},{"content":"Very nice location, staff was very helpful, rooms were very clean. Has a pool which is a big plus. Would definately stay again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Kirk Bashirian","date":"2012-04-08 03:33:20 +0300"},{"content":"The hotel has a lot to like - comfy beds, a nice (if small) pool area if you have a child in tow, free broadband (wired), and friendly staff. However, it's not quiet. There is a substantial gap at the bottom of each door, so hallway conversations and door slamming will be clearly audible. The windows have good sound insulation but the AC units do not, so traffic noise and sirens pour in at all hours. I liked it well enough, but the noise coming in was loud enough that it kept my three year old from getting to sleep. I understand it's a hotel in the middle of the city, but that's too loud.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":2.0,"Location":5.0},"author":"Beau Mayert","date":"2014-06-20 22:56:53 +0300"},{"content":"I would return here for a clean, safe, comfortable place in an ideal central location for touring, with great service at the front desk. We stayed at the Peninsula a few years ago and that is a knock-your-socks-off world class luxury hotel. This is not -- it's a nice business class Hilton family property. But I would actually prefer to return to this one, instead of the Peninsula, because it is more centrally located, and I don't need to pay for all that luxury when we are out touring all day. We like to walk, and we were able to walk to the boat tours, the old Marshall Field in the Loop, Berghoff, the Sears Tower, Navy Pier, the Magnificent Mile and the Hancock building, all from the HGI. The Peninsula was a little bit further north, less convenient to the Loop, and so we found ourselves using many more cabs. We had a great lunch at Berghoff (weekday lunches on the main floor are as good as ever, including the homemade root beer) and we also had a lot of fun at dinner and great traditional food in a German neighborhood place to the north, the Chicago Brauhaus in Lincoln Square.","ratings":{"Overall":5.0},"author":"Matteo Schaefer","date":"2014-10-29 23:14:08 +0300"},{"content":"After reading all the tripadvisor-reviews, we decided to go for this hotel. Good choice! We 've stayed here 3 nights and everything was really good. The hotel itself is clean, nicely decorated (nothing special, but just as you would expect from a Hilton/garden inn) and the location is really perfect! Downtown, close to the nicest stores, attractions, bus stops and restaurants; great! The staff is VERY friendly, the breakfast at the Weber Grill (which was free for us, as Hilton Honors members) is really nice and everything's freshly prepared to your order. The room we had was very spacious and clean. I would really recommend this hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Ted Labadie","date":"2014-12-13 21:40:42 +0300"},{"content":"great hotel in the heart of the city, close to everything. excellent amenities (pool, jacuzzi, computer use etc) and good service. only drawback: the room decor is too 'flowery' (although beds are comfortable and bathroom well equipped).","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Ocie Thiel","date":"2015-08-25 18:44:08 +0300"},{"content":"We stayed here for a Bears game and general sightseeing. With the Red line right outside the door, we were able to go everywhere we wanted very easily. The hotel is also located right across from a very nice Jewel food store. Great for sodas or snacks. Check in was a breeze and the employees very friendly. We had requested a king nonsmoking and a king smoking and both were ready for us. A nice security feature is you must use your room key to use the elevator. Our room was fairly large, especially for city standards and was spotless with very nice furniture. It also had a microwave and refridgerator along with a coffee pot. We had a view of the Hancock Building and the windows opened slightly for fresh air. It had a good size bath that was also spotless and nice toiletries including lotion and mouthwash which is not often given. Good water pressure and plenty of hot water. The beds were comfy and made up with double sheets which is a nice touch. Pillows were okay but of the foam variety and a little hard. Free internet is a nice feature but charges for local phone calls a little cheap in my opinion. The Weber Grill is located in the hotel and serves a wonderful breakfast buffet with great service. Overall a great stay and would definitely stay there again. Wonderful location just off Michigan Avenue and a nice clean, friendly atmosphere. What more could you ask for.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Jacinto Dooley","date":"2013-12-06 06:48:55 +0300"},{"content":"The hotel staff couldn't do enough for me! As part of our engagement evening, I had a couple special items to be delivered to our room at a specific time. They came through where other hotels have not. Why this hotel is not rated higher than 3 stars is beyond me!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Justina Grimes Sr.","date":"2013-05-04 05:17:44 +0300"}],"public_likes":["Luella Klein","Andrew Bauch","Estell Deckow","Arch Schmitt","Alden Volkman","Domenic O'Hara","Lilla Rippin DVM"],"vacancy":true,"description":"If you are travelling by car and on a budget, Campanile is your friend wherever you go - the rooms could not be more simple, but the locations are usually very convenient at motorway junctions. In Birmingham, it is north of town, where the A4540 ringroad meets the A38, which goes straight into the city, and has the added benefit of being located over the Birmingham and Fazeley Canal lock.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}