{"title":"Nice","name":"Hotel Suisse","address":"Promenade des anglais 15 Quai Raubà Capéù","directions":"Just below Colline du Chateau next to the asenceur","phone":"+33 492173900","tollfree":null,"email":"hotel.suisse@hotels-ocre-azur.com","fax":"+33 493853070","url":"http://www.hotel-nice-suisse.com/uk/index.php","checkin":null,"checkout":"11am","price":"€80 to €200 (seaview and balconies makes the difference)","geo":{"lat":43.69402,"lon":7.27938,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20422,"country":"France","city":"Nice","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"I stayed at the Lumen for a week for about the 7th or 8th year. The Hotel is nice. Some of the rooms are bit odd since it is a remodeled \"motor court\" type of facility. This time I had the worst room I've ever had. It had one tiny window that overlooked the construction site (the hotel is expanding and the new part is scheduled for completion next spring). The window was tiny and dirty so the room seemed claustrophobic. It only had a double bed. There was no closet, just a wardrobe that was not large enough to hold a week's worth of business clothes. But the hotel is clean, pretty quiet, and the employees are, to a person, pleasant and accomodating. The restaurant, Social, is good but probably not worth the prices!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Camila Hudson","date":"2015-03-30 01:17:05 +0300"},{"content":"I got a great rate on line, staying there for a conference at SMU. I walked to campus every day! Modern, spacious chic room, upgraded upon arrival. Valet service a little crazy, but valet very professional and friendly. Not downtown, but very close to shops and very nice area. Loved the room, had a lot of visitors but no one complained about the noise we made. I did miss the exercise room and pool, but relaxing stay overall. Oh, the wine and beer happy hour was a nice touch and I was able take as much as I wanted. Will stay here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lexie Wiegand V","date":"2013-09-03 04:58:50 +0300"}],"public_likes":["Issac Heidenreich","Lindsay Rohan","Clay Dare","Gustave McClure","Lynn King","Ms. Anthony Purdy","Keeley Howe","Justice Funk"],"vacancy":true,"description":"Located very close to the sea and the old quarter. Free WiFi in the lobby. The Superior and Privilege rooms have a small balcony with a table and two chairs where you can sit and view the surf along the entire Nice waterfront. The rooms are small but nice and the service is excellent. Even though it has only three stars, it has amazing views and service.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}