{"title":"Paris/1st arrondissement","name":"Hôtel Saint-Honoré","address":"85, rue Saint-Honoré","directions":"Métro: Louvre","phone":"+33 1 42 36 20 38","tollfree":null,"email":null,"fax":null,"url":"http://hotelsthonore.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.8611083,"lon":2.3433014,"accuracy":"APPROXIMATE"},"type":"hotel","id":21725,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Came to Grand Wailea on a honeymoon for 6 days after coming from the St Regis on Kauai, and boy what a difference. I know its not exactly fair to compare a different hotel chain from a different island, but we paid similar money to stay at both, with similarly nice accomodations. St Regis Kauai is head and shoulders above in terms of service, grounds upkeep, and exclusivity. You can relax there, not worry about racing for good seats, there are not 1000's of screaming children and pushy adults. I just dont know how else to describe it other than \"down market,\" which is not how a hotel in this price range should feel, in my opinion. The good: Our room was awesome, we were on the 5th or 6th floor and we were upgraded to oceanview room with terrace. Room was perfectly nice, although our couch was a bit stodgy. Otherwise an A+. Room service despite not serving 24hrs (which lets be real people at these prices and on maui, this should be available) was pretty good and we used them several times. Great views from the room. The beach was nice (if you could get on it). The pools/slides are cool. The grounds are very nice in certain areas where the original hotels grandeur has been preserved, such as the lobbys and entrance and some of the outer grounds/gardens. Its beautiful to walk around at night. There is a nice long path that runs along the hotel beach and goes past many other hotels, nice for a walk in the morning or sunset. Good snorkeling can be found near by, we swam with sea turtles and saw lots of fish. And the highlight of our trip was SHANE THE BARTENDER, WHO ROCKED . HE KNEW US BY NAME AND WELCOMED US WARMLY each time we popped by for a drink. He would remeber what we drank last and was very good. Unfortunately, he was the only one who we got this type of service from at this hotel (and in comparison, when at the st regis, there were several employees throughout the resort who knew us by name and were outgoing and friendly.) Big difference to me. The Bad: I was here 10 yrs ago, and let me tell you there has been alot of change. All these glowing reviews of this place must be from first time travelers to this hotel. If they had the priviledge to see this place in its glory, they would have a better idea of whats gone wrong with this place. The hotel itself is basically the same, except everything seems worn and dirty: pathways are dirty and falling apart in some areas, there are wood banisters in some spots that need some up keep or paint or to be redone, or something. The grandiose gardens that I came back for are not as well kept, and there are plants that are really beat up and half dying. They need to be replaced. The grass along the walkways is worn out and its dirt or yellow/dead in many places. they try to cut and paste new grass is but it just doesnt look right. The water by the restaurant on the tropical lagoon is atrocious looking, I was concerned for the fish they had in it (and in the grand scheme of things these might not be such a big deal, and I am being critical, but only because I saw the real Grand Wailea Hotel and Spa, and know how far its fallen. Several times we tried to call down to the concierge and the phone just rand and rang and rang. I spoke to several peope who are \"members\" allowing them special rates and frequent visits and they agreed that the place has taken a turn for the worse.) There is just a major vibe of corner cutting, and just maintaing what they have, to milk it for as much money as they possibly can, without investing anything more money into it. OK NOW LETS TALK ABOUT THE UNPLEASANT POOL/BEACH SCENE. I love the pools at this place. However, there are just too many people on this property. WHERE DO ALL THESE PEOPLE COME FROM?!!?!?!?!?!? The management is dropping the ball here big time. Finding a free chair can be a nightmare. There are lines for towels, which are needed to claim a chair. People line up at ungodly hours to be first. They say they clear the towels off the chairs if people dont come down after an hour, but I didnt see this happen once. The pool/beach staff was not friendly at all. I was told these hotel gigs are hard to get on Maui and are well liked by the locals, apparently not! The loungers and chairs around the pools are stacked so closely there may not even be an inch between them, and in some places they go 3 or 4 rows deep. I felt like I was sitting on the expressway, in rush hour, only in a lounge chair with palm trees around me, and a melted 20 odd dollar pinacolada. And dont let them tell you they are at max capacity, because this hotel is huge and was not filled if we were getting free oceanview room upgrades. The scam here is, they built this huge condo complex (Hoelei? or something)across the street, and to get people to stay there, they allow them full access to the Grand Wailea pools and grounds. These people seem to bring kids by the dozen. Its screaming kids all day. I felt like I was at a six flags water park, not an alleged 4 star resort upscale resort. So you basically have 2 resorts worth of people on one property. NO WONDER THE PLACE IS SO OVER CROWDED. SO HERE I AM WITH MY VERY HIGH ROOM RATE AND 20$ COCKTAIL, STRUGGLING TO FIND A SEAT ANYWHERE NEAR A BODY OF WATER, WEDGED IN TRAFFIC 3 ROWS BACK FROM THE POOL AND IM STUCK BEHIND/PUSHED OUT BY PEOPLE WHO ARE NOT EVEN HOTEL GUESTS!!!!!!!! THIS IS AN OUTRAGE!!!!!!! but this is not a problem, just simply rent one of there 300 dollar a day poolside huts and you will not have to worry. Service is so so poolside. Did I mention the screaming kids yet? haha! This place has sold its soul in my opinion, I dont even want to get into the beach scene, which was actually a little better. I left with a bad taste in my mouth, wishing I had never left the st regis. I will never be back. I gave 3 stars because the grounds are still somewhat nice in comparison to most properties and the pools are still cool. If you walked around this place at night after all the cattle go back to the barn, and the darkness covers up the blemishes, its a beautiful place. We just spent alot of time off the property and hung in our room so we could have some peace and quiet. Something that there is a severe shortage of here. Do yourself a favor and go to the 4 Seasons, the Ritz or Kea lani if your coming to Maui. We were watering at the mouth walking past the Marriot Outrigger resort which is down the beach path from the GW. Things looked so peaceful and realxing and serent there. Chairs were spaced out appropriately. This place needs to lower its prices and have there 4 star rating removed. We still managed to have a great time here, but beware! Things are not the same here anymore. If we do come back we'll stay at the Marriott a few doors down or the Ritz in Kaplua or 4 seasons next door. Both looked serene and could be had for less money, except the 4 seasons. BOTTOM LINE: THE GRAND WAILEA IS A ZOO AND THE HOTEL HAS TAKEN A TURN FOR THE WORSE!!!! IF YOU MUST GO, IT BETTER BE DURING THE SLOWEST PART OF THE SEASON THERE. LOOK ELSEWHERE, UNLESS YOU ARE A FAMILY WITH & KIDS AND PLAN TO STAY AT THE CONDO PLACE HOELEI ACROSS THE STREET. GOOD LUCK!","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Rebeca Sawayn","date":"2014-03-22 19:04:55 +0300"},{"content":"The Front Desk: When we first arrived at the Grand Wailea, we had 2 separate rooms, so we had two different desk clerks. One of them was NOT nice!! I think some previous reviewers mentioned the lack of courtesy before. When you are spending almost $400+ per night for a BASIC room, EVERYBODY NEEDS TO BE SMILING AND KIND!!! Not the case. The clerk did her job, but was not pleasant and never once even cracked a smile. The other clerk was very nice and accommodating and he ended up upgrading our room to an ocean view. Several other desk clerks were also very friendly, but I feel like at this level of hotel, there should be absolutely no exceptions. The Rooms: They were very spacious and pretty nice. We had a room with double queen beds. The bathroom was huge, mostly marble, and the toilet was separate from the rest of the bathroom and had a separate door, which I really liked. There was a large soaking tub and a separate shower with a little bench. Good water pressure and plenty of space for your things. Great little mango/honey shower gels and shampoo/conditioners. Usually, I ignore the hotel samples, but these were very nice. There was a large flat screen TV in the room and plantation shutters that kept out most of the light if you wanted to sleep in. You could also sleep with the windows open and the screen door closed, so no bugs got in. Maid service was annoying, but efficient. They just came way too early, so we had to use the do not disturb sign every day. The carpets did look like they could stand to be replaced. They weren't dirty, but again, for the price of the rooms, we expected better. The beds were very comfortable and the pillows were great. I slept well every night. The hotel: The hotel is extremely ornate and has a lot of beautiful elements. Statues all over the place, flowers all over the place, they've clearly put a LOT of money into making this hotel spectacular. That being said, we went down the street to the Four Seasons to have a drink and it was sheer understated elegance. We didn't go into any of the guest rooms, but the common areas were just gorgeous and classy. While the GW is not OVERstated, we agreed that it IS stated. If we were to spend that type of money again, we would probably go to the Four Seasons. In addition, the GW property is HUGE. There is a long walk pretty much anywhere you go. I think we were pretty central to everything, but it took at least 3-5 minutes to walk anywhere. I would have hated to have had one of the less central rooms. It was mostly ok because the weather was pleasant, but at times it was just a pain in the butt. There were times when I would bring things for later just so I didn't have to walk to get back to the room. The pools: There are a ton of pools on the property, but we only used the adult pool, which was nice. There were a lot of slides all over, which would be a lot of fun for kids, but we weren't sure if there was an age or height limit and it didn't appear that they were used too much by adults, so we never used them. Never too crowded (we went the week after the Labor Day holiday) and the pool had a beautiful fountain. You could get as many towels as you liked, but they did ask for your name and room number before giving you anything. It wasn't a long process. The beach: The beach behind the pools is GORGEOUS. We had the use of free beach chairs and umbrellas while at the beach and the sand out there was just supersoft and beautiful. It's a golden color, so it's darker than what I normally see, but I got used to it very quickly. There was very little debris in the sand or the water and it made swimming in the ocean a joy. I would walk down the beach next door to the front of the Four Seasons property and enjoy the view from there. Just stunning. The spa: Spa Grande is FABULOUS!!! The facilities are great and I didn't have enough time to fully enjoy them to the extent I wanted. Think Burke Williams within a resort. There are 5 different baths with different salts, eastern and western hot and cold pools, a steam room, sauna and several other amenities. Make sure you ask for a tour of the facility so you know where everything is. And get there at least an hour before your service so you can enjoy it. If I did it again, I'd allow myself an hour and a half to two hours because I like to do repeats. They also give you a free 5 minute exfoliation if you are receiving a service. This is a great way to ensure that all of the guests are clean before they use the amenities (you are still required to shower first). I got an 80 minute massage that wasn't the best I've ever had, but it was perfectly fine and I felt extremely relaxed afterward. One thing that was REALLY annoying about the spa is that the staff was constantly walking around calling names of guests who had services scheduled. When you are trying to relax in the steam room or a bath or something, the last thing you want to hear is someone else's name repeated over and over (rather loudly, I might add). They should take a hint from Burke Williams and require folks to report to one area 5 minutes prior to their service. That way, the other guests are not disturbed. They came to get me a full 10 minutes prior to my service. I needed my 10 minutes and still made it upstairs in enough time that I had to wait for my masseuse. The food: It's extremely expensive. Extremely. We had lunch once at the restaurant closest to the Hibiscus Pool (I forget the name) and the food was very average. Definitely not worthy the price. We had dinner one night at Humuhumunukunukuapua'a (named after the fish) and it was pretty good, but again, very pricey. We were having a birthday celebration and had asked for seating to see the sunset, but we didn't feel like the seating we got was optimal. In fact, when we spoke to the person making the reservation, she told us the sun set at 7:30pm when it was fully below the horizon at 6:30!! A couple of the servers were great, though, and we had fun with them. We mostly ate off property, including The Shops down the street. We really enjoyed Longhi's for breakfast and we also ate at the place next door to it (something about burgers), but didn't enjoy the food or the service nearly as much as Longhi's. One day, my friend and her dad had the $50 buffet brunch, which they said was decent. They did mention that the view from the buffet was spectacular. I went driving up a mountain instead, so I missed it. :) We also had dinner at Nick's Fishmarket, which had delicious food and stellar service and we tried Pacifico's in Lahaina (worth the 45 minute drive -- if you go, be sure to get some shaved iced from Ululani's). Our first night, we ate at Cafe Olei (sp?), which we didn't particularly enjoy. The expensive food was average to below, with a less than average atmosphere at a strip mall. It was recommended to us by the valets at the hotel. Bad choice, skip it. The concierge service: On one day, I spent over 3 hours going back and forth with the concierge about activity plans. It was my most frustrating, non-enjoyable day. I wanted to go to Road to Hana, but the people I was with didn't want to go, so the concierge (who sounded like she knew her stuff) told me there were less touristy, more spiritual things to do there. We agreed to connect an hour later and when I showed up, she was the only concierge out of 4 of them who was busy. After waiting for 30 minutes and seeing the people going nowhere, I finally asked her to call me when they were done because I wanted to get in some time in the sun. Of course, she called as soon as I settled in my lounge chair. She said I needed to come back up so she could show me some places on a map, so I headed back up. The call soon dropped and she didn't call back. When I called back, I was told she was busy with other guests. I walked up soon after and she started apologizing profusely for having to leave!!! I couldn't believe she had taken an hour break, then came back, helped other people and left without helping me!! She passed me off to another concierge who gave me incorrect directions, even though I asked her repeatedly whether she knew where she was going and told her I didn't want to drive for 45 minutes to get lost. She seemed very unsure of herself. I had to ask her a thousand questions over the course of about an hour just to get any relevant information. And guess what? I never found the location. She claimed she would send up a more detailed map, but the map she sent up was less detailed than the one she showed me at the desk!! Completely useless!! And none of them seemed to know about the black sand beach 10 minutes down the road!! I just don't get how these people can hold these jobs and know practically nothing about what's going on and where things are ... I definitely expected more from such a highly rated hotel, but I was completely disappointed.... Overall, though I enjoyed my visit, I wouldn't stay at this resort again ... it's too expensive for what you get and there are plenty of other really nice places to stay in the area.... but I will DEFINITELY be back to Maui ... it's awesome!!!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Baron Graham","date":"2014-10-10 19:04:09 +0300"},{"content":"So beautiful, best weather and best beach. Hint: If you can travel without kids, go in October when it is less crowded. These guys offer an adult only pool where you can carry your drinks, kiss in the pool, whatever. Hint: I think you can get a garden view (if your room overlooks the chapel) that is the closest to the pool and beach. I may not spend the $$ for the deluxe ocean view next time. The people were great, service was great, I have no complaints. The hotel can get very crowded, so maybe people complain about the service during those times. I did not each dinner there but once, the view was great from the steakhouse, but the food was so/so at best. At night, get in the rent a car and go out to each, there are many great places.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Abdullah Weber MD","date":"2012-04-21 19:30:36 +0300"},{"content":"Stayed at the Grand Wailea for 4 nights last week. Last time I was in Wailea a few yrs ago I stayed at the FS, so I am somewhat jaded. This hotel is enormous....almost 800 rooms! Everything seemed like a hike. Was a 5-10 min walk from my room just to get to the pool. Felt I was nickel and dimed at check in. $25 resort fee. $10 luggage transfer fee. $3 maid gratuity fee. All this on top of my nightly rate. Didn't find staff to be too polite or accomodating. They need some lessons from their neighbors down the beach (FS & Fairmount). Anytime I asked a question, they made me feel like I was harassing them. Would not stay here again and would not recommend to anyone...even families....there are plenty of other resorts in HI that'll cater to children. You don't need to spend your money at this place. The biggest joke was the line of people (40 deep) waiting to get towels prior to the pool opening at 7 AM. It stressed me out just looking at them from my beachside yoga class. This is not a 5 star property, or anything close to luxurious. Conrad Hilton would be rolling over in his grave if he knew the GW was associated with his chain.","ratings":{"Overall":2.0},"author":"Ms. Bradley Frami","date":"2012-05-02 21:25:45 +0300"},{"content":"\"Brokedown Palace\" best describes this place to me. I think the glory days for the GW are long gone. It's still on a beautiful beach and the pool is nice if you don't mind 5000 screaming kids like Disneyworld. During our visit there must have been some sort of Fred Durst family convention going on LOL I swear, every guy there had a backwards baseball cap, a goatee or soul patch (!) and had tons of kids in tow. The whole grounds, pool area and all the patios (especially on the ground floor) looked like they had been hit with a tidal wave of inflatable toys, boogie boards, towels, food, soda bottles and trash. I have nothing against kids, but this place markets itself as a romantic high-end luxury property (with prices to match) but in reality it is more like a huge 3 1/2 star Disney hotel aging in a beautiful location. Did I mention most of the Durst clones were sloppy drunk at the pool by 1PM? A true Durster wouldn't even get up until 1PM. Amateurs ;) They should lower their prices and lower their guests expectations. The prices at GW are still very high and there are many other beachfront hotels that are less expensive and will probably offer the same experience for less $. If you are looking to spend big bucks for a romantic luxury trip of a lifetime and you want a true 5 star experience, you will be much happier at the Four Seasons next door or the Ritz in Kapalua. I've stayed at both and both are a thousand times nicer than Grand Wailea.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":2.0},"author":"Micheal Berge","date":"2012-10-17 01:49:05 +0300"}],"public_likes":["Alaina Wuckert","Jacinthe Osinski","Robyn Becker","Erna Block","Dariana Littel","Miss Carmel Hintz","Sarai Bergstrom","Mr. Paris Kohler"],"vacancy":false,"description":"Close to the Louvre. The place was renovated in the last few years, so the comfort level is pretty good considering it hasn't received a star rating yet.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}