{"title":"Val-d'Isère","name":"Hotel Avenue Lodge","address":"Avenue Olympique","directions":"near place Jacques Moufflier","phone":"+33 4 79 00 67 67","tollfree":null,"email":"contact@hotelavenuelodge.com","fax":null,"url":"http://www.hotelavenuelodge.com","checkin":null,"checkout":null,"price":"€330-695","geo":{"lat":45.44930074361091,"lon":6.979062259197235,"accuracy":"ROOFTOP"},"type":"hotel","id":31944,"country":"France","city":"Val-d'Isère","state":"Rhône-Alpes","reviews":[{"content":"We stayed 4 nights in the Harbour Grand hotel on Hong Kong island at Easter 2012. We had a pleasant stay. It's a pricy hotel, but you get value for it. We are airline staff and they do give industry discounted prices for a room. Just write to the hotel and ask for it. The location: from the metro station Fortress Hill, it's a 5 minutes walk. The hotel is a bit hidden, but it's right on the boulevard. This boulevard is currently (april) under construction and there's a highway between the boulevard and the hotel. It would be a good idea to build a bridge or so over the highway for easy access, but I'm sure something like this should be part of the reconstruction plan already. We can't tell about the kitchen, as we didn't use it. There's many cheap breakfast options in the surrounding streets, which is a good option to save some money here. We used the bar on the top floor though. It is recommended to have at least one drink here at night to enjoy the spectacular view over Hong Kong harbour. The room is luxury, with good beds and a good bathroom. Be sure to book a room with harbour view on the higher floors! At night you can enjoy the wonderful Hong Kong light show from your own room. The only slightly disappointing issue was the pool... The reason why we chose this hotel out of many options was the pool, to be able to relax a little bit after a long touristic day in Hong Kong. But the water temperature was only 21 degr C.... Not inviting to stay in for longer than 5-10 minutes, despite the nice setting. That is too cold for a pool in a 5* star hotel, I would recommend to heat up the pool to a 27 degr C temperature year-round. Luckily they have a sauna and steam bath as well, so you can warm up afterwards. Overal: we had a nice stay here, but there are many good options in Hong Kong. We might try out another hotel next time :-) Wendy and Paul, the Netherlands","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Jude Heathcote","date":"2012-06-04 19:11:58 +0300"},{"content":"Beautiful view from the room. Bed was super comfortable. Too bad the pool was under repair when we went, I was able to use their gym though. Location wise, it was convenient, a quick 2 minute walk to Fortress MTR station.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Wilburn Cummerata","date":"2014-08-26 16:49:12 +0300"},{"content":"We stayed in this hotel for 4 nights and upon arrival we upgraded to the Club room which was an excellent decision. Club room on 38th floor was well equipped (compact but sufficient) clean, well furnished and had all the things you could/would need plus a great view! The club lounge on the 41st floor was just great. Breakfast, tea and coffee all day, afternoon tea and alcoholic drinks 6-8pm and 5pm late check out on departure all included, all for approx. £60 extra per room, per night. Incredible value. Don't listen to reviews about the supposedly dodgy area, it is fine and a taxi in Central Hong Kong only costs about £4 so hardly an expensive ride! Alternatively there is the MTR close by which we didn't use as taxis were so cheap/accessible. Excellent gym, shame about the pool being out of action but to be honest there is so much to do in Hong Kong why would you sit by a pool!? All in all a fantastic hotel which I would not hesitate to use again. I have stayed at the Marriott right in the centre of Hong Kong and didn't find the Harbour Grand in any way inferior for being a few minutes further out.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Rusty Dach","date":"2013-01-14 14:56:14 +0300"},{"content":"Stayed here for 5 nights in November 2011, was a bit unsure of staying on Hong Kong Island as we had previously stopped in Kowloon (2009) and didnt venture over the harbour much, one day we visited this hotel as a member of our party knew someone who worked here. The street was a little off-putting as it is very \"local\" with garages and shops, the hotel look a little out of place as the reception is very luxourious. My in-laws stayed here in October 2011 and said how lovely it was so we decided to book it! So glad we did I would say after stopping in this hotel, we will definately be back! Upgraded to the Club lounge and the views from our room across the harbour were lovely. Club lounge is well worth the extra, daily breakfast, free drinks throughout the day, lunch time and evening nibbles and a fantastic view. Staff were lovely, always remember you and very friendly and helpful. Rooms nice and clean. Staff were sometimes a little slow at breakfast but we didnt let it bother us, just felt a bit bad asking! Close proximity to the MTR and we didnt feel at all intimidated by the locals around us, even late at night (as no-one seems to sleep here!) Didnt eat in the restaurant as we wanted to explore as we were only here a short while and the MTR makes it so easy to get around but the in-laws said it was very nice when they came. Looking forward to returning next year!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Delta Skiles","date":"2013-12-13 14:30:15 +0300"},{"content":"Prior to our arrival we were upgraded to a Grand Deluxe Harbourview Room as the swimming pool was closed. I hate to think what our original room would have been like, as with two suitcases and handbaggage there wasn't an awful lot of spare room. The harbour view was only partial, and there was quite a lot of building work going on below us. Fortunately most of our stay was over Chinese New Year so it didn't cause us much bother, but you really noticed it on the last day when everybody was back at work. If you are spending time on Hong Kong Island this hotel has easy access to the MTR which made getting about fairly easy, even though several stops away from Central. Room and harbour views nowhere near as good as the Harbour Grand Kowloon, which we stayed at last time we were in Hong Kong, but more than made up for with its easy access to the MTR without the need of a shuttle bus.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Miss Jany Rodriguez","date":"2015-03-28 19:32:24 +0300"},{"content":"The hotel is nice but the rooms are very small (think London small). The lobby is very sterile and has no lobby bar or restaurant . This hotel in my opinion is basically a convention hotel. The staff were very friendly and the service was good. One thing you should know is the location of this hotel is very bad. It is located in an old 1960's residential neighborhood. There is plenty of local food around but it is not really a tourist area. The hotel is located on a road called \"Oil Can Road\" which is appropriate considering there are car repair shops located next to the hotel. These shops stay open late. The MTR is located about 3 blocks away. If you are coming as a tourist I would not recommend this hotel because you have to hop on the MTR to go anywhere.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":1.0},"author":"Alisha Gleichner","date":"2012-10-29 01:33:35 +0300"},{"content":"Stayed in this hotel for 5 nights. I would say this is a good 4 star hotel. I am hesitant to say this is a 5 star hotel because although it looks like a 5 star hotel, it did not feel like a heavy weight 5 star hotel. There were quick free shuttle buses to/from the HK station of the Airport express trains. Service was good but erratic. For example, I ordered the standard Yang Chow Fried Rice for room service. It was way too greasy…can you imagine fried rice with an inch thick of oil at the bottom of the rice? Not exaggerating….after leaving the unfinished rice outside the room for pick up and having written negative comments about it on the napkin, although the item “Private Dining – Room” was reflected on the bill, the cost (without me asking for it) was zero. Great initiative. What was erratic was the newspaper….firstly, they did not ask me whether I preferred English or Chinese papers. Secondly, it was only delivered on the 1st day and they forgot about it for the next 4 days! Finally, there was window cleaning/replacement going on so the ropes from the gondola were constantly knocking against the room’s windows (even late at night). This was not mentioned upon check-in. So although a room change was offered after I inquired about what was going on, it was rather late because I have unpacked and it was late at night. What gave it a 5 star look: a big sized lobby; there was also a musician playing harp in the lobby in evenings…soothing; good sized restaurant for breakfast , did not feel crammed. Nice looking hotel pool too overlooking the harbor. There was a good Business Centre too but a pity that the person behind the counter did not even know how to arrange for a DHL package to be picked up. Why it did not feel like a heavy weight 5 star hotel: weird location. The surroundings are rather run down with no trendy shops to speak off however there is a 7-11, 2 supermarkets and MTR station (Fortress Hill) is a short walk away though. It is not conveniently located i.e. From Fortress Hill. It is a few MTR stops to Admiralty (which you will need to get off in order to get to change MTR to Tsim Tsa Tsui). Suggestion: get the free shuttle buses from the hotel if it takes you to where you want to go (they go to Causeway Bay, Admiralty, Central). Slow elevators in Hotel. Made worse by large tour groups jostling for the elevators. If not too much more expensive, suggest getting a room from 28/F upwards. You will get to use elevators in a different elevator bank from those that tour groups use (they appear to generally use rooms up to 27/F). If you are after good sized rooms (by HK standards), want to feel comfortable in a large hotel with modern amenities, are not bothered too much by its location and its surroundings, and can live with service that does not go the extra mile, and cost is important (it is slightly cheaper than others more conveniently located hotels in the same class) I would say this is a good choice.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":2.0},"author":"Hyman Reichert","date":"2015-06-02 22:28:36 +0300"},{"content":"I had always wanted to visit HK and pushed the boat out for our Silver Wedding. Like others we opted to upgrade to the Club Room and found ourselves on the 39th floor. The views alone are worth the extra cost. Be sure and ask for a west facing room as you get the aspect out to Hong Kong centre and Kowloon. From the lounge the views are fantastic both during the day and evening when you have front row seats to the lights show at 8.00pm. The staff in the lounge make a real effort to look after you. A real 5 star experience. We found the best way to get around during the day was the metro/underground using Fortress Hill which is only 3 stops from central. I have never felt so safe on an underground system as I did there. We did also go on Star Ferry, buses, taxis and trams as well. On speaking to other tourists on a trip to the Buddha we realised that the compromise of very central v views was worth paying as others didn't have any view out of their hotel due to the built up area nature of the City. The open top bus tour was also an excellent way to find out about HK. We also went to see the Pandas at Ocean Park Theme Park and went on the cable car ride which gave great views over Aberdeen, Stanley and Repulse Bay. The night market in Kowloon was well worth a visit giving you a chance to experience the \"in your face\" Hong Kong. Once again 20/25 minutes back on the metro. Don't bother with the airport transfer which takes around 70 minutes as you are last hotel on the stop, get a taxi as it costs around the same 350HK$ or take the train and then taxi. Always write down where you are going as sometimes the taxi drivers can't understand what you are saying.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kayden Hagenes V","date":"2012-05-19 02:19:44 +0300"},{"content":"Harbour Grand Hong Kong is a good value and modern hotel with spacious, comfortable and well-quipped rooms. The hotel isn't amongst all of the hustle and bustle at Central, Causeway Bay or Wan Chai, however it is a 5 minute walk from the Fortress Hill MTR Station (which is quick, cheap and frequent enough to commute to Hong Kong's major districts with minimal fuss every day) and there are some nice street markets just up the road. I stayed here for a week over New Years and found it to be a great location. Although there isn't a major shopping district around the hotel, there are still the essentials: Mannings, Wellcome supermarket, 7-11, McDonalds (with McCafe - good value coffee in Hong Kong!) and a Starbucks so you will never be without food nor caffeine. I found the Harbour Grand to be significantly cheaper and more spacious than other hotels that are closer to Central and Causeway bay. For me, staying here for a week the financial savings and larger room definitely outweighed the (slightly) out of the way location.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Ryan Hahn","date":"2014-05-13 15:03:42 +0300"}],"public_likes":["Dr. Mariela Monahan","Lolita Donnelly","Jack O'Keefe","Bailee Paucek","Arno Kuphal"],"vacancy":false,"description":"Located on the most beautiful avenue in Val d'Isère, the Hotel with lounge bar, pro shop, spa, large lounge area with a fireplace and spacious bathrooms.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}