{"title":"San Diego/Downtown","name":"Gaslamp Plaza Suites","address":"520 E Street","directions":null,"phone":"+1 619 232-9500","tollfree":null,"email":null,"fax":"+1 619 238-9945","url":"http://www.gaslampplaza.com/","checkin":"4PM","checkout":"11AM","price":"$120-$275","geo":{"lat":32.71482,"lon":-117.15964,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25161,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Well I am not sure where I need to start. I was very excited when I booked this place because it seemed like a great location and cute and cozy. NONE OF THE ABOVE! I rented the suite up at the top. It's the one when you go all the way up the stairs to the left. Don't get me wrong I understand these places are old but this was way too much.. When we got up to our room there was cobwebs all over. The smell inside smelled like burnt flesh if that is even a smell. I had to call them 3 times to come and see about the smell because it was THAT bad. They had to put \"air\" cleaners in the room. They had 3 hooked up. They said we could keep them the entire weekend if we wanted, because that is a relaxing vacation. The air didn't work, it was HOT AND STICKY. The bathroom was DISGUSTING. There was hair all over the counter and the towels were stained and nasty. Let me go to the bed. It STUNK so bad that I refused to lay in it. I was actually scared that the sheets were not even clean. LONG story short, I was planning on staying here for 3 days and after 5 hours there I checked out and went to the HILTON, where I had a clean room and NICE people. BTW, did I mention that when I explained to the lady that I wanted to check out because of all these reasons she REFUSED and said I was LYING. I still had to pay 300 dollars because she said now they wont have a chance of getting anyone in the room and I caused them to LOOSE money. NEVER AGAIN.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Tommie Kshlerin","date":"2013-10-10 07:59:38 +0300"},{"content":"we stayed at the chateau hotel for one week dec.19 th to 24th. we had a room with a balcony facing chartres street,it was just wonderful.location of the chateau is right in the middle of the french quarter. so close to jackson square, restaurants, streetcars and attractions and of course the famous cafe do monde.it was very quiet although so close to everything,we loved to hear the clicking of the horses going by. chateau offers a continental breakfast,free parking with a aaa card ,internet ,10 percent discount for seniors and free newspaper a beautiful courtyard and pool. great employees. the breakfast if taken to your room every morning by donna ,she jus a wonderful person and employyee. she calls you before comming and makes sure you are completely safisfied. we cant't say enough about this caring person. thank you so much donna for making our vacation better. our grandchildren victoria and nick love you.i recommend this hotel to everyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mozelle Langworth","date":"2012-06-22 11:52:07 +0300"},{"content":"Traveling with friends and picked this hotel for the New Orleans experience. If you don't want a cookie cutter hotel this is for you. It takes you back to old New Orleans. The room is decorated in the New Orleans theme. The beds are small doubles. It seems strange at first but gets you in the mood to experience New Orleans as it should be. The room was on the second floor that opened onto a small balcony. A patio is below. It was shrouded in fog when we were there. We never went outside that our glasses didn't fog up. The doors lock with a key. This hotel is about 150 years old. It was abandoned in the 50's and remodeled in 1959. The staff was friendly and the french market and bourbon street were close. We were there when the Saints won their first game of the season and we expected a lot of party noise. We heard a little, but not much. The room is very small, especially for four women with a lot of luggage. Continental Breakfast is limited to muffins, coffee and juice, served by a waitress on the patio. There is a parking fee. A parking lot down the street. This hotel is an experience.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Javonte Zulauf","date":"2015-03-20 14:23:34 +0300"}],"public_likes":["Electa Leannon","Linwood O'Keefe","Ralph Herman","Cleveland Howe","Dax Bode","Mrs. Jermain Bradtke","Erika Mann I"],"vacancy":false,"description":"Housed in a beautiful historic building, this hotel offers lovely rooms and complimentary breakfast - served on the rooftop terrace (weathering permitting).","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}