{"title":"San Francisco/Union Square-Financial District","name":"Handlery Union Square Hotel","address":"351 Geary St","directions":"between Powell and Mason","phone":"+1 415 781-7800","tollfree":null,"email":null,"fax":"+1 415 781-0269","url":"http://www.handlery.com/sf","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7871,"lon":-122.409,"accuracy":"ROOFTOP"},"type":"hotel","id":26214,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I needed a hotel close to the airport as I had a 5 AM flight after traveling to Grand Canyon. Everything was excellent. Check in was easy. The young man at the reception area was very nice. ( I checked in at around 4 pm on August 2, 2011) My husband had to return the rental car and needed a ride back to the hotel. He got directions from the young man at the desk and was picked up by the shuttle and brought back to the hotel. The room was really clean and very comfortable. The hotel is not a resort or anything like that but if you need a room in Phoenix this definitely fits the bill.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Augustus Friesen","date":"2015-07-07 09:07:39 +0300"},{"content":"I was travelling on business from Australia and was very pleased with the experience at this hotel. From the airport pick-up (and drop-off) to the front desk, housekeeping and the restaurant - the staff were friendly, helpful and delivered great service in their respective roles. The hotel room was super clean, comfortable and quiet. I especially enjoyed the Herman Millar chair as I had two days of report writing in my room. Free internet was issue-free and the gym was well-equipped and also clean and tidy at all hours. I would highly recommend this hotel. Other reviews reference the area it is situated in as being very dodgy/dangerous...the area didn't feel this way at all. This hotel is not downtown or near any areas with lots of restaurants but it is very close to a light rail station, safe to walk at night (I felt I was safe as a 30-something year old woman) and only 10 mins from the airport. If you do want something close to eating out etc, Tempe is your best bet or downtown. Great work Garden Inn Phoenix North!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Nicholas Feil","date":"2012-01-09 11:51:28 +0300"},{"content":"I had picked this hotel to stay after a late-ish arrival at PHX the day before our American Southwest Roadtrip, mainly on the reviews here. However, the reviews on Tripadvisor do not do it justice. This hotel is truly a little gem in a huge city such as Phoenix. The impressive service started at the airport where our shuttle driver offered us cold water from a cooler. It went down very well considering we had arrived in the early evening and temps were still hovering around 100F. On arrival, the evening desk clerk was extremely welcoming and friendly, even throwing in a free breakfast buffet when we asked. Warm freshly-baked cookies were also offered as well. The room was a decent size, and nicely decorated with an extremely comfortable bed. The only downside is when we arrived to our room, there were dirty dishes and trays from breakfast on the hallway floor right at our door. When we mentioned it to the clerk, they were taken away promptly with apologies. Location-wise, it is in a deserted area maybe bordering on seedy. However, it is very safe walking around the area, albeit a bit deserted. Other reviewers noted there is an In and Out Burger \"right across the street\" when in reality, it is 5 miles away. There is really nothing nearby food-wise within walking distance, except for a Bill Johnson's Big Apple a short walk away, which offers decent diner food with good service. We didn't try the hotel restaurant other than the buffet breakfast in the morning. The breakfast is excellent with great choices and the hotel serves one of the best omelets we've ever had, hands down. From check-in to check-out, the staff at this hotel can't do enough for you, always smiling, pleasant and professional. In reality if Phoenix were our destination we would probably choose a more central hotel, but for arriving at the airport to go to other destinations this is absolutely going to be our go-to place to stay. Kudos to the management and staff for such a great accommodation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Hardy Kozey","date":"2012-01-24 00:19:28 +0300"},{"content":"On the north side of the airport in an industrial area of Van Buren, so location is not the best, BUT, for the early am flight out, it was ideal. Turned the car in early, after returning from dinner, and the hotel shuttle picked us up from the airport and took us back in the morning- saved a bit of time in the morning, trying to find my way around an unknown airport. Other than the location, the hotel was very nice. Clean, very comfortable beds- comfortable enough I wondered if I should ask about the brand, well laid out, and the staff were extremely helpful and patient. Although I didn't buy the breakfast package since we were departing so early, the hotel did not charge for a cup of coffee on the way out- and it was a pretty decent cup of coffee.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Angel Cummerata","date":"2012-08-13 06:40:58 +0300"}],"public_likes":["Charlene Goldner","Linda Hyatt"],"vacancy":true,"description":"A family hotel with a European flair, and the feel of upscale boutique accommodations providing warm, personal attention. The cable car is located at the corner and attractions are within walking distance.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}