{"title":"Topanga","name":"Topanga Canyon Inn","address":"20310 Callon Dr","directions":null,"phone":"+1 310 570-3791","tollfree":null,"email":"Bed@TopangaCanyonInn.com","fax":null,"url":"http://www.topangacanyoninn.com/index.htm","checkin":null,"checkout":null,"price":"$190-$315/night","geo":{"lat":34.11447,"lon":-118.57851,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":37649,"country":"United States","city":"Topanga","state":"California","reviews":[{"content":"don't get me wrong. The location and price (group rate for Seattle Rock'n'Roll Marathon) for the hotel is not too bad but I know a few people (me included) chose this hotel because of its advertisement for hotel's amenities. This is what's on the hotel's website. Our hotel includes an array of amentities: * Shuttle to start of marathon When I checked in (around 4.30-5 p.m. and check-in time is 3 p.m.), I requested for a spot for the shuttle and was told that no spots available. It's on first come first serve basis. That's fine but if so, shouldn't the hotel put that in their ad. I heard a few other people that were checking in about the same time, told the hotel that that's why they chose this hotel. So if next year, you want to choose this hotel, make sure you get your spot. otherwise, stay at or near the official hotel or Qwestfield where the official shuttle buses depart.","ratings":{"Overall":2.0},"author":"Hanna Toy","date":"2012-04-28 12:00:32 +0300"},{"content":"I don't expect much when I book a Quality Inn. Two stars should mean a clean, comfortable room and not much else. Our room was fairly clean and this place isn't a dive. But the owners cut corners where they shouldn't. The towels are awful, like scratchy sandpaper. We skipped our showers this morning to avoid them, they're that bad. My husband couldn't get a hot shower all day New Year's Day. I assume they were close to capacity, but shouldn't they be prepared for that? The walls are paper thin, which is to be expected I guess. A child's coughing woke me up this morning and I am not a light sleeper. The elevator is so slow, we saw more people simply give up and take the stairs than wait 20 minutes. We ended up carrying our bags up to the 3rd floor. I am writing this review from a coffee shop because I could not access the internet for 2 days. What's the point of free WiFi if it doesn't work? There's a Hyatt Place and a Best Western nearby that are probably a lot better than this place. Don't waste your money. The owners needs to take the ridiculous fee I was charged for a New Year's Eve rate and buy some towels. They clearly don't take much pride in this place which is too bad because it's in a great location.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Ella Sauer","date":"2014-04-10 11:10:36 +0300"},{"content":"This hotel offers a cruise and park special - 238 dollars, excellent package considering they include up to 2 weeks parking and the shuttle back and forth to the ship. We stayed at the Maxwell for three nights before moving here so we were a little spoiled. As we were already in town and were told that the parking was limited we arrived early. Rooms were not available so we waited in the lobby. The lobby area is run down, outdated and dirty. Our room 219 was ready at about 1:30 which was fine - it is a very busy hotel. We took the elevator up - slow and creaky! Room 219 was disgusting, the carpets filthy and badly stained. I quickly looked down the hall at some other rooms, as they were being cleaned, and went back to the front desk. I asked the women for another room at the other end of the hall. She asked if the room had been cleaned and I said yes but that it was still disgusting and I was not about to sleep in it. She moved us to another room that was a bit better. The hotel has great potential ! Good location, indoor pool and work out room. Large breakfast area and parts of it have been updated. They need to update, clean and get new furniture for the lobby. The rooms and hallways all need to be completely refurbished. The elevators also need to be updated - they literally creek and are very slow. Stairs are easily accessible, but when you have several suitcases an elevator is necessary. They have laundry facilities but when we used the dryer it ruined two white shirts , they came out covered in grease!! For Seattle this is the best cruise and park package available but if I weren't going to use that particular package I would recommend you go somewhere else until this place cleans up its act!","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":2.0},"author":"Estell Larkin","date":"2015-07-28 19:50:39 +0300"},{"content":"We spent 5 nights at Quality Inn & Suites and it was great. The room was clean and there was adequate space. We booked a suite that had 1 king size bed in the first room with a small kitchenette and the second bedroom had 2 double beds and a bathroom to the side. This room comes with 2 TVs. The pool was a hit with the kids and the hot tub was clean and hot. They picked us up from the Amtrak station for $15 including 7 trunks. And dropped us at the airport at the end for $30, again with 7 trunks and all our other hand luggage. In the US, it is difficult to find hotels that cater to for 5 people where the parents don't have to room with the children for any price, so, this hotel was great for us. And the price was good too. The hotel front desk staff were great, some of them even helped us figure out which buses to take to visit a few of the further flung locations we wanted to get to. And of course it is only a few blocks to Seattle Center, so one can just walk there. Breakfast was included and while it wasn't a great breakfast (we eat mostly fruit and don't like lots of wheat and starch), the breakfast was similar to that we've had in other hotels in the US. I do think that the rooms at the front of the hotel might be noisier as the hotel is on a busy street, but we had a room facing the back and looking onto the hotel next door. Not a great view, but we slept fine. So if noise will be a problem for you, ask for a room facing the back. We used the kitchenette to make sandwiches and to eat takeout foods from the grocery stores nearby. We don't usually dine out as our younger children are not adventurous eaters, so paying a small fortune to eat in an expensive restaurant where the kids don't like the food doesn't make sense to us. We didn't want to eat McDonalds all week either, so the kitchenette was very handy. It is not a fully equiped kitchen. There is a sink, stove, small fridge, microwave, coffee maker and a dishwasher, but there are limited pots and pans and only a few plates and bowls. But it was adequate for our needs as I didn't want to cook meals. The hotel was close to two very good grocery stores, one in the Pan Pacific Hotel and a QFC at the bottom Seattle Center on 5th. Both are about a 10 minute walk from the hotel. The store in the Pan Pacific Hotel was more expensive, but they had a bigger selection of takeout foods that were relatively healthy. Both stores had lots of fruit and veg including organic foods. I'd stay in this hotel again if I needed to go to Seattle and wanted to stay near the Space Needle or downtown, especially if I was traveling with children or teenagers. They even have free parking.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Devon Walter","date":"2013-08-27 16:45:32 +0300"}],"public_likes":["Axel Veum","Carey Turner","Jennifer Rice","Daphney Hickle"],"vacancy":true,"description":"A secluded Bed and Breakfast off Topanga Canyon Boulevard.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}