{"title":"San Francisco/Golden Gate","name":"Hotel del Sol","address":"3100 Webster St","directions":"at Greenwich St","phone":"+1 415 921-5520","tollfree":null,"email":"del@communehotels.com","fax":"+1 415 931-4137","url":"http://www.jdvhotels.com/hotels/california/san-francisco-hotels/hotel-del-sol/","checkin":"3PM","checkout":"noon","price":"$119-$199","geo":{"lat":37.7994,"lon":-122.4341,"accuracy":"APPROXIMATE"},"type":"hotel","id":25802,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My first trip to the USA; I picked this 16 room Inn from the TripAdvisor recommendations, and I was not disappointed. The only problem I had was parking the rental car, but the Prudential building one block away (2 minutes) had plenty of safe parking at $39 per day. Very close to the 'T' station on the green line, and in the Back Bay area - walkable to Copley Square and as far as Boston Common. The Prudential building had good shopping malls with numerous restaurants; there is a 7 Eleven store opposite the hotel and Shaw's is 5 minutes away. With the studio room having its own kitchenette (fridge/freezer, microwave, coffee maker, toaster oven, two ring electric hob and even a waste disposer), one could have cooked if one wanted - and great for snacks etc. A basic breakfast is available downstairs in the small lounge from 7 to 11am, with a large-screen Apple for internet access; hot coffee, cold juice & yogurt, toasted muffins and bagels set you up for the day. Tom the manager couldn't have been more helpful and friendly - his staff are on duty until 10pm in the office, and available later by telephone. One (small) minus - the hotel opened in the fall of 2008 after a major refit, but is an characterful 'brownstone' building with wood floors; it's a matter of showing consideration for the other HOUSE guests, for that is what we were - the room is serviced when required, but will be left for up to 8 days if not required - perfect for that late sleep-in after traveling! Air conditioning kept us warm, but fresh air was also good in the quiet neighborhood. A first-class experience of US hospitality and a 'boutique' hotel! Thanks, Tom; you made our stay great. We'll be back real soon!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jerrell Klocko","date":"2014-01-14 00:43:33 +0300"},{"content":"We stayed here for 3 nights in the beginning of October and thought this hotel was a pure delight. Just the thing you need en want when you are in the big city! 2 weeks before you arrive you receive an entrance-code by e-mail, when using this both the front door and room door opens. No checking-in, you walk straight to your room, strange, but something we both appreciated. The room was beautiful, very large bed, hugh flat screen, nice bathroom and even a kitchen (we didn't use that but still it was nice). In the morning you go to a small sort of kitchen where there is the best coffee (nespresso) available, with some cakes, fruit bars, yoghurt and brownees, nice sitting area, again another enormous flat screen, after that: off you go, the city is waiting! The inn is located very centrally, 3 minute walk to the T, several shopping centers nearby, go to Top of the Hub for a nice drink with gorgeous view, again a 10 minute walk max. Very safe area. We would de finately stay here again when we visit Boston and already recommended it to several of our friends and family. I wish every big city in the US had a place like this!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Miss Rossie Schaefer","date":"2014-08-06 02:39:39 +0300"},{"content":"We stayed in Room 301 (deluxe 1 bedroom suite). The room was spacious, clean and well equiped, and great value for money). We loved the check-in system (key pad coded for both main entrance, and room), and the privacy that it gave us. We also enjoyed the extensive channel options on both of the TV's. The hotel is on a quiet street, yet only 100 yards from the Prudential Centre and the T. Also, for sports fans, a short walk to Fenway.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Forrest Koelpin","date":"2013-12-14 19:19:51 +0300"}],"public_likes":["Mr. Leila Ferry","Reid Prohaska","Stella Osinski","Verlie Rippin","Ellen Ryan","Arely Ritchie III","Tito Homenick","Everett Skiles"],"vacancy":true,"description":"Voted CitySearch San Francisco's &quot;Best Budget Hotel&quot;, &quot;Best Family-Friendly Hotel,&quot; and &quot;Best Hotel Pool&quot; in 2006. Part of the fancy Joie de Vivre hotel group, this formerly nondescript motor lodge was rejuvenated with some cool colors, interior design, and upgraded management.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}