{"title":"Bedford","name":"The Swan Hotel","address":"The Embankment, MK40 1RW","directions":null,"phone":"+44 1234 346565","tollfree":null,"email":null,"fax":null,"url":"http://www.bedfordswanhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.13491,"lon":-0.46546,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":2622,"country":"United Kingdom","city":"Bedford","state":null,"reviews":[{"content":"We were 3 adults with 2 teenagers going to Orlando for the theme parks. We booked these appartments through Jetsave, they were an alternative to a villa or hotel rooms. They were reasonably priced, so we weren't expecting too much. When we arrived the staff were friendly and proffesional. Our appartment was huge, it had 3 bedrooms and 3 bathrooms - the master ensuite had a massive shower, a jacuzzi bath and two sinks! The kitchen had everything you would need to cook and eat everynight if you wanted, with a washing machine and tumble drier.We also had a large balcony overlooking the pool area. This was very nice but the pool was open till 11pm and sometimes groups arrived late and headed straight for the pool, while we were in bed. We had some maid service included in our package, so the beds were made towels were changed and the dishwasher filled and started for us. We were disappointed to find out that the maid did NOT clean or bleach the toilets. It is ideally situated for all the parks, literally 5 minutes from Disney. (It's right behind the Nickelodeon hotel) The pool was always spotlessly clean, with clean towels always available. There was a complimentary breakfast thrown in, it is not up to much, but you could eat there every day for free, so who would complain about it? Overall this is a very good resort. Not as big and isolated as a villa, but with all the benefits of self-catering. I would stay there again- no question!","ratings":{"Overall":4.0},"author":"Kevon Denesik","date":"2014-08-09 23:53:23 +0300"},{"content":"Found this resort at a very good price in VBRO direct from the owner. Three bedroom, three bathroom, 4th floor very nice view of pool, washer/dryer, full kitchen, 3 TVs, very close to everything - parks, shopping, cinema, downtown disney, old town. The best thing about this hotel was location. Overall everything was good, big rooms, clean well kept, fast check in and faster check out. Stayed with 3 year old and wife, lots of space good internet access. There is not much bad to say except there was not much to do at the resort if you wanted to stay in.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Eli Kutch","date":"2014-01-10 21:49:03 +0300"},{"content":"The first time we stayed at Resort Quest, we loved it. We were very disappointed this time. First of all, we had noisy neighbors next to us who sounded like they were moving furniture all night. The dryer took hours to dry one load of clothes. We opted not to have cleaning service or linens replenished on a daily basis. However, someone did come into the condo and took out the trash. Someone took my sons cellphone and made over $1200 in calls to Honduras. The televisions were outdated and security was very lax, unlike our first visit. We love the location and the close proximity to stores and parks, but I don't think I will be staying there the next time.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Johnathan Brekke","date":"2012-07-19 16:37:49 +0300"},{"content":"wonderful resort,so close to all amenities and although we hired a car shuttle service and taxis were easily available. The resort was beautifully maintained and really clean.Pool area lovely with high spec loungers ,plenty of spotless pool towels and good toilet facilities. Staff friendly and most helpful and we were moved to a condo nearer to the pool area after our first night with the minimum fuss and it seemed to be pleasure for the staff to be able to help us!! 2 bedroomed apartment was huge and all facilities perfect and clean.We declined housekeeping for the 2 week stay but maid service emptied bins and tidied on a daily basis anyway. As 2 middle aged fogies just in search of sun and relaxation it was marvellous but an in house bar with some entertainment would have been the icing on the cake","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kelsi Ankunding","date":"2012-08-16 01:17:20 +0300"},{"content":"We had a great time at the WorldQuest resort. I was impressed with the condo-style rooms, large living area and kitchen. We (family of 4) had a 3 bedroom 2 bath condo and shared it with my sister's family of 5 and grandparents - so three families total. The condo was big enough for all, I only wish we had 3 bathrooms since we had to share with the grandparents. The kitchen was well stocked with at least one of everything we needed (except specialty things like rice cookers) and we cooked quite a few dinners there. It also had dishwashing detergent and dishsoap which was nice. The only problem we encountered was that with \"limited housekeeping\" they did not check toilet paper and replace it. This seemed to be strange and I wonder if we had called and requested if they would have supplied these necessities. My mother just bought replacements. The website lists a surcharge for wireless internet service. However, there was free internet access through a cable at the counter/bar area of the kitchen. This served our needs nicely and we thought this was a nice unexpected free service. The location was as good as any other we saw in the area. It was right behind the Nickelodian resort and easy to find after your first visit. The lobby area was nice and we enjoyed the free breakfast a few mornings. It was good quality food, but limited to starches (pastries and bagels), cereal and milk, and apples along with coffee and juice. My only suggestion would be to add filtered water - only water available was from the sink in the prep area. We were in building 6 which was a considerable walk (maybe 5 minutes) from the lobby - especially when you're trying to get everyone ready and out the door - so we only ate the free breakfast when we took the shuttle and were going to the lobby area anyways. I saw plenty of folks filling grocery bags with bagels and apples to take back to their rooms. We ended up buying cereal and milk and having that in our room most of the mornings to save time. I used the gym facilities a few times and while small it contained everything I needed for my workout including a few treadmills, free weights and yoga mats. It also had TV's available and towels. Filtered water was available here and I once I found that out I got my water for breakfast here - it's just down the hall. The pool itself was very nice. I wish the heat had been turned up since it was VERY cold when first entering. But we warmed up to it soon and had a blast! The hot tub was a little dirty in my opinion but much warmer then the pool (but not super hot). Tripadvisor was lacking any info on the free shuttle, so I kept our info sheet to post for posterity. Here is the info: - Reserve a shuttle and pick up a boarding pass from the guest services/ticket area in their \"marketplace\" at least 15 minutes prior to departure on the same day. This gives them the opportunity to try to sell you tickets which are actually a good rate (cheaper then gate prices when we checked into it). - Shuttles to Epcot depart at 9:20 am, 11:30 am, 1:20 pm. Then you have to use Disney's internal (free) transportation to the other parks. The free shuttle was \"average\" - a smaller bus that fit approx. 50 people. - Shuttle picks up right outside the lobby area - past the covered pull-through area - you have to be waiting and watching for it or it might not stop. They were mostly on time for the two days we used it. - Worldquest was their last stop so while you got a direct ride to the park, you also run the risk of having to stand or not being allowed boarding since it's full. We had an especially hard time taking a double stroller - there was just no room for it besides in the passenger seat at the front of the bus. The drivers were very nice but want to be tipped for their effort. One had the whole bus sing happy birthday to my 2-year-old on the way to the park which I thought was very nice - and of course he got a tip! - We found the free shuttle to be effective, however when taking the earliest available shuttle we still arrived in the parks one hour after opening - and anyone familiar with Disneyworld knows the first hour in the park is the most important since it's the least crowded. So most of the other days we just paid for parking to get full advantage of that extra hour. - Same for the return: you loose time in the park if you use the shuttle. Return from Epcot was 6:30 pm, 8:45 pm, and last shuttle was 10:30 pm. They made it clear that these were the DEPARTURE times and that if you weren't there on time they would leave without you. Since the Magic Kingdom closed after 11 pm each night, if you took the shuttle you don't get to see the night-time parade, the fireworks and spend that extra time in the parks. And remember that it takes at least 30 minutes to get back to the Epcot area from the other parks, taking away more valuable time. - Good thing about the return trip: you're the first hotel dropped off = short trip back. Which is nice at the end of a long day. - Another disadvantage of the shuttle is that you can't come back to rest in the middle of the day when it's very crowded and your kids need a nap. No return to hotel until 6:30 pm and no departures to Disney in the afternoon/evening. - Would I use the free shuttle again? Probably not. Unless: I didn't care about getting there at gate opening, I didn't have a large stroller, I didn't want to return to my hotel for a nap in the afternoon, and I didn't mind returning before the evening festivities. My mom was happy to use the shuttle since all of this applied to her. It just wasn't for my little \"disney-crazy\" family. Overall I was happy with our stay. I just won't factor in the free shuttle or free breakfast when doing the cost comparison with other hotels. If it's still a good deal without that stuff then I'd stay here again in an instant!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Billy Mueller","date":"2014-07-29 06:05:31 +0300"},{"content":"We just returned from a week in Orlando - Dad, Mom, 15-year-old son and 10-year-old daughter. We travel a couple of times a year and WorldQuest is the nicest place we have stayed. The unit was spotlessly clean, well supplied, convenient to EVERYTHING, and surprisingly reasonable priced. I would strongly recommend it to anyone. The service was outstanding...we messed-up the room safe and there was someone there within 5 minutes. Stay at WorldQuest...you'll be so glad you did!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Arno Jacobson","date":"2013-08-30 07:09:50 +0300"},{"content":"We have stayed at the WorldQuest resort several times over the past several years. When we arrived this time, I was greated by name at check in and was handed my paperwork, eventhough it had been 6 or 9 months since or last stay. Great value and Class A accomodations will keep us coming back, with a free breakfast to boot.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Anderson Beatty","date":"2014-07-17 03:50:10 +0300"},{"content":"Our stay at World Quest was excellent! It exceeded our expectations! We stayed in a 3 bedroom 3 bath condo. It was spacious, clean, and beautiful. Decor was updated and we had a great view of the nature reserve and pool. We could not get the coffee maker to work so we called the front desk and they sent a brand new one right up. We were in building 4 which was a short walk to the clubhouse and bus stop. We walked to the clubhouse daily for breakfast (muffins, bagels, toast, cereal, juices, coffee). You can also buy your park ticket there. We had no trouble with the bus. It was only a few minutes late on a few days. It really beat having to drive to the parks. The only negative about riding the bus is that we could not stay for the fireworks at each park because the last bus to the resort left at 10:30. All staff members we encountered were very polite and friendly. We enjoyed coming back to relax each night after a long day at the parks. We would recommend this hotel to anyone. You will love it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Abbie Hahn","date":"2014-01-06 21:55:27 +0300"}],"public_likes":[],"vacancy":false,"description":"A good central location at the bottom of the High Street on the embankment. The hotel was built in 1794, with more recent extensions increasing its size to 113 rooms. Rooms start around £90.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}