{"title":"San Francisco/Western Addition","name":"Hotel Kabuki","address":"1625 Post Street","directions":"at Laguna","phone":"+1 415 922-3200","tollfree":null,"email":null,"fax":"+1 415 614-5498","url":"http://www.jdvhotels.com/hotels/california/san-francisco-hotels/hotel-kabuki","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.78543,"lon":-122.42849,"accuracy":"ROOFTOP"},"type":"hotel","id":26264,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My mother and I traveled to Istanbul for the first time for a 4 night vacation, and ended up here after our booking agent said there were no 4 star hotels in Sultanahment with available rooms and wanted to book us at a place in Taksim instead. We really wanted to be within walking distance of the cultural sites, so we asked for a 3 star place in the historic district, and we're very glad we decided to stay in the area. The hotel is in a great location - a 5 or 10 minute walk to the Hippodrome, Blue Mosque, Arasta Bazaar, and Grand Palace Mosaics Museum, and about a 15 minute walk to the Aya Sofia, Topkapi Palace, and the Basilica Cistern. It's also a 10-15 minute walk to the tram line and Grand Bazaar. It's on a small side residential street, so you don't get noise from crowds or traffic, which is a plus. There is a view of the Marmara Sea from one side of the hotel and from the outdoor terrace where they serve breakfast. Breakfast is nice - all cold, but a perfectly good start to the day - bread, yogurt, cheese, cold cut meat, tomatoes, olives, fresh fruit, jams, juice, tea, coffee. The rooms were cute - average size (not cramped, not huge), with high wood paneled ceilings, and hardwood floors with an oriental rug. We had asked for a room with two twin beds and got a room with three, which was great. There was a wardrobe and shelves and a TV, as well as a nightstand and lamp. We also had a lot of windows, so the room got nice light, and there were embroidered sheers for privacy. The curtains did a good job of shielding the light in the morning when we were sleeping. The bathroom looked new and had a roomy floor-level shower with lots of hot water and a Western toilet. There is wireless Internet, but we didn't use that since we weren't traveling with our computers, so I can't comment on how well it worked. We only had two complaints. First, the hotel is three floors (no elevator) and has difficult stairs. It's a gorgeous spiral staircase with marble steps, but it's steep and twisty and doesn't have a handrail all along it; plus, there are motion-sensor lights that don't activate until you're halfway up the flight of steps, so you have to navigate in low light sometimes. This was a very minor issue for me as a 20something, but my 60 year old mother had difficulty with it, and I imagine it could be hazardous for the elderly or little kids. The only other issue we had was the bed linens. The beds were only outfitted with a flat (not fitted) sheet on the mattress and a thin blanket. We missed the usual top sheet, and kept having to tuck in and reposition the bottom sheet since it wasn't fitted. I'm guessing this is a local custom, but as exhausted tourists, we would have appreciated Western bedding. Also, the thin blanket wasn't enough for me for the cool nights - however, I used the blanket from the third bed, and I imagine they would have given us an extra one if we had asked. Overall, we felt this was a good value in a great spot, and we liked that it was family-run. It's always nice to support family businesses, and Otkay, the owner, was clearly dedicated. With the addition of a complete handrail on the stairs and Western bedding, this place would be absolutely fantastic! As it is, I would recommend it!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Trycia Fisher","date":"2014-06-17 15:45:23 +0300"},{"content":"When searching for a hotel close to Ciampino airport with swimming pool, this hotel showed up. I booked a room, but when I arrived in the afternoon, warm and sweathy,and asked for the pool, I was being served a lie: \"I'm so sorry, the pool broke down three days ago\". When looking at the pool area, it was clear that the pool had been out all season, reinforcement bars at the pool side were rusty and weed were growing in the pool itself! The hotel is \"next door\" to both the railway line and the runway, so it's extremely noisy. I have now waited three months for a refund from the hotel, and they keep telling me \"the refund has been made\".","ratings":{"Overall":1.0,"Location":1.0,"Service":1.0},"author":"Mrs. Kenny Gulgowski","date":"2013-01-20 00:41:24 +0300"},{"content":"Good location but a tad too close to I17 if you are on the wrong side of hotel. Very loud Decent room but nothing special. Third floor smelled a tad funky as you get off the elevator. The front desk guy was totally overwhelmed with one check in and one phone call. Took 15 minutes to check in plus goofy policy & fee for the in room safe. At least interior corridors.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":3.0},"author":"Hector Ondricka","date":"2012-08-18 09:20:46 +0300"},{"content":"Overall, the Red Roof Inn was a decent experience but a couple of things made the hotel come up short for us. We chose the place because our needs were simple and the price was excellent for the long memorial day weekend. We would have preferred a place with the free continental breakfast for the convenience as much as cost. For a small amount extra we got a microwave and fridge (happy with that, btw) and the hotel info claimed to have coffee available in the lobby so we figured we could forgo the free breakfast. That brings me to my first huge complaint. It wasn't exactly coffee that they had--it was one of those little multi-beverage machines that produced a hot brownish coffee-flavored beverage. I think it's actually supposed to be \"brewed\" but I think they just run some hot water over some instant flake things. Think sanka. Instant coffee would have been preferable. Let me just add that I understand Red Roof Inn is not a fancy hotel and I wasn't expecting Starbucks, just a cup of real coffee. It's not that difficult or expensive to run a coffee maker. And if they don't want to do that, they shouldn't claim to provide it. Okay, I'm obsessing, but I'll bet I'm not the only one who wants a dang cup of coffee in the mornings. Our plan was to purchase a roll or something simple we could heat up for a light breakfast and grab a cup of coffee from the lobby. Well, on to plan B and that meant buying breakfast out. We dealt with it but.... Okay, enough whining over that. My second complaint was that everything seemed to be done on the absolute cheapest-of-the-cheap. We got a tiny little bar of soap for the shower and they have gone to the little single-use shampoo packets instead of the traditional small bottles. Okay, lots of inexpensive places have done that. But it would have been nice to have 2 packets--one for each of us. Cheap. There was only one small trash can for the entire room--none in the bathroom area at all which was inconvenient. And when we had to get an address and directions over the phone and there was no pen or paper in the room. We had a pen but had to scrounge for something to write on. Most inexpensive places still give you a few little sheets of paper. We didn't need fancy stationery and weren't paying for that, but c'mon. There's no frills but this was just plain cheap. Okay, that's the complaints. Nothing we couldn't live with. Otherwise the place was actually very good. The woman who checked up in was very friendly and made us feel welcome. And the clerk when we left was very helpful getting me info to get to the car rental at the airport. The room was cleaner than most and beds were firm and comfortable. Even the air conditioning was good; quiet, easy to adjust and didn't get overly cold or warm which was a pleasant surprise. So except for the few annoyances it's a good place to stay. Just be prepared to provide everything for yourself (including a trash bag) and it's just fine. I might stay there again, depending on the circumstances, but there are other inexpensive choices nearby and I'd probably try one of those instead.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":2.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":2.0,"Location":4.0},"author":"Valentine Gleason","date":"2012-08-23 11:01:35 +0300"},{"content":"We stayed at RR North on April 11 for 2 nights, I have stayed in other RR hotels in other states but this time I think it was a room that it was not bad so but nice is not also the adjetive to describe it, clean? Yes, it was... but that smelly athmosphere was uncomfortable even for the kids who are very easygoing they realized about this thing. We were changed to another room with better results, but in average this hotel needs a renovation asap in order to qualify as a chain brand. I would stay there only if there is no other hotel in the area.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":2.0},"author":"Rigoberto Weimann","date":"2013-11-08 07:10:27 +0300"},{"content":"Stayed 6 nights. $30 cab ride from Sky Harbor Airport. Easy access from I 10. Rented car from Elliot Rd. using Hertz' \"pickup and drop off\" service as the airport costs $150 more with added surcharges and taxes. Hotel was excellent. Clean, comfortable beds and pillows, friendly staff, good breakfast, 24hr coffee, adequate parking, feels safe and number of gas stations, restaurants and fast food places nearby. Only set back was slower Wi-Fi.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Dr. Maymie Schmeler","date":"2015-11-29 08:59:48 +0300"},{"content":"Business traveler spending one night before flying out....location is in a commercial district, not scenic, but seemed safe. Great central location to museums, and 5 minutes to Sky Harbor. Area northeast was rough, but plenty of dining options. Room was average, rooms have balconies. Staff was courteous and knowledgable. Left too early for breakfast.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Eldred Schmidt MD","date":"2012-04-21 23:02:52 +0300"}],"public_likes":["Lester Torphy","Rylee Waelchi","Ian Grant","Granville D'Amore","Catharine Rowe"],"vacancy":true,"description":"A Japanese-style hotel with a calm ambiance.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}