{"title":"Paris/8th arrondissement","name":"Prince de Galles","address":"33 Avenue George V","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.starwoodhotels.com/luxury/property/overview/index.html?propertyID=250","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86912,"lon":2.30076,"accuracy":"APPROXIMATE"},"type":"hotel","id":21853,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Thank Laka (Pele's babe) that the Maui Prince exists! It is the best kept secret on the Ilse of Maui. First off, the beach is fantastic: big, soft sand, good snorkling both to the right and left, and, most importantly, IT IS BASICALLY ONLY USED BY GUESTS OF THE MAUI PRINCE! That final point is the biggest point if you are looking to get away from crowds as part of your reason for going to Hawaii. Also, the resort is the closest to Molokini Crater (where we snorkeled with turtles, sharks and a variety of colorful fish). Next, there are a variety of restaurants on the property, so there is no need to drive into Wailea or Kihei for food. Yes, the food is pricey, probably right up there with the Four Seasons, Kea Lani, or Fairmont in terms of cost. It is good quality, however, and Hawaii in general is like eating in Manhattan, price-wise, let's be honest. As for the rooms, we had a suite at the far end of the hotel, not really an ocean view, but you still hear it all night, plus you get the bird songs (and, unfortunately, a punctual rooster). The hotel does need some love, i.e. bucks, in terms of exterior paint and interior decoration, both in the lobby and in the rooms. It is well kept, but no matter how clean you keep 20 year-old tile and furniture, it is still going to show wear and tear. Let me emphasize again, that it is CLEAN, but the owners do need to fork over the cash and do some basic updating. For example, the \"gym\" facility needs to be scrapped and a new out-building, perhaps near the croquet court, constructed of some 2000 feet to hold the current and new exercise equipment. The Prince sits at a real disadvantage to the \"Big Four\" (\"Grand Wailea, Four Seasons, Fairmount, and the Marriott) in terms of appealling to more fitness conscious clietel (and, take note, Owner: those folks pay UP and a good portion of your current clientel is dying off). If they can't scrape up the $750,000-$1,000,000 for such facility, then they need to sell to someone else. That said, we would highly recommend this resort to those couples and families looking for a restful, interesting (on-site, pretty good luau, salt water swimming pools, etc.), and quiet vacation, this is the place. Our beef with the alternative Big Four is that its like being in Beverly Hills or the Upper East Side: lots of people, super pricey, very noisy, a lot of SEE AND BE SEEN (particularly at Spago at the Four Seasons), and a lot of people who go the Big Four just to tell their friends they went to the Big Four. We actually want to go someplace to go there, not impress others. We get enough fake boobs, spray on tan, swell fellas, snotty kids, etc. where we live, so we wanted something a little different. If you share our viewpoint, then you will be happy you stayed at the Maui Prince.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Pierce Reynolds","date":"2015-01-05 12:51:27 +0300"}],"public_likes":[],"vacancy":true,"description":"Named after Edward VIII, the erstwhile Prince of Wales and son of George V, this art-deco hotel opened in 1928 and amassed a veritable potpourri of celebrities in its guest book, ranging from Winston Churchill to Elvis Presley. More recently, it underwent thorough renovation and reopened in 2013 as a part of Starwood's Luxury Collection.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}