{"title":"Offa's Dyke Path","name":"Forest Cottage Self-Catering","address":"1 Forest Cottage","directions":null,"phone":"+44 1691 658032","tollfree":null,"email":null,"fax":null,"url":"http://self-catering-shropshire.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.81529,"lon":-3.09959,"accuracy":"ROOFTOP"},"type":"hotel","id":21036,"country":"United Kingdom","city":"Treflach","state":null,"reviews":[{"content":"The Boston Marriott Long Wharf is a spectacular hotel! The location in the city is perfect for tourists who don't know where they're going - you can walk anywhere and everywhere! The room was beautiful, the view lovely, the beds were extremely comfortable, and the staff and service was great! Right outside the hotel you can grab a delicious meal, take in the historical sights or pick up the ferry for a moonlight harbor cruise out to see the USS Constitution - breathtaking sights and a great stay! I would come back to the Marriott in heartbeat - it is well worth the cost. I highly recommend this hotel to anyone and everyone! It is a beautiful place in a great city!","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Lindsay Emmerich","date":"2013-01-23 21:52:25 +0300"},{"content":"1st stay here, and the main + is the location: short fast cheap MTA ride from airport; close to many attractions, and on the harbor. It's in walking distance of almost everything, and if not, the MTA is great. Don't even think of renting a car in Boston--that is really asking for problems. many rooms, including mine, have water views, and others overlook a nice park. Ask for a room toward harbor end of hotel. It can get noisy on wkends with music from outdoor restaurants/bars nearby. also in spring there are hordes of school kids around the area, I suppose because of the nearby aquarium, boat rides, and on the Freedom Trail.:Reminded me of Hitchcock's The Birds, with adolescent kids substituting for birds. Rooms are small and pricey [mine was $280] and the total taxes are high--another $50+. But rooms are comfortable and clean. I wanted to open the window to get some seabreeze, since the window looked like it was designed to opne--but when I called the desk, I was told they don't open. The a/c took a while to cool the room down, but once it did so, it was comfortable. Then i went for a walk and noticed that a number of room windows were open--no explanation. As usual at Marriotts--which is why I like them--, all personnel are pleasant and responsive.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Miguel King","date":"2012-09-16 02:37:43 +0300"},{"content":"On stopovers on my way to or from Europe, I usually stay either here or the Hilton at the airport. The Long Whart is getting a little long in the tooth and could stand some rennovations, but still it is a competent hotel only a few yards from the most \"high value\" sites in Boston. The cab ride from the airport to the hotel has gone up considerably over the years but it's good if you are \"on your way through\" and have a little time to do some sightseeing.","ratings":{"Service":5.0,"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":5.0},"author":"Devante Leuschke Jr.","date":"2013-07-13 15:01:49 +0300"},{"content":"We just came back from 3 nights stay at the Marriott Long Wharf in Boston. Whatever can go wrong went wrong with our stay. 1. Marriott made mistake with our reservation so we were placed in their small standard room with 2 double beds for $299.00. We were party of 2 adults and 2 teenage daughters. We were told by CARMEN at the front desk that they didn't have the corner unit that I requested. She said that our reservation didn't request the corner unit so that when the corner unit next to us opened up, we couldn't get it. She had to give it to someone who REQUESTED it. Finally around 9:30, we decided that this wasn't going to work so that we called in to shorten our stay. ROCHELLE from the the front desk immediately searched for bigger room for us and found the corner unit which we were told were fully booked. She apologized for the misunderstanding since our reservation shows my request for the bigger room. 2. Our third and final night, room next door left their joining door open and decided to have a LOUD LOUD sex session at 10:00 pm. We were all watching TV. My husband tried to match the volume with TV but they were louder. Thank God the session were interrupted by a phone call from their friend. After 3 calls to the front desk went without any action, I went down to ask if anything can be done about this. ANDREW placed me and my daughters in another room for no charge. This room was located right above the street level bar which were filled with at least 50 young patrons. They all left by 2:00 am. My daughters slept with pillows over their head. At least this noise was preferred to the other noise. Beside our events, we were extremely happy with the service from rest of the staff. This will not deter me from other Marriott hotel/resort since I have stayed in so many without any incidents but I will ask more questions and double check with my future hotel bookings.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":2.0,"Overall":2.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Cordia Kreiger III","date":"2012-03-29 02:51:36 +0300"},{"content":"We stayed here while so that we could be in the middle of everything in Boston. If I went back, I would certainly stay here again. It is close to everything and right on the water. It is close to the Chart House Restaurant and the Aquarium. The lobby was great and everyone was very friendly. The layout of the hotel is definitely different; however, it is very nice. The only downfall is the $40+ per night parking. However, you must consider that you are staying downtown Boston and that's just the price you pay for convenience. The beds were nice; however, they will soon need some upgrading. I would recommend this hotel to anyone staying in Boston for business or pleasure.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Kaitlyn Osinski","date":"2013-09-14 05:45:21 +0300"},{"content":"Expensive and dumpy. Nearly $200 a night and the still charge $12.50 for Internet. Go elsewhere.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Location":3.0,"Rooms":2.0},"author":"Rosa Moore","date":"2015-02-06 16:18:09 +0300"},{"content":"The hotel has a great classic vibe but they charge three times what you pay at a nice Hilton or Marriot. The bathrooms are tiny and the low pressure, archaic tub wouldn't drain. They charge $12.50 per day for wi-fi - it's 2012, McDonalds and Best Western hotels provide free wi-fi - it should not be considered a \"special\" service but rather a standard amenity, just as much as phone and TV serice. Residential internet costs $12.50 PER MONTH. How in the world do they justify this? Speaking of phones, they need to update those too, they look like they came from a Miami Vice set. The room had no comfortable chairs to sit in, only two rickety dining room chairs so old that there was no padding left in the seats. When I checked out, I had to wait in a 10 minute line at the desk where two atttendants tried to service 30 guests. This place obviously has the resources to update the furniture and fixtures, hire more desk help, and provide free internet. But the truth is, they're counting on guests to be so enamoured with the idea of staying at the \"Historic Plaza Hotel\" that they feel justified in the ridiculous room rates and embarrasing lack of comfort and tech amenities. Next time I'll go to a Double Tree for a third of the price, reasonable guest servies, and a friendlier staff. This place is overated to the extreme.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":1.0,"Location":4.0,"Rooms":1.0},"author":"Allison Walter","date":"2015-04-23 07:14:01 +0300"},{"content":"Really nice staff, somewhat small rooms and double beds only but really nice. My room was perfectly updated and spotless. There were a ton of young European kids in the lobby but they were very quiet at night, and it was a wonderful stay. Thank you!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Seth Crist","date":"2013-03-14 19:28:30 +0300"},{"content":"classy hotel but the water pressure in my shower made it feel like I was taking a bird bath, but other than that had a great stay","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Blanche Cole","date":"2013-11-19 10:31:43 +0300"}],"public_likes":["Linwood Herman MD","Margie Schuppe","Cathy Raynor","Jackeline Hodkiewicz","Randi Wehner"],"vacancy":true,"description":"B&B; Self-catering accommodation","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}