{"title":"Offa's Dyke Path","name":"The Park Hotel","address":"Pandy","directions":null,"phone":"+44 1873 890271","tollfree":null,"email":null,"fax":null,"url":"http://www.theparkhotelwales.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.89509,"lon":-2.96772,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21050,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"I really dont think you can get a better value for your money than staying here. Great rate, very classy, great location, terrific value. By the way, some of the most comfortable pillows and cases ive had at any hotel. Will stay again and would recommend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Lacy Bergstrom V","date":"2015-04-15 18:43:20 +0300"},{"content":"The hotel was everything we had expected from the Park Plaza, until there was a knock on the door. We certainly had not expected the front desk to send us up a bottle of wine and a plate of cheese and crackers with a personalized note extending their wishes for us to enjoy our fundraiser that evening. Remarkable customer service in an already wonderful location and beautiful hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Neva Gerhold","date":"2014-10-05 05:08:12 +0300"},{"content":"This was our first stay at Park Plaza. It would be hard to have a better location: a half block from the public garden and all the shopping of Boylston and Newbury streets. Just a short walk to Trinity Church (a must see), Copley Place, Prudential Center. The hotel is quite lovely - spacious lobby, lounge, and numerous restaurants. We splurged for a concierge level room (they call it the tower level) at a conference rate of $365 per night, including tax, so quite expensive I think. Our room was spotlessly clean, the king bed was very comfortable, and the large flat screen TV worked ok. The bathroom was miniscule. In fact we could not open the door all the way, because the toilet blocked the door! And the bathtub has this very strange gel-like padding on the bottom. It made for a rather dangerous shower, since you had to worry about keeping your balance. Just don't close your eyes, or you might fall over! The size of the room and bathroom are typical of older, historic hotels. But this bathroom was REALLY teeny. The concierge level had a nice lounge that served an ok breakfast and a nice afternoon snack with a cash bar. Overall the Park Plaza is an ok place to stay. Just don't expect a large room like you might get at the newer hotels. It's an historic building. Great staff, very accomodating.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":5.0},"author":"Jan Goyette III","date":"2015-06-05 16:16:05 +0300"},{"content":"Excellent location and conveniently near transport options. Very comfortable rooms and courteous staff. A very historic hotel with nostalgic ambiance. Highly recommended.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Desiree Luettgen","date":"2012-07-17 10:09:04 +0300"},{"content":"I cannot say enough good things about this hotel. It is very elegant. Everyone there is accommodating. They are just simply amazing!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Shania Franecki","date":"2014-07-24 22:42:36 +0300"},{"content":"Located very close to train station. Frank was ablle to get us very good tickets to a Sox game at the last moment. Really liked the \"little things\" like offering us an umbrella to use when it was pouring rain outside. We have stayed here several times and the service has always been super!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mozelle Kub","date":"2015-01-15 23:59:42 +0300"},{"content":"Having read the reviews for the Boston Park Plaza I was a little worried, but my worries were put to rest after I discovered the exact location and walked into my nice air-conditioned chilled room!! We went July 16th weekend when highs were in the mid 90's! I made it a point to request a room with a king and air conditioning that cranked when we checked in and the front desk came through!! This is a historic hotel with lots of character! There are a ton of dining opportunities in the building itself or right across the street, Legal Seafood, McCormick and Schmicks, PF Changs, among others. Our room was huge and had two separate bathrooms as well (free upgrade to Deluxe)...the bathrooms were on the small side but nice to have my own bathroom!! The shower pressure was great and there was plenty of hot water! The bed was super comfortable with both down pillows and regular foam pillows. TV wasn't plasma or LCD but was 32 inch and had plenty of channel opportunity. coffee maker was a krups machine with 4 servings to brew! The fitness Center wasn't your typical 10x10 room....they had several precor machines, free weights, a yoga room and strength training machines! If I go back to Boston I will definitely stay at the Boston Park Plaza! We booked through Priceline and got a fantastic deal!!!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Clair Labadie III","date":"2013-07-31 15:27:34 +0300"},{"content":"I stayed twice at the Boston plazas and had slightly different experiences. It's located in Back Bay, which is a great area that is accessible to many things and nice to walk around during the day. At night, it's quite deserted and there isn't even many take away or fast food options if you are looking to eat (I had to eat food from a CVS store..). The check in the first time was breezy, however he wouldn't let me use my credit card that still had the generic card as I hadn't received the new one. The signature matched my identifitication.. but anyway, go to the atm he tells me. The atm was out of service, so i had to walk to a bank. Minor inconvenience, but inconvenience in any event. The lobby is very nice and there are many staff members on hand to assist you in you need help. The room was very-very large (as big as a suite almost) and had 2 double beds. There was a desk area, lcd and windows that opened to a sheltered roof that clearly many people sat out and smoked on. The bathroom was large in size with a full bath and seat in there, so perhaps it was a disabled access room (explains the size?). My only complaint about the room was the noise associated with the old heat/cool system, so loud. The room was next to the ice machine too, so some noise. The breakfast was sufficient (fruit plate, berries, muffins and coffee with juice) and there were no complaints with service otherwise. There was a candy/drink machine in the iceroom which was convenient also. But they didn't accept many coins or notes (evens ones listed, just shoots them back.. randomly), so I think they need updating or calibrating. The second stay I was placed in a much smaller and dated room. The bathroom was a lot smaller, but still had a bathtub. The tv was older however, but there was an nice street view available. I received an express checkout slip under the door the night of leaving, which was missed during the first stay. The girl checking me in accepted my credit card with no questions. All in all a pleasent stay, some inconsistencies within the hotel - but with a hotel of this size.. you half expect it. Gym is small but open 24 hours. Some of the equipment needs updating.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Earnestine Kautzer","date":"2015-08-09 21:18:44 +0300"}],"public_likes":["Mrs. Betsy Denesik","Devon Pacocha","Mr. Pearl Thompson","Madie Schmidt","Florence Parisian IV","Alberta Kautzer"],"vacancy":false,"description":"Accommodation and food services.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}