{"title":"Santa Monica","name":"The Fairmont","address":"101 Wilshire Blvd","directions":null,"phone":"+1 310 576-7777","tollfree":"+1-800-866-5577","email":null,"fax":"+1 310 458-7912","url":"http://www.fairmont.com/santamonica","checkin":null,"checkout":null,"price":"$290-730","geo":{"lat":34.0169,"lon":-118.50111,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26495,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"I have stayed here a few times and would agree that the experience can be hit or miss. I recently went up for a one-night trip with my children over the Christmas holiday to do some sight-seeing in L.A. We found a good rate on Hotwire ($78 plus tax was around $96 total). Parking (with in-and-out privileges) is $22.50/day. The first room we went into was filled with smoke, so we trekked back downstairs and were put in a room on one of the \"Starwood Preferred Guest\" floors, which didn't seem to be any different from the others. The clerk was very friendly and apologetic and I would say the service was good at the front desk. At another time, when I had lost my parking pass and needed a new one, the clerk was very helpful and then took a look at my kids and came back with two Westin Adventure Kids backpacks plus goodies inside. I felt they were trying to make our stay nice. The downside is that, while the hotel is close to LAX, it's in the neighborhood close to LAX. It's not someplace you'd want to walk around outside. Walking out front would be like walking on the side of a freeway. Also, the housekeeping was pretty poor. Our room had a noticeable layer of dust along the entire desk/dresser/minibar area and the bathrooms were very average, especially for something rated as a four-star hotel in Hotwire. The beds were comfortable, like other Westin beds, and the room was fairly quiet, but that may have been different if the hotel were more full. The hotel has a heated pool on the third floor. It's an average-sized pool and the water temperature is heated but not terribly warm. We went in in the evening, when it was in the 50s outside, and the pool felt pretty cool. The jacuzzi was much better, though you can't sit in the jacuzzi and watch your kids in the pool because there are steps and a wall between the two. So if your kids want to swim, be prepared to stay by the pool and save the jacuzzi time for later. The gym is currently being remodeled (as of December 2011). I didn't check out the temporary gym that they had in place. As far as location is concerned, as I mentioned it is minutes from LAX on Century Blvd. We used the hotel as a home base to do activities in Santa Monica. With L.A. traffic going either on the 405 or up the Pacific Coast Highway, it's about 30 minutes to Santa Monica. Having said all of this, my kids thought this was a WONDERFUL hotel. They say it's definitely a four-star hotel and one of the nicest they've been in. Don't they remember the stay at the Hyatt Regency in Maui? So, evidently, it made a great impression on them and hopefully that accounts for something. My tip would be to check Hotwire and try to get a good rate. At less that $100 a night, you'll feel it's a good value.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Zola Berge","date":"2015-10-13 21:24:50 +0300"},{"content":"Very nice and well located hotel at less than 2 miles from LAX. For business travellers is an excelent choice. The rooms are wide and the service is very friendly. The price is average and the outside amenities can satisfy most of guests.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Hilton Reilly","date":"2013-09-18 17:07:27 +0300"},{"content":"I am a frequent guest at this hotel, as it is the best that I have found at LAX. The check in procedure is quick, but friendly. I am able to get from the front desk to my room within 5 minutes of my arrival. Likewise, departure is also expedited as I can select to have my bill placed under the door, emailed to me, or both. Selecting the emailed option ensures that I automatically receive any updates to my bill without having to stop by the front desk (for the breakfast, etc. charged to the room). The restaurant is run by a third party, and though pricey for an airport hotel, offers a high quality product. For those of you who have not tried the heavenly bed, it is the best in the industry.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Maverick Pouros I","date":"2012-08-23 16:58:25 +0300"},{"content":"Booked last minute on the Starwood website. The front desk check in was welcoming, quick, & professional. My room was nice. Clean and quiet. Great value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Kaela Watsica","date":"2012-05-12 07:46:17 +0300"},{"content":"Let me start by saying, the Westin LAX for many years used to be one of our favorites at LAX. Sadly, it has suffered a steep decline in customer service. I would not recommend this hotel for people wanting uninterrupted sleep, or for visitors to LA looking for humane treatment after a long flight. Stay somewhere else. Starwood Preferred? I wouldn't recommend it for you, dear member, either. I arrived at midnight, tired, after a long-delayed flight. As a member, I automatically just lined up in that line, only to be completely ignored by the desk clerk. The desk clerk kept taking guests from the other line, presumably because the \"Preferred\" clerk was off having a tea-break. Eventually, the Preferred clerk arrived back, and motioned me forward. No \"hello\", no \"nice to see you, just a bored, unfriendly \"name?\". Then he couldn't find my reservation. He sighed, went and got the night manager, and both of them stood there for the next several minutes slowly scrolling their way through the system - at midnight. Hello... person needing to sleep here... Eventually they found half of my booking, but had trouble reconciling the two nights, presumably because they were prepaid using points. After a dozen more minutes they got that sorted out - then put me in a room with two single beds. So we started over. After a half hour more delay, they finally sent me to an incredibly noisy room that faced the runway - exactly the type of room I had requested that they not put me in. By then, even I was too tired to care, so I turned in. Then around one a.m., a party started in the room next door (warning to guests: the Westin has very thin walls). I called down but no one called or came up or did anything to stop the noise, so after fifteen minutes, I knocked on the door myself and the guests were kind enough to stop. Roll on to this morning - despite my placing a \"Do Not Disturb\" sign on the door, a Westin day manager with a clipboard knocked on my door and woke me up to tell me that it was \"time for me to check out.\" I told him I was booked for two nights and was desperately trying to get some sleep. Sorry, but you need to check out, he said. No, I don't, I replied. Please check. After a little more prodding, he checked. Oh, you're right. He then apologized (the only manager that apologized for anything during this entire stay) - but by that time I was awake. Roll on to the evening. I'm dead tired by now and have just fallen asleep when the Duty Manager (a man who would perhaps be better suited to working at a morgue than in live customer service) wakes me up to tell me that my credit card has been declined and he needs another card. I told him that is not possible because it is a Gold Amex, and completely up to date, and asked him to retry it, but he refused to. So I offered to give him another card over the phone. He said no, you can't do this over the phone, we need to have the physical card to swipe. I said, look, the rooms are prepaid, the card you have is fine, I'm sleeping, if you need another card for the incidentals, I'll give it to you in the morning. He gets testy and responds by saying if you don't provide me with the card, you can't continue to stay in the hotel. Say what? I remind him that I've prepaid for my two nights (the card is being used for incidentals only.) He says it doesn't matter - he needs to swipe the card, or I can't stay - even though I've pre-paid for the room! At this point, I'm getting annoyed. I've paid for the room with points earned from hundreds of stays at Starwood properties. And this is the third time I've been deprived of sleep in less than 24 hours at the Westin LAX, and I'm exhausted. I call Amex. They confirm my card is 100% fine - the hotel made an error while entering the credit card date - they entered 11 instead of 14. I ask them to hold, get dressed, go down to the lobby and ask for the manager. I put him on the phone with Amex. Amex confirms to him that the hotel made a mistake. The rooms are fully paid for (and had been all along). The incidentals will be covered, if he just enters the date correctly. We hang up. I ask the manager for an apology. He refuses. He says instead that if I don't like the service, I can leave. At this point, I'm stunned. And beyond tired, and really frustrated. I can't believe the level of tone-deafness on display. The guy shows no understanding of the concept that the primary reason that anyone needs a hotel room is because they want to sleep. I don't know who to feel more sorry for - myself, future weary travelers, or Starwood shareholders. Anyway, sorry for the long rant, but that's what these reviews are for - sharing. Speaking of which, I am now writing this from the Hilton LAX, where the people were nice on check in and treated me like a fellow human being (thank you!) I'd forgotten how nice the Hilton LAX is. Now that I'm back, I would strongly suggest that visitors to the LA Airport area stay here instead of the Westin - it's usually around the same price, but closer to the airport, the amenities are similar, the food is better, but most importantly, it appears to be staffed by caring humans. As for the Westin LAX, unless you enjoy being treated like the meat in a sausage machine by uncaring duty managers, and constantly deprived of sleep, you may want to avoid it. Life's too short, and \"Preferred\" clearly isn't what it used to be.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":3.0},"author":"Joan Oberbrunner","date":"2015-11-10 14:12:55 +0300"},{"content":"Stayed here twice this week, had stayed here several times before. It continues to be very well run, and extremely good value. Seems that it is priced much lower than several other major hotels which are just slightly closer to the LAX terminals. It is well with the extra few minutes on the shuttle or in your rental car, since it is comfortable and very good value. I will continue to stat here whenever I am in LA and need to stay near the airport.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Avery Stamm","date":"2012-09-23 08:54:28 +0300"},{"content":"This hotel caters to those who are flying out of the airport and only need a place to stay for the night. They have a dedicated line for airline flight crews. The line to check in when we arrived in the evening was very long and they didn't have enough front desk presonnel to cover it. We only stayed one night and didn't see much of the hotel. The rooms were average for a Westin. Nothing too special, somewhat older bathroom that looked like it had been remodeled, but was starting to show some age. The rest of the room was fine, but nothing better than average.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Francesca Zemlak","date":"2015-07-27 13:48:14 +0300"}],"public_likes":["Velva DuBuque MD","Dr. Keara Schaden"],"vacancy":false,"description":"A great hotel, but it only has ocean views.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}