{"title":"San Francisco/Golden Gate","name":"Presidio Inn & Suites","address":"2361 Lombard St","directions":"between Pierce St and Scott St","phone":"+1 415 931-7810","tollfree":null,"email":"presidioinn@gmail.com","fax":"+1 415 931-5318","url":"http://www.presidioinn.com/","checkin":null,"checkout":null,"price":"$70–$140","geo":{"lat":37.7991,"lon":-122.4404,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25796,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We were pleasantly surprised because we thought the price would reflect a run down hotel compared to the price we paid downtown for the W. Free internet in the lobby, great breakfast, stylish rooms and very comfortable beds. Bathroom was small and a little dark, but shower was good. Lobby area has a fireplace and many sitting areas with cool furniture. The free parking is also a bonus - there is a big parking lot behind the hotel for easy in, easy out. Staff nice. The cab ride downtown to eat was around $16 each way, but the money saved on the room fee makes up for being a little out of the loop from downtown. We will stay here again!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Rosetta Sanford","date":"2015-01-31 03:29:24 +0300"},{"content":"A very stylish hotel to stay in, good location with the river taxi only one stop away from St Marks. Staff generally helpful around the hotel. Rooms of a good size and stylishly designed, very high ceilings. Bathroom a tad on the bling side with a strange, dark shower/bath combination, with steps leading up into it. Food generally good for lunch and snacks. Breakfast offering was above average, busy most days. You are required to leave your room key at reception when you go out of the hotel - people may not always be used to this, but it was fine and had no security concerns with our room. I must commend the waitress we had one evening for a light dinner - outstanding and touching service - she was partially deaf, but she gave 100% care, concern and effort to her job with impeccable attention to detailed service from taking our order, ensuring it was totally correct, setting our table and giving us the most wonderful, warm, genuine smile when we ordered the house gelati selection and upon departure. Venice - well, some love it, I got over the romance for the place in a few hours after arrival. Eating out is expensive, it's a complex city to navigate, lots of architecture and gondolas to look at, St Marks is not that impressive and a lot of scaffolding around. Shopping isn't that great either! Water taxi to hotel is 60 euros...","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Alphonso Swaniawski","date":"2012-12-15 23:59:00 +0300"},{"content":"Location - We travelled to this hotel by the water bus Number 1 was the stop, which was right next to the hotel. Really easy to reach the main squares by foot as there were lots of bridges providing access from the hotel area elsewhere. Perfect! Staff - The staff were very friendly and helpful. Rooms - The room was an average size but had everything we needed. The bathroom was great also and we had a lovely big balcony, almost as big as the room. The internet was the only bad aspect of this hotel. We had to pay for cards and usage. Food - The breakfast was great and had everything you could want. We also had room service, and i would recommend the deserts. We ate our final meal in the hotel also, which was very nice and had interesting dishes on the menu. Thank you for a wonderful stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Oceane Gislason","date":"2014-03-17 14:02:54 +0300"}],"public_likes":["Andre Boyer","Salvador Greenholt MD"],"vacancy":false,"description":"Small budget European style inn located in the Marina District.  They have free wi-fi and offer a complimentary breakfast.  It's just one block from Chestnut St.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}