{"title":"London/South Kensington-Chelsea","name":"Simply Rooms & Suites","address":"21 Avonmore Road, W14 8RP","directions":"tube: Kensington (Olympia) or West Kensington","phone":"+44 20 3384-4698","tollfree":null,"email":"stay@simplyroomsandsuites.co.uk","fax":"+44 20 7602-9035","url":"http://www.simplyroomsandsuites.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4945,"lon":-0.2071,"accuracy":"ROOFTOP"},"type":"hotel","id":16451,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Can't tell you what a nice place, super people and great location the Ames is. From the front desk to the maids and everyone in between were just great. The rooms were a thing of beauty, and squeaky clean. And finally, the location, oh my God. You are right on the Freedom Trail in the heart of it all. Kudos Ames, you made us all very, very happy!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Kelsi Smitham","date":"2013-05-03 05:39:27 +0300"},{"content":"Ames is centrally located right on the Freedom Trail with easy access to both \"coasts\" of Boston. The location was very perfect for us - the city felt safe even when we walked after dark. There will be city noises - sirens, the occasional loud person, but we loved it! The staff at the Ames were very accommodating and friendly. Especially try to take advantage of their wonderful concierge Charles - he's definitely the man to get you what you need. You rock, Charles! Thank you, Ames, for 8 comfortable days! Couple notes: * Beds/rooms are wonderful, clean and simple * Expect small elevators - a wheelchair will fit, but not easily! * The restaurant food is delicious but not for regular ordering - too expensive and a little too fancy for eating often. * Do NOT take a taxi from the Airport...the subway blue line will let you out steps away from the hotel!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Karelle Hartmann","date":"2014-03-16 12:54:34 +0300"},{"content":"I read all the reviews before traveling, but nothing really did this hotel justice. Located right in the heart of downtown, across from Government Center it was the nicest hotel in the city I think I have stayed in. Everything is very upscale and visually striking, with great a great view of the city from our room. Nice features to mention: heated towel bars, water saving features, modern wall art, and tall ceilings! Hope to be able to stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Luciano Kirlin","date":"2013-03-23 17:31:58 +0300"},{"content":"We stayed here for the Cub/ Red Sox Series and enjoyed it very much. Getting to the hotel could not of been easier as you are no more than 20 steps from the Old State House (State Stop on 'T'). Check in was quick eventhough we were 3 hours early. The safe in our room was broke but they fixed it while we were out doing touristy stuff. Did I mention that you are less than 20 steps from the 'T' and 2 minutes from Quincy Market/ Faniell Hall, etc. Charles the Conceirge (aka C.T.C.) was excellent and very helpful for stops to get some snacks and directions. However, the WiFi was not free and for the price I figure they might have it thrown in with the $300+ room fee. Also there is no exhaust fan in the modern designed bathroom so that was annoying after a shower. The bathroom was very sexy with the glass opening and open to the bedroom.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Abbey Heaney","date":"2014-11-18 11:45:45 +0300"},{"content":"This hotel works very hard to let you know how Cool it is. It's so Cool, it doesn't have its name on the front of the building (a Morgan trademark, apparently). If peppermint-flavoured shampoo is important to you, this is your kind of place. On the other hand, if your definition of Cool includes help carrying your bags to your room, a sofa on which two normal-sized people can sit, minimal street noise, and a seat in the bar, you might find one of Boston's other hotels, in a less seedy part of town, a Cooler choice.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":2.0},"author":"Rose Little","date":"2014-11-01 14:25:51 +0300"},{"content":"Ames is a wonderful boutique type of Hotel located a stones throw from Boston Common and Quincy Market. Our experience has been so enjoyable that I am writing this on the 3rd day of our 5 day stay (from the room). The staff at Ames are the most customer service oriented group of folks I've ever experienced while traveling. Nina Sweet (front office manager) and Charles Currier (concierge) played a major role in making our stay remarkale. In the week prior to our arriving in Boston, I emailed Nina to introduce myself and mention to her how much we were looking forward to our stay.. She responded the following day and stated that she had upgraded our room from the standard queen we had booked to a Deluxe King. Additionally, she has provided us with complimentary internet use during our stay, which is allowing me to write this review at no cost.. The pictures posted of the hotel are accurate in that the hotel is very hip and asthetically pleasing to the eyes. Additionally, the room is very comfortable with wood and marble flooring,12 foot ceilings and a window that likely measures 10ft by 6 ft, a 40in flat panel television, very comfortable bed, refridgerator, a safe large enough to store a laptop, complimentary toiletries (shampoo, conditioner, lotion, soap, and body wash) and bath robes. We've been to Boston 2 times prior to this saty, and Ames has been a major factor in making this our best trip yet. Thank you Nina, Charles, and staff!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rollin Zulauf","date":"2015-05-04 21:37:45 +0300"},{"content":"Everything was ok. Nothing stood out. The rooms were stark and empty, which may be a modern look, but seemed cheap. It was also odd that our \"deluxe room\" was rather small. The bathroom was visible from the bed with the glass panels and even with the curtain there was no privacy. The problems really began at checkout. I was charged for multiple nights of parking, when I only stayed for one that included parking. I was charged for items that were previously taken from the mini bar (I did not realize I was supposed to check the mini bar for the hotel when I arrived - they actually said that to me). And then the topper was when the valet would not return my car key, until he received a tip. Even though I had given him $10 on the way in. Needless to say, I will not be staying at the Ames again.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Ida Sauer","date":"2012-08-27 12:45:53 +0300"}],"public_likes":["Estell Kuvalis","Tyrique Farrell","Grant McCullough","Kyler Ryan","Ms. Ben Brakus","Miss Buck Jewess","Shayne Bruen"],"vacancy":false,"description":"New 4 Star hotel boutique hotel offering high spec bedrooms in an excellent location off Kensington High Street (opened May 2010).","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}