{"title":"San Diego/Mission Beach-Pacific Beach","name":"Best Western Mission Bay","address":"2575 Clairemont Drive","directions":null,"phone":null,"tollfree":"+1-800-457-8080","email":null,"fax":null,"url":"http://www.bwmissionbay.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.78989,"lon":-117.20384,"accuracy":"ROOFTOP"},"type":"hotel","id":25242,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"We had a family reunion for about 100 members of our family at the Arizona Biltmore over a 3 day weekend last December. Needless to say, the resort grounds were breathtaking, and very relaxing! We absolutely loved the outdoors. We all had rooms in the Ocotillo wing. The rooms were very nice and comfortable. The Ocotillo lounge with breakfast and all day coffee and tea service was a start attraction for our family:) We did not eat at the hotel's restaurants so can't review them. But all that we experienced was very nice. The one problem we had was that when we initially approached the hotel to book our reunion, we made clear to them that we have lots of kids - and they assured us they 'love families and kids'. But during our 3 day stay, we got the evil eye from other guests over our let's call it the kids' enthusiasm and inability to whisper 24/7. That put a damper on the mood at times.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":3.0},"author":"Beaulah Parker","date":"2014-01-09 11:11:12 +0300"},{"content":"We planned a trip to visit our son in Arizona and thought we'd spend one night at the Biltmore before seeing him. We called the hotel the day we arrived to say we missed our flight and would be arriving later. We wanted to stay in the oldest section of the hotel and have a fabulous meal at the Wright's restaurant. We were very disappointed when we arrived because the oldest section of the hotel and restaurant were closed for renovation just two days earlier....They automatically upgraded our room and sent us chocolates (which were delicious) with a handwritten note. Telling the wonderful young woman who was our waitress at Frank and Albert's restaurant (forgot her name) about our disappointments, she introduced us to one of the waiters from Wrights, who introduced us to Jason, the Sous Chef who made us a special appetizer that we would have experienced if Wright's was open! I want to thank everyone at the Biltmore for their personal attention and care. Thank you to Tim who somehow always bumped into us and made us feel loved. Thank you to Becky for a fabulous tour. I'd recommend this hotel to everyone. We will return again next year!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mrs. Marina Rowe","date":"2012-01-30 03:18:46 +0300"},{"content":"The Biltmore is an outstanding hotel with an outstanding staff. The \"kinks\" that I mention in my title have to do with some troublesome, minor details, but ones that the management might want to consider. I'd been advised by friends who had been there many times to ask for a room in one of the \"Cottages.\" Despite my having been assured that I was connected to the hotel desk when I called, the person I spoke with had no knowledge whatsoever of the cottages--and in fact, she thought I meant the Villas, which are very expensive and very different from cottages. When my husband and I arrived and made our way from the parking garage, we passed through--guess what?--many buildings labeled \"cottages.\" The front desk was puzzled by this gaffe, and we will try again the next time we visit. Although we had a lovely and large room in the Valley wing (and I agree with the person bemoaning the lack of in-room coffee), there is as of this writing no wireless at the hotel, a problem if you have a laptop such as a Macbook Air with no ethernet port. This was very surprising, and a clerk agreed: she said, \"This is 2011, right?\" When my husband turned on the water to take a shower (fortunately, he turned on the water from outside the tub), the entire shower head--one of those large \"rain\" shower head--flew off the connection and into the tub and then into the bathroom. Had he been in the shower at the time, well..... The staff members were eager to make things right when we brought things to their attention. (We hadn't mentioned the shower...) Our keys demagnetized four times--no exaggeration, despite our keeping them away from cell phones, coins, etc.--and when we went to the clerk yet again to have them fixed, the clerk said that such problems were not acceptable and, to our surprise, gave us a small but appreciated credit on our bill. SO...while there were glitches, we'd still go back. The staff members were eager to please, and the place is lovely.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Cassandra Bechtelar","date":"2015-02-23 09:49:54 +0300"},{"content":"wonderful place to relax, have stayed there several time, in cottages, or simple room by main pool. got this time a huge appartment with a terrace looking onto the golf course, amazing ! the hotel is like a village, you can walk around so many places and gardens !","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Modesta Wiegand","date":"2012-01-27 05:02:43 +0300"},{"content":"Day two of a four day stay. Staff is friendly and responsive, hotel grounds and common areas are lovely. Dining is good but if you want a quick breakfast, \"The Cafe\" menu is limited, mostly carbs in the form of pastries. The lunch options looked more promising. The room is definately in need of a face lift. We have broken tile and peeling ceiling paint in an awarkdly designed bathroom. While the hotel room isn't dirty, it isn't sparkling clean. I think this is due to how old the furnishings seem. All in all, it is a fine place to stay but has seen better days.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":5.0},"author":"Kitty Strosin","date":"2013-02-12 10:08:08 +0300"}],"public_likes":["Nicolette Stiedemann","Mrs. Shanny Mertz","Brennan Jaskolski"],"vacancy":false,"description":"A kid friendly hotel off I-5 nearby.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}