{"title":"Pembrokeshire","name":"East Jordeston Cottages","address":"St. Florence, Tenby, Pembrokeshire, SA70 8NT","directions":null,"phone":"+44 1834 871627","tollfree":null,"email":null,"fax":null,"url":"http://www.ejcottages.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.682357,"lon":-4.781434,"accuracy":"ROOFTOP"},"type":"hotel","id":22057,"country":"United Kingdom","city":"Saint Florence","state":null,"reviews":[{"content":"It's a great deal in a nice hotel in the heart of Napa wine country. The staff was top-notch. Within hours of making our initial reservation, the front desk made our reservations at the French Laundry and sent us other recommendations for restaurants in the area. Upon, arriving they provided plenty of information about regional wineries. It's also within within walking distance to the many incredible restaurants and wineries in Yountville. Free breakfast is served daily and surpasses what most hotels serve as a continental breakfast. I have no complaints and would happily stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kade Orn","date":"2013-12-02 23:44:53 +0300"},{"content":"I was able to take advantage of a Zozi coupon, but Napa Valley Lodge is a bargain at full price. From the moment I walked in to check in, everything was perfect. I was warmly greeted. I had a room at the far end looking out over a vineyard. A great bottle of wine awaited me in the spotless room. Internet was fast and free. Loved the beautiful renovated bathrooms and first-class toiletries. Unfortunately, I did not have time to go for a swim or use the hot tub. But, I can't wait to go back and swim some laps in the beautiful, heated pool. Breakfast was very nice, bountiful, and fresh. If I have to offer one less than glowing comment, it would be that my bed, sheets, and pillows at home are more to my liking.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Shad Gusikowski","date":"2012-03-14 17:49:10 +0300"},{"content":"The Napa Valley lodge is ideally situated inn the charming town of Yountville and a short drive from all the fabulous vineyards near by. Our room was spacious, clean and tastefully, yet simply appointed. The bathroom was immaculate and recently renovated with lovely tile and seamless shower. We had a great little patio overlooking the pool. The plus was that it was within walking distance of the fabulous restaurants such as French Laundry and Bouchon. We did not eat their breakfast buffet, opting to walk to local eateries instead. The lodge is more like a motel in the sense that the room doors face outside to the parking lot, but we really enjoyed our stay there. The Location was fabulous and I plan to stay there again!","ratings":{"Overall":4.0},"author":"Abigail Crona","date":"2013-08-25 20:18:57 +0300"},{"content":"We enjoyed our stay at the Napa Valley Lodge. It was the perfect place to stay in the Napa Valley. The town of Yountville, CA is beautiful. It has the best restaurants, great shops, delicious bakery, streets to wonder and spectacular views! It is so easy to get to the vineyards, and there are many wine tasting opportunities in downtown. The hotel provided free wine tasting in the lobby many evenings. The hotel breakfast was delicious. Relaxing in the hot tub or sitting by the fire pit in the evening was the perfect ending to a glorious day in the wine country. I would recommend staying on the 2nd floor as we could hear people above us. Also a room with a view is best!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Harvey Skiles","date":"2014-05-17 15:15:37 +0300"},{"content":"My husband and I live in the bay area and wanted to get away for the weekend without having to fly to our destination. Although Napa is only 45 minutes away once we checked into our hotel we felt miles and miles away from our day to day lives. The Napa Valley Lodge was just what we needed. The service was outstanding. The complimentary breakfast was delicious. Our room was lovely with an incredible view that overlooked the pool and beautiful vine covered hills. We spent one day touring local eateries and wineries and the next day recuperating by the pool. The pool side service was great and my husband and I treated ourselves to massages. Loved loved loved this place. We are already talking about the same exact trip next year!! BTW....the location is fantastic. Yountville is our favorite town. The best restaurants in the area all within walking distance. So feel free to eat, drink, and then safely walk back to the hotel!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dock Gleichner","date":"2014-10-16 12:44:22 +0300"},{"content":"I traveled with my family and we loved the free breakfast. The rooms were amazing and the pool is beautiful and a great place to get together with friends and family. The rooms and bathrooms were very spacious, clean and comfortable. The lobby is very nice and enjoyed the afternoon cookies and wine tasting. The staff was very courteous and helpful and went above and beyond to assist my family. Our room was right off the pool and was so peaceful and quiet. Can't wait to return next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Fabiola Leannon","date":"2013-07-04 05:37:42 +0300"},{"content":"The location of this hotel is fabulous! The town of Yountville is definitely the place to stay. Walking distance to many 5 star restaurants, shops, and wine tasting rooms. A short drive to all the famous Napa Wineries. Try to reserve a room upstairs (it's quieter) and overlooking the pool. It's quite beautiful.We went for the luxury king suite and were not disappointed. Flat screen t.v, super comfy bed, 2 person tub, fluffy robes, and a fireplace with a Duraflame log. The outdoor pool is heated to 90 degrees so you can enjoy it year round, which we did. The front desk staff were very respectful and helpful with reservations. This was a wonderfully romantic place to get away to.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Terry Baumbach PhD","date":"2013-12-09 23:37:09 +0300"},{"content":"I spent New Year's here, waited until the last minute to make plans and was really pleased with the warm and attentive service we received from our first phone call. The room was spacious with a beautiful view. The breakfast was beautifully presented.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Location":5.0,"Rooms":5.0},"author":"Tyshawn Howell","date":"2012-08-31 18:21:29 +0300"}],"public_likes":["Dave Kautzer","Shad Erdman","Albert Deckow","Lon Stehr","Summer Denesik"],"vacancy":true,"description":"5 star luxury holiday cottages near Tenby, Pembrokeshire, Wales. Ideal for the Pembrokeshire Coast National Park, walking, beaches and other activities.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}