{"title":"San Diego/Downtown","name":"Lucky D's Hostel","address":"615 8th Ave","directions":"cnr 8th and Market Street","phone":"+1 619 595-0000","tollfree":null,"email":null,"fax":null,"url":"http://www.luckydshostel.com","checkin":null,"checkout":null,"price":"Dorm beds start around $20/night, privates around $50-$60/person","geo":{"lat":32.71177,"lon":-117.15717,"accuracy":"APPROXIMATE"},"type":"hotel","id":25155,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"As a Hilton Honors Diamond VIP, I selected 2 bottles of water and snacks for Embassy. The front desk notified me that this was only provided on day of check in, but If I selected free internet service, that was available everyday, so I changed my selection in HH My Way account. That doesn't make sense that one option is for check in only and the other (a $10 per day fee) is free everyday...... Valet parking was confusing and expensive, had to park in a yellow curb zone in front of the hotel to check in, then they had to call the Valet person. A couple of days into my stay, the Valet person told me that we could pull into the Garage to find the Valet desk, even though the outside entrance is marked \"Exit Only\" The room was clean, furniture OK. Some of the TV channels faded in and out which was annoying and the remote keys were sticky, like someone had spilled a coke in it. The elevators were slow as molasses, especially on the weekend when everyone was trying to get to the free breakfast before the Saints game. Overall, Below Average for the price.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":3.0},"author":"Glennie McDermott","date":"2014-12-12 16:34:29 +0300"}],"public_likes":["Freddie Johns"],"vacancy":true,"description":"Fun hostel in San Diego's trendy East Village. The hostel offers free breakfast, free dinners, free internet, free house phone, free pub crawl and free use of linens and towels. They also run a weekly tour to Tijuana.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}