{"title":"Paris/15th arrondissement","name":"Novotel Paris Gare Montparnasse","address":"17 Rue Du Cotentin","directions":"Metro: Montparnasse-Bienvenüe or Pasteur","phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.novotel.com/gb/hotel-5060-novotel-paris-gare-montparnasse/index.shtml","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.8386,"lon":2.315,"accuracy":"APPROXIMATE"},"type":"hotel","id":21655,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We changed hotels during our stay in Indianapolis from a 4-star hotel to this Hampton Inn. This hotel beat out the 4-star hands down in every category possible - and was a lot better priced. This hotel is very conveniently located downtown - close to everything! We were here for an event at the convention center and it's a very easy walk down the street. The staff (thank you Megan!) was over-the-top helpful. The rooms were nice and clean. The bathroom was good-sized. There are mirrors in the room so that more than one person can get ready at a time in the morning (always a bonus in our family). And best of all, it was quiet! The beds are double, not queen - so on the smaller side. There is a table and two chairs instead of a desk, which is nice for eating takeout or playing games. But the outlets are next to the table for computer usage. There is no refrigerator or microwave in the rooms. They do have a good variety of tv stations and pay movies available. The breakfast is free and is what I would call a continental-plus. There are some hot dishes available as well as the basics - and it's managed by some very sweet ladies who are very attentive. Also, the breakfast room is on the 2nd floor in a very large room with lots of space to move around in. A nice change from the usual squeeze-and-eat of most hotels with free continental breakfasts.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Meaghan Effertz","date":"2013-08-04 15:42:38 +0300"},{"content":"We have stayed here for three Big Ten Basketball tournaments and have loved our stay. The location is ideal (only one block to Conseco Arena).The staff at the front desk and breakfast staff are terrific and do their best to accomadate your every wish. This year we were forced to check out early because our son had to have emergency heart surgery and the staff was very helpful and sympathetic.Also one of the young men at the door ran almost two blocks to flag down an airport bus. We were not able to tip him,but called a friend and she gave him a tip which he was reluctant to take-Said he was just doing his job. Looking forward to our trip and stay in 2012.We also love meeting and interacting with fans from other Big Ten Universities.cannot not mention the breakfast and staff who work there. They are so helpful and energetic and hard working. I could say more good things ,but better stop. You get the idea.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Gudrun Franecki","date":"2013-11-24 02:49:48 +0300"},{"content":"Just got back from your hotel for the Dealer Expo. This is the second year we've stayed at the Hampton Inn Indy Downtown. We love this hotel! The staff is wonderful, so very friendly; the front desk staff, valet and breakfast attendants are friendly and helpful. This year we were upgraded to a suite with a jacuzzi. That was a nice treat for us as we are hardly ever able to get away for a weekend. I can't wait for next year's Dealer Expo and our night at the Hampton Inn!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jasper Walter","date":"2015-11-07 17:40:38 +0300"},{"content":"I loved this hotel and it's staff! I will stay here again for my next Indy trip! I must say the breakfast area was better than expected and kept us from paying to eat breakfast out! When a staff member found out that I couldnt sleep without the noise from my fan ( like at home) she made sure a fan was placed in my room that day while I was away! (Thanks so much!) While downtown take advantage of the $5 cabs to any other downtown location! Great deal!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Hazel Schumm","date":"2014-12-10 12:46:16 +0300"},{"content":"This is a great location for visiting Indy. The only problem we had was the panhandlers on the street as you walk. The hotel was clean and the staff very friendly. The valet parking guys were very fast if you needed your car. This is next to the circle center mall and lots of restuarants. Try the Weber Grill.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":3.0,"Value":3.0,"Rooms":5.0,"Location":5.0},"author":"Pink Sipes","date":"2012-06-15 04:41:52 +0300"},{"content":"Mine was an unplanned stay at the Hampton Inn & Suites. My flight had been canceled due to weather in Chicago and the alternate flight I was booked on had been oversold. For me this meant an extra two unscheduled nights in Las Vegas. The hotel provides 24 hour shuttle service to the airport and the driver did an excellent job of accomodating my need to go back to the airport several times over two days. The front desk staff was very kind in making sure I had everything I needed and even made recommendations for nearby places the shuttle could drop me for shopping. The breakfast staff and housekeeping were all very attentive and the room clean and comfortable. I can definitely recommend this hotel as a place to stay if you want to be near the airport off the strip.","ratings":{"Overall":4.0},"author":"Kristofer Kling","date":"2012-12-15 05:37:46 +0300"},{"content":"This Hampton Inn is new and the perfect place to stay if you are going to the airport the next day. It is located one street away from the McCarran Airport. The service is excellent, and the rooms are outstanding! Everything is so simple and clean there. The breakfast was good with plenty of options.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rico Keeling","date":"2015-07-04 19:21:13 +0300"}],"public_likes":["Abbigail Wintheiser"],"vacancy":false,"description":"Located in a quiet corner of Montparnasse, and if you don't mind a 10-min walk to the Metro, this is a nice and relatively new hotel. Easy access from the Montparnasse-Bienvenüe Metro: just take the stairs all the way up to the train platforms, exit on Boulevard de Vaugirard, take a left and follow the street up to the hotel. There is a Velib' City Bike Rental park just outside the hotel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}