{"title":"Chippenham","name":"Premier Inn","address":"Cepen Park, West Cepen Way, Chippenham, SN14 6UZ","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi.At the roundabout take 2nd exit onto ''West Cepen Way(A350)'' for 0.2 mi. At roundabout take 3rd exit","phone":"08715 278244 (10p per minute)","tollfree":null,"email":null,"fax":"08715 278245","url":"http://www.premierinn.com/en/hotel/CHICEP/chippenham","checkin":null,"checkout":null,"price":"Rooms from £65 (£29 Deals available)","geo":{"lat":51.4787703,"lon":-2.1320236,"accuracy":"APPROXIMATE"},"type":"hotel","id":5840,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"The experience was perfect relaxation,comfort and service. I have traveled a lot and stay in 4 star hotels and this was by far the best experience I've ever had. Heidi Wilson NY State","ratings":{"Overall":5.0},"author":"Jaylan Murray","date":"2014-01-27 08:47:38 +0300"},{"content":"I attended my nephew's wedding at the hotel. The hotel was very accommodating, when my nephew had to move the wedding indoors a couple of days prior, due to anticipated hot weather. The hotel made the arrangements to move it indoors without hesitation. They wanted my nephew's wedding to meet all his expectations and it did. We had Hors d'Å“uvre's served along with champagne or sparkling cider prior to the dinner. The staff serving us were very attentive. The ballroom where the wedding reception was held was set up so beautifully and the staff serving dinner were very attentive as well and bent over backwards with my need for extra bread, butter, water, coffee etc.... I actually felt so bad for asking for so much and I told them so, but the servers smiled and stated, \" they were happy to be of service\". I have a big family and I caught myself stacking dishes to help the server out of habit and they kindly stated, you are here to relax, let us take care of you\". This statement made me feel special and pampered. We spent the night at the hotel. The room was beautiful, clean, quiet, comfortable and cozy, but also roomy. We had a nice view of Downtown San Diego from our room. If and when I visit San Diego in the future, this is the hotel I would plan to stay at. Great Job Westin!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Aracely Cormier","date":"2015-08-03 20:06:16 +0300"},{"content":"The Hotel stay was excellent. We ate at the restaurant at night & the food was verfy good. I had the Steak which was warm during my entire meal - served on a hot metal plate (with wood on outside). And ambiance was quiet & elegant. The room service was very professional & courteous & appeared to care when they asked if I needed anything else or if I enjoyed my stay (which I did).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Roberta Harvey","date":"2015-03-22 19:48:01 +0300"}],"public_likes":["Dallin Barrows","Gabriel Maggio DDS","Garfield Hoppe","Stone Aufderhar","Luella Hammes","Roselyn Sanford","Osborne Daugherty","Dr. Nellie Champlin"],"vacancy":true,"description":"Chippenham Premier Inn has comfortable beds in every room, and an onsite Brewers Fayre restaurant serving pub food in a family friendly environment","alias":"Premier Inn Chippenham","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}