{"title":"Palm Springs","name":"La Joya Inn","address":"545 Warm Sands Drive","directions":null,"phone":"+1 760 327-6413","tollfree":"+1-800-962-0186","email":"info@Lajoyainn.com","fax":null,"url":"http://www.lajoyainn.com","checkin":null,"checkout":null,"price":"$89–169","geo":{"lat":33.814881,"lon":-116.537248,"accuracy":"ROOFTOP"},"type":"hotel","id":21551,"country":"United States","city":"Palm Springs","state":"California","reviews":[{"content":"I stayed in the Ritz-Carlton for three nights on a business trip. I informed the attendant during check-in that it was my first time in Chicago and was immediately upgraded to a Deluxe room with a view on a high floor from a Superior room. The service was unobtrusive and thoughtful with prompt and excellent in-room dining. The concierge had a ready list of restaurants to recommend and offered VIP lists to reduce wait time. The hotel was a little dated and the room showed some age despite having an LCD TV. The bathroom had a bathtub and shower combination and was a bit small compared to others in its class. There was an excellent pool and fitness center but closes fairly early. The lobby, as with a few other major hotels in the city, was situated on a higher floor, to cut off the riffraff. It was still fairly quick to reach one's room by taking two elevators. Overall, an excellent hotel with superb service and centrally located in the shopping district.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Whitney Hudson","date":"2014-12-16 04:49:04 +0300"},{"content":"Love Love Love the Ritz Carlton Chicago! We travel to Chicago a few times a year and we always stay at the Ritz. The staff is so welcoming, Mark the doorman and Lula the lady who sits at the first floor entry desk always remember our kids names. The front desk, housekeeping and room service have been equally accomodating. When traveling with a baby we always forget some random necessary item, If the hotel didn't have whatever we needed they offered to go out and get it. (Another plus is the perfect toddler and kid sized playground right across the street) The lakeside suites have amazing views of Lake Michigan and Navy Pier. During the summer on the weekends you can catch the fireworks from Navy Pier right from your room. The rooms have just been nicely renovated and are much more contemporary. The Ritz lobby is like a little oasis tucked just 12 floors above a busy metropolis.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Lucie Schmitt","date":"2014-11-07 02:10:19 +0300"}],"public_likes":["Lamar Nader"],"vacancy":true,"description":"Private gay men's clothing optional resort. Gay resort in heart of Pam Springs.","alias":"Inn Exile","pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}