{"title":"London/Westminster","name":"Sanctuary House Hotel","address":"33 Tothill St, SW1H 9LA","directions":"tube: St James's Park","phone":"+44 20 7799-4044","tollfree":null,"email":"sanctuaryhousereception@fullers.co.uk","fax":null,"url":"http://sanctuaryhousehotel.co.uk/","checkin":null,"checkout":null,"price":"From £195","geo":{"lat":51.4996,"lon":-0.1319,"accuracy":"APPROXIMATE"},"type":"hotel","id":16527,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"This is a beautiful old brick building with lots of possibilities. But currently, avoid staying here if you can. The room was in pretty sad shape--even had a broken box frame on the bed. NO HOT WATER!!! Not even after several calls. They still charged full price. Thread-bare towels. No food service but they did have a charming diningroom. Couldn't get into the wireless internet. Best part was that it was very clean.","ratings":{"Service":1.0,"Cleanliness":5.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Adella Weber","date":"2012-06-13 10:41:41 +0300"},{"content":"This five star wanna be guest house is expensive. I had stay in motels that have a best quality. The room was terrible, was so small. The TV are prehistorical , bad cable reception, the toilet was broken. The area have a nice nocturnal live, but It doesn't have to feel in your room,, NO noise insulation. Mosquitoes in the room. They doesn't put you a bracelet and they are constantly asking you if you aree staying at the place..a bad pain.... (I think they are invoicing you enough money for that!!!) They rent you the room for 4 and they does not have even a two full beds for 4 adults. I did understand how they have the nerve to invoice you more than $100 per night for this place in low season....please people, area is nice, but your facilities and service are a terrible experience...","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Wilford Oga","date":"2015-10-10 21:41:32 +0300"},{"content":"Situated in a charming little town, this \"parador\" is totally captivating. Beautiful ocean views from your ample balcony. Snorkeling,diving and boating activities abound. Far and away the best hotel I have found in Puerto Rico. I include in that assessment the Hiltons and DoubleTrees.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ricardo Bode V","date":"2013-10-16 05:07:40 +0300"},{"content":"We stayed at Villa Parguera for a weekend in May and did not enjoy it at all. The place is not well kept and our room was outdated and thoroughly unimpressive. We were told that we had to buy a package deal with the meals included but the food there was so aweful that we ended up dining out instead. There are much better places to stay in Puerto Rico than this, I would suggest going somewhere else.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Scotty Ledner","date":"2014-05-02 16:14:24 +0300"},{"content":"My children thought we had arrived at an upscale resort when we saw the park-like interior grounds overlooking the water with swaying palm trees and beautiful blue water and mangroves extending out into the distance. In fact, it was not that expensive at all. The rooms were nice, with a small outside sitting area. The pool was very pleasant and the grounds were really really nice. There was a boardwalk extending a short distance out through the mangroves to the water. There was no beach but there is no beach at La Parguera. We chartered a small boat to go snorkling and they picked us up at water's edge by the hotel, which was fun. The restaurant had good food but was a little pricey. I would definitely go back to this Parador.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":4.0},"author":"Adah Paucek","date":"2012-05-03 07:08:50 +0300"},{"content":"My wife and I spent 10 days there in March. We were looking for a quiet getaway and we got it. If you want a fast paced casino and beach experience, stay in San Juan and pay a fortune. If you want tranquility, golf, beautiful pools and ocean and a staff that is truly glad you are there, go to the Hilton Ponce Golf & Casino Resort. I suspect most complaints are because the guests were expecting plush urban American facilities. We got a great price for unlimited golf and breakfast. The rooms were great - tile floors, very comfortable beds and quiet, except for the ocean and birds. We loved it. In fact, we wish we were still there. We played about 36 holes of golf every day and had the wonderful golf course almost to ourselves. We went in to Ponce often for dinner and exploring. It was a lot of fun. The golf staff was fantastic. For that matter, all the resort staff were superb. Sancho's Sushi Bar was the only disappointment - food was not good and prices were too high. Coming from San Francisco and Washington DC we have great sushi restaurants. Sancho's could use a rehab. The La Cava restaurant was excellent - food was delicious and properly prices. The waiting staff were fantastic. The La Terraza restaurant was our morning oasis - an outdoor breakfast by a lagoon filled with fish and turtles, plus a great view of the ocean and the pool. What a great way to wake up every morning. The beach is not an idyllic beach, but it is a typical Caribbean beach. I recommend snorkeling on the reefs with Caribbean Images Tours (http://www.caribbeanimagespr.com/caribbeanimagespr.com/Welcome.html) . David Mansfield and his first mate Jorge are great guides. You'll have a fun and safe ecotour of the nearby reef. The 27 hole golf course is fairly new and a stern test when the winds come up in the afternoon. There's plenty of water so bring lots f balls for your first few rounds. Once you get your club selection and routing figured out you will be OK. A few fairways are a little rough due to either too much or too little water, but don't hold that against them. The bunkers were pretty much unplayable, but who cares. Take a drop and have fun. There are lots of birds and iguanas to entertain you along the way. The exercise facility is too small for the size of the facility and could use an expansion and equipment upgrade.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Lew Hauck","date":"2015-05-18 15:40:10 +0300"}],"public_likes":["Ryann Moen","Wilfredo Orn I"],"vacancy":false,"description":"Small hotel in a lovely old building close to Westminster Abbey, part of a popular Fullers pub.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}