{"title":"Venice (California)","name":"Venice Beach Suites and Hotel","address":"1305 Ocean Front Walk","directions":null,"phone":"+1 310-396-4559","tollfree":"+1-888-877-7602","email":null,"fax":"+1 310-396-3989","url":"http://venicebeachsuites.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98826,"lon":-118.47495,"accuracy":"ROOFTOP"},"type":"hotel","id":32176,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We had a great experience at Roman Spa Hot Springs. Convenient location, comfortable room, and \"warm hot springs spa\". Took advantage of the Oasis Spa \"mud bath\" and loved it.","ratings":{"Overall":4.0},"author":"Avery Mills","date":"2012-11-12 14:31:37 +0300"},{"content":"The Roman Spa is a favorite. I have gone to the Roman Spa several times for a romantic weekend. The lush foliage gives the Roman Spa a tropical peaceful ambiance. It is especially beautiful during the holidays. I have also visited the Roman Spa Mother's Day weekend with my mother and sister. The staff was so accomodating. My sister had broken her leg a couple of weeks earlier and the weekend proved to be a bit much for her. The Roman Spa provided a wheel chair, not only for getting around the resort, but for getting to dinner and around town as well. I've even taken my young niece and nephew, who are preteens, to the Roman Spa for an unforgettable weekend. They loved the warm pools. Great restaurants and shopping are all close by. Calistoga is a fun little getaway and the Roman Spa is a special place to enjoy it.","ratings":{"Overall":5.0},"author":"Joannie Ebert","date":"2015-05-09 04:33:48 +0300"},{"content":"I read the (mostly negative) reviews before I stayed at this hotel, and decided to try it anyway to save some money. I was just in town one night to see a band and I was by myself. Hotel was recently updated and is in decent shape. Hotel staff was friendly. Room was small, but bathroom was decent size. The beds aren't as bad as some people have stated but are by no means great. The main problem with this hotel is that the trains constantly run and it's LOUD. I was awoken repeatedly - it sounds and feels like an earthquake. I am normally not someone who gets up at every little sound. I'm guess I would stay here again for one night if I was on a budget, but if you are trying to have a relaxing time, consider whether you can afford a few extra bucks to stay somewhere without the train commotion.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":2.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":1.0},"author":"Rachel Carter","date":"2013-03-23 10:54:22 +0300"},{"content":"I'll tell you what..Nice location.close to La Zona Rosa(relatively speaking) and a great value..Staff was courtious friendly and spoke English well...Will go back this year hopefully!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Idell Osinski","date":"2013-04-02 23:07:48 +0300"},{"content":"Great find the staff were very helpful and gave us very good recommendations where to eat and I must we were'nt disappointed. The room was well appointed and the bed was very comfy. I must say the general manager was great and very professional. Would deffo be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ricky Bashirian","date":"2012-01-12 23:18:30 +0300"},{"content":"Hotel is great, staff is friendly and helpful. You certainly get your value for money, whether you book online or directly with the hotel. Rooms are very cosy (see photos), new furniture and most importantly, hotel is very, very clean. All the staff is very friendly and at your disposal, from waiters, reception staff to manager Serpil. After our four days stay, we have decided this is going to be \"our Istanbul hotel\" that we will be coming back to whenever there. Location is perfect, just off the main street which makes it less noisy and enables you to sleep, yet just few steps away from the main happening. Breakfast is nice, buffet type and you can additionally order anything you want. The option of pick up at the airport if you are staying more than 3 nights is very nice and it was comforting to see the sign with your name at a busy airport in Istanbul. Hotel is very near Taksim square (5min walk) where you can get the metro, bus, taxi to go to other parts of the city. Really enjoyed this stay and will hopefully be going there soon again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Melany Murazik","date":"2012-01-04 21:38:13 +0300"}],"public_likes":["Jack Pfeffer","Madeline Kihn","Maximilian Kris","Andy Denesik","Otilia Wolff","Isom Conroy","Avis Bailey"],"vacancy":true,"description":"Venice Beach Suites & Hotel offers fully furnished vacation/corporate suites in the heart of Venice Beach.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}