{"title":"San Diego/North","name":"Rancho Valencia Resort","address":"5921 Valencia Circle, Rancho Santa Fe","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.ranchovalencia.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.99099,"lon":-117.1861,"accuracy":"ROOFTOP"},"type":"hotel","id":25264,"country":"United States","city":"Del Mar","state":"California","reviews":[{"content":"This was the biggest hotel disapointment that I have ever had! My wife and I scheduled a long weekend in Phoenix and wanted to try the Biltmore for something different than our usual stays at the Phoenecian or Royal Palms. There is no comparison....the Biltmore is very dated, has horrible service in the restaurants, and is somewhat depressing inside. Even in a suite, you almost feel as though you are in a dungeon. We joked that it was somewhat similar to the \"tower of terror\" ride at Disneyland. The worst part about it is that we were woken up early 2 out of the 3 mornings by the groundscrew and their leaf blowers outside of our room. We ended up checking out early and spending out last night at the Royal Palms...and were happy we did!","ratings":{"Overall":1.0},"author":"Johnson Gerlach","date":"2015-06-27 06:04:34 +0300"},{"content":"This hotel is overprice!!! To be honest is not worth spending the money. the food and all the is overprice and is not good. There is no coffee pot, the water cost 5 dollars for a little bottle. A glass of milk is 4 dollars. the staff is very rude and they don't know anything. the rooms are very small with no views. the pools are always closed when you want to go, or there is no towels. The only people who are helpful are the hispanics that work there.","ratings":{"Service":1.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":2.0,"Location":5.0},"author":"Eino Fritsch Sr.","date":"2013-07-09 03:16:34 +0300"},{"content":"The resort grounds are really beautiful, the rooms were spacious, and the weather was gorgeous during our stay, but that's about the best thing I can say about our experience at the Biltmore. For a hotel property of this caliber and at this price point, I really had much higher expectations for the service that we would receive. The hotel seemed to be extremely understaffed as we noticed the same servers working full shifts at the pool and then also at the property's restaurants and lounges at night. Service was terribly slow at all of the restaurants, we waited more than 30 minutes for our waiter to bring us our check one night. On another occassion, our server brought us our drinks and when we gave her exact change (including tip), she exclaimed \"you guys are my favorite customers because now I don't have to come back and check on you.\" We sat outside at this lounge for 5 more hours that night and she never did come back and ask us if we wanted another drink. That experience pretty much sums up our whole stay. I have paid 1/3 the cost at other hotels and gotten far better service than I got at the Biltmore. In my opinion, this property is definitely not worth the money. I would return to this hotel only if the room rate was under $200/night.","ratings":{"Service":2.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":2.0,"Value":1.0,"Rooms":4.0,"Location":4.0},"author":"Jules Schulist","date":"2013-02-03 17:21:32 +0300"},{"content":"The property itself is beautiful and well maintained. The service is another thing altogether. The fridges are well stocked, but don't dare move anything out of the fridge, even if you have no intention on consuming it. You'll be charged an arm and a leg. Mysterious extra charges have appeared on credit cards from numerous people in my group of several hundred that stayed there for a convention this past summer. The hotel was most unhelpful to rectify the situation. Months later, more charges mysteriously appear without explanation. Don't waste your time and money at this place. It's the BilKmore!","ratings":{"Service":2.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":4.0,"Location":2.0},"author":"Berneice Friesen","date":"2015-03-19 17:20:45 +0300"},{"content":"I have read the recent reviews from disappointed guests, but most of them focus on situations that were particular to their staty (e.g. the front desk messed up with their reservation, etc.) My disappointment is more about the actual hotel itself. I was expecting a beautiful, world class resort, but this was a shabby property that at one time may have been nice, but now is just worn out and tired. Everywhere I looked were signs of delayed maintenance. The overall look of the hotel is of an institutional compound with cement grey walls. There was nothing beautiful about it. The carpets were dirty, the landscaping in poor condition, the swimming pools were murky and cloudy, the pool side furniture faded, worn out, rusting. It was sad walking through the grounds and seeing areas where children are supposed to play ping pong, or on playgrounds, but there was overflowing garbage cans right there ruining any nice effect. At the spa, the showers had mildew growing in them, the towels were worn out and faded, and it had an overall cheap quality about it...not luxurious in the least. Parking is very poorly designed. There is only one self-parking lot at one end of the huge complex, and to get to my room I had to drag my luggage through back alley ways full of garbage and junk. The main restaurant is closed for renovations, so I ate at the casual cafe, where cocktails were $12. What a joke! All the food in this place is double or triple what it should be. I would expect this in some opulent, beautiful resort, but not this place. It was a HUGE disappointment. I would not recommend this place, especially for a special, romantic getaway. You will be VERY disappointed.","ratings":{"Service":2.0,"Cleanliness":1.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":2.0},"author":"Tabitha Trantow","date":"2012-04-30 18:16:04 +0300"},{"content":"The Arizona Biltmore Spa has a very nicely manicured grounds and nice staff. However, looking at the prices, I somehow expected more. We stayed first in a room with a \"Mtn View\", unfortunately the noise of the unloading trucks, the garbage bins back behind the buildings, did not make this in my opinion a very desirable room. We opted for a change to the Paradise Wing overlooking the pool and they were able to accomodate. The \"pool exposure\" isn't entirely the greatest because we were a bit toward the rear. I am not a golfer so this resort did not have much appeal in that respect, but they do have a shuttle to the fashion mall. The assorted cafe's on the grounds are very overpriced as are the shops. In excess of $2.50 for a diet coke, not to mention mixed drink prices. Interestingly enough they had a nice lobby table set up with wine glasses, etc... appearred like an evening welcoming reception like they had at Sanctuary (in Arizona) but our hands were quickly slapped away as this was for \"wine dinner\" participants only. Very sad, then at least I might rope off the area or put out a sign! I think if you do a golf package you might be happier, again, I am not a golfer. My spa trip was average, my wife had the Lemongrass Thai Bamboo body scrub and she really enjoyed it. I think we will try the Phoenician the next time or back to the Sanctuary on Camelback.","ratings":{"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Service":5.0,"Rooms":3.0},"author":"Francis Stoltenberg","date":"2013-08-19 09:26:45 +0300"},{"content":"I stayed here for one night on business in early June 2005. My room was large, tastefully decorated and very comfortable. The bathroom was large, clean and had a great shower. I ordered a room service breakfast and it was delicious, although expensive after the delivery charges and gratuities. The fitness facility is first class, among the best I've encountered in 25 years of business travel. The staff members were friendly and very responsive. I understand that Frank Lloyd Wright designed the hotel and it really does have some distinct architectural touches. One thing you may want to consider, however, is that the rooms are in separate buildings and you may have a walk of anywhere from a few feet to a few hundred yards to reach your room.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Caterina Batz","date":"2013-09-23 20:27:04 +0300"}],"public_likes":["Leanne Corwin","Jamison Spinka","Andrew Hane","Angeline Wiza","Rafael Hessel","Ethelyn Altenwerth","Kevin Schroeder"],"vacancy":false,"description":"Luxury resort, featuring a spa, tennis and golf, with 49 suites.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}