{"title":"Newcastle (Down)","name":"Avoca Hotel","address":"93-97 Central Promenade, Newcastle","directions":null,"phone":"+44 28 4372253","tollfree":null,"email":null,"fax":null,"url":"http://www.avocahotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.2073,"lon":-5.8922,"accuracy":"ROOFTOP"},"type":"hotel","id":20124,"country":"United Kingdom","city":"Newcastle","state":null,"reviews":[{"content":"Great Potential We just want to give a special thanks to the Animation Team who went out of their way to provide us with their best service. They are all great employees and were a lot of fun to be around.We look forward to seeing them all again on our next visit.Gerd Brockelmann/ Greg Pape  the rest of the Port Hardy Crew.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Rubie Stracke","date":"2012-11-10 17:29:26 +0300"},{"content":"I had a fantastic experience at this Hotel. It's situated on Kowloon, a perfect location between airport and Honk Kong Island not too far away from Nathan Rd. The luxury shopping area in which this hotel is located is superb, a shopping paradise! The room was large (0cean view) and perfectly cleaned, the bath tube an the shower amazing! Restaurant manager greet us in a warm way and director of whenever/whatever knows how to do her job, the Woo Bar experience was fantastic, very good drinks! Spa and Swimming pool on the roof very elegant and Coomfortable! Concierge guy amazing, he answered to all our inquiries in a warm and enthusiastic way! I want to really recognize that w Hong kong is three thousands step up than the others Hong Kong hotels!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Flavio Johnson","date":"2013-07-11 01:36:24 +0300"},{"content":"Amazing place, great location and the best buffet breakfast ever i really loved this place and will go back again when i am in hong. The airport link is just a 5 min walk through the shopping centre, very convienient.","ratings":{"Overall":4.0},"author":"Sven McKenzie","date":"2013-01-12 19:22:29 +0300"},{"content":"This is the 3rd W i have stayed at the other two being in New York and Shanghai and it lived up to the expectations set by the brand. I have generally found design driven hotels to be lacking in service but this was not the case here as the service was as good as the design. The hotel is a stones throw away from 118 floor high International Commerce Center in west Kowloon that houses the Ritz Carlton Hotel. As i stayed there only for one night i couldnt really use all available facilities but the breakfast was extensive and the cafe had a great view. Within the room the most striking feature is the mini bar that had the most extensive selection ever, right down to an umbrella and a multi pin adapter! All in all it was a very nice stay and like all hotels in Hong Kong, quite expensive.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Margaret Daniel I","date":"2014-02-17 08:12:58 +0300"},{"content":"Pretty cool rooms, kids not welcome in pool area (apparently the pool is a \"the pool is a very sought after venue \", bar was dead on Sat. nights.... Would be a fun hotel for a 20 something looking for a home base, 30+ with kids I do not recommend - feel like I am at a exclusive night club where the staff is pretentious.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Danika Sanford","date":"2014-09-19 15:59:55 +0300"},{"content":"I stayed there with my Mom for two nights last summer, and we had a wonderful experience. We actually live in Shenzhen - the great city immediately to the north of Hong Kong - but I was leaving for Taipei, so I HAD to stay in Hong Kong before I could go back to mainland after Taiwan, and I didn't book the hotel until 20 days beforehand - well, sorry that's another story. My point is therefore W Hotel was kinda pricy to me (compared to many other non-branded upper upscale hotels in HKG), but it was worth a visit to the leading boutique hotel and the adjacent Elements Mall. $$$$$ was well-spent. The location is great. The hotel is right above the Kowloon Train Station, and it's only 20-30 minutes train (subway) ride from the airport if my memory is correct. Based on my experience, the train still ran at 9:40PM and 5AM. Also, I flew Cathay Pacific to Taipei and got checked in right at the train station, so I didn't have to carry my checked bags to go on the train- I liked it so much. It's connected to the Elements Mall, and I personally liked it better than the Harbor City because it was newer and far less crowded. I had no trouble finding things I wanted that I would be able to get at the Harbor City. Front desk staff spoke fluent English and okay Mandarin. Hotel staff were nice and always greeted us with smiles, especially service people at breakfast buffet. W Hong Kong truly met its service level and my expectations. On the first night, we chcked in late and were lucky to get upgraded to a harbor view double room for two nights. Beds were really comfortable, and I absolutely loved the compartmentalized bathroom. I had never used Bliss before, but in-room Bliss body/skin-care products totally turned me into a loyal Bliss customer now. Use of technology and decor were very advanced and artsy, but not too overwhelming. Their housekeeping did a good job, too. It has happened to me many times before that your room didn't get fully cleaned if your stay is longer, but everything looked nice and clean again like a new guestroom after housekeepers came in on our second day. I also used their infinity pool. You'll have to try it, if it's your first stay at the W Hong Kong. It was just so good to see all the skyscrapers nearby in your bathing suits on that fancy rooftop. Although I could smell the chemicals, my hair was fine after swimming in the pool. I heared the spa is really good too. Breakfast was good but not impressive, basic Western style. Don't remember if it was complimentary. If I do have to pay next time, I probably won't have it. (228HKD or something). Personally, I'd just prefer to go to some yum dim sum at other cheap places. Come on, you're in Hong Kong. BTW, passed by W Barcelona last week, and it looked so gorgeous - even better than this one. Regret not having statyed there. I'm kinda a W fan now. - 距离香港国际机场搭机场快线很方便。早上5点多和晚上10点左右都还有车。还可直接在九龙火车站就办理手续。 很喜欢圆方，比海港城人少，逛得舒服。东西很全也很高端，也可丰简由君。 海景房很宽敞，浴室很棒。Bliss的产品很舒服。游泳池值得一去。早餐一般，如果要自掏腰包，不划算。 很喜欢这间W, 以后有机会还会去。","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jadon Ledner","date":"2012-03-13 17:53:29 +0300"},{"content":"One of the best places to stay in Hong Kong , Great Hotel with friendly and helpful staff","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":3.0},"author":"Thalia Reilly","date":"2012-03-24 00:15:16 +0300"},{"content":"Spent the weekend here during a short visit to HK and had an excellent time. Everything from the service at check-in through to room service was great. The rooms are beautiful and spacious, especially in comparison with other hotels in HK. Having had a chance to peek in at a suite I could tell that it really does get even better, not just a little couch and tv but a proper suite. Aside from all the great things about the hotel there's even a airport check-in counter in the same building.. The only downside might be that it's in Kowloon and not on the main drag but there's a free shuttle to get to the main part of Kowloon and a train that takes you to central HK. Definitely recommend staying here and will definitely be back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mary Barton","date":"2014-07-12 02:43:53 +0300"},{"content":"I've never stayed at a hotel that made me feel so young and fun as my recent stay at the W Hong Kong. So many formal, stuffy, scripted hotels in the world! This is the anti-stuffy hotel. I remember not one but two guys delivering my luggage to my room after check-in. One guy was Billy, wearing big thick rimmed glasses. Couldn't tell whether he loved his job, or was really well trained to demonstrate fun... regardless I really felt the W's cool atmosphere. The Kitchen (name of the buffet restaurant) is really cool too. I am a simple cereal eater for breakfast, but I found my favorite cereals already in a little mason jar. I grabbed an other bottle of milk and a mango juice with the same mason-jar lids. So cool. Only bummer was I was helping run a conference in one of the meeting rooms, and the doors to the meeting rooms are like city gates. Massive and hard to push open! You cannot quietly slip out of the room without heaving the doors open. Ok, I had to say something negative! But that's about it. I still prefer the InterContinental, but this one's a must stay if you need to see how cool and fun a hotel can be.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Clair Cummerata","date":"2012-10-24 14:46:02 +0300"}],"public_likes":["Devin Gutmann","Ms. Damian Gerhold","Jamie Abbott"],"vacancy":true,"description":"Family run 16-bedroom licensed hotel. Walking groups and ramblers can get special discounts.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}