{"title":"L'Isle-sur-la-Sorgue","name":"Hôtel Saint Louis","address":"allée de la sauge, RD901","directions":"Le Thor","phone":"+33 4 90 33 70 70","tollfree":null,"email":null,"fax":null,"url":"http://www.hotel-saint-louis-provence.com/","checkin":null,"checkout":null,"price":"from 59 to 92 €","geo":{"lat":43.921105448496,"lon":5.018112659454346,"accuracy":"APPROXIMATE"},"type":"hotel","id":40383,"country":"France","city":"Le Thor","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"Stayed at RobertRamon for three days in September 2010. The hotel was located near a few popular museums and within walking distance to a few restaurants...but the price and overall hotel experience is not worth this location. Amsterdam is a small city and you can walk to everything easily (or take public transportation). The hotel is not very sound proof - I could hear trams running, cars driving on the street, and people talking on the street all night long. I could also hear other people in other hotel rooms talking and walking around their room. On my first day at the hotel, I was waiting to talk with the receptionist while he was helping another person. Thee receptionist created a hotel card key for my room for this person. I only caught this because I was standing at the reception desk and the receptionist said here is a key for room 312 as the people were walking, I pointed out to the receptionist that room 312 was my room...the receptionist called back the people and made them a different key. Not sure what would have happened if I would not have been standing at the reception desk. I would not stay in the hotel again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Dillan Lueilwitz","date":"2014-06-20 10:30:55 +0300"},{"content":"This hotel is great if you are used to warmer climates and tiny single rooms, single room was so small i thought i was in a cupboard, but it was great as I needed to lose aq few pounds and it had no air condictioning thus was about 100.F at all times, you could open the small window and listen to the street noise or workman below, very handy if you are deaf. may also be good for sailors as bed was on a $@!#% and rolled about, thus like being on a ship. Come to think of it, best way to describe a single room is sleeping in hot engine room to an old steam ship in a storm. wifi works if wind in the correct direction for periods of 5 seconds in every hour. sorry almost forgot about breakfast, you need to go down the steepest stairs (like a ladder) to the basement where you will wished you had not.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":1.0},"author":"Paige Botsford","date":"2013-08-16 11:58:16 +0300"},{"content":"Construction and steep stairs proved somewhat problematic, but friendly staff members helped with luggage and were careful to make sure I maneuvered the steep stairs safely. Room was small but clean and comfortable. Excellent location for seeing museums and sights of interests. And the good news? You burn off all the wonderful calories you consume because you get exercise on the Hotel Smit stairs! Great staff. Would stay here again.","ratings":{"Overall":2.0},"author":"Maribel Gibson","date":"2014-03-12 10:51:11 +0300"},{"content":"We headed to a quick visit to Amsterdam and we very pleased with the Hotel Smit. The breakfast buffett that is included with the price of the room was a HUGE budget saver for us. Breaksfast included meats, cheeses, coffee, tea, cold cereal, hardboiled eggs, juice and baguettes -- it filled us up for most of the day! The staff was friendly and helpful. The rooms were clean and even though we were in a smoking room you never would have noticed -- absolutely no smoke stench. The hotel is located within walking distance of most of the Amsterdam museums and the street were is located is home to some pretty shwanky shopping (Cartier, Hugo Boss, Gucci etc...) but the price of the hotel would never lead you to believe this! We plan to return to Amsterdam and will definitely make our reservation at Hotel Smit again.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":3.0},"author":"Jaleel Bartoletti","date":"2015-12-19 12:45:59 +0300"},{"content":"Staff are very friendly and helpful.Breakfast was so good, a great selection to choose from, meats, cheeses, breads, cakes, fruit, cereal. Great coffee also. Our room was spotless. Large shower,all toiletries and a hairdryer included in our bathroom.Lots of storage space. Safe also in every room.Extra pillows and duvets already in your room.Very close to metro station,we walked some days to the sites as they are so close to hotel. Nice restaurants in the area and some lovely shops for buying oils and spices for bringing home in the area.The hotel arranged a taxi to pick us up at airport and we were dropped to the hotel. Very reasonable price. Would recommend this hotel for a city break. Thank you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Candice Towne","date":"2015-07-18 07:18:20 +0300"}],"public_likes":["Lincoln Beahan","Eladio Thompson","Aliza Hickle","Axel Hilll","Dr. Kristina Greenfelder","Jan Reinger","Watson Schulist","Jerel Greenfelder","Daisha Anderson"],"vacancy":false,"description":"has a restaurant, with the possibility of half board. Swimming pool.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}