{"title":"North Uist","name":"Hamersay House","address":null,"directions":null,"phone":"+44 1876 500700","tollfree":null,"email":null,"fax":null,"url":"http://www.hamersayhouse.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60489,"lon":-7.16229,"accuracy":"APPROXIMATE"},"type":"hotel","id":20740,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"We first stayed at the bell town inn in may of 2011 and we thought what a wonderful inn, from the free use of bikes and umbrellas, to the helpful and very freindly staff our room was very clean and a nice size the location is one of the best in town close to everything Seattle has to offer. So here it is oct of 2011 as we are in the process of moving to Seattle and again we stayed at the bell town inn, and again what a wonderful experience, we are going back and forth for interviews and this place always makes us feel so welcome. the best part is we take light rail from the airport to westlake and then a very short six blocks and you have arrived at the inn. I recomend this wonderful inn","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Emerson Rath","date":"2013-09-19 21:35:32 +0300"},{"content":"We stayed two nights, August 30 and 31 on a trip west and one night - September 9 - on the way back home. Found the hotel to be charming and quirky, in keeping with the neighborhood. We thoroughly enjoyed our days and nights during the stay, were able to walk to Pike Place Market, great restaurants, and local shopping. The staff was knowledgeable about restaurants and totally accommodating to our requests; kudos to Courtney, Cesar, Rachel and others whose names I can't remember. The neighborhood around the hotel was filled with interesting characters, but no one ever harassed us or made us feel uncomfortable. Room was very comfortable, even though not air-conditioned. Could hear some \"discussion\" through the courtyard on our last night there, but it subsided pretty quickly. Definitely a place we would look to stay again; Seattle people are the best hosts!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Frederick Sipes","date":"2015-02-16 21:19:46 +0300"},{"content":"Have previously stayed at this hotel and think it is great for price and location but this stay was during hot weather in Seattle (85') and it was impossible to cool the room down. This made it hard to sleep. It was cooler in the lobby and outside.","ratings":{"Cleanliness":4.0,"Sleep Quality":1.0,"Overall":3.0,"Value":5.0,"Service":4.0},"author":"Sonia Schmitt","date":"2015-06-25 14:58:04 +0300"},{"content":"I stayed here with my boyfriend over the Fourth of July weekend. Neither one of us had ever been and just booked this hotel as a package deal. It was a perfect location to everything. We walked everywhere. It felt like no matter where we went it was no more than a ten minute walk. The hotel staff was so accommodating and helped us with anything we needed. They recommended great places to eat and see. They have free bikes you can rent to tour the city that includes a bike lock and a helmet. It is a hotel for a more younger crowd. I wouldn't necessarily want to take my family there. There was just a younger crowd. I highly recommend this place to anyone that was an affordable and comfortable hotel in Seattle.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Emmet Crist","date":"2012-03-26 18:37:38 +0300"}],"public_likes":["Christian Collier PhD"],"vacancy":false,"description":"Formerly the Tigh Dearg Hotel, a new hotel (opened in 2005) located about 15 minutes walk from the ferry.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}