{"title":"San Diego/Downtown","name":"500 West Hotel","address":"500 West Broadway","directions":null,"phone":null,"tollfree":"+1-866-315-4251","email":null,"fax":"+1 619-234-5272","url":"http://www.500westhotelsd.com/","checkin":null,"checkout":null,"price":"Dorms from $44 per night","geo":{"lat":32.71598,"lon":-117.16779,"accuracy":"ROOFTOP"},"type":"hotel","id":25151,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"This relatively new hotel is in a perfect location, about 2 blocks from Pike's Place market and the heart of touristy Seattle. Great water views, typically solid Four Seasons service with their outstanding beds make this a great downtown hotel with a FS twist. I did find some minor housekeeping shortcomings (ironing board wasn't put away after I used it, small bars of soap, clothes I left out weren't folded as they'd typically do in other FS properties) but this is still a stellar city hotel. I also had one of the best massages in my life while enjoying a little down-time here.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Isabel Denesik","date":"2014-10-20 15:05:51 +0300"},{"content":"This is the second time we have stayed at the Four Seasons Seattle. It is located about a block from PIke's Place Market. We visited the Seattle Aquarium, Experience Music Project and the Children's Museum. All are worth the time and money. We also easily could walk to restaurants and went to the Highway 86 jazz bar located about a block away. The Four Seasons service was impeccable. Our room service was great and right on time. We at lunch in the Lounge and our meal was very good. I used the gym and our daughter swam in the pool. Both we very clean and more than adequate for this size hotel. The pool is located outdoors, however heated to about 80 degrees. Our daughter had no problem swimming in it the 50 degree misting weather! We will definitely stay at this hotel again.","ratings":{"Overall":5.0},"author":"Iliana Pacocha","date":"2014-06-18 05:41:06 +0300"},{"content":"I spent three pleasant evenings at the Four Seasons Seattle in May, 2009. I would recommend the hotel to other travelers. The hotel is a new structure, of modest height, right on Seattle’s waterfront. A few of the rooms have direct waterfront views. Many other rooms (mine included) overlook the pool area and have diagonal views of the water. There are also rooms which look out over the streets that surround the hotel (I thiink I'd try to avoid those). The interior décor is modern (think bleached wood, and Scandinavian design). The standard rooms are of decent size, and include a built in desk with two chairs (one a high tech swivel chair with mesh back and seat) and one easy chair. The easy chair suffers (just a little) from the modern design problem – i.e., it’s beautiful to look at but nowhere near as comfortable as a traditional overstuffed arm chair. The room was perfectly quiet during my stay (no noise from adjoining rooms, nor any detectable noise from the outside). The lighting in the room is good – each of the reading locations has a light source of more than ample wattage. All of the linens and bedding were of the normal high Four Seasons quality. The service was excellent. All my interactions with the front desk were handled precisely and efficiently. The concierge offered a dinner recommendation, and followed up with an inquiry about the meal. The one breakfast I ate in the restaurant was very good. This hotel lacks some of the charm and history that the Olympic Hotel provided when it was managed by Four Seasons. That said, this is a very fine hotel, and one I would be glad to visit again.","ratings":{"Overall":5.0},"author":"Delbert Borer","date":"2015-06-08 07:57:37 +0300"},{"content":"I am a loyal Four Seasons customer and was very excited to have the chain come back to Seattle after many years of absence. Unfortunately, my first stay negated my excitement. The hotel is new and the rooms are reasonably nice and brand new, but not really up to Four Seasons standards. The furniture is light maple and the carpets are very bright. The entire place felt like it was built by high end Ikea. It doesn't look or feel luxurious. The other big problem is the location and the view. I paid extra for a waterview room, but it was dominated by a view of two big smokestacks and a construction site. Seattle has amazing water views but this hotel isn't situated in a spot that has them. In fact, it is still in a transitional neighborhood with a handful of peep shows and X rates theaters only a block away. The worst part of my stay, however, was my inability to take a normal shower. The water pressure in the shower was the lowest I've experienced in North America. I couldn't wash my hair and could barely get the soap off my body. Upon checkout I emailed the manager and he told me that the \"water pressure in my room was consistent with the hotel standard.\" I don't know what that means but it is not connsistent with any other place and certainly not a Four Seasons. Seattle has great luxury hotel choices in Hotel 1000 and the new Pan Pacific. There is no reason at all to put up with the shortcomings of this Four Seasons.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Location":2.0,"Rooms":2.0},"author":"Jakob Runte","date":"2015-04-05 15:20:29 +0300"}],"public_likes":["Dr. Sandra Beier","Brady Lehner","Raquel O'Hara MD","Genesis Dibbert","Rosina Schmitt","Valentina Upton","Mozell Stracke"],"vacancy":true,"description":"YMCA-affiliated Hostel in downtown San Diego, right next to Amtrak railway station. Free Wi-Fi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}