{"title":"San Francisco/Fisherman's Wharf","name":"Pier 2620 Hotel Fisherman's Wharf","address":"2620 Jones St","directions":"2 blocks southwest of Pier 39","phone":"+1 415 885-4700","tollfree":null,"email":null,"fax":"+1 415 771-8945","url":"http://www.pier2620hotel.com/","checkin":"3PM","checkout":"noon","price":"$240-$360","geo":{"lat":37.8056,"lon":-122.4165,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25670,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed at the Chancellor over the christmas holidays in dec '04. It was a very good experience - the hotel is charming, the staff is helpful and nice. The only complaint is that there was only one elevator working...so i would check to see if the second elevator is working before making a reservation on one of the higher floors. The location was amazing - we had never been to san fran before and the cable car ride to the wharf was right across the street. I would definitely recommend this hotel to anyone that was traveling to san francisco (and especially if they're looking to shop!).","ratings":{"Overall":4.0},"author":"Chauncey Beer","date":"2013-12-12 08:40:58 +0300"},{"content":"I really quite liked this hotel. It had a certain charm but don't ask me why. This hotel is ideally located in Union Square and is close to the main tram stop at the bottom of Powell Street. The bay area will take around 30 minutes to walk but trust me the queue for the trams are usually much longer. I found the room very spacious and cleanliness of this hotel very good. For the price, I found it good value and had a pleasant stay.","ratings":{"Overall":3.0},"author":"Brock Wisoky","date":"2013-11-17 09:49:11 +0300"},{"content":"After we paid $60 dollers a night for 4 nights in mid July 04 I checked this site and thought there must be two hotels of this name and we had paid for a dud !! To be honest we visited the City last summer and knew the location but where still worried there had been a mistake with the price , but no. This is an excellent hotel no matter which part of the service you look at, the rooms, staff, public areas even the normally surly reception staff where up-beat, friendly and helpful. I would have no problem in recommending this property, we paid $280 a night for a suite in a Hyatt in San Diego and as nice as it was the Chancellor was better.","ratings":{"Overall":5.0},"author":"Jay Turcotte IV","date":"2013-08-30 03:04:00 +0300"},{"content":"Family vacation to San Francisco and we are going to return to this wonderful city. Stayed 6/12 6-15. Used this site to 'hunt' for a suitable hotel location. Worried a bit that these reviews are overblown, but not having a better option, I went with the sites recomendations and landed on the Chancellor. For others reading this I can now say 'rest easy' there is little risk with the Chancellor. I travel a lot and stay in all kinds of hotels all over the country. What I say next comes from 65 - 80 nights on the road per year. The Chancellor is not 'perfect' but if your goal is to find a safe, clean, friendly place, with professional staff in a great location and at a price that allows you to focus your resources on seeing the City and doing the other things without feeling buyers remorse, then this place will meet that goal. This hotel is older (1914), designed and built in a different era. It lacks the modern uniformity and the cookie cutter design approach of a Westin or Hyatt or Hilton. Hallways are narrow and twist and turn. The elevator is small, older and a bit slow for a traveling type 'A' like me, but hey, use the steps to go down. With that said, this hotel is as clean and quiet if not cleaner and a more quiet hotel than that of the larger more expensive hotel chains found elsewhere. Rooms are smallish but at this price do what we did, get two adjoining rooms. Room for all !! Great rest - beds are clean and comfortable - at a very good price. Great Location. Can walk around as its a safe area - a few beggars perhaps, but this is a large American city not unlike any other large American city in that regard. Easy acess to cable cars, taxis and BART - no need for a car while in the City. Fun tip : Rent the \"Blazing Saddle\" bikes and ride across the GG Bridge. Yolanda the desk person ( who assisted with our extra nights stay ) and Matt the Bellman ( who secured me an extra rubber duck) were names I recall for service. I can't recall anyone else at any other hotel I've stayed at over the past year. Can you? It's that kind of place.","ratings":{"Overall":5.0},"author":"Cedrick Goodwin","date":"2014-01-20 01:19:12 +0300"},{"content":"My wife and I stayed at the Chancellor for three nights in March 2004. The location of this hotel could not have been better for us, we put the hire car to bed and walked all over the city. The cable car stop was just right outside the front door (walk down to the truntable or you will never get on). The room was a little bit small but the walk in wardrobe helped with hiding the luggage. Breakfast was included in our deal and it got us of to a good start. Would I stay at the Chancellor again, yes I would.","ratings":{"Overall":3.0},"author":"Katrine Heidenreich","date":"2015-02-06 02:16:28 +0300"},{"content":"If you're a business traveler seeking an extended stay hotel, this is the hotel for you! It's appealing factors are best value for money, location, location and location. For $1100 a month, you get a hotel with a stocked kitchenette and a location off 82nd Street & Allisonville which is a major commercial corridor (think hundreds of restaurants, retail shops, auto repair, groceries and bars & nightclubs. Some other pluses are it is pet friendly, a helpful staff and a gym membership a few blocks away. A slight drawback is it gets busy and the parking lot gets filled up at night time. But when that happens, you can always park next door to Candlewood which is owned by the same owners of Suburban","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Abigale Hand","date":"2015-12-28 14:20:14 +0300"},{"content":"The staff were always ready to help, giving suggestions of things to do, timetables, directions and even temporary luggage storage. Comfortable space for 3 of us. Right in the middle of everything; restaurants, shopping, museums, etc & transportation. Maintenance was there to help in 10 mins. Would definitely stay again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Javier Hoeger","date":"2015-04-03 19:19:17 +0300"},{"content":"The experience of this hotel is different because it is a small part of a large fancy hotel tower. There is a jar of truly homemade cookies on the check in counter which is really the only hint of what a great place this is. Our room moved us from the hustle of downtown to the hush of a sweet large room set up like a charming home, with a fireplace, french doors over a terrace, books and knicknacks, and two cozy armchairs. It is very homelike. They have a wine/food get together in the late afternoon and a truly homemade breakfast that is one of the best I've seen. The downside? Well the bathroom isn't anything fancy. If you like a nice tub this won't do. But you do have access to a nice fitness center and two hot tubs. Also, they need to upgrade the mattresses. These are old style, with too much wiggle. Also--it's across from nice art galleries and the Art Musuem. Plus a block away from the University station of the light rail to the airport, so it is very convenient to the airport.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Curt Crona","date":"2012-05-26 19:52:09 +0300"},{"content":"We stayed here before our Alaska cruise and were very happy with the choice. The rooms are clean and comfortable. The breakfast options are more than typical conteniental fare - made from scratch options like quiche, plenty of fresh fruit, cereals, and yogurt. The location is very convenient for public transportation from the airport and a quick walk to the Pike Market.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Arlo Herzog","date":"2013-07-30 03:42:44 +0300"}],"public_likes":["Norberto Padberg","Josiah Stiedemann","Lacey Koepp","Augustus Schowalter","Christiana Stroman"],"vacancy":true,"description":"Non-smoking hotel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}