{"title":"Paris/1st arrondissement","name":"Hôtel Costes","address":"239, rue Saint-Honoré","directions":"Métro: Concorde","phone":"+33 1 42 44 50 00","tollfree":null,"email":null,"fax":"+33 1 42 55 50 01","url":"http://hotelcostes.com","checkin":null,"checkout":null,"price":"A basic room starts at €500 off-season","geo":{"lat":48.8664365,"lon":2.3286655,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21733,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We've been to Maui 11 times, staying for at least a week each time, and finally succumbed to the hype about the Grand Wailea (GW) and decided to stay there over Thanksgiving. We've typically rented one of the 2/3 BR Villas over at the Kea Lani, but decided to get two adjoining deluxe oceanfront rooms. The \"membership\" is mostly a rip-off. We did get our \"discount\" but this is calculated from the HIGHEST published rates, and was hardly a bargain. The nickel and dime fees were maddening: There is the resort fee $20, Valet fee, $15, Adjoining Room Fee $20 ea. as well as the usual excise fees. So this added up to about $100/night more than the \"discounted rate\" for each of the rooms ($1800 over our entire stay) With Maui, the prices are always high...but at the GW, they are outrageous, and the quality of the food was just not good at Bistro Molokini or the Volcano Bar. $25 for a cold, undercooked burger, a bag of Maui chips and a warm beer served by the horribly overworked pool wait staff was typical. We routinely went over to the 4 Seasons next door for breakfast because the food and service were excellent, and the prices were cheaper. The Kula Cafe had great food and the prices were sane The location was great, and we had excellent dinners at Ruths, Spago, Ferraros, Tommy Bahama Cafe, and Fire Dragon (mediocre) as well a few others farther away. Service ranged from disdainful/indifferent to excellent, depending on the situation. The attitude is pretty much one of \"if you don't like this place, go away....there are 10 more in line\", but there were a few people that were really nice and provided excellent service. The whole place was understaffed. At check in, it took us 45 minutes of standing in line, waiting on only 3 clerks. The whole place was dated, and worn out. Cracking stone, in the common areas, flagstone falling off, tile coming off the bond beams on the pools, etc. The hotel has obviously been really popular and looks like the hotels right around large convention centers that get enormous trade show traffic. The water features are cool, but the kids hated the line for the water elevator and ditched that after the first 2 or 3 times. The slides are long, and for safety's sake, the guards wait until the riders have cleared the bottom before sending the next rider. Unfortunately, this really makes the cycle time long and the lines are huge. My kids were sick of the waterslides after a day or two. I did get a charge out of the gamesmanship necessary to get coveted poolside chairs. If you aren't waiting in line by 6:45 and ready to get personal belongings onto the chairs as soon as you walk down, you are toast. There is an attendant walking around photographing \"unattended\" chairs to try to cut down on the \"land grabs\" but it is a tough job. In the summer, it must be completely nuts. My wife said that the Spa was terrific We went \"for the kids\" but they gave the GW \"three thumbs down\"","ratings":{"Overall":2.0},"author":"Virgil Bergnaum","date":"2015-06-24 03:11:59 +0300"},{"content":"Grand Wailea - 10/03/06-10/10/06 We just got back from our honeymoon at the Grand Wailea in Maui. All I can really say about the hotel is it was average. Staff: Very friendly Grounds: very nice, but a bit too big for a honeymoon couple wanting a little romance. I could see how it would be good for a family with kids. The grounds are very pretty, but we did see a dead koi fish in one of the ponds and a large roach walking around. Restaurants: The Humuhumu... restaurant was expensive, but was not very good. The Kincha Japanese buffet (fri. & mon. - $50 ) was very good. The mini-burgers that can be ordered from the Botero bar were delicious, but kinda pricey at $20. Room service was served quickly, but the food was just average. Housekeeping: The rooms were kept very clean. When we returned from our daily excursions, the rooms were always cleaned and new amenities were provided. We did however find one roach in our room and we were occasionally visited by a few ants. Recommendations if staying at the Grand Wailea: Go to the ABC store located next door at the Shops at Wailea, to puchase essentials (water, soda, snacks, etc.), it'll save you A LOT of money. If you like sea food, you must try Mama's Fish House, located in Paia (about 30 min. drive from hotel). Confirm that there is no construction/renovation being done to the rooms surrounding your room. If you have questions regarding The Grand Wailea and you want non-biased answers, feel free to email me at qrious_2@yahoo.com","ratings":{"Overall":3.0},"author":"Baron McKenzie","date":"2012-11-01 04:58:14 +0300"},{"content":"I've been to Maui a few times and usually stay at the Fairmont in Wailea. A few weeks ago, we decided to try the Grand Wailea since we heard it was the best hotel on the island. From the outside, the hotel looked very promising. The exterior was beautiful, the pools spectacular, and the beach access unbeatable. But from the moment we pulled up to the valet, we realized that the hotel was simply a body without a soul. As we pulled up, we had to wait a minute or so before we were \"greeted\" by a valet. In fact, we had already unloaded our bags before one of the valets finally showed up. As we walked into the lobby, the female greeter uninterestedly placed leis (sp ?) around our necks. She didnt even bother smiling. I contrast this with the warmth and friendliness that greeted us everytime we arrived at the Fairmont. We arrived at the hotel at approximately 3:30pm, which is about half an hour past the official check in time. However, our room was still not available and we were asked to simply wander about the hotel and were told that we would get a call on our cell phone when our room was ready. Half an hour later we still had not received a call and decided to go back to the front desk. After waiting a somewhat lengthy time to finally speak to a front desk person, we were told that our room was ready. Where was that phone call? When we got to our room, we were fairly unimpressed. The bathroom looked dated and the overall size was smaller than the rooms at the Fairmont. The pool area is truly the gem of this hotel. There are something like 10 pools and various slides and water attractions. However, if you're an adult, you might find the number of screaming kids a bit overwhelming. The hotel had a feel comparable to your average waterpark. Nevertheless, my friends and I still enjoyed the pool. The easy beach access was also a positive as it was just a few steps from the pool area. My biggest complaint about the hotel is the service, or lack thereof. There was none of the island love, or general hospitality that you would expect from a 5 star resort, or more importantly a hotel that costs 500-900 bucks a night. The staff members rarely smiled, they seemed bothered when you approach them with a question, and generally seem out of place at a high-end resort. None of the little touches were found at the Grand Wailea. For example, at the Fairmont, smiling pool side employees would frequently walk around handing out fresh pineapples. At the Marriott Ihilani in Oahu, they had a jolly guy walking around the pool spritzing cool water on the feet of hotel guests. Those little things are so important when you pay the kind of rates you pay at the Grand Wailea. The capper to our 5 day stay was the jack hammering that started at 7:30AM during the last 2 days of our stay. Imagine if you will, waking up in paradise to loud jack hammering...at 7:30 in the freaking morning. When we complained during the last day, they told us that they had left letters in our rooms telling us of the jackhammering. First, we didnt get a letter. Second, who cares if you they left a letter? Why not wait until a more reasonable time to start causing that kind of noise. Fortunately they decided to comp us one night which made the experience slightly more bearable. My last memory of the Grand Wailea was back in the valet. After the valet pulled up the car for the final time, he sat there and watched as my friends and I struggled to place the bags in our trunk. No offer to help. Needless to stay, I will never again stay at this hotel. I've warned my friends who are planning trips to Hawaii to stay away from this place. If this was a normal 200 dollar a night hotel, I really wouldnt have cared. But paying Grand Wailea rates for Motel 6 service is just unacceptable.","ratings":{"Service":1.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":5.0},"author":"Shaina Denesik","date":"2013-01-30 20:27:43 +0300"},{"content":"I am looking at the ocean in my Grand Wailea ocean view right now. The room is good, quite spacious and I CAN see the ocean from my 6th floor room (I guess we got lucky). Hotel grounds are lovely and extensive with loads of Koi ponds and waterfalls. It's peak season so the pools are filled with kids but the beach isn't crowded and it's easier to get a chair. I'd recommend the room + Breakfast package as the buffet is fine and it'll probably cost you more to eat a la carte. The staff are friendly but I wouldn't say that they go the extra mile considering the hotel rating and room prices. I have had better at Ritz Carlton, Westin and other 5* hotels. I'll agree that they do Nickel and Dime you, although you wish it were just Nickels and Dimes. The hotel is expensive, to eat, sleep and play will cost you a pretty penny! But I've looked at some of the other hotels (including the Four Seasons next door) and this one may just have one of the best overall packages for pools, gardens, beach, eating and accommodation. It's probably especially good for families as the kids will swim all day. That said I couldn't give it top marks because for the high cost there are no hammocks between palms (come on this is Hawaii it's what you'd expect), the staff could do better, everything closses at 9:30 and the overall finish isn't the best, so the Wow factor is low. To end there was a bit of a fiasco at checkin with room availability that many people seemed to be suffering from, we had to stay in a garden view room for the first night (they comped it though and gave us a drink at the bar!!). The reason for the problems are that Hilton have bought the hotel and decided to change booking systems mid peak season that has caused a few headaches, we were patient though and were rewarded for it.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Omari Casper","date":"2014-05-20 07:06:13 +0300"},{"content":"I just returned from a week at the grand wailea, and can honestly say it was one of the finest resorts I have ever visited. Yes, there are some minor flaws, but nothing I experienced merited some of the lambasting reviews posted here, which made me quite nervous, as I had booked the hotel months ago. First off: the rooms are normal. They do not measure up to the standard of the JW Marriott on Oahu, but did not seem inadequate either. Luckily, we were upgraded to the Wailea suite, a large two-bedroom room with a full refrigerator and table. It is worth requesting an upgrade, I can tell you that. The parlor made it hard to leave in the morning. The grounds are filled with tropical gardens which are sprinkled with great works of art, and the grounds don't seem tacky, but like a true tropical paradise, which is lucky because you will be doing a lot of walking. I got lost several times on the first day. The pool is incredible: it consists of several pools linked by tile slides, emptying into a main activity pool, which is rarely crowded. There is a separate adult pool: during my stay, it never had more than 10 people in it. The poolside dining is varied and tasty. There is little shade here, which makes renting a cabana useful, but at $200, it is a bit of a ripoff, even though they do deliver fruit, water, towels, cold towels, frozen grapes, and icepops throughout the day. The pool staff is a bit unprofessional, something not relfected throughout the rest of the resort. Nevertheless, the activity pool (the one with the slides) never felt like a waterpark, but instead like a particularly nice complement to Wailea Beach, the best beach I have ever visited. It has everything: nice sand, equipment rentals, crystal clear water, and even snorkeling in the morning. I recommend going out early just beyond the rocks at the neighboring Four Seasons to see a cornucopia of aquatic biodiversity. One woman spotted a green sea turtle. The beach has waves, which invariably heightened during the afternoon, making for some entertaining waveriding. After an enjoyable day, it would be nice to have a good hotel dinner to look forward to, but the restaurants here fall short, for the most part, of the resort's opulence. Kincha, the japanese restaurant, is the best at the place. HumuHumu was well overpriced, and mediocre. Finally, Bistro Molokini was good for lunch, but had a limited and expensive menu. Most things here are overpriced, even for hawaii, which is my only fault with the place. Room service is always expensive, I know, but a $6 can of soda, an $11 bagel, and the breakfast buffet for $27 (limited selection) all seemed disgustingly overpriced. Wailea in general seems this way. I would recommend a trip to Spago, at the four seasons, for great service and even better food. The golf is also spectacular, and their private lessons are very helpful. For families, or even active adults, the Grand Wiailea seems like the best choice on maui. It is palatial, and grand in every sense of the word. Bottom line, is that the four seasons looked nice, but if the kids in my party ever wandered over the the Wailea activity pool, they would be very jealous. My one regret is not venturing into Lahaina, where the restaurant selection seemed more diverse than on the south side of the island.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Service":4.0,"Rooms":4.0},"author":"Raina Mraz","date":"2012-03-30 16:27:30 +0300"},{"content":"We spent one week of our three week Hawaii trip at the Grand Wailea. We did not read the reviews before we went because we received the trip as an incentive package from one of the vendors from our heating & air conditioning business on the east coast of US. In response to reviews we read after returing home to write a review I offer the following: We though the place was fantastic. The grounds in our opinion were beautiful. Our oceanview room was spacious with standard ammenties that we would expect at this level of resort. Large soaking tub and seperate shower for two, seperate toilet room, sitting area in room, desk with high speed internet, lani with seating. The room was comfortable, bedding was fine, no noise from outside. Maid service was fine. The pool area was busy, I did not want a cabana but if I would have I would has planned in advance. We travel alot, usally in 4 star plus accommadations, in doesn't make any difference how much you pay there are allways people that don't know how to conduct themselves. Every time we went to the pool there were no \"open\" chairs. This day and age even with the hotel claiming they watch for unused but \"saved\" chairs you have to take matters into your own hands. If there were just towels, not personal items, we pitched them in the used towel bin and replaced them with clean ones. Big deal, if some one presented themselves stating that the chairs were theirs and we had been there the hotels limit of one hour we would tell them that the hotel cleared their towels, go speak to someone with the hotel as we are using the chairs and are not leaving. No one ever presented themselves. Many reviews stated about things being run down, yes our room could have been touched up where people knocked their luggage in to the wall, but who cares about a few of the million plus pool tiles being broken. The hotel was hosting a group of 750 from Sprint also when we were there (4/23 to 4/29). Someone claimed they over booked and paid them to move to another hotel but allowed them to use the facilities. They put some Sprint folks up next door at the Four Seasons. Some of the people from other hotels using the Grand's pool were authorized but I am sure there were some ousiders also. The hotel actually gives a wrist band to help keep unauotherized folks out, good luck pool police ! Yes everything is expensive at the Grand, and in Hawaii in general. One person complained that the resturants were so expensive that they were eating PBJ sandwich's to get by. What did they expect? They should do a little more research befor they book next time. We ate at the fancy \"HunHun\", of something like that, one night, expensive yes, food was excellent, service was okay, waitress had zero personality, never did return to see if everything was okay. We have had better service in a $5.00 a plate diner, or a $100.00 a plate fine dinning place, but we have also had the worst service possible in both of these extremes. You could blame the hotel for employing them but, when you look a the housing and wage difference in Hawaii It's a wonder to me that they can have enough people to serve us travelers who invade their homeland and expect everyone to bow to them because we have enough money to get there! I think the Grand is Great and if anyone knows were you can do better for less let me know!","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Macey Cartwright","date":"2012-11-17 01:40:06 +0300"},{"content":"We have just returned from a 5 day stay at the Grand. We could only afford their terrace rooms (the low end rooms) and was a little concerned over what we would get. We could see the ocean and gardens from our balcony!!The room was generally guiet - some construction noise from accross the street but this wasn't all the time. We found the staff to be helpful and friendly. The grounds and hotel were absolutely beautiful. The pools were also fantastic. Our 13 year old son loved the pools/waterpark as well as body surfing in the ocean. I have read reviews were people complained of too many kids and therefore noise around the pools. There is a separate adult pool which I found to be very quite. We were there during spring break and always found lounge chairs during any time of the day...takes a few minutes to hunt them down but we always found something.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Service":5.0,"Rooms":5.0},"author":"Myriam Satterfield","date":"2012-12-25 00:47:19 +0300"}],"public_likes":["Ms. Richie Huel","Rita Gulgowski I","Marlon Hoeger","Elian Lind","Sydnee Crist","Mr. Ellis Carter","Mable Nitzsche"],"vacancy":true,"description":"When the Costes brothers, who made their fortune in the Paris café trade, opened this designer hotel a couple of years ago it became an instant hit with the rich and famous, especially those of Hollywood. Whether it's worth the price for the exquisite interior decoration and the chance to rub elbows with a few movie stars is up to you to decide. They don't pay travel agent commissions, so either book it yourself, or pony up the extra €50 the agent would normally get.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}