{"title":"Orange (France)","name":"Hôtel de Provence","address":"60 avenue Frédéric Mistral","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hotelprovence-orange.com/","checkin":null,"checkout":null,"price":"From 50 to 75€.","geo":{"lat":44.13742149999999,"lon":4.818422400000031,"accuracy":"ROOFTOP"},"type":"hotel","id":21242,"country":"France","city":"Orange","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"Housekeeping doesn't come close to acceptable. Front desk is a bunch of lost youngsters without a clue, this place has lost its footing and should be avoided.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Location":5.0,"Rooms":1.0},"author":"Felipe Eichmann Jr.","date":"2012-11-01 16:54:52 +0300"},{"content":"We ended up paying about $225 per room per night including the Hyatt upgrade to get a high floor. This is a good quality hotel in a good location even as a visitor. I would not have wanted to pay more than I did but would recommend if you can get this price or less. Good fitness centre and pool. We asked for and were given connecting rooms as we were travelling with our teenage children. I think this is now a slightly older hotel so choose a high floor away from the elevator in order to get some quiet, you can hear people in the next room although we were not really disturbed.","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":4.0,"Value":3.0,"Service":3.0},"author":"Ms. Jude Koch","date":"2013-09-09 19:16:09 +0300"},{"content":"From beginning to end, our stay in this hotel was abysmal. I was here for a conference the last week in June, and didn't have a say on where to stay, and was concerned about the reviews I read, but was hoping it was better than others thought. The most negative of the reviews were right on!! The first night, the a/c in the room was non-existent, and the room would not cool off. We called several times, and they told us to radically lower the thermostat, which had no real effect. We then asked to have a fan sent up, which they did after some time. We then asked the next night to have a different room, which was somewhat better, but we luckily kept the fan, or it wouldn't have been usable. The minibar in both rooms was set up so that you couldn't use it to store other cold items without being charged $25.00; even Red Roof Inn have usable mini refrigerators in their rooms! The problems continued - the conference I attended ran out of coffee after 1/2 hour, and the hotel, claiming to take care of this, did nothing until the 2nd day, at which time they still provided inadequate coffee. The hotel staff, other than one young man, were surly and ineffectual. To top things off, in the new room my wife opened the nightstand and found that someone had left a sexual device there! I couldn't make this stuff up! The cleaning staff obviously didn't do their job. We returned the sexual device to the front desk, and didn't receive any formal apology about this. Then after the second night, the comforter that was on the bed was taken, and when the room was made up, the comforter was never returned! 7 phone calls later, on the 4th day we were there, they finally brought a comforter, but it was a full size (the bed was a King), and it was wet! We returned that. For our hassles, the hotel did provide us a free dinner, but the restaurant had horrible service on the terrace, and the young waitstaff acted as though they had never waited on any customer before. I should also mention that the rooms were small. The pool was not handicap accessible, there were two staircases of 10 stairs each leading down to it, in a very inaccessible spot. There were no soda or snack machines anywhere on any floor. They charged 50 cents a minute for computer access in their \"business\" center. Once people found that out, they didn't use it, and it was empty, although the hotel employed a person to sit there and provide service (mostly fielding angry comments about the cost). They charged $ per day for wireless internet access, which is incredibly cheap. On check out, there were hassles with the hotel charging me several Massachusetts taxes, even though I had documentation that because it was a Federally Funded Conference I should not be charged state lodging taxes. Other people at the convention I attended had the same problem. The quality control at this Hyatt is obviously very subpar.","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Jennie Eichmann","date":"2015-12-21 07:22:59 +0300"},{"content":"Just stayed here for a business/family trip. I am pretty familiar with Boston and this location was excellent! Right by South Station for easy access to the airport or amtrak and right by the subway as well as in the heart of downtown boston so many things are within walking distance. Our room was very nice and spacious, I don't know how we lucked out, but they put us on the top floor in a corner room. The front desk staff as well as the concierage were all very friendly. We booked a decent deal on this room, would not have wanted to pay full price..but all decent rooms in downtown Boston are overpriced. I can't figure out why hotels don't all offer free wi-fi anymore..just seems like another way to nickel and dime customers especially when this hotel didn't come with any other perks like a free breakfast or even a reasonably priced breakfast ($20 for the buffet!). However, the pool and fitness center did help make up for this, both very nice, but the indoor pool was very cold and no hot tub..but the steam room was nice! But, I would definitely stay here again for the location, quality of the rooms and the staff. Thank you!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Ernest Quitzon","date":"2012-01-18 23:16:23 +0300"},{"content":"I booked 4 rooms for a group of friends. I had requested that all the rooms be close together and have king beds and was told that there shouldn't be an issue. When we arrived the front desk had difficulty finding the reservation and said that they had not held the rooms as promised. First they tried to tell me I had clearly made a mistake and I was at fault until I reproduced the email from the manager indicating my request would be honored. At that time they simply said well it's impossible now so here are your double bed rooms. Other than the front desk staff being very rude I would have to say the hotel is nice. The rooms are clean and spacious, but the double beds are very small. The location is great for site seeing. Easy to get to the Airport bus and the subway stations.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Laverna Hansen IV","date":"2013-04-25 06:58:05 +0300"},{"content":"I arrived early and they were kind enough to get me a room right away. May have been the luck of the draw - but kind. I had asked for a room with two double beds - as I had 3 days of business and then a friend was joining me. I was on the 7th floor - 2 floors above the lobby. At first I was disappointed being on a lower floor - but it worked. I would avoid the 6th floor only because the gym is on that floor and it is open extended hours - which may lead to more noise in the hallway. Speaking of the gym...the workout is getting there - LOL but really it is a great gym with a pool, state of the art gym equipment, steam rooms and really clean. The only misses were the housekeeping staff - they clearly do not read english - which I have no problem with - but they need to speak with their supervisor if they cannot read the note (and tip) I left. I wanted my window left cracked (it was closed) and I had asked for extra Decaf coffee. Also, I had requested turn down service each night - and it was only done 1 night. When I called - they were prompt to send someone quickly - and the turndown staff does a great job of refreshing the room and bathroom. Overall the hotel is in a GREAT location - centrally located - a quick walk from the T (several different T stations - Downtown Crossing, South Station, Chinatown and several others). Very close to Chinatown - attached to a Macys, near many theaters and near the Boston Commons. A couple of quick tips - great and inexpensive lobster at Peach Farm - Chinatown - close to a CVS and the concierge had great restaurant suggestions. I did eat at the Avenue one - the restaurant - the food was very good (lunch) and reasonably priced. I did drink in the bar and wish the red wine choices were more varied. Oh, and one more note: the weekdays the clientele was strickly business - the weekend is a WHOLE different (and louder) crowd - be forewarned","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Brenna Breitenberg","date":"2012-05-17 22:17:07 +0300"},{"content":"I got this hotel on Priceline, and I was really excited because it's RIGHT downtown, and a block from Downtown Crossing station. The inside of the hotel is nice enough, although weirdly laid out. The lobby is on the 3rd floor, and you have to take an elevator from the street level to get to it. This wouldn't be so strange, except for the fact that the elevators to the rooms are on the other side of the lobby. If the elevators were all the same, it would be fine. The rooms were nice, pretty large for downtown, and had great views. I could see the state house clearly from my room. The bed was crazy comfortable, I think it was a featherbed. I just wanted to sleep all day. The only problem with the rooms, and this is a big one, is that the walls are VERY thin. We could hear our neighbors talking, watching tv, even coughing in their room. Which made me wonder what they could hear from our room. Definitely a big minus.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Gustavo Beahan","date":"2015-07-31 18:08:31 +0300"}],"public_likes":["Jayda Crona","Miss Jamarcus Wolff","Zoila Torphy","Westley Johns","Rozella Connelly","Green Botsford PhD","Kenna Krajcik"],"vacancy":true,"description":"Three-star hotel near the train station.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}