{"title":"Keswick","name":"Denton House independent hostel","address":"Penrith Road, CA12 4JW","directions":null,"phone":"+44 17687 75351","tollfree":null,"email":null,"fax":null,"url":"http://www.dentonhouse-keswick.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.60337,"lon":-3.12591,"accuracy":"ROOFTOP"},"type":"hotel","id":13702,"country":"United Kingdom","city":"Keswick","state":null,"reviews":[{"content":"We visit Vegas about 6 times a year - mainly for business. We spent 3 nights at Paris for the first time and it was just fine. The location clearly is perfect - especially in the Vegas summer. Upon arrival we were perturbed to see a LONG line for check-in and had visions of an hour plus wait. Nope - the hotel had 12 windows open - check-in proceeded briskly and we were done in 20 minutes. Not award winning but hey - it was prime time. Our room was great - clean - above average bed - decent size bathroom with tub & separate shower. Nice big HDTV. The romantic french love seat however. très inconfortable. The only \"low\" point was their steakhouse. French it ain't. We were seated RIGHT next to a solo dinner in an otherwise empty and cavernous room. Why do they do that?!? A very mediocre meal for $350. Inattentive service. Pedestrian food. Boring. The pool was fine - not too crowded - lots of free chairs. Nice view of the surrounding environs. Good bar service. All well. Paris is what it is - an inexpensive hotel with a great location. It's not a 5 star hotel - nor does it charge like one. We will definitely return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Pablo Christiansen","date":"2013-02-15 02:54:59 +0300"},{"content":"We stayed at Paris for two nights in mid-June. As a Francophile, I had always wanted to stay there just for kicks, and we also booked the trip through Travelocity and received two-for-one tickets to see Penn & Teller. Paris is just like every other hotel on the Strip in that you have to weave your way through what feels like acres of slot machines and stores to get to the guest elevators, but once you make it to your room, they're quite comfy and nice. Ours had a nice, big bathtub that I wasn't able to take advantage of, and a spacious shower. (I tend to gauge hotels by their bathrooms... this one was excellent... it even had a sweet ceramic hair dryer that made me want to come home and splurge on one. :) ) One of the things I loved about Paris is the pool right under the Eiffel Tower. We were less than impressed with the service at the poolside restaurant for breakfast (it took an hour for french toast and a breakfast burrito), but we heard other patrons saying that just the day before they had received very speedy service, so we are pretty sure that part was a fluke. The staff were very friendly, and there are many, many food and shopping options in the casino, all laid out in a quaint French avenue setup. Having been in most of the casinos in the central part of the Strip, I found the setup at Paris the easiest to navigate and most convenient... but that could just be because I like imagining I'm back in the real Paris. :)","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Hailey Abernathy","date":"2015-05-08 17:27:49 +0300"}],"public_likes":["Cynthia Grant"],"vacancy":true,"description":"Independent hostel catering for groups including stag weekends.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}