{"title":"Buena Park","name":"Radisson Suites Hotel Buena Park","address":"7762 Beach Boulevard","directions":null,"phone":"+1 714 739-5600","tollfree":null,"email":null,"fax":null,"url":"http://www.radisson.com/buenaparkca","checkin":"3PM","checkout":"12PM","price":"$89-179","geo":{"lat":33.849996,"lon":-117.997404,"accuracy":"ROOFTOP"},"type":"hotel","id":4399,"country":"United States","city":"Buena Park","state":"California","reviews":[{"content":"My boss wanted to hold and incentive meeting in Napa Valley; I knew nothing about the hotels in Napa. Because of Trip Advisor, I chose Harvest Inn in St Helena. What a wonderful place. The meeting was very successful; the staff made me a hero with my boss. This is a small boutique hotel with a wonderful conference center. We had the rooms that surrounded the Conference Center, which has a huge terrace. We owned this space, attendees did not get lost; everyone was on time for meetings. The hotel does not have a restaurant, however the caterers that the hotels use are incredible. We had casual dining and a formal awards banquet. The hotel did not miss a beat. The grounds are beautiful and well-manicured. Floral is in bloom everywhere you look. The hotel also overlooks a working vineyard. You truly know you are in wine country. While we were there a wedding was taking place overlooking the vineyard; what a beautiful and romantic place for a wedding. All of the major wineries are very nearby; the concierge was very helpful with planning an additional wine tour and transportation for 30 people. This is a must do for all small groups and for romantic get-a-ways. I can’t wait to return with my husband.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Lexus Olson","date":"2014-01-11 02:46:24 +0300"},{"content":"This was the most beautiful hotel that I have ever been to. The premises were immaculate. The senary was awesome. The rooms were quaint and relaxing. The ambiance was wonderful. The staff was so polite and extremely accommadating. I did not want to leave. The premises were surrounded by green grass, beautiful trees,and magnificently detailed architectural designs. All rooms had beautiful views. It may be a little pricey but here you definitely get what you pay for and much much more!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Elwyn Wuckert","date":"2012-12-14 16:06:37 +0300"}],"public_likes":["Miss Boyd Kertzmann","Letitia Hirthe I","Ebony Jast"],"vacancy":false,"description":"The Radisson Suites Hotel Buena Park, CA is a stylish, ALL-SUITE hotel conveniently located within walking distance of Knott's Berry Farm and just minutes from Disneyland Resort. Our full-service Buena Park, CA hotel provides an array of amenities, including complimentary cooked-to-order breakfast in our on-site Flora Restaurant, meeting space, Manager's Receptions Monday - Thursday and complimentary scheduled shuttle service to Disneyland Resort and Knott's Berry Farm (reservations required). Choose the Radisson and see why we're one of the top Buena Park hotels","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}