{"title":"Culver City","name":"Culver Hotel","address":"9400 Culver Blvd","directions":"downtown","phone":"+1 310 838-7963","tollfree":"+1 888 328-5837","email":null,"fax":null,"url":"http://www.culverhotel.com","checkin":null,"checkout":null,"price":"$89 for a room with queen beds to $299 for the John Wayne Suite","geo":{"lat":34.02385,"lon":-118.39427,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7061,"country":"United States","city":"Culver City","state":"California","reviews":[{"content":"i have stayed here many times,including this past spring.nice clean rooms,at reasonable prices,especailly for ace club members.sunday brunch best deal in town,with crab legs,champane and more for low price.good gaming odds,restraunts,and gaming.not in center of strip,but public transportation readily available right outside to strip,or downtown.the best kept secret in vegas by my opnion,especailly on a budget!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Bianka Brown","date":"2014-11-19 14:32:37 +0300"},{"content":"Well, i've never stayed here before and was lured here by their great prices on rooms. I see other reviews, and i won't discredit them, everyone has a different experience right ? This hotel has been here forever however, the rooms were fine, didn't show signs of wear and tear. The room was just fine, had a clean and comfy bed, lots of pillows, flat screen tv, the rest room was clean, everything worked fine and toiletries/ TP were stocked well - no in-room fridge/microwave/coffee maker , but includes an ice bucket and disposable cups. . We did not get a strip view room but seeing as we only came to the room to sleep and watch tv..etc, it was no big deal, just close the curtains. We did not even smell smoke in our non-smoking room. We did not hear the next door couple, um \" doing it \" . Ice machines were near by and functioning. Check-in was a breeze. At this hotel , everything was close by, we liked that !","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Magdalen Bechtelar V","date":"2015-11-28 11:39:23 +0300"},{"content":"The Stratosphere gives you the best view of the Strip in Las Vegas. Period. The caveat to that is that it's NOT exactly located ON the Strip; you can argue that it's at the northern end of the Strip, after you have passed all the other major hotels/casinos. The traffic in Las Vegas Blvd (the Strip!) can be pretty bad between Stratosphere and the other casinos towards the south, especially on weekend evenings. But otherwise, the hotel is really good. the rooms are pretty good. Enough parking space (if you have a rental car!), you just have to find the empty spot though! ;) Free entry into the Tower for guests is pretty good. Would definitely recommend if you're not willing to spend too much to stay in any of the bigger hotels!","ratings":{"Location":2.0,"Overall":3.0,"Value":4.0,"Service":3.0,"Rooms":4.0},"author":"Emery Zulauf","date":"2014-11-10 09:09:14 +0300"},{"content":"We stayed at this hotel and were disappointed with the room. you had to get out of bed walk across the room and look around a column to look out the small window. We went up to the roof and had to walk around garbage cans which were being used to catch the rain water leaking through the roof. On the plus side, the casino did come around with drink very often and the buffet was not bad.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":2.0,"Value":2.0,"Service":4.0},"author":"Ray Johnson","date":"2012-12-22 00:25:42 +0300"},{"content":"We stayed at the Stratosphere in May. It was a great deal, so we were able to stay longer than expected. They have some really scary rides on the top of the tower, and a very cool observation deck that you can see the whole valley floor from. The rooms were very nice, and the staff friendly. It was a short walk to the rest of the strip, but if you don't like to walk, take the bus. The buses do 24 hour, or 3 day rates, and are very economical. It is also a short bus ride to Freemont Street which you should not miss. All in all we will be back to the Stratosphere the next time we are in Vegas.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Dayana Bahringer","date":"2014-08-11 07:27:47 +0300"}],"public_likes":[],"vacancy":true,"description":"Listed on the National Register of Historic Places and located in the heart of downtown Culver City, this hotel opened in 1924 and offers a unique lodging option with rooms featuring antique furniture.  The hotel was once owned by John Wayne and served as accommodation for most of the cast of the Wizard of Oz during its filming.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}