{"title":"San Francisco/Civic Center-Tenderloin","name":"Adelaide Hostel","address":"5 Isadora Duncan Ln","directions":"between Geary St and Post St","phone":"+1 415 359-1915","tollfree":null,"email":"info@adelaidehostel.com","fax":"+1 415 614-1940","url":"http://www.adelaidehostel.com/","checkin":"1PM","checkout":"11AM","price":"Dorms: $23 and up, Private rooms: $60 and up","geo":{"lat":37.7874,"lon":-122.4121,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25587,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We liked this cute hotel. Our room was \"smallish\", but spotless, featuring a very comfortable bed, plenty of pillows(hurray!), and enough room for two people to move around. We selected this hotel online, mostly because it featured discounted parking and was right on Union Square. We don't regret our choice. The only downside for us was the spotty availability of hot water for tea in the lobby. We missed having a microwave or a coffeemaker in the room to make getting hot water more convenient.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Cecilia Fahey","date":"2015-10-01 10:24:33 +0300"},{"content":"You can't put a price on the history of the Chancellor hotel and surrounding area. The cable cars run right in front of the hotel and you are in easy walking distance of Union Square and tons of restaurants and rental car locations. Starbucks across the street is handy as well. Very nice!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Nellie Rutherford","date":"2015-06-06 01:28:49 +0300"},{"content":"Only stayed for two nights wish it could have been more.The hotel is in a perfect location very close to Union Square , the trams and the Bart.The staff were extremely helpful and even when the loo broke at midnight it was fixed within 30 minutes , very impressive.The rooms are not huge but there is a large walk in closet to store luggage so no problem there.We did not meet the Manager Wes Tyler but he ensured our stay was perfect nothing was too much trouble and we would definately stay here again if we visited San Francisco.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Emily Mraz","date":"2014-12-23 08:39:48 +0300"},{"content":"My wife and i stayed here for 4 nights at the end of september for our 10 year wedding anniversary. We were on a road trip down to LA via the big sur and needed a good start in San Francisco to set us on our way. Booked with trailfinders and were very pleased with the hotel choice. Good service all round, checking in was a breeze , lovely room with a view of Union square , comfortable bed , small yet adequate bathroom. Shower was powerful and considering that it was very warm during our stay the lack of air con was not a problem as the fan above the bed was nice and cooling. Loved the free tea and cookies in reception. Didnt have breakfast in the hotel as sears is next door and heard that they cooked a lovely pancake sandwich so ate there every morning and i wasnt disappointed. Quite a few places to eat nearby in the evening. if you get up early you can get onto the trams before they get busy . Wait at the stop up the road opposite outside starbucks. All in all a fantastic start to our holiday and would recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Stanley Shanahan III","date":"2012-03-22 23:01:32 +0300"},{"content":"As you guessed, primo location! Everything about this hotel was perfect for a typical San Fran boutique hotel. The ONLY issue you may have is the very, very small rooms. Maybe 12 X12 with a bathroom that you must enter in the direction you wish to face because turning around might be ifffy......BUT none if this posed a problem for my daughter and I. Rooms very cozy and nicely decorated. Comfy beds. Staff very, very pleasant. We were out and about most of the day so room size didn't bother us. I felt the regular prize ($200 per night) was steep for such a small room but watch for deals on Expedia, we got for $125 and my sister leaves next week and got it for $99. San Fran is amazing...just go with the location (there are areas like the Tenderloin that you definately DO NOT want to be in). The small room size is a good exchange for price and location","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Ashley Runolfsson","date":"2012-04-17 16:13:57 +0300"},{"content":"My wife and I stayed at the Chancellor for 8 nights in Sept. Great hotel for the price, great location. We enjoyed late night meals at the bar as well as breakfasts in the restaurant. A noisy ceiling fan was fixed the same day. We were in #1304 with not much of a view but enough sounds of the city to remind us where we were! Yes rooms and baths are small but with walk-in closets for the luggage and adequate internet access. The room was always clean when we returned. The pillow menu was a nice touch! No A/C so we kept the ceiling fan on and the window open - very comfortable. We would stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Kurtis Schuppe","date":"2014-10-03 21:03:59 +0300"},{"content":"We stayed at the Chancellor during the first week of September for four nights. I had stayed there three years ago and had a superb experience. My second stay was just as exceptional. This little gem of a hotel runs like a well-oiled machine. Every staff person we encountered was lovely, efficient, friendly and well-mannered. We stayed in Room 1203. I had asked for a high floor room facing Union Square which was acommodated. After the first night, I mentioned to Rory at the front desk that the bed was not quite as comfortable as I had remembered it being during my previous stay (in a different room). We returned to the hotel late that afternoon to find that a foam topper of some sort had been placed on the mattress. Problem solved! The valet parking was easy and convenient and well worth the cost. $29 I believe. Allow 30 mins. for your car to be brought around. Well worth the value and convenience, since SF is a terrible parking city. The cleanliness of the room was exceptional each day. I can't say enough about this. The linens and douvet are very nice and the pillows are extremely comfortable. I cannot say enough about what an outstanding hotel the Chancellor is. As evidence of this, check out the piece in today's (9/9/10) NYT, the Chancellor and Wes Tyler, the GM are featured, in a piece about bed bugs. You will see how seriously he takes the management of his hotel. Enjoy!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Kenneth O'Keefe","date":"2013-12-01 00:04:01 +0300"},{"content":"We had read numerous reviews before booking, so we were aware of the small room size and lack of air conditioning (which did not bother us). The only complaint we had is that the beds were very, very uncomfortable. For this reason (and this reason alone) we would not stay here again. Our experience at the Chancellor Hotel was otherwise quite positive. We were able to check in early. The room decor is nice. The customer service is outstanding. The hotel serves a good breakfast (and you can have it delivered to your room at a specified time for a small charge). The hotel is right on Union Square, and the cable car line. Close to shops and many restaurants, and a ~ 30 minute walk to the Fisherman's Wharf area. Aside from the beds, this is a great find and worth the price you pay.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Kacey Welch DVM","date":"2014-02-08 10:53:52 +0300"}],"public_likes":["Adell Auer","Demond Kiehn","Duncan Herman","Corine Barrows","Angel Schimmel","Oren Paucek"],"vacancy":false,"description":"This is a popular backpacker hostel just two blocks from [[San Francisco/Union Square-Financial District|Union Square]].","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}