{"title":"Belper","name":"Makeney Hall Hotel","address":"Makeney Road, Milford","directions":null,"phone":"+44 1332 842999","tollfree":null,"email":null,"fax":null,"url":"http://www.choicehotelsuk.co.uk/en/clarion-collection-hotel-makeney-hall-belper-hotel-gb190","checkin":null,"checkout":null,"price":"around £50 pppn","geo":{"lat":52.997678,"lon":-1.477721,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":2815,"country":"United Kingdom","city":"Derbyshire","state":null,"reviews":[{"content":"Centrally located this place is perfect if you're not carborn and/or want to live downtown Seattle with close proximity to the waterfront. Best value for monthly stays. Rooms (queen bed, one person) are new and clean, furniture OK. Kitchenette has everything. Good storage room for both shoes, clothes and bags. Big and nice desk and LCD TV that's not in the way. Staff is friendly and efficient, front desk open 24 hours which feels safe. Could be better: affordable parking options, internet these days should be complimentary and wireless (they have a business centre but that's SO not attractive), mirror (one in bathroom only), noise reduction from the street (thin windows), cooling options (no airconditioning, hot in summer!) Area is a local neighbourhood, pretty tourist-free. Lots of good places for wining and dining at resonable cost. Some streets are less attractive and easily avioded. Perfect for young or solo travellers looking for long-term stays downtown.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Berenice Schaefer","date":"2013-04-13 19:16:13 +0300"},{"content":"This is absolutely not a four star hotel, it could pass for three stars. The breakfast is poor, the badroom worked only partly, the showercurtain had fungus and so did the silicone seem around the bad. Room and the whole hotel are constructed with cheap materials and service is poor. Beside this the locatation of the hotel is in one of this hyperclean finex nabourhoods very far out of Rome centre. We paid 107 euro for one night which is a ripoff. the hotel is not near the airport so you should ad 40 euros for the taxi because public transport is very difficult from this area. The website is mentioning a future gym and swimmingpool which are both not available and not in the planning soon.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":1.0},"author":"Raphael Lemke","date":"2013-10-10 07:09:42 +0300"},{"content":"Great value hotel We had a wonderful three night stay in November 2008. The hotel was very intimate, only a couple of other guests and the service was outstanding. Everyone who worked there was incredibly helpful, including the Manager who would make a point of talking to all the guests on a daily basis. The staff helped us organise diving in the area, trekking in the jungle and also onward travel from Pemuteran. There was building work going on at the hotel but we were completely undisturbed by this. We had a deluxe ocean view villa which was everything we could have asked for - the outdoors bathroom was amazing too, something special about showering under the stars!","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":-1.0,"Rooms":5.0,"Location":4.0},"author":"Hershel O'Connell","date":"2014-06-18 22:38:36 +0300"},{"content":"The Pointe Resort is not a resort. One should conjugate the verb \"resort\" instead. 1) I resort---to having cleaning service that only takes out the garbage and makes the beds. So it is a lot like home. You get the level cleaning your kid may do and then you do the rest! 2) You resort-to having queen size beds a foot away from flimsy windows. Perfect for giving parents heart attacks when toddlers are jumping on beds. I was told this set-up was in \"all of their rooms.\" 3) He, she, it resorts-to no WIFI. They will say they do but it is only in the lobby. Nice. I have a million dollars in the bank, it is just not in my bank account. But they do offer Ethernet cords which would be helpful in 1998. 4) We resort-to the lowest common denominator. It was our wedding anniversary. We asked for a bottle of wine. BTW- There is no room service so we were transferred to their \"bistro.\" You would think I was asking for gold. They couldn't make that happened. Also, the basic free continental breakfast was great. Only it was 9 dollars per person. But this was unnecessary for us as the aroma of breakfast lingered in our room for our first day. It smelled like hash browns. We were told it was probably our neighbors. Dem da breaks! So yes, it is a resort. This should be your last resort. I have no idea where the place these folks stayed that was four or five stars. I travel quite a bit and had better accommodations in Siberia.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":2.0},"author":"Modesto Torp","date":"2015-09-28 15:56:15 +0300"},{"content":"This was a wonderful place to say. The staff was very friendly, the rooms and upkeep of the place was incredible. I enjoyed having a kitchenette, Walgreen's was within walking distance and we were able to keep the fridge stocked as to not need to eat \"park food\" or fast food for every meal. Flatware and silverware were made available as well in the cupboards so no need to by disposable. Each night we went down the the pool which was kept very tidy. The king-sized beds were very comfortable. I have no reason to complain and would encourage anyone to stay. Whether using the shuttle or calling a cab the distance from just about every park was reasonable. Cab fare was usually 20bucks.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ahmed Rath","date":"2013-09-07 21:11:24 +0300"},{"content":"Had a great time in Orlando, perfect weather & quiet hotel. Booked a one bedroom suite which was clean & comfy. My husband found the bed to be too soft for his bad back. The suite had everything we needed & used the washer/dryer a few times. We knew about the Keurig coffee maker so brought our own K- cups. The shuttle to Universal left at 820 a.m. & the cab back to The Point about 7$ unless you stayed until 7:30 pm for the bus back. The pool was warm & we loved it! Breakfast was good (downstairs by the lobby) but you could shop at Publix a couple miles away & make your own. The ethernet worked great for my laptop! We did have a resort fee of 11$ daily which is much less than other hotels including parking , newspaper & ethernet in our room. Staff was always wonderful, polite & helpful, other businesses should take note! One negative was the extra price for our room on Friday & Saturday because of the NBA being in town. Firmer beds & a flatscreen in the bedroom would have made it purfect. After many busy days in the theme parks we like to relax in our bedroom. We would stay again, but check for anything big going on in Orlando!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Cortez Price","date":"2012-04-07 20:18:29 +0300"},{"content":"Nice room, great staff, free shuttle to all Disney venues and Seaworld. Golfing nearby, wide array of restaurants nearby. Heated pool was great. There is no restaurant, just the poolside snackshop (burgers and such). No worrys about safety/security, nice section of town. Near the trolley line.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Ms. Lukas Pfannerstill","date":"2013-04-02 02:39:37 +0300"},{"content":"I don't have a single thing to complain about! The location was absolutely perfect for our needs, right near International Drive and close to the parks and other activities. The hotel offers a free shuttle to Universal and Disney which is perfect to avoid paying for parking and it drops you off/picks you up at the perfect times! The room was spacious, VERY clean, and just what we needed. Definitely would stay here again and recommend!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Luna Murphy","date":"2013-10-24 01:34:46 +0300"}],"public_likes":[],"vacancy":true,"description":"40 room","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}