{"title":"Llandysul","name":"Waunifor","address":"Maesycrugiau, Pencader, SA39 9LX","directions":null,"phone":"+44 1559 395437","tollfree":null,"email":"info@waunifor.com","fax":null,"url":"http://www.waunifor.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.046684,"lon":-4.246137,"accuracy":"APPROXIMATE"},"type":"hotel","id":38018,"country":"United Kingdom","city":"Maesycrugiau","state":null,"reviews":[{"content":"Things I really liked: - Perfect location. Just a block from shopping and 1 mile from the stadiums. - Great staff. Parking valet and reception staff were friendly and quick to provide good service. - Free wifi if you join Kimpton Intouch. Joining is free and you get perks like said free wifi, $10 towards mini bar snack, your choice of paper in the morning, and choice of pillows. - Charming and unique atmosphere. - Dog friendly - Amazing down pillows - Leopard print terry robes. - In room safe - Efforts in being eco-friendly Things I didn't like: - Mattress was awfully uncomfortable. I'm sure not all rooms were like this (in fact, I've stayed here before and the bed wasn't like this). It was lumpy and there were big dips from being overslept on. - Every time someone in a neighboring room closed the door, the whole room would shake and it was so loud. - Shower liner was stained with black mold and mildew. -Small tub/shower Tips: -Join Kimpton Intouch - Ask for a corner room if possible. It's much larger.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Mr. Nicolas Breitenberg","date":"2012-11-22 15:47:09 +0300"},{"content":"I have stayed at several other Kimptons, but this was the first time in Seattle. Lovely hotel and great, friendly service. They do have a few quirks, though. On the positive side, beautiful decor and comfy room and I raved about the Tulio restaurant, where I enjoyed one dinner and two breakfasts, with excellent food and attentive service, especially from the manager, Doug. I agree with some of the other reviewers about the peculiarity of only having morning coffee available in the lobby. It is good coffee, but these days, even the average motel provides good coffee in the room. The bathrroom is rather small. Since I use a breathing machine ( CPAP ) the first thing I check out is electrical outlets near the bed. This was one of those cases where the outlet was behind the mattress, and it involved some rearraging of plugs. Otherwise, even with the extension cord that I carry, it would not have reached other outlets in the room.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eveline Gaylord","date":"2014-08-30 18:45:51 +0300"},{"content":"Hotel Vintage Park is centrally located in downtown Seattle, it was very easy to get to the shopping areas/Pike Place Market and a few good restaurants. We did not have a car and it was very convenient to get around. The staff at the reception were all friendly and helpful. It really only took a couple of minutes to check in and out. We were offered a coffee-maker, which was delivered within 10 minutes of our arrival with coffee/sugar etc. all on a tray. The room was spacious with bathrobes/socks/umbrella/in-room safe inside the wardrobe, and actually had plenty of hangers as well. The bathroom had good lighting, also with all the amenities that we needed. Our king size bed was comfortable with good pillows/sheets. We liked the decor, the couch and bed were not clattered with cushions (lots of modern hotels have heaps of cushions these days, and we usually have to move them around to create more room). Our room was on the top floor, so we had a leafy outlook of the city. The wine tasting evening was a nice social occasion to meet fellow travellers, especially for the single travellers. We really enjoyed it. We joined the Kimpton Intouch, so we got free internet throughout our stay, and it was great to be able to keep in touch with friends and family. This hotel is just so unique, one has to stay there to experience the difference ! We will definitely stay there again when we are back in Seattle next.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Kennedy Legros","date":"2013-09-16 15:29:40 +0300"},{"content":"We stayed at the Hotel Vintage Park for 5 days in August on a vacation trip, and found it to be one of the best hotels in all of our travels. The staff is first rate, and our king premier room was lovely. The afternoon wine reception became one of the highlights of our day, both from enjoying a variety of wines, and from visiting with others staying at the hotel and exchanging informaton. We especially enjoyed the two concierges, Ally and Louis, who not only added to the wine reception but were very helpful especially with restaurant recommendations. We tried the hotel restaurant for breakfast and weekend brunch, and it was very good. All of the extras provided with the hotel added up to an outstanding value, even more so if you are a Kimpton In Touch member. I will definitely recommend this hotel and we will stay here upon future return trips to Seattle.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Gregg Mosciski","date":"2012-12-10 15:32:40 +0300"},{"content":"Sometimes luck of the draw is luck; picked this hotel out from hotels.com on the train into Seattle. It was great! The rooms are very comfortable -- leopard print terrycloth robes are funky! Nice location near downtown attractions. The staff was exceptional. I left my cell phone in our cab and the front desk staff got it back for me within 20 minutes. Definitely would stay there any time.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Sim Schumm","date":"2015-08-20 15:42:59 +0300"},{"content":"Weekend getaway in Seattle... I chose the Vintage park since I have had good experiences with Kimpton hotels in the past and am in the InTouch frequent stay program. Kimpton did it again.... Beelyn and Lane at the front desk felt like friends after the first meeting and were very helpful in navigating Seattle for a first timer, they made . The upgrade to the Luxury Suite was delightful especially if you like to entertain friends. The Vintage Park is small enough that you get to know the staff quickly, yet large enough that it doesn't have that creepy B&B feel. Location is great! Easy walk around downtown or about a $10-15 cab ride anywhere else worthwhile. Seattle is not a \"hail a cab\" city so let the desk call one for you and one will be there in moments. The restaurant is pretty good, Sherry at the bar is an absolute delight and great to chat with if dining solo. On my next Seattle trip (which will be soon) there will be no doubt that the Vintage Park will be where I book.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Kennedi Abbott","date":"2012-02-04 04:48:30 +0300"}],"public_likes":["Kobe Zieme","Jayson Kovacek"],"vacancy":true,"description":"Historic estate with 6 holiday cottages offering self-catering accommodation and 2 large eco-friendly meeting rooms set in 4 acres of grounds and gardens. Pottery and craft studio on-site.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}