{"title":"San Francisco/Western Addition","name":"Queen Anne Hotel","address":"1590 Sutter Street","directions":"at Octavia","phone":"+1 415 441-2828","tollfree":null,"email":"stay@queenanne.com","fax":"+1 415 775-5212","url":"http://www.queenanne.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7872,"lon":-122.4265,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26265,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I saw the reviews online for this motel and thought I'd give it a try...never again. First off, the location is beyond horrible. The beds were itchy I had to spray them with Lysol just to stop the itching. The room I stayed in was halfway clean with dirt in the bathroom's floor cracks and pubic hair in the shower. The staff however are helpful and friendly but please don't make the decision to stay just on this. There are motels 2x better than this for the same price. Also they write your credit card number in full on the check in paperwork when asked about this I was told that they shred it once payment has gone through.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":1.0},"author":"Robb Franecki","date":"2012-06-11 20:12:05 +0300"},{"content":"Below Average Negative comments:1. Rooms are absolutely tiny2. Unfriendly, uninformed and unhelpful staff3. Do NOT go on the tours they offer as they are a waste of money, cheesy and over priced. Rather do things on your own steam.","ratings":{"Service":2.0,"Business service":1.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":3.0},"author":"Antoinette Conn","date":"2013-07-20 16:42:32 +0300"},{"content":"On balance very good for price Based on the limited information in earlier reviews, I was pleasantly surprised with my stay at the Dorsett. Yes, the beds are very firm, and the rooms very small and the air conditioning does not seem to have a heating option. On the other hand... *They let us check in at 9am when we arrived intending only to drop off our bags from the airport.*Brought us a good quality baby bed, gratis, for our 10 month old. *Air Conditioning filters out smoke smells well. (We wanted a non-smoking room and ended up on a smoking floor--there are only about 3 NS floors in the 20 floors of the hotel--but did not have a problem with smoke smells, except when we turned the AC off and the gentleman in the room next door lit up. Turning the AC back on quickly alleviated the odours).*Staff throughout were efficient and courteous.*Considerable arrange of room amenities on hand (tooth brush, comb, in room safe, etc. in addition to usual shampoo and soap)*Well located between MRT stations (Olympic a quick 5 min walk, Mong Gok about 10/15 min walk the other direction). (They have an airport shuttle too, but the MRT was sufficient for our needs)*Plenty of local food/shopping easily accessible in blocks around hotel.I would not recommend the breakfast buffet as much as some others. It is adequate (particularly on your first morning before you have oriented yourself), but the variety is limited and missing a few breakfast buffet staples (like fruit!)","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Linnie Kling MD","date":"2013-04-07 02:48:54 +0300"},{"content":"Great Accommodation with a reasonable price I went to Hong Kong to see a friend who was there for a study abroad program. I stayed a week and I must say this place is such a great place to stay. Room and bathroom were small but that's ok. There was a TV with 2 english channels on it, the beds were nice, and the place as a whole made up for it greatly. There was excellent service at the front desk and they made it so easy for me with the english they spoke very well. Shuttle was always on time and the maid tidied up the room every day. Bellman will push the elevator button for you and direct you out to the shuttle bus when it arrived. If I had any shopping, direction, or nightlife question they were always helpful by pulling out a map and pointing out all they knew (which was alot).They called taxis for me (one time the guest service guy went all the way up the road just to flag one down for me)! I was so very pleased with my stay and would stay there over and over again. Be careful, though, It's in Olympic City which is not an area where many other westerners stay. The place is still VERY safe, and was never in any worry that anything would be stolen. I was pretty much the only westerner at the hotel. But a 5 min. shuttle ride will get you to an MTR metro station which will open the doors to anywhere you want to go in Kowloon or Hong Kong Island. It's SUPER cheap! So are the taxis, but more expensive than the MTR.On the food end, there is a McDonalds just down the road, but who wants to go there? When you're in HK, do as the HKese do and eat at a local restaurant. There is a place very close by, to the left of the 7eleven I always called the Hot Pot place because it's real name was written in chinese, but it had THE best food from Vietnames, Chinese, and Indian you could get it there. Plus the bakery shops are also another thing to die for. I kept getting the raisin bread twists that were always sold there.Nightlife...not in Olympic City or the surrounding area. Take the MTR to TST (in Kowloon) or Central station (on HK island) and enjoy the nightlife there, it'll only cost you about $2 US to get you there and it's quick. Only trouble I had here was getting back. The MTR closes at 12:30am and to get back after that time you had to take a taxi. I was either in TST or on HK Island so to get back to my hotel it usually ran me between $4.50 US and $15 US depending on just how far away I was from my hotel.I would definitely stay here again without a hesitation.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Wilma Thompson","date":"2012-09-05 09:02:12 +0300"}],"public_likes":["Nick Runte"],"vacancy":false,"description":"The Queen Anne provides a real San Francisco experience, being an 1890 Victorian Hotel between Pacific Heights and the Civic Center, and near Japantown. Some rooms have fireplaces, and afternoon tea is served daily.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}