{"title":"Haverfordwest","name":"The Granary at Roch Mill","address":"Roch Mill, Roch","directions":null,"phone":"+44 1437 710 764","tollfree":null,"email":"granary@rochmill.co.uk","fax":null,"url":"http://www.rochmill.co.uk","checkin":null,"checkout":null,"price":"From £320 per week","geo":{"lat":51.8593,"lon":-5.0895,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":11315,"country":"United Kingdom","city":"Roch","state":null,"reviews":[{"content":"I had a 7th floor Twin Room overlooking the temple on Waterloo Street, & paid SGD$175 / Aust$139 per nt. I found the bed rather firm, and the bathroom walls are in need of a good clean or re-paint (splashes, scrapes and writing on the wall under the hairdryer). There is a good choice of TV channels, the room was quiet, and they have replaced the silly mini-fridges that were there on my last stay with small bar fridges which actually keep things cold. Housekeeping staff are friendly and were prompt in servicing the room. My main problem was the slow WIFI Internet. I was able to work online very early in the morning (from 4am to 5.30am), but at all other times it was so slow I just gave up. Don't think I will stay again.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Brannon Weissnat","date":"2013-12-18 22:36:14 +0300"},{"content":"We stayed here as part of our 3 month world tour and were not disappointed. The hotel staff were friendly and helpful and the room comfortable, clean and value for money.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Arianna Reilly","date":"2012-05-21 00:06:10 +0300"},{"content":"Booking through Accor annual \"50% off\" promotion and the deal is great considering the hotel price is high in Singapore. Room is really clean and bright and no strange smell even though the restroom is totally not \"open-to-the-air\". staffs there are polite and attentive. Also, the location is good. Subway is around 500m away and the bus stop just in front of the hotel. Overall. It is a nice hotel and if you get the deal, it become really great. Oh, BTW, they got really nice bed for sleep.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Delores Konopelski","date":"2014-05-31 16:56:54 +0300"},{"content":"Rooms a bit small, but nice decor. Buffet breakfast adequate. Many bus-lines just outside hotel and about 10 minutes walk from Metro Very helpfull staff. A pool would be nice. Staying again end of trip.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Brisa Bashirian","date":"2012-11-05 23:37:47 +0300"},{"content":"Good clean hotel. Designed for business travellers, but with some adaptation (i.e.sleeping bag) we could squeeze a family of 3 in their room. That is the only complain I had - wish there was a little more space in the room, to put an extra bed. Breakfast was excellent - enjoyed it much. Location is good - walking distance to Orchard street, MRT. Health faucets by commode could be a good addition to the minimalistic-yet-functional bathroom.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Emelia Lesch MD","date":"2012-01-23 23:28:57 +0300"},{"content":"hotel located well, very clean but very small rooms (ok for 2-3 nights. When booked via singapore airlines stoppover vouchers given are awesome i.e breakfast at hotel 50% off so 2x breakfasts cost $21. Other vouchers such as Hop on bus awesome and convieniant for most places you need to go. Marina Sands hotel and view awesome - better than wheel but to get to all the top area you need to book one day in advance (same cost $20)","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Emma Kessler","date":"2013-09-07 21:46:14 +0300"},{"content":"Stayed here many times, It was very good and friendly in the beginning, but it is sliding on every aspect: service getting more arrogant, broken linen, broken rooms( although repaired immediately but poorly, breakfast stays the same, bathrooms had a smell, etc","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Reta Rice","date":"2015-12-20 18:59:29 +0300"},{"content":"More than met our expectations. Only hiccup was due to medical condition requiring a frig. On request one was in our room within 5 minutes. The 'one resturant' was a worry for us as the menu was very limited for meals and difficult for one with dietry needs but.... the staff were very helpfull and pointed us in the direction of suitable and not expensive eating places. The help and service provided was excellent. Certainly will go again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ayla Hauck","date":"2014-11-16 00:57:44 +0300"},{"content":"Good location, neat and clean rooms. Suggest to supply traveller with toothbrush and toothpaste ao in case a traveller forgets to bring one he/she doesnt have to buy from ther store. Overall, the hotel is am good place to stay specially for people who loves to shop.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Katheryn Runolfsson","date":"2012-11-09 18:42:26 +0300"}],"public_likes":["Mr. Bennie Conroy","Marlee Koelpin","Brisa Schoen"],"vacancy":false,"description":"Self catering holiday cottage in Brandybrook valley close to Newgale Sands, Solva and St Davids . Sleeps 2-4, Sat TV, WiFi, usual appliances. Private 6-acre gardens alongside river. Ample parking. Inside Pembrokeshire Coast National Park.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}