{"title":"Menai Bridge","name":"Hafod Lon Holiday Apartment","address":"2 Plas Hafod Lon, Lon Ganol, Llandegfan, Ynys Mon, LL595UD","directions":null,"phone":"+447802437898","tollfree":null,"email":"enquiries@hafodlon.co.uk","fax":null,"url":"http://http:\\www.hafodlon.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.242,"lon":-4.1414,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":40188,"country":"United Kingdom","city":"Llandegfan","state":null,"reviews":[{"content":"i stayed in the hotel from Friday to monday. we arrive very late friday night to find the hotel in an area surrounded by outdoor clubs, fast food outlets and young drunk kids, mostly of the Punk variety. we did not feel safe on the train platform or walking the 200 meters to the hotel. once at the hotel it was beauitful, you cannot hear the techno music from the clubs or the sounds from the roads outside. the room was a good size, the staff were excelent, the breakfast will keep you full well into the day. during the day the surrounding area looked fine. mainly young students living and working in the area. there was some broken glass on the gound from the nights before. i would not recomend this hotel if you have young children as the drinking culture in this area is a big turnoff good hotel if your looking for cheap, comfortable hotel close to the train lines.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":1.0},"author":"Miss Nathanael Morissette","date":"2013-02-13 21:59:30 +0300"},{"content":"Travelled in a group of 7, and stayed 4 days in Miami prior to our cruise. At first impression, I am not sure if they are going for the nostalgic dark decor, but the hotel had a sort of antique features and dark wood, with low lighting. We had to find someone to take our bags to our room as there was no doorman when we arrived and only one conceirge with the trolley full of luggages, so we had to go up the elevator to the main lobby and wait for the concierges there. From previous tips from this website I requested a high level bay view which the three of us received. We were very happy and amazed from the views. The rooms were of substantial size and had all the amenities except for a minibar, although there is a ice and drinks vending machine a few doors away. However, my Uncle was unfortunate to get locked in the bathroom and had his wife call maintenance to unscrew the door to let him out. They fortunately were able to change rooms later that day. The rest of the group had no problems with the room. We had dinner on our first night and was throughly entertained by our Egyptian waitor (cannot remember his name) but we really enjoyed the evening. Breakfast was ok, however the variety was limited but I did expect it after reading the previous reviews, so I was not surprised. As a vegetarian, I did fill up on fruits and bread, however the savoury foods only limited me to scrambled eggs and oatmeal. Would have liked beans or hash browns instead of pancakce rolled up with creamy cheese! The staff were helpful and the internet service was good as it was free if you are a guest. The gift shop was also good as well as the bar in the main lobby, however it did take long to get our order as there was only 1 bar man serving...he gave us complimentary drinks for waiting so long. The surroundings were ok, no problems there as we mostly took taxi around town, we did try the mono rail which was exciting but a bit scary at the freedom tower stop, a guy was screaming which led me to believe he was mentally insane, there are no barriers from the platform so be careful as it does get windy up there. We went on the city tour and the Orlando day tour as recommended by Danilo the concierge. We enjoyed the boat city tour, however I would not recommend the Orlando trip as it was a nightmare. The main journey took 3 hours (expected) however if you are going to the magic kingdom, you have to transfer to a mini van, which the driver then took us into the car park of a supermarket area as he had to wait for a guy who was buying the entrance tickets, we had to wait in the car park for 10 minutes, at this time after travellig 3+ hours we were furious as we were told we would get at the park around 10am instead we arrived at 11am, thus cutting short our enjoyment at the park. We vented our frustration but the driver said to complain to the company and muttered in Spanish. We tried to enjoy the rest of the day. The tickets should've been purchased prior to the day. The following days were uneventful and we went on our cruise. Lambert the doorman was thoroughly considerate.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"Kadin Willms","date":"2014-12-24 19:21:28 +0300"},{"content":"I stayed here for one night due some mix-up with accommodations in Ft. Lauderdale but that was fine as my cruise was departing from the Port of Miami anyway. Location-- very close to the free people mover and major bus connector to get all over Miami or South Beach. A Burger King was directly across the street for a quick coffee or salad but that was it for restaurants. Room-- I did like the floor to ceiling windows and it was clean but, in all honesty the room was no more different than any hotel that I stayed in with a lower star rating. The bathroom light is on a timer so that was good for energy conservation. Bed was comfortable and TV worked fine. Walls looked a bit old though so I am thinking that perhaps this hotel could be showing its age somewhat. Staff-- were nice, friendly and always had a smile. Negative-- the wireless internet. I decided to purchase it and it was horrible. Kept crashing and when it did open it was slower than dial-up I had years ago. Was good for one night but I would not do longer.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Moriah Rippin","date":"2013-11-24 14:46:04 +0300"},{"content":"First time staying at the Miami Hilton Downtown. I was in town for a short business trip and the location was perfect, so decided to give it a try. It's very much a Hilton, with all the standard amenities and qualities one expects to find at a Hilton hotel. That also means you know you're in a hotel and not at home :-) The room is nicely furnished and clean, and surprisingly quiet in spite of being located right next door to the ice and vending machine. TV selection was pretty basic, but I'm not here to watch the tube so no biggie. Lots of elevators, so I didn't ever have to wait long. Bed was comfy, though the pillows were a bit thin for my liking. It would be nice if the hotel offered a selection of pillows, as some other chains do. Bath was clean and everything worked flawlessly. The drain in the shower was a bit slow (probably clogged with hair) but a quick call to maintenance fixed that. I did eat in the hotel restaurant one night and it was good. Had the mahi-mahi, with rice. Location is good, with the Sea Isle marina a short walk across the street. I took a walk one night after dinner and enjoyed the view. I'd stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Bette Bernier","date":"2015-07-05 15:58:03 +0300"},{"content":"We stayed here for 2 nights in Nov. 2011 for a romantic getaway. Our view from the room was not that great but the view from the terrace was. The staff was very friendly and I tipped generously. The room itself was massive and clean. This is 1 of the best 3 hotel rooms I have ver stayed in and I've been to a lot. The staff was also very courteous and evyeryone was willing to go the extra mile. I was not used to not having free wifi, since its availabele for gold hilton honours members, which we werent at the time. However the odd thing is the wifi fee the charge you is per device not for the room. This means if your not a Gold HIlton Honors member, and have 3 devices you want to connect to wifi in your room, Hilton expects you to pay 3 times. This seems odd consdering that number of devices that have a mobile hotspot feature. Another way around this is just use a device or phone that has a mobile hotspot and connect all your devices thru that. Nedless to say we found out the hard way and were charged twice but the front desk attendant made it right by covering one of our charges. Our only regret was that we wish woul dcould stay longer. We will be staying here next time we visit to see the Heat play.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Stone Cummerata","date":"2015-12-03 23:03:56 +0300"},{"content":"Stayed here when we missed out flight to San Juan. Arrived late, tired and hungry. Avi, manager of the restaurant took great care of us, helping get us fed after the kitchen was about to close. Went out of his way to help. Nice front desk personnel as well. So far a great experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Myrl Stehr","date":"2013-11-21 14:48:57 +0300"},{"content":"We stayed at the Hilton for 2 nights after getting of a cruise. The hotel itself was pretty good. The staff were friendly and helpful, and the lobby and bars downstairs were very relaxing and we did spend alot of time there. The room was spacious, but the walls very thin. We were near the lifts and they were noisy all night. The airconditioning in the room was rather loud as well. But the room was clean and bright. Except for the location, we would stay there again. When we travel, we like to walk around the area/city and enjoy the sights. DO NOT walk too far from this Hotel. We should have stayed at South Beach area instead. Downtown did not feel safe at all, and there were alot of unsavoury looks as we did walk 4 blocks from the Hotel. We soon turned around, went back and called a taxi to take us where we wanted to go. The Hotel is good - the location is not.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":1.0},"author":"Herman Bins IV","date":"2013-01-24 14:40:10 +0300"},{"content":"We spent one night prior to cruising and were not disappointed. Our room on the 14th floor had a great view of downtown, the port, and the waterfront. The room was clean, spacious, and well appointed. The front desk staff was courteous and efficient during our check-in. The location is very convenient, only a short 1 1/2 miles from the cruise terminal. It also is only a block away from the Omni station, which provides access to the free Metro Mover, as well as numerous buslines (including multiple lines serving South Beach / Miami Beach for $2 per ride). We ate a late dinner at the hotel bar and were pleasantly surprised at the food selection, quality, and moderate prices. However, service was a bit slow, even though it wasn't very busy. The bar, as well as other public areas were nicely decorated and clean.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Margret White Sr.","date":"2013-12-31 07:53:12 +0300"}],"public_likes":["Valentina Gutkowski","Luciano Jast I"],"vacancy":true,"description":"Self-contained first-floor two bedroom apartment with its own private entrance. The apartment is situated in the village of Llandegfan between the town of Menai Bridge (1.5 miles) and the seaside town of Beaumaris (2 miles). The apartment occupies the top floor of a large private manor house, overlooking the Menai Strait towards the university town of Bangor and the Snowdonia Mountains beyond. The property is located in a private spot down a private lane and has of parking space if you need somewhere secure to park your trailer, boat, canoes, etc.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}