{"title":"Paris/1st arrondissement","name":"Hotel Karraz","address":"12, rue Mondétour","directions":"Métro: Les Halles","phone":"+33 1 40 26 25 40","tollfree":null,"email":"apparthotel@hotmail.fr","fax":"+33 1 40 26 22 02","url":"http://www.hotelkarraz.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86365,"lon":2.34854,"accuracy":"ROOFTOP"},"type":"hotel","id":21722,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"If you are a Hilton Diamond Member using points, be prepared to use quite a few points. For us it was worth it! Here's a tip - when you book your reservation, prior to your travel you will get a 2nd email from hotel with an area to submit an upgrade request. We used that link to upgrade, for free, to the Napua Tower. The Napua Tower is like the Executive Level. They have a good breakfast in the morning and appetizer in the evening. The service is great. House Keeping did a great job and our room was very clean. Another Tip - At The Whaler's General Store in The Shops at Wailea (a short drive/walk from the Hotel) you can pick up some reasonably priced snacks, drinks and deli. I was surprised the prices on most items were cheaper than the local super markets in Kihei. Finally, the greeter at the front (Rose Sumibcay) was very cool. She was very kind and engaging and my 9 year old daughter looked forward to seeing her everyday to \"talk story\". Solid Vacation --- Hope to be back next year.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Rylan Runolfsson","date":"2014-12-08 05:06:04 +0300"},{"content":"This property is clearly gorgeous but very very big! The pricing is what the pricing is and I feel that if you stay here you should have known that going in and thus you are not allowed to complain. I found the staff to be very pleasant individually but something just doesn't click here? It may be that it is so large that it all just doesn't connect, or come together as complete. The grounds are spectacular and easy to navigate, just be prepared to walk. Take in all that is around you, there is plenty to look at! The pool area was crowded but it was not a problem finding chairs, even after 11:00 am. There is limited space around any pool no matter how big, if you want to be pool front get up and get out! There was lovely lawn area with plenty of chairs and it was just fine and a short walk to the pools...just wear your $@!#% flops, as the walkway is sooo hot! Not the GW's fault! The beach is shared by 3-4 hotels and, though lovely, it is not huge and it gets packed!!! We went into the ocean but parked ourselves by pool and lawn. We ate at Humu and the pool area restaurant. Humu, with the $40 coupons was a fairly reasonable value and a great atmosphere. We had 3 rooms so we had $120 worth of coupons. Our dinner for 6, after coupons, was just over $200! This included some apps and drinks. Don't drink as much as us and use your free drink coupons with dinner, not before, and it is even less! We all felt it very good. The pool area food and bar was as expected, just fine. My daughter loved the spa treatment and, again after using the 20% off coupon, thought it was reasonable at about $125 for a 50 minute message and one hour use of other facilities included. The gym was large and we were there at peak time and waited for no machine. The rooms were very spacious and comfortable. We were in the back building and on the 6th floor and had a great view! I liked the bed though others with us thought they were to soft. If you take the down mattress cover off, or ask housekeeping to, it will be more firm. One thing to note, the lovely bathrooms were adorned with a throw rug that had no rubber backing in front of the sink!!! REMOVE IT if they have not yet changed them all out. I took a pretty good fall, after ignoring a slip or two prior. I was lucky to only twist my ankle and bruise my elbow pretty good- enough to miss my scheduled golf event with son. I can only imagine if it was someone older or less able to control the fall. I mentioned this to front desk and though my rug was immediately changed out to one with rubber backing the other two rooms we had were not! I was clearly not the first by the look on the faces of those I mentioned it to. Though I was looking for nothing, I was surprised by the apparent lack of concern when discussed with security. Would I stay again, yes I would. It was a lovely place.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Ashtyn Cartwright","date":"2015-08-10 19:43:48 +0300"},{"content":"The grounds of the hotel are beautiful, but the hotel itself is pretty dated. I've stayed at nicer rooms at the new Hampton Inn properties for much less money. The property is probably too large for them to offer great service. We started the honeymoon at a 5 star property in Kauai, which set the Wailea up as a disappointment. I would be surprised if this property remained a part of the Waldorf collection much longer.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":5.0},"author":"Destini Lakin","date":"2015-04-16 14:22:47 +0300"},{"content":"Don't listen to any single negative comment about this hotel. I browsed a few of them: \"Too much sun at the pool\"? \"Average food\"? \"You have to wear a wristband to use the pool\"? Who are these sad, little people? If more than usual sun exposure is a concern for you, then please: don't visit a tropical island for your vacation. My wife and I came here on our honeymoon, and we returned for our one year anniversary. When we informed them of this, they gave us an amazing (free) room upgrade and put a bottle of wine and a cheese plate in our room! The thing about the GW is there's NO reason to ever leave the property. You have beautiful beach, SEVEN swimming pools, a pool bar, and incredible restaurants. The layout of the hotel is awe-inspiring as well. Basically everything IS expensive, and it's because you're receiving the best of the best. Just down the beach are two other famous, upscale resorts: The Four Seasons and the Fairmont. While each are also impressive in their own ways, they just don't compare because the pools at the GW are so epic. There's amazing water slides and even a current-driven path that connects one pool to another. You can easily walk to any of the restaurants at other hotels. If you can afford it, why would you stay anywhere else?","ratings":{"Overall":5.0},"author":"Ms. Ricardo Gerlach","date":"2015-06-04 13:50:23 +0300"}],"public_likes":["Chelsey Barton Sr.","Mallie Rippin","Jenifer Keeling","Mr. Sadye Labadie","Ava Keebler","Enid Von","Rogers Huels"],"vacancy":true,"description":"Next to Les Halles Metro Station.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}