{"title":"London/Hammersmith and Fulham","name":"Novotel London West","address":"1 Shortlands, W6 8DR","directions":"tube: Hammersmith","phone":"+44 20 8741-1555","tollfree":null,"email":null,"fax":null,"url":"http://www.novotel.com/gb/hotel-0737-novotel-london-west/index.shtml","checkin":null,"checkout":null,"price":"From about £130","geo":{"lat":51.4918,"lon":-0.2207,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16176,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Awesome stay Hi All, we stayed at the RIU Bambu 6/18-6/25/05, this was an awesome stay. We have stayed at 3 other Riu's. All are excellent one their own, Bambu is the best yet, from our perceptive. Nice room excellent service, fantastic food. We ate at the buffet every day, breakfast and dinner. Selections were great. themed dinners ( mexican, Dominican, BBQ,) the seafood is awesome shrimp lobster oh my god it was awesome. We ate everything and no one got ill. However, eating fresh fruit and salads, and spicy foods are part of our daily diets. Drinking, ask the bartender to make you thier special drink. I highly recommend the  el Boney at the pool bar. Go prepared... take plenty of sunscreen ( pack twice what you think you'll need, the water and sun will require frequent reapplication) you can pay more than $16.00 USD for a new bottle.Take isolated mugs, you will be happy for a cool drink while lazing on your lounger.Take a raft type item for drifting in the sea.The beach flea market was not for us, pushie aggressive vendors, however it is a nice walk up the beach.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Joy Littel","date":"2012-06-07 22:05:11 +0300"},{"content":"Shame about the rain I was unsure what to expect after all the negative reviews, however this was a great place for a relaxing holiday. The only thing that spoiled it was the weather. It rained continuously for 10 out of 14 days. I would suggest avoiding the month of May. The hotel was very clean. There were no roaches in our room or the hall way. The food was good and plentiful. We were never sick and ate pretty much everything. The only complaint I have is about the entertainment. I recognise that the team work very hard long hours however the shows are quite repetative, at times quite unprofessional and when it is raining no additional entertainment was provided and as a result spent more time watching TV on this holiday than any other. Staff were very helpful and friendly. There are very little shops so dont worry about excess baggage on return journey as theres nothing to buy.Manarium is the excursion where you swim with sharks and rays and was excellent value. Took a trip on a helicopter which was a great way to see the coast line. Without a doubt the best thing about this holiday was the beach. Just as well as this is pretty much all there is in this area. It is huge with white sand and clear blue sea. We never had a problem getting a lounger and there was plenty of space, infact even when the sun shone the beach never looked crowded.A great value for money relaxing beach holiday best suited to couples and famalies. We may return but at a different time of year.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Zoila Koch","date":"2015-12-02 13:43:50 +0300"},{"content":"unfriendly staff hotel is beautifull and food is pretty good, but staff was not very friendly.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":3.0,"Rooms":5.0,"Location":-1.0},"author":"Conrad Daugherty","date":"2013-01-16 06:50:01 +0300"},{"content":"Fun Place BUT.... Nice resort with an incredible beach. Service was excellent with a helpful, enthusiastic staff. Very-very clean.However, the virus lives. Five of seven got sick which puts the victim down for a day. I don't think it has anything to do with the food; its more like a 24 hour bug.This really is a very nice place and I don't think this problem is due to anything in particular that they are doing wrong. It's just there and probably needs time to run its course.Its definitetly the nicest RIU of the five on the complex.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Darby Willms","date":"2015-09-14 04:57:05 +0300"},{"content":"Eat Lots Before You Go! Just got back from the Riu Bambu ( feb. 21 - 28 ) The food was really BAD and the wine well impossible to drink. I did book last minute and that was the only place available (not a good sign). Rooms are okay nothing special and mine came with an upgrade I guess; I had hundreds of tiny ants. Since I was travelling alone, I did not mind them and by the end of the week they were gone. Maybe they didn't like my music. Did I tell you how bad the food was? Don't understand how this place got a 5 star rating. I read reviews were some people liked the food. Man you guys need to go out more. Also tons of children and sadly most of them orphans or the parents spend the day at the bar trying to forget they had kids.If you like chatting with other guests, I suggest you bring a German translator. Food is really bad except for soups, deserts and the fries were okay. So for my main course I had a banana and fries. On a more positive note, I was not sick; then again it's pretty hard to get sick on BANANAS. Everyday the buffet is the same; I guess they were afraid to change a good thing. It was nice to come home to a good bottle of Shiraz and week old leftover in my fridge. (DELICACY)Conclusion; If you can survive on very little food, then this is the place. The weather was nice and the beach is beautiful. Good news from my doctor this morning; He thinks I will make a full recovery. PS In case I forgot, the food is really bad. BON VOYAGE!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Alden Kerluke","date":"2015-06-27 18:57:14 +0300"},{"content":"Mixed results My wife and I stayed at the Bambu for 1/13/05 through 1/20/05. While we had a great time, the virus caught both of us. She was sick most of Sunday and I on the following Tuesday.Beach: Beautiful, spectacular.....need I say more. A few topless ladies but nothing out of line. Lots of beach chairs all days but one.Pool: Beach was too nice to sit by the pool but many did and had a good time.Food: OK for all-inclusive. Lots of food whenever you wanted to eat.Bars: Lots of fun, lots of booze. Did my best to get my $$$ worth. A few tips go along way. By the way, they do have Johnnie Walker Red for the scotch drinkers.Rooms: Stayed in 108 close to the beach. Clean and no problems.Will consulate with my DR. b-4 going back to avoid illness. We drank no tap water but still got sick. i would say 50% of people I spoke with had gotten ill.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mr. Immanuel Cartwright","date":"2012-03-24 17:57:59 +0300"}],"public_likes":["Ursula McKenzie","Elvis Watsica","Mrs. Daisy Armstrong","Joannie Ward","Kaylin Parisian","Terrill Paucek","Mortimer Dibbert","Garrison Rempel"],"vacancy":false,"description":"Very large business-class hotel.  The rooms are reasonably priced with basic amenities in each room.  Wireless internet available, or basic internet through the room's television.  English breakfast available at extra charge. Restaurant/Bar/Lounge, massage center, concierge, cash machine, shoe shine machine, tourist information desk, porter, dry cleaning/ironing available, currency exchange, pets allowed with deposit.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}