{"title":"Santa Monica Mountains National Recreation Area","name":"Circle X Ranch","address":"12896 Yerba Buena Road, Malibu, CA, 90265","directions":"Take Yerba Buena Road 5 miles north from Pacific Coast Highway","phone":"+1 310 457-6408","tollfree":null,"email":null,"fax":null,"url":"http://www.nps.gov/samo/planyourvisit/circlexranch.htm","checkin":null,"checkout":null,"price":"Free entry. Reservation fee for campsite use varies","geo":{"lat":34.10578,"lon":-118.93951,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":37590,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"We needed a place to spend the night on our return to the states from Canada as our flight left in the am. I wanted to be near Pike Place market so my son could see the fish throwing before we headed to Sea-Tac, I found the Moore, and couldn't belive the rate ($80/nt plus taxes and fees in downtown Seattle!). It seemed a little sketch/hostel-y on its website, and in my 30's with a child I'm not too into that, but the reviews were such that I felt that we should give it a shot. It was wonderful, the staff was nice and helpful, check in was a breeze and it was obvious staff was attentive to who was entering the hotel to make sure they belonged there. Our room was right on the street (6th floor), but a fan was in the room and once turned on you couldn't hear any of the traffic down below. The bathroom had been recently redone and was neat, clean, and attractive. The room was large, and the beds comfortable. Add to that the the location is unbeatable - this hotel is a jewel!","ratings":{"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Zechariah Torp","date":"2012-07-01 09:02:26 +0300"},{"content":"My girlfriend and I were in Seattle for my birthday, staying at the Sheraton. My girlfriend is the type to always seek out the hotel were she can have room service for every meal; she loves to be waited on. Well, we missed out departing flight and were stuck in a city with ZERO rooms available (Neil Diamond was in town). We needed to book a room fast. I got online and found nothing, and then I came across the Moore Hotel. Not only did they have ample rooms, but the rate was CHEAP. My girlfriend complained the entire way to the hotel, because it wasn't the Hilton, Four Seaons, etc. She nicknamed the place the \"No-Moore Hotel\" befre we even arrived. Once we arrived, the hotel had SO much personality. Everything was exceptional, rate paid considered. We will both be staying here every time we visit Seattle. I can not go on about this place enough!! I truely rate this hotel five stars for its charm and resonable rate!","ratings":{"Overall":5.0},"author":"Ola Pfannerstill","date":"2012-12-13 04:49:34 +0300"},{"content":"We had our concerns when we booked at the Moore for Sept 6 & 7, because you get what you pay for, right? And any accommodations anywhere else would have been more than triple. We were very pleasantly surprised! We got more than we paid for. The rooms were clean and spacious with character. Even though Megadeth was playing at the theater, we slept soundly. We will absolutely stay there again. The location is excellent. We used the city bus service, so parking was not a problem. Although there was no air conditioning, open windows and fans kept us comfortable. Splurge on the John Malkovich suite if it is available (private joke, you'd have to see it.)","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Olaf Bernhard Jr.","date":"2013-10-18 09:29:38 +0300"},{"content":"I love this hotel -- WILL DEFINITELY STAY AGAIN on my next trip to Seattle. Quite unpretentious, room is large, clean bathroom, clean everything. the friendliest staff on the planet, quiet, well-insulated rooms, loved the \"clawfoot\" bathtubs - very ornate and quite unique. Very reasonably priced. Only few minutes walk to Pikes Market and heart of Downtown, Ross Dress for Less and Macy's, greatest location for the price. I will definitely come back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Darlene Konopelski","date":"2014-02-22 13:22:55 +0300"}],"public_likes":["Russel Parker","Camilla Schumm"],"vacancy":true,"description":"Circle X Ranch is the only campsite within the National Recreation Area boundary. Trails to nearby Sandstone Peak and Boney Peak terminate here.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}