{"title":"San Francisco/Golden Gate","name":"Hostelling International-Fisherman's Wharf Hostel","address":"Fort Mason, Building 240","directions":"Upper Fort Mason","phone":"+1 415 771-7277","tollfree":null,"email":"info@norcalhostel.com","fax":null,"url":"http://www.sfhostels.com/fishermans-wharf","checkin":"2:30PM","checkout":"11PM","price":"Dorms: $26-$30 Private family rooms: $65-$100","geo":{"lat":37.8071,"lon":-122.4285,"accuracy":"APPROXIMATE"},"type":"hotel","id":25795,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We stayed at the Deca for one night following a long drive through heavy Seattle traffic. Since I was exhausted I decided to take a short nap---and short it was indeed, because a teenaged girl began shrieking and running through the hallway outside of our room. To the hotel's credit, a security staffer came up and instructed the girls to stay in their room, but shortly after he left, the aforementioned girl was out giggling and running in the hallway. When I went down for dinner, I commented to the desk clerk about our noisy neighbors, and she said, \"Sometimes things like that happen.\" I was speechless, but took that as a cue to seek dinner outside of the building. (The Deca has a small bistro in its basement, where we had lunch: the service was friendly, but the food was an overpriced disappointment. A small piece of grilled salmon was served over a large bed of lightly sauteed sliced onions and peppers. With 2 drinks, the total tab for the two of us came to over $30, and we left hungry. I also might add this hotel has no room service, so forget about breakfast in bed or late-night munchies in front of the flatscreen plasma TV that was in our premium room.) This is too bad, as the room we stayed in was pleasantly decorated and had plenty of space. We had a view of the city from our window, and the hotel is located very close to the University of Washington, where I was visiting. There is also free off-street parking, which is a lot to recommend in a town where parking averages $7 an hour. However, we were disappointed by the noise we could hear in our room. On one side we could hear our neighbors' television, while on the other, shrieking and giggling. Maybe a less noise-phobic guest would like this place: but I really need quiet to sleep well, so I didn't. Beware too, that the free continental breakfast is cleared away at 9 a.m. sharp---something that wasn't mentioned anywhere in the room---so you will miss out if you like sleeping in. I have to say I have visited Seattle many times and have stayed at several different hotels; I don't think I want to go back to this one. There are quieter places with far more amenities in that city.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":2.0,"Rooms":4.0,"Location":4.0},"author":"Rupert Crist","date":"2013-12-26 20:16:56 +0300"}],"public_likes":["Laverna Frami Sr.","Boyd Adams","Dr. Teagan Crona","Malika Hickle","Mellie Wilkinson","Brook Keeling"],"vacancy":true,"description":"Even if you're unsure about hostels, you should still consider this place; the location alone makes it worth your while, as it is in a park-like setting with great views of the Golden Gate Bridge and Alcatraz and is within easy walking distance of [[San Francisco/Fisherman's Wharf|Fisherman's Wharf]]. It has a total of 150 Beds in dormitory style rooms. Quite clean and safe, with wi-fi, laundry facilities, lockers, and free breakfast.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}