{"title":"Birmingham (England)","name":"Hotel La Tour Birmingham","address":"Albert Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48104,"lon":-1.89056,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3644,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"great expectations from the hotel of THE FUGITIVE! Wonderful lobby! AND THAT'S IT! The room was old in style and furnitures, the tv was from the other century, no minibar, no wireless internet, no wireless adapter enough for the number of the room, those guys ignore that we are in the era of IPAD without cable connections. small room, small bathroom, rude service room. they have lost my credit card number and want CASH ON DELIVERY for a breakfast of 20 dollars. Robbery in the business center, 0,59 cents a MINUTE for internet connection, you have to pay to use word, or excel. NEVER AGAIN!","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Buck Buckridge","date":"2014-06-28 08:29:55 +0300"},{"content":"I had to stay there for a conference. The room was quite small and the interior dated. Neither the room or the bathroom were very clean. Very dusty ...and under the bed and found till receipts from previous occupants!!! NO wireless internet in the room. On the plus side, the location is excellent and around the hotel there are lots of lovely coffee shops and restaurants.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Genevieve Price","date":"2015-06-23 13:03:47 +0300"},{"content":"This was my third stay at Palmer House. It is now my hotel of choice in Chicago. The Palmer House is elegant, but I always feel well cared for--as if I was the most important guest. During my stay this time, the hotel was observing Autism Awareness Month. It's nice to see obvious evidence of the commitment to a good cause (one that I care about personally). Between business meetings, I spent time relaxing in the beautiful lobby (worth a trip just to see it!) and very much enjoyed the food in the lobby bar area (great burger!). No negatives at all. Great hotel!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Damion Pfannerstill","date":"2013-08-18 02:58:15 +0300"},{"content":"I have 2+ million miles flying, hundreds of hotels, thousands of nights, 30 reviews on this site and even 8 different ones in Chicago. As far as the developed world goes this is up there with the worst managed hotel. Not the worst hotel, it has a beautiful lobby, nice people but the worst managed. So if you get your room cheap - which means under $130 a night you might want to stay here. Otherwise you will not get what you pay for. First impression, 18 minutes in the Hilton Honors line to check in at 8PM on a Saturday night. Imagine what it is like on Monday. First room 12X15 and this is in an upgraded room I measured. The others are smaller. No toilet paper, no tissues, all of the lamps unplugged, pealing wall paper and pealing plaster in the spaces between the wall paper. Then the pipes began to scream and bang. Called the desk asked to send up an engineer they sent a security guard for the screaming. Explained the issue called the desk, they said there was no problem. Started again 30 minutes later so I held up the phone this time and they said they could hear it through the phone but would send a plumber. He came said of course he knew it happened it was old pipes. Called the desk a fourth time put him on and they said the onl king room was on the executive floor but I would have to pay for. I said fine. Went to put my suit in the closet. This is not a lie the closet was narrower than my coat hanger. Then went to use the TV. Did not work they sent a repair person. Then went to use the wireless. They said you need to come down to the front desk - waited 15 minutes - to get an old bridge, leave a $200 deposit, went back plugged it in nothing. Wireless only works with a bridge, get one when you check in. Called down the sixth time in 12 hours and they did not have any engineers working Sunday sent a bellman with a new bridge. The internet did not work in the room because the plug was torn out from the wall. Called down a 7th time in 12.5 hours and they said they would find me another king. They would find me a work room in the mean time. Sent a bellman he told me he was there to move me to a single - the old 12X16. I said no. I took the key went here and now am online and decided to write. Can't wait for the next 3.5 days. Check your room before you agree to make sure it is OK. BTW when I complained around call number 5 the desk person said they were sorry they did not know how the hotel had 4 stars when the Hampton Inn around the corner was better set up with better rooms and services. Another desk person said they have been complaining for years but Hilton will not put any money into the hotel. You have been warned.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Dora Adams","date":"2012-11-26 07:10:07 +0300"},{"content":"The Palmer House is a beautiful historic hotel. This is the best thing about the hotel. Otherwise, it is not a pleasant place to stay. It charges for everything....a coffeepot for our room, the fitness center, etc. The rooms are small without a proper reading chair. We could hear our neighbors all the time. The elevators are very slow. And yes, I did complain to the manager on duty who did take care of some of our issues but I would not stay here again. There was just too much hassle. One other point in its favor though is the location...great location for shopping and eating.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Juvenal Mayert","date":"2015-10-16 02:41:26 +0300"},{"content":"We stayed at this hotel in Dec2010, we booked it for its location and location was really great if you want to enjoy the downtown strolls, though there are no scenic views from hotel rooms,most of the Malls , and theaters are at walking distance, and you can visit Navy Pier and shed aquarium within $10 taxi fare...","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Stanford Leannon","date":"2013-11-29 00:18:47 +0300"}],"public_likes":["Brandon Stark","Cruz Conn","Miss Janice Beier","Keegan Johns","Tre Rath"],"vacancy":false,"description":"This stylish hotel caters for the luxury end of the four-star market, with an a la carte restaurant with open kitchen and in-room &quot;media hubs&quot; that let one connect their devices to the room's display and sound facilities.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}