{"title":"Oban","name":"Columba Hotel","address":"The Esplanade, Oban, PA34 5QD","directions":null,"phone":"+44 1631 562183","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"Rooms generally £50-80 per room.","geo":{"lat":56.4149,"lon":-5.47393,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20959,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"This inn was wonderful, beautiful and spacious rooms and bathroom. Our room had a great view of the harbor, I really cannot say enough good things. The breakfast had a large selection of fresh fruit, bagels and cereal with coffee, tea and hot chocolate available 24 hours a day. Ok the negative was, in Fells Point there are really only pubs and ice cream shops you must walk (20--25 minutes) or water taxi to the inner harbor for restaurants. But then you can return to the Inn and escape.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Suzanne White","date":"2014-09-13 07:43:32 +0300"},{"content":"We have four children and stayed in two rooms next to one another during the gap between Christmas and New Years Day. Extremely happy with the rooms; very comfortable beds, towels and very much liked the breakfast buffet.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Zita Ward","date":"2015-05-28 13:27:33 +0300"},{"content":"I recently extended a business trip a few extra days, decided to avoid the chain hotels, and made reservations at Henderson’s Wharf Inn. It’s the smartest thing I’ve done in a long time! The inn is ideally situated in Fell’s Point, within walking distance to Baltimore’s Inner Harbor. The inn’s entrance, lobby, and rooms are nicely decorated and very comfortable. The inn provides luxurious robes, a complimentary bottle of wine, and a well-stocked snack and beverage bar. The Inn also provides complimentary breakfast, which is enough to get you going in the mornings. You can enjoy your breakfast, weather permitting, in their courtyard garden. It’s worth noting that the inn’s guest rooms are on the first floor with either marina or garden views. The floors above are residences, which add to the appeal. You never quite feel like a tourist, and instead feel quite at home. The cobblestone streets, shops, pubs (lots of them), cafés and restaurants of Fell’s Point might keep you busy and away from the Inner Harbor. However, if you do remember to visit the harbor, you're within walking distance. The walk will take you along the water’s edge, or you can just as easily take the water-taxis that will take you back and forth all day long for one fare. Please try the taxis at nights; the city lights are wonderful at night! I’ll be returning again, and will only consider staying at Henderson’s Wharf Inn!","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Charity Goyette","date":"2014-02-01 20:18:33 +0300"}],"public_likes":["Mozell Lesch","Major Oga","Ocie Nitzsche","Kaya Rau","Joel Waters","Ivy Nader","Ariane Marquardt","Alyson Jast"],"vacancy":false,"description":"As it is on the North Pier, rooms on three sides have sea views, some rooms at the back can be noisy from the pubs below.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}