{"title":"San Francisco/Civic Center-Tenderloin","name":"Hotel Metropolis","address":"25 Mason St","directions":"between Eddy St and Turk St","phone":"+1 415 775-4600","tollfree":null,"email":"Reservations@PersonalityHotels.com","fax":null,"url":"http://www.hotelmetropolis.com/","checkin":"3PM","checkout":"noon","price":"$99-$299","geo":{"lat":37.7836,"lon":-122.4094,"accuracy":"ROOFTOP"},"type":"hotel","id":25596,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We are \"semi-locals\" who live two hours from San Francisco and come into the city 8 or 10 weekends a year, for plays The Chancellor was not new to us, but we had not stayed there for several years, partly because we only stay for one night on the weekend, and partly because I use a consolidator kind of thing to find the hotels with the best parking deals. We had a midweek matinee and a good parking deal at the Chancellor, so we decided to go back, which I had hoped to do anyway because of all of the wonderful recent reviews and I wanted to see the room refurbishing. We decided to make it a two night stay. There are two main things which impressed me, especially as compared to the myriad hotels in San Francisco that we have visited over the years. The first is the staff. I swear that the general manager, WesTyler, must have trained this staff in customer relations. Or else they are just genuinely great people...they don't ACT trained, it seems genuine. The front desk clerks are smart, efficient, friendly, and alert. The bellboys keep track of when your room is ready if you arrive early and efficiently keep track of various people's luggage. both checking in and checking out. The woman at the Tour Desk (which we did not use) is available for questions and help...she is probably the equivalent of a 'concierge' in a larger hotel. (She will also laugh with you when you come in from the rain soaking wet.) The staff in the restaurant is not only efficient and attentive, but cheery and fun. They really seem to enjoy what they are doing and always wish you a good day when you leave. If you run into a member of the housekeeping staff in the hallway as you are entering or leaving your room, you can always count on a greeting with a smile, ...\"good morning\"...for example. The refurbished rooms are delightful, with a classy decor, beds and linens and comforters you wish you could take home with you. SO....this is an older hotel, brought up to boutique/charming style. Don't expect 300 square foot rooms, air conditioning, huge modern bathrooms. You may find a welcome walk-in closet. You will not have air-conditioning, but you will have a window which opens and a ceiling fan to circulate the air. Actually, you will need not to worry about A/C at all in SF. You will need to worry about heat, if you are in your room during the day on cold days. The hotel has an efficient way of turning on the heat at about 5 o'clock in the evening and turning it off later in the morning, but if you are in your room during the day and get cold, look in your walk-in closet you will find a modern electric 120 v \"radiator\" which you can trot out to warm your toes. It is not really a problem, just a caution for extra cold days if you plan to \"stay in\". OKAY, Wes.....your turn. But please share what I said about your staff with them. They are truly incredible.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Marcos Kassulke","date":"2015-04-11 20:42:46 +0300"},{"content":"Stayed with family (incl 2 teenagers) for 3 nights in December - fantastic location near Union Square, amazing value and super friendly and helpful staff. Special mention to Susan who helped us with last minute city trip and airport transfer. The place has a really charming ambience and lots of character you will not find at other hotels. It was our best hotel experience during our 3 week trip around the US (and we stayed at more expensive and \"prestigious\" hotels in other cities). When we return to SF from Sydney some time in the future we'll be heading straight for the Chancellor. 5 stars.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Melissa Heidenreich","date":"2014-05-03 20:50:34 +0300"},{"content":"I've stayed at the Chancellor 2 or 3 times, and it has become the place I stay when in SFO. The attractions are in order of attactiveness: location, staff attitude, quietness. The location works for most of the Market/business dist area and I stay here for Moscone conferences as well. The place is consistently well staffed by people who notice you and ask if they can help in a proactive fasion. The rooms are a bit small, but that's what you get with an older property. And with an older property you also get more solid and quiet construction. I found most of the fixtures in the room of higher than average quality. Everything worked in my rooms there. There is no exercise equipment there, but I never care in SFO since it's a walkers paradise. While the property itself doesn't have some of the things I usually associate with an excellent rating, the location and value of this hotel combined with the consistent service level propels to this level.","ratings":{"Overall":5.0},"author":"Cleve Grimes","date":"2015-09-22 06:28:14 +0300"},{"content":"The first time I stayed at The Chancellor was in Dec. 1990 when I went Christmas shopping with three friends. We stayed at other hotels in and around Union Square during the past 17 years and they were OK. Living in the Central Valley we are frequent visitors to San Francisco. I came back to The Chancellor by a twist of fate. My mother, aunt and sister from New York wanted to visit San Francisco in September after attending my son's wedding. When we were talking about it, my aunt found a an index card my uncle (now deceased)had typed with information about The Chancellor. It had a hand written note on it that I liked it. On a fluke, we called the phone number on the card and sure enough the reservation clerk at The Chancellor answered in person. Same phone number 17 years later and a real live person!!! No recording!!! We booked a room for my husband and myself and suite for my mom, my aunt and my sister right next to us on the 15th floor. We had a wonderful time! The staff is top notch, so courteous and helpful. We love the extra touches of coffee, tea, cookies, fruit, newspapers 24-hours 7 days a week. Luques Restaurant has delicious food and superb Eggs Benedict ... Yum.... During the Sept. trip I booked a suite for the Dec. 1 and 2, 2007 for myself and my three Christmas shopping friends. This time we got the suite on the 14th floor, which is in the back of the hotel and much quieter. We had a fantastic weekend and really got into the Christmas spirit!!! We did lots of shopping, eating, walking ....and laughing at Beach Blanket Babylon!! My friend wants to go back to SFO in January and already booked another hotel down the street. The desk clerk was rude and snappy — So, I wonder how our stay will be???? I would rather stay at The Chancellor!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Khalid Gutkowski","date":"2014-04-02 14:56:59 +0300"},{"content":"We chose the Chancellor based on other Trip Advisor reviews. It exceeded our expectations for three-star hotels in every way. We've stayed in other hotels in the same Union Square neighborhood before but think this is certainly the best value. We were able to get a \"parking package\" which is critical for this area of San Francisco -- parking rates can be as high as $38 a day. The parking lot was just 1/2 block away which was another nice change from the other neighborhood hotels we've stayed in. The room was a little small, but obviously recently remodeled and even had a view. The bed was wonderful and the bathroom was small but sparkling clean (yes, it had a tub). One caveat: the hotel is on a boiler system, so there's no heat available until late at night. The hotel gave us a portable radiator that kept us warm until the building heat kicked on. The lobby has free coffee, newspapers and cookies. We enjoyed the breakfast at the small restaurant, Lucques. The staff was friendly and helpful. We will definitely stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Jamaal Rogahn","date":"2014-03-03 08:35:42 +0300"}],"public_likes":["Mrs. Anya Collier","Onie Fay","Abagail Lehner"],"vacancy":true,"description":"It's on the eastern outskirts of the Tenderloin, but there can be people sleeping in stairways and panhandling right next to the hotel, so it's authentic enough. Inside it is perfectly clean.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}