{"title":"Birmingham (England)","name":"Ramada Birmingham","address":"160 Wharfside Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.4754,"lon":-1.90599,"accuracy":"ROOFTOP"},"type":"hotel","id":3636,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"I was initially excited when I booked a room at The Palmer House on Priceline for a romantic getaway to Chicago, this this was very short lived. Upon arrival we were greeted by a Valet, who spoke very broken English. He asked if we needed assistance with our luggage to which we answered yes, he proceeded to give us our ticket and said we were all set. We then stepped in to a very impressive lobby (which is all that was impressive in this hotel) and waited in a long line to check in. The front desk clerk acknowledged that we booked through Priceline and assigned us a room, whcih was to have a been a room to accommodate 2 adults. We then entered a very TINY room that consisted of about 120 sq feet and a single bed. We promptly realized that this would not be acceptable accommodations for two people, as guaranteed by priceline, and returned to the front desk. At the desk we were informed that there are no guarantees when booking through Priceline, that we pay less than their other guests, therefore the rooms are assigned to the full paying guests and Priceline customers get the remaining rooms. After some argument we were able to be assigned another room. This room was slightly larger in size and included a \"Queen bed\" a little room to walk around it and a very small bathroom. There was construction outside of our room. The room had peeling wallpaper in multiple areas and was very dated with an old tube television and dated bathroom fixtures. It did not meet my expectation when I think of a \"4-Star\" hotel. The hotel did provide a 15x25 foot pool to accommodate it's over 1,000 rooms. It had a fee to use it's fitness room, a fee to use it's wired internet (as there was no Wi-Fi available)and we were not able to use the concierge due to an extensive line, therefore we chose to fend for ourselves rather than spend hours in line. Our luggage never did make it to our room, we had to contact valet and were escorted through the parking garage to retrieve our luggage ourselves. I would not recommend staying at this hotel to anyone and would not return to it. The time we spent outside of the room was very enjoyable and Rock Of Ages was great! I would recommend checking out Rock of Ages while in Chicago! :)","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":4.0},"author":"Laverna Moen","date":"2014-01-23 07:20:40 +0300"},{"content":"Fabulous hotel, great location. Stayed on business, but if I was travelling on vacation, i would consider staying at this hotel. The facilities were great, the staff helpful and the food was good.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Eudora Waters","date":"2014-03-14 14:43:13 +0300"},{"content":"My wife and I spent two very nice nights in the Palmer House last October 21-22, electing the executive level rooms for the added comfort and convenience. While a bit more pricey than regular rooms, the executive level included a continental breakfast and a happy hour, both with substantial offerings of good , solid foods. In this regard, don't let the title \"continental breakfast\" fool you. It included hot and cold cereals, cold cuts, a broad assortment of rolls, coffee and teas. Alcoholic drinks were available during happy hour at a reasonable price (champagne cocktails for 6 dollars each). The rooms were LARGE, very clean and comfortable. Within walking distance of the Civic Opera House (which we attended both nights) and the Art Museum (be sure to check out the new addition to the museum) and north Michigan Avenue, the Palmer House is an ideal spot from which to launch your sightseeing of the windy city.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Craig Johnson","date":"2014-08-13 03:04:32 +0300"},{"content":"The lobby was wonderful and the staff was very friendly. But...the room was nothing special. The wallpaper was peeling off the walls, the mattress was rock-hard, and the TV was from 1997. And, I had a nice view outside my window of the fire escape. The bathroom was very nice, however, with a nice showerhead and big thick towels, and it was very clean. However, overall the room was a disappointment. The rest of the hotel was very nice, though. I would probably look for a different hotel my next trip to Chicago. I like the location here, but I'm really using the room the most, so when it is a disappointment, I feel like I'm not getting everything I should be getting, especially for the cost of a room here.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Vicente Hauck","date":"2015-01-29 01:57:39 +0300"},{"content":"My wife and I enjoyed a stay at the Palmer House Hilton for a weekend in Chicago. The staff was really nice at checkin. We stopped at the bar a couple of times and the bartender was quite pleasant. It is close to a lot of things one would want to do in Chicago - Michigan Avenue, Skywalk, Art Museum, etc. The hotel is a little dated and the parking situation is not favorable ($38/night) but from what I have read, any place in Chicago costs just as much. Overall was happy with the location and would stay again in the future.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Timothy Kuvalis","date":"2015-01-04 17:18:45 +0300"}],"public_likes":["Autumn Mayer","Mathew Mann Jr.","Maybell Wisoky","Coy Leannon","Bette Gaylord","Nelda O'Connell","Kacey Volkman"],"vacancy":true,"description":"The Ramada is a part of the Mailbox multi-use complex, where you will find multiple restaurants, shopping opportunities and service outlets. The hotel faces a canal, which provides for nice views and ambiance, but the rooms are in dire need of redecoration.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}