{"title":"Marina del Rey","name":"Foghorn Harbor Inn","address":"4140 Via Marina","directions":null,"phone":"+1-310-823-4626","tollfree":"+1-800-423-4940","email":null,"fax":"+1-310-578-1964","url":"http://www.foghornhotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98118,"lon":-118.45955,"accuracy":"APPROXIMATE"},"type":"hotel","id":17595,"country":"United States","city":"Marina del Rey","state":"California","reviews":[{"content":"Just got back March 28th.Overall, everything about the Iberostar is beautiful, clean and very well maintained.The buffet food was very fresh, but I have to say, painfully repetitive and bland at this hotel. I have stayed elsewhere and had better luck with the buffet-style food. If you are a hot dog fan ? try one at the Iberostar, they are surprisingly good. They did have well known brands of liquor, so that made up for the lack-luster meals.There are Howler Monkeys living at this resort. We apparently got a very good room (resort edge side bldg 26, 3rd floor) if you are interested in the monkeys because they used our roof as a path to the inner part of the resort. We got several pictures of them REALLY close to our balcony.This hotel is definitely nicer than the Occidental Allegro or Riu next door and we never had any trouble finding a place to sit on the beach (pool is another story). The beach is gorgeous at this hotel. There is a wait staff that will bring drinks to you on the beach - thought that was great. Tipping is greatly appreciated.I wasn?t a fan of their nightly shows. Many of the skits were bizarre and/or irritating. I did enjoy the ever-present hotel theme song and dance. Mascara (the night club) was a tad odd (they had the staff dress up in Halloween costumes), but played popular music and was open until 3am for the teenagers and night owls. Good that it is away from guest rooms because it is loud.The kids at this resort seemed really happy and the star friends seemed to keep them pretty busy throughout the day. I don?t think it is a great place for toddlers as there are quite a few accident-waiting-to-happen areas for someone so small ? especially around the pool and in the jungle. But I didn?t have any kids with me, so take that for what it?s worth. There is soft serve ice cream by the pool - a real crowd pleaser - kids were eating 4 or 5 cones a day!We didn't hang out in the pools too much during the day, besides the lack of available loungers (people do that ?saving chairs for later? thing here), the only ladies room that I could find near the pool only had 4 stalls and often had quite a pile up of women waiting. They kept it clean ? but I hope you don?t mind guys with mops in the bathroom while you are using it - happened more than once.One thing about this resort - when the sun started to go down, the pool and beach became deserted. I mean ghost town. This was a great time to go to the pool or beach and have it basically to yourself. Keep your beach towel close - they want $10 to replace it.If you have a late flight on your departure date, for $10 per hour, you can keep your room after the regular check out time of noon (based on availability). They also have a nice hospitality room that you can use after check out and will let you keep your towel cards and all-inclusive bracelets until you depart.I would stay at the Iberostar again, but I go to Playa 2 times a year and will probably check out another place next time. Have a blast!","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Lenny Denesik","date":"2014-04-03 08:44:16 +0300"},{"content":"Just returned from the Quetzal after staying the week of Dec 27th thru Jan. 3rd. There were 20 of us in our family that travelled together and I have to say that our accomodations were great. I had requested ahead of time that we be assigned to the same bungalow and as close to the pool and beach as possible and my request was fulfilled. We stayed in building #22 which was a perfect location for us - we are big time beachers so being close to the lobby was not a priority. The reviews on Quetzal our mixed and mine are as well. The positives of the resort include the service, accomodations, activities for the kids, the Star Friends and all other staff members. The negatives include the beach - although it's a beautiful beach, it is not maintained well - it is littered with cigarette butts and there are vendors that walk up and down the beach all day trying to sell their goods. Depending on the trade winds, the fumes from the motor boats and jet skiis can become quite strong when you're on the beach. The ocean water, however, was warm and very refreshing. Pool water was colder than the ocean. Alcohol choices are limited - no top shelf alcohol available and the wine is low quality as well. The food in the buffet and the specialty restaurants is average and repetitive. My family has stayed at the Iberostar Bavaro in the Dominican Republic and we were expecting the Quetzal to be along the same quality which was a bit disappointing. Despite the negatives, we had an awesome vacation. We had a blast on New Year's Eve - plenty to do that night for young and old alike. Lots of day excursions to pick from - Tulum was awesome; an absolutely breathtaking view and it's worth going with a guide to hear the history of the Mayans and their culture. Xel-Ha was a beautiful place but horribly crowded. We were there in the early afternoon and had to wait hours to get snorkel equipment - they had no masks to give us. Bring your own equipment and save yourself the hassel - snorkeling in the caves in and the park itself was wonderful but don't expect to see a lot of tropical fish - we did see a school of yellow fin tuna that was it. There was also jet skiis, ATV riding with snorkeling in cenotes, horseback riding in Cancun on the beach and parasailing to fill our days. 5th Avenue is a stop you have to make but make sure you go to the mall - it's easy to loose your way and end up on the side streets where the quality of merchandise is less and the prices seem to be a bit higher. Suggestions if you're going to Playa del Carmen - go to the ruins - Tulum is only 40 minutes away and worth the trip. 5th Avenue is great for shopping and picking up those souvenirs you'll be searching for, get comfortable with your vacation representative and the staff at the reception desk - they are full of relative information. Xel-Ha and Xcaret are filled with activities but expect to spend a full day at either one in order to make it worth your money and time. Relax and enjoy yourself! All in all, we had a wonderful vacation and are already making plans for next year. We won't return to Quetzal because there are far too many other places to visit in the world.","ratings":{"Overall":4.0},"author":"Kelsie Lang","date":"2013-08-29 08:30:33 +0300"},{"content":"You could do alot better at the Barceló Maya! My family and I do alot of traveling and have visited many places. I have been a Travel Agent for over 15 years and my family and I have very high standards so I think we are a good judge of things. We just got back from a stay at the Iberostar Quetzal/Tucan, we were very unhappy the food was Horrible, the same at every meal every day! unless you tried one of the specialty restaurants which your only allowed to eat at one or two times during your visit and their not that great! The rooms were dirty and the maids were not great, the beach was very dirty, garbage everywhere and all you could see was sun chair. The jungle on the property was very nice. But the Barceló Maya was by far a much better place to stay, the food their is suburb! and you felt you were the only people their because the property was so open and the beach so spread out and had so many mature palm trees. Save some money and go to the Barceló Maya and if you want some wild life go visit Xcaret.","ratings":{"Overall":2.0},"author":"Karli Rau Sr.","date":"2015-03-12 04:19:37 +0300"},{"content":"Stayed at this Hilton for 2 nights. It was like most Hilton Garden Inns. It was nice, people were pleasant (very), cheap good breakfast ($10), small but nice workout facilities and pool, good rooms/bathrooms. Most of all, we appreciated the free shuttle to a mall, plenty of restaurants, Ikea, etc.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Everette Kihn","date":"2014-11-04 15:39:01 +0300"},{"content":"Stayed one night on long drive home after attending a conference in DC. Last minute reservation made by my staff, in a place the name of which I dimly remembered seeing on the Interstate in many years of driving south from New England. Arrived late in evening but what a pleasant surprise, especially after having driven for miles through some areas that made us a little nervous (due to my errant GPS). It was a very nice looking Hilton Gardens (which I've stayed at many times before) but was definitely \"nicer\" than any so far. Staff was excellent, the check-in smooth. We were very tired after working hard for two days actually running a conference in DC, so it was a pleasant surprise to find ourselves in a very large room with desk, large bath, and very, very comfortable beds. Internet was fast and free, and the room came with two comfortable \"living room\" chairs. Enjoyed a good breakfast with made-to-order omelets by a perky chef and a very pleasant and helpful waitress. In the day we could see how nice the area was and we spent some time in a well stocked bookstore in the shopping malls there. Easy access to I-95 we now discovered. (my GPS definitely needs remedial lessons). This is about 10 minutes outside Baltimore and so lots to do. We visited Fort McHenry for the first time, but that's another story.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mr. Mabelle Bruen","date":"2015-05-11 14:15:33 +0300"},{"content":"Were were going to Towson Md for a church service, so we opted to stay outside of the city in White Marsh. We were so impressed with the Hilton Garden Inn. The lobby is beautiful. The check in was easy and the personnel were very friendly. The room was gorgeous! Plenty of room with comfy beds, fresh linens, wonderful decor. It was very comfortable. We did not hear a sound while we were there, and this was on a weekend at that. The pool was small, but we did not swim anyway. I enjoyed the excercise room and I could have went to the Bally fitness center that was just behind the hotel if I wanted to, but I was ok with the equipment the hotel provided. Also, for ten dollars you can eat in their restaurant, which I recommend. The food is made to order; pancakes, omelettes, bacon, sausage, biscuits, fresh fruit, even fruit filled pancakes. My teenagers loved it. We will stay here everytime we return to Baltimore.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Chyna Nolan","date":"2015-11-10 01:28:37 +0300"},{"content":"Just stayed at the Hotel Monaco in Seattle for three evenings. They are undergoing a renovation and the newly renovated room that I had was fresh, had good amenities e.g., each side of the bed had a plug for me to plug in my computer! Colors are really nice. Workout room is nice as well. What makes this hotel so great is their staff. Top notch and makes everybody who walks through the door feel welcomed. Just amazing. The location of this hotel is excellent as well - walkable to everything. The link from the airport stops 2 blocks away from the hotel and is an excellent alternative to cabs and super shuttle. I highly recommend this property. Every time I stay here I just fall \"in like\" again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Efrain Bailey","date":"2012-12-03 22:09:55 +0300"},{"content":"My husband stayed here on business quite some time ago, and everything was excellent. This time, we were not as impressed. The service was still excellent. And they have complimentary wine in the lobby for an hour each evening. That was nice! And the location is great -- walking distance to Pike's Market and lots of shopping. One of the first things I noticed when we got to our room was that the upholstered chair next to the bed was in tatters. No kidding. In at least four places it was not just threadbare, but literally torn down to the stuffing. For a hotel of this quality, this is completely unacceptable. Perhaps one of their doggie-guests been chewing on the chair. That's another thing. We didn't realize it was a pet-friendly hotel. I don't know if that's a new thing, but my husband never saw any pets there the first time around. Maybe because it was during the week, and this time we were there on a weekend. I'm fond enough of dogs, but I don't really want them staying in the hotel rooms that I stay in. However, it's my fault for not noticing the pet-friendly tags on their website beforehand. The dogs were well-behaved overall. There were several in the lobby off and on, and we heard barking twice from our room. Lastly, the weekend rate in February was a great deal, we thought. But that was before we added in the cost to valet park. It's posted $36 a night, but with taxes it was about $44/night. So be sure to figure that when you're looking at room rates.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":5.0},"author":"Gavin Becker","date":"2015-07-14 17:33:04 +0300"},{"content":"Good, not great. Hotel has a circus-like feel. Can walk to lots of restaurants, attractions, and coffee shops! The staff is helpful and friendly. The gym is really small - only has one treadmill. The afternoon wine hour is a nice touch.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Samara Bernhard","date":"2012-10-16 06:26:19 +0300"}],"public_likes":["Ernestina Balistreri"],"vacancy":false,"description":"Nestled among breezy palms, the charming inn is situated along quiet, colorful Marina Beach. Each of the quaintly-appointed rooms offers a private patio or balcony, so you can sit back and enjoy the lovely views of the sand and scenic harbor.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}