{"title":"Yosemite National Park","name":"Wawona","address":null,"directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_WawonaHotel.aspx","checkin":null,"checkout":null,"price":"Rooms rates are $225 for a room with a private bath, and $151 without.  Rates are slightly lower in the winter","geo":{"lat":37.536389,"lon":-119.653611,"accuracy":"APPROXIMATE"},"type":"hotel","id":33887,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"Exceeded my expectations Stayed at Barcelo Bavaro Beach for a short mini-vacation April 2-5. Was registered for the Caribe hotel, but with run of the house status (meaning you can be placed in any of the hotels, depending on availability), and upon arrival was shuttled to the adjacent Beach hotel. I'd read the reviews--good and bad--and frankly was very apprehensive about coming to Punta Cana, but the Barcelo Bavaro Beach exceeded my expectations. I had a blast!I'd read the about the unfriendliness of the people (particularly toward Americans), but that was not my experience. Nor, to my relief, did I find language to be a barrier. Many of the staff are multilingual, and most that I encountered speak English. For my part, I made every attempt to communicate in Spanish (and my Spanish is very basic). A smile and knowledge (and use) of just a few simple Spanish phrases--the standard greetings Buenos dias and Hola and courtesies such as Por favor and Gracias--will get you by, no problemo.I'd worried about getting sick and had the full series of inoculations (hep AB, diptheria/tetanus, typhoid) as a precaution, but I didn't get sick, and I ate just about everything that was offered, including salads and drinks with ice.Had really wanted to go on the Saona Island excursion, but missed it (most excursions are available on only certain days of the week), so I took the Marinarium tour--basically a 4-hour booze cruise on a large catamaran that takes you snorkeling and swimming with the sharks and rays--and it was great! I'd do it again in a heartbeat.So, if this is your first trip to Punta Cana (as it was mine), leave your worries behind, go with a positive attitude and an open mind, and enjoy your vacation. I certainly enjoyed mine and hope to return to Punta Cana and to Barcelo Bavaro Beach.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Jay Stanton","date":"2013-08-06 09:16:50 +0300"}],"public_likes":["Jade Mohr","Thurman Dare","Troy Runolfsdottir III","Gust Klein","Ara Mraz"],"vacancy":true,"description":"This historic lodge overlooks Wawona Meadow in the south part of the park along Route 41. Of the 104 rooms only 50 have a private bath.  The lodge is rustic, with no telephones or televisions. In the winter months the lodge is only open on select weekends and holiday periods.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}