{"title":"Santa Monica","name":"Wyndam Santa Monica","address":"120 Colorado Ave","directions":null,"phone":"+1 310 451-0676","tollfree":"+1-800-947-9175","email":null,"fax":"+1 310 393-7145","url":"http://www.wyndham.com/Santa-Monica","checkin":null,"checkout":null,"price":"$180-280","geo":{"lat":34.01155,"lon":-118.4945,"accuracy":"APPROXIMATE"},"type":"hotel","id":26491,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"Travelling as a family of 3, with a young teenage son is never easy. This hotel appealed as it is one of the few hotels which allows a group of this size to book a single room rathe rthan the expense of two rooms. We booked what was advertised as a junior suite: \"spacious Junior Suites\" The main room contained a double bed, and in a separate \"living\" area, without intervening doors, a single armchair which expanded into a single bed. In this position it filled the remaining space providing just enough space to walk to the bathroom , or round to the window onto the balcony. The bathroom although well furnished had a sliding frosted glass door ensuring that there was at best limited privacy for anyone using the bathroom if anyone was in the adjoining\"living\" area. I did not make use of any of the other facilities in the hotel. there is a bar / lounge area on the first floor serving plastic wrapped sandwiches and \"nespresso coffee\" at extortionate rates. In the street next to the hotel there is an \"El Fornet\" cafe which provides an excellent coffee and danish type breakfast at a fraction of the price. Whereas the hotel breakfast was 15 euro each. the cafe provided breakfast for 3 each morning for less than 14 euro total","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":3.0,"Value":2.0},"author":"Rowena Reynolds","date":"2015-03-29 17:37:03 +0300"},{"content":"We chose this hotel as we wanted to be away from the main tourist area (mainly Las Ramblas) in order to get a good night's sleep. Contrary to other reviews on here we found our room to be lovely and quiet and dark. Its location on Av. Diagonal is perfect if you like walking (although I believe there are buses from outside). We happily walked to the seafront, La Sagrada Familia and Nou Camp all from the hotel. After a hard day's walking around the city, it was really nice to come back to a quality air-conditioned room. The hotel is situated in the more upmarket area of the city, where there are plenty of nice bars and restaurants and a handy bakery for breakfast on the go just around the corner! The staff were friendly and helpful and the free Internet access in reception was a useful service. Despite a slight mix-up with our airport transfer on arrival (for which the staff were apologetic; I would suggest confirming with the hotel a few days in advance of your stay), I cannot fault this hotel and would recommend it to anyone visiting Barcelona.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Victor Cremin","date":"2013-02-23 15:49:00 +0300"},{"content":"I stayed here for 6 nights over New year. The location isn't perfect but its a ten minute walk away from Diagonal metro station and the metro system is brilliant so you can go anywhere from there. Also a taxi from Las Ramblas was only around 7/8 Euro. The rooms are small but very nicely decorated. The shower was really powerful & roomy. Staff were very helpful & the mini fridge in the room is handy, there is a supermarket around the corner & its worth stocking up on snacks and drinks rather than paying minibar prices. The TV has no English speaking stations other than CNN & another news station and pay per view movies are not available so not much entertainment if you decide to have a night off from the bars & clubs. The internal noise in the hotel was really bad, and there were doors slamming all night long, we could also hear every movment of the people in the room above us. Had to buy earplugs in the local chemist to get some sleep. Overall though, a good hotel for the price.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":3.0},"author":"Filomena Hirthe","date":"2013-04-29 05:39:00 +0300"},{"content":"Stayed at Wilson Boutique 3 nights before our cruise. Good location on Avenida Diagonal. Had a room on seventh floor, facing the street and never heard the traffic. This hotel was remodeled in 2008 and it is very,very nice. Would stay here again. Mauser","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Elinore Rowe","date":"2012-02-02 18:03:39 +0300"},{"content":"Beautiful room with excellent views. Ten minute walk to metro but a walk down Rambla worth the shoe leather. Would go back. No coffee and tea making in room if I was being picky.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Nickolas Grady","date":"2015-06-20 01:00:01 +0300"},{"content":"I stayed in this hotel earlier this year as part of a company trip and I was really surprised! The rooms were clean, super cute, and the location was fantastic for seeing Barcelona! Also, the staff was very nice....I came away from the experience thinking that I would even book it for myself if I went to Barcelona on vacation. For a 3 star it was definitely impressive!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Bobby Donnelly","date":"2015-07-03 23:39:21 +0300"},{"content":"Contemporary chic hotel-room compact but stunning. Shower to die for and lovely balcony to sip wine at night and coffee in the mornings! Berlin Cafe outside hotel great for snacks and very friendly staff. Would highly recommend-nothing is too much trouble-service 1st class.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":4.0},"author":"Adele Rau","date":"2014-09-27 02:59:03 +0300"},{"content":"I'm more than a little reluctant to review this hotel, just in case everyone discovers it. Hidden downtown within easy walk of Staples Center and theaters, this understated hotel is fantastic. Huge rooms and suites, full access to the sporting facilities, and free breakfast (unusual in US) and internet. The Athletic club itself is a huge fitness facility with everything you could ask for x 10, The locker room attendant seemed a little daunting at first but turned out to be super helpful, as we're the front desk staff at all times. There is no valet parking, but there is a covered multistorey car park next door with easy access to the hotel, and it's cheap with validation. The only downside of this stay was the closure of the swimming pool for maintenance and renovation without any notice to either my travel agent or myself when I booked. It had been a major reason for the stay, (along with the location near The Orpheum Theater) so that was disappointing. However pool overhaul should be completed by now and it is huge. Everything else was so good this aberration was soon overlooked and forgiven. Not the glamour of Hollywood, and a little rough on the streets after dark, but none of this matters if you need a discreet bolt hole downtown. Great bar half a block west too, Seven Grand.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Fernando Turner","date":"2012-01-01 22:29:56 +0300"}],"public_likes":["Watson Adams","Daron Rosenbaum III"],"vacancy":true,"description":"Hotel is quaint, comfortable and some rooms have a partial ocean view.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}