{"title":"San Diego/Downtown","name":"ITH Adventure Hostel","address":"1658 Front St","directions":null,"phone":"+1 619 228-9234","tollfree":null,"email":null,"fax":null,"url":"http://ithhostels.com","checkin":null,"checkout":null,"price":"Dorm beds start around $20","geo":{"lat":32.7227,"lon":-117.1649,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25154,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"The street layout made it difficult to get from the bellman on one side to the parking garage on the other. Once there, the staff was accommodating to a few special needs (a refrigerator without all the minibar stuff). The halls smelled like stale beer, probably spilled from the free happy hour. Breakfast is edible, but not great. Happy hour drinks are a lot stronger if you tip just a few dollars. The room was plain, but clean and workable. One of the large lights illuminating the top of the building shone directly into my room, but the blackout curtains (once gently rearranged) worked well. The concierge was simply fantastic. I did not get his name, but he's the only bald guy. He did not lead me astray for directions, eats, or things to do.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Ashlynn Breitenberg V","date":"2013-01-10 01:40:16 +0300"},{"content":"My recent stay at Embassy Suites was a delight. The staff is friendly and lively. A hot breakfast buffet is included with the price and also free drinks in the evening.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"King Bartell","date":"2014-02-12 00:10:45 +0300"},{"content":"We've stayed at many Embassy Suites, and this one was the worst. The concierge desk was helpful in suggesting local attractions for families and the location was okay. The furniture was torn, the pillows flat, and the view non-existent. It was okay, but won't stay there again.","ratings":{"Overall":2.0},"author":"Brandon Bruen","date":"2013-01-25 07:56:36 +0300"},{"content":"We reserved the Embassy Suites for the first weekend of Jazz Fest. We used an opaque third party booking agency so I wasn't sure which hotel we were getting until it was already reserved. I was a bit concerned after reading some of the reviews about this hotel but wanted to say that we really enjoyed staying there. The location for us was nice. It was close enough to walk pretty much anywhere we wanted to go and just a few blocks from the riverfront streetcar line. It's a little away from Bourbon Street but we still felt safe walking back to our hotel at night. The location is quieter than the hotels I have stayed at in the French Quarter on previous trips. The hotel has a hot breakfast buffet every morning included in the price of your stay. Even though it was a busy weekend in New Orleans we never had to wait long to get through the line, even when we ordered omelettes. Our room was very clean. Although there were some signs of wear, there was nothing in our room that was torn or broken. The staff was very friendly and helpful, and checking in and out went smoothly. We arrived at about 6 pm on a Friday and left around 8:30 the following Monday. There are two charges that I would like to let other travelers know about - we had our car and parking is $30.00 per night. They also charge $14.95 per day for high speed internet access but have a business center where you can use the internet for free. Both times we went to use the business center there was a computer available for us to use. We found our stay at the Embassy Suites to be very pleasant and relaxing during our busy weekend in New Orleans and would definitely stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Casey Kilback","date":"2015-03-03 23:41:55 +0300"}],"public_likes":["Garett Ritchie","Toni Towne Jr.","Tyson Renner Jr.","Jerod Kovacek"],"vacancy":false,"description":"A friendly and cozy hostel that offers free breakfast and free dinner daily. Also they provide free adventure activities that guests can go on to enjoy San Diego.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}