{"title":"Chippenham","name":"New Road Guest House (B&B)","address":"31 New Road, Chippenham, SN15 1HP","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi. At the roundabout, take the 1st exit continuing straight onto ''Malmesbury Road(B4158)'' 0.2 mi. Turn right onto ''Hardenhuish Lane(B4528)'' after 0.8 mi. At the roundabout, take the 1st exit left onto ''Bristol Road(A420)'', continue to follow ''A420'', go through 1 roundabout bear left into ''Park Lane'' (joining one way system). Get into right lane, after 0.8 mi turn right into ''St. Paul Street''. Guest House car park will be on the left after 68 ft. (Should you miss the turn for ''St Paul Street'', stay in right hand lane all the way, follow one way system onto the ''New Road'' for 0.1 mi. At lights follow road around to the right [follow sign for ''M4''] staying on ''New Road(A420)'', after 79 ft joining ''Marshfield Road(A420)'' for 0.2 mi [signposted ''Lyneham''], turning sharp right back onto ''Park Lane'')","phone":"+44 1249 657259","tollfree":null,"email":"mail@newroadguesthouse.co.uk","fax":null,"url":"http://www.newroadguesthouse.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4631469,"lon":-2.1179849,"accuracy":"ROOFTOP"},"type":"hotel","id":5843,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"Best Bathrooms  I stayed in the double room for a few nights in September, 2008. The bathroom was the best I've seen outside Tokyo and Seoul. Beyond the large area for the sink and toilet, the shower was in another alcove behind a glass door. There were multiple showers (2 shower heads on opposite walls and 3 body sprays near one of them), there was a tile bench along one wall that you could sit on while you took a shower if you chose the removable showerhead opposite the one with 3 body sprays. The bathroom was almost as large as the bedroom. The beds were also extremely comfortable. Service was immediate and friendly. The bath products were from Lather, and they smelled wonderful. I go to an annual convention in San Fran, and this is the first time I've stayed almost my entire time in the hotel- I took a couple long showers daily and read in bed all day. Although I stay at different hotels every year, I will book at the Kabuki from now on. This room was so nice that I'll book better rooms in the future. This is not like any of the other 4 star hotels. If you care about the 2 things top on my list for a hotel- the bathroom and the bed, you won't go wrong at the Kabuki.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Eva Trantow","date":"2015-01-04 13:26:13 +0300"},{"content":"Better place to spend money We stayed there three days ago for one night and vowed we will never go back.We were looking forward to staying there and we chose this place to spend our last night of our trip in San Francisco.The welcome tea ceremony that was promised never took place. The room was smelly and when I went to wash my face I saw the finger nail on the basin. Yuk.The Internet connection was bad. Took 10 mins to open a webpage. You need to connect and reconnect repeatedly.Then next morning when we went to have breakfast in the hotel's restaurant it took more than 10 mins for someone to take the order. Had I not voiced out my displeasure it might take more than 20 mins. I saw a family whose father also lost patience becasue of the same issue.There are many better places in San Francisco to stay, definitely not this one. We so regreted of making such decision and decided to pst this message so other people will not have to go through what we experienced.","ratings":{"Service":1.0,"Business service":1.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":3.0,"Rooms":1.0,"Location":3.0},"author":"Emil Grady","date":"2015-12-22 17:23:28 +0300"},{"content":"A really nice alternative. We had a week in San Francisco for a convention and decided to take our two kids. That meant looking for a suite, so that we could put the kids to bed in one room and still stay up and watch TV and visit with friends in the other. The Kabuki had a variety of reasonably-priced suites that fit the bill, for just a bit more than a regular double room at the big-name convention hotel. (Note: the Kabuki's 'East-West' suite, with one Western bedroom and one Japanese tatami room, does not adequately isolate one room's sound from the other.) The 'Junior Suite' was great for our purposes. The kids had the big bed in their room while we had a foldaway futon in ours.The hotel is newly remodeled (it was the Miyako when I lived out there), and very comfortable. The staff seemed to be changing constantly, so it was hard to find a regular, 'go-to' person; however, everyone was professional and pleasant enough.Japantown is a nice part of the city, with plenty of (mostly Asian) dining options very close to the hotel. We found we could walk pretty much everywhere we wanted to go (we made the obligatory tourist trek up over Hyde Street to Fisherman's Wharf and even walked to the Tea Garden in Golden Gate Park). When we needed cabs, they were easy to find.The only drawbacks I can think of were the lack of any sort of bathrobes in the room -- a bit odd for a Japanese-style hotel -- and the rather slow wireless Internet. Also, refrigerators in the suites would be nice (NOT just for the idiotic mini-bar -- does anyone actually buy that overpriced $@!#%?) However, all in all, we would gladly go back, and we were very glad we opted for the Kabuki over the mega-chain conference hotel.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Rahsaan Rau","date":"2012-10-26 10:50:58 +0300"},{"content":"Terrific Time! My husband and I celebrated our 24th anniversary at Hotel Kabuki, and we had an amazing time! We arrived in the pouring rain and were pleasantly greeted with sake and wine tasting before we even got to the front desk to check-in. When we checked in with Michael at the front desk, he upgraded our room when he found out we were celebrating our anniversary. Tomo refilled our glasses with sake and invited us to take our glasses with us to our room. Later that evening, Michael delivered more of the yummy sake and some delightful, tasty snacks as a nice anniversary treat. I jumped in for an enjoyable soak in the wonderful tub--the sake was a great complement to the bath! Then we enjoyed the lights of San Francisco in our corner room. The room was nicely furnished, and the Lather bath products were a nice touch. In the morn, we awoke to a beautiful sunrise sneaking over the buildings on the horizon. We had the weekend planned and took Michael up on his offer to help us with anything we needed--we wanted to take a bottle of the yummy sake home with us. Michael got us a bottle. We would highly recommend Hotel Kabuki. The price was right, the room was great, and the staff was awesome. Parking was good for a large city: we parked in the underground lot next to the hotel--very easy access and out of the continuous rain. We didn't spend near enough time in the hotel. And, we didn't take time to enjoy the Kabuki Spa, which we heard was great. Guess we'll have to plan that on our next visit to SanFrancisco--and we'll definitely stay at Hotel Kabuki!","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Miss Annabel Lind","date":"2015-04-18 19:16:25 +0300"}],"public_likes":["Jeffrey Doyle","Ryan Sporer","Mrs. Reilly Satterfield","Leopold Hickle","Autumn Beatty","Keagan Cartwright","Alan Robel","Karolann Leffler","Wyatt Eichmann"],"vacancy":true,"description":"This friendly, family run B&B in the heart of Chippenham has ten bedrooms, five in the Main House and five in the Coach House in the garden, with a mixture of singles, doubles, twins and family rooms, all of which have Freeview TV and a hospitality tray","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}