{"title":"Inveraray","name":"Loch Fyne Hotel","address":"Inveraray, Argyll, PA32 8XT","directions":null,"phone":"+44 870 950 6270","tollfree":null,"email":"lochfyne@crerarhotels.com","fax":null,"url":"http://www.crerarhotels.com/ourhotels/loch_fyne_hotel","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.2248,"lon":-5.0782,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12228,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"Book thru our holiday planner and hesitated. What a surprised, it's beyond our expectation . Good service and warmth welcome from the man in white. Check-in fast and though room small, the view was nice. Design modern and sleek . Hope to be back again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Raphael Kautzer","date":"2013-12-03 17:49:20 +0300"},{"content":"Booked a weekend stay with my partner and totally enjoy the hotel facilities. Very close to clarke quay and nice pool. Service excellent. Will book again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Winnifred Ebert","date":"2012-03-22 05:53:18 +0300"},{"content":"Stayed in this hotel due to long weekend hotel. The first impression was clean, cozy and comfortable feel though the lobby was small. The reception staff upon check-in was attentive and courteous.. plus point for Spore hotel.. the room though small.. clean, well maintained and simple designed.. The weekend seafood buffet at the lobby restaurant was worth to try. The spread was limited but the food quality and freshness of the seafood from oysters, cold crabs and mussels are yummy.. Service and attentive of staff was good. The swimming pool is just stunning, though the weather did not permit us to stay longer. The hotel is located within walking distance to the happening clarke quay...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaunita Collier","date":"2015-02-04 04:49:57 +0300"},{"content":"Not much to add to the generally favourable opinion. Great location on the Singapore River - close enough to Clarke Quay without the noise and traffic. Modern room at a reasonable price with a view down the river. Only drawback was a very small wardrobe, but we weren't staying long. Efficient, friendly, helpful staff. We didn't eat in but used the supermarket, cafes and Italian restauarant in the mall across the road. The hop-on sightseeing bus stopped just round the corner. Altogether a lucky choice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Lenora Mills","date":"2013-09-18 04:31:50 +0300"},{"content":"Comfortable room, booked four nights via Qantas Holidays from 18/11/10. Apparently refurbished 12 months ago - staff only too pleased to assist.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mattie Olson","date":"2015-12-22 02:50:47 +0300"},{"content":"The hotel seems to be rather new and is conviniently located opposite of UE Square very near to Clarke Quay, Singapore's nightlife hotspot. The rooms are clean and functional but a bit small though. If you travel with much luggage it can become difficult to find enough space for it. The choice of food at the breakfast buffet is is good, same for the taste. Pool is rather big and at the time we were there only sparesly populated.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Tad Donnelly","date":"2012-07-07 19:34:46 +0300"}],"public_likes":["Sophia Cremin","Marcia Koss"],"vacancy":false,"description":"The hotel offers restaurant, leisure and spa facilities.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}