{"title":"Tamworth (England)","name":"Ramada Tamworth","address":"Junction 11 M42","directions":null,"phone":"+44   1530 279500","tollfree":null,"email":null,"fax":null,"url":"http://www.ramada-tamworth.com/","checkin":"15:00","checkout":"12:00","price":null,"geo":{"lat":52.524577,"lon":-1.728973,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":29560,"country":"United Kingdom","city":"Warwickshire","state":null,"reviews":[{"content":"I want to commend Hotel Le Marais on their hospitality, competence, reliability, efficiency and attentiveness regarding our hotel stay. From the beginning of our booking process earlier this year to the final checkout I have been very pleased with all stages and personnel. Shawn was excellent booking my room and giving me the room I requested. He was always cheerful and anxious to help The next day after we checked in, we overslept for breakfast and we came down to the front desk and explained that we have missed breakfast this morning and asked to the young lady who was working if we could get some fruit and yogurt. As fast as she could she ran to the kitchen and brought us oranges, apples, yogurt and amazingly she also included muffins, sausage patties with English muffins, milk and orange juice. Seriously…this is SERVICE!!! The type of service you don’t find everywhere. She went above and beyond our expectations and if I remembered correctly her name was Daphneey. The room was clean and nice, with everything you could possibly need. The bar was awesome with candles lighting up in every table. Shawn and Alex at the bar were amazing. The heated outdoor pool was relaxing. My wife and I were really impressed with the overall appearance of the hotel, the staff and especially the comfort of the beds. Thank you Hotel Le Marais, your immediate staff, the front desk staff, to the housekeeping department—each person made my wife and I feel welcomed, cared about and treated like a friend. We will definitely comeback again and again!!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lera Stoltenberg I","date":"2015-07-27 21:51:40 +0300"},{"content":"This hotel is newly renovated. It looks great today. They cut corners in renovation, for example, they didn't replace the elevator which is painfully slow. They used cheap doors and you can hear right through them. While waiting for an elevator we could clearly hear a shower in one room and a whoopie session in another. The complimentary breakfast is lame. A few boxes of cereal and bagels laid out in the bar, not a service person to be seen. That said, the bed was great, free wifi is appreciated,location is great and quiet. The rooms are pretty, small but nice.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Isai Johns","date":"2015-12-01 22:27:49 +0300"},{"content":"I recently had the pleasure of staying at the newest French Quarter property, Hotel Le Marais. While still undergoing the final touches of a massive renovation, this is a beautiful little gem right off of Bourbon Street. Upon arriving, parking can be a little tricky, as with all of the boutique hotels in the quarter. But valet was great. Lobby was small but very efficient, with the hotel lounge overlooking a stunningly beautiful courtyard, complete with a small pool. The rooms were very nice and stylish,. The beds were incredibly comfortable. LOVED the step in shower. Although no tub, the shower was great! And, even though you are less than a block off of Bourbon street, I couldn't hear any of the noise. This property is a real asset to the French Quarter and I would highly recommend it whether your going to the city for business or pleasure. Can't wait to stay again!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Athena Feil","date":"2012-12-15 15:34:51 +0300"},{"content":"I would highly recommend this hotel. The room was great, very modern, comfortable bed, and very nice and clean room and bathroom. The restaurant and bar are amazing. They have a few tables with beer taps at the table very cool. The bar is very modern and well stocked, if Abby is your bartender then your in for a treat, she is the best. Great staff and service. I stayed with my uncle and his friend booked the room and he did not know I was coming so when we asked for a room with two beds they had nothing available so they took some $$ of our bill and gave us two money vouchers towards the bar or restaurant. Great location a few blocks from bourbon street so you don't get all the noisy rift raft at night, and walking distance to Jackson square and the Frenchman. If Acme has a line 30 deep which it usually does go across the street to Felix's its better and is where the locals go, huge fresh oysters the best I have ever had. Enjoy the devils play ground I did.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Georgianna Nitzsche","date":"2012-12-19 11:32:48 +0300"},{"content":"Recently stayed there for a night. It was my first trip to New Orleans, and the staff (especially Helbert) had great recommendations for food and entertainment. They were incredibly nice. Parking was cheapish and on-site, so I just drove right up to the hotel and valet-parked. The room was what you'd expect from a W: stylish, comfortable bed, nice bathroom. There is some construction going on at the hotel, which is sort of annoying, but it was not a problem on my floor. There's a great pool as well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Doyle Trantow","date":"2013-12-10 19:44:20 +0300"},{"content":"I had a pretty nice stay for three nights at the W under renovation in the French Quarter. Great location, nice staff, service variable, but OK, and I am fussy. Was in a new room. The good news is that unlike most W's there was enough light for my aging eyes. The bad, the new decor is really terrible. Why didnt they keep it simple instead of painting the walls orange with an eyesore of a design as the focal point of the room and the ugliest carpet I have ever seen. Could have been amazing, now certainly comfortable, and the good part is you close your eyes at night and dont have to look up at the scary design above you. I'd stay again, but sorry for the poor designer.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Princess Reichert","date":"2015-11-16 17:19:12 +0300"},{"content":"Love this place. The construction is a pain, but should be wrapped by summer. The staff was so over the top nice and helpful it made up for any jack hammers. Especially ask for Halbert and Daniel. The two guys were super cool and couldn't be more helpful. Southern hospitality at its finest. Ya'll.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Maia Wehner","date":"2013-12-11 19:51:00 +0300"},{"content":"The staff at this hotel was the friendliest and most helpful of any hotel we've ever stayed in. Since there is currently construction going on at this W, it is difficult to give a fair rating. As SPG members we expected a better room. The only available room was small and there wasn't even a comfortable chair in it. But at least it was at the rear of the total away from the construction noise and jackhammers. A stay at this W will probably be better after the construction is completed and, hopefully, the rooms are upgraded a bit. The extremely friendly and accommodating staff and great location in the French Quarter are reason enough for us to return to the W on our next visit (after renovations are completed).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Joannie Effertz MD","date":"2013-10-14 07:08:13 +0300"},{"content":"We just stayed at the W New Orleans French Quarter. We had a very unfortunate experience with our room being located close to construction taking place in the hotel. The staff at the hotel was extremely attentive and did their very best to make things right for us. I can't say enough about the concierge Halbert. Truly a stand-out in service. Recommend verifying up front if construction is still taking place and if so doing what you can to ensure you are not going to be affected by it. Don't expect a fancy W - this hotel is older and going through remodel - but do expect excellent service. Some of the nicest people we met in NOLA - a place where everyone is friendly and nice.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Arlie Leannon","date":"2013-12-16 04:30:34 +0300"}],"public_likes":["Lillian Johns","Desmond Goodwin","Jerald Funk"],"vacancy":false,"description":"Comfortable hotel just outside Tamworth town centre with Reuben's Restaurant & Bar.  Ideal for business guests with free wifi and easy access to motorway network.  Very family friendly with excellent value packages including entry to Drayton Manor & Thomas Land, Conkers, Twycross Zoo and National Space Centre.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}