{"title":"Annan","name":"Hoddom Castle","address":null,"directions":"About 5-miles north on B723 from Annan","phone":"+44 1576 300251","tollfree":null,"email":"enquiries@hoddomcastle.co.uk","fax":null,"url":"http://www.hoddomcastle.co.uk/location/index.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.04435,"lon":-3.32366,"accuracy":"ROOFTOP"},"type":"hotel","id":37341,"country":"United Kingdom","city":"Dumfries and Galloway","state":null,"reviews":[{"content":"My boyfriend and I (we are both 27 years old) stayed at the Iberostar Quetzal March 6-10th and had a very nice time. There were a lot of families and couples in their 40's and 50's, etc. Some \"spring breakers\" arrived shortly after we did, but I think Cancun probably had a lot more. We seemed to be caught in the middle as far as age is concerned, but we didn't mind! I would suggest breaking in your sandals before going if you're not used to wearing them, I developed some blisters. I brushed my arm up against the extremely hot metal grill at the buffet by the pool and burned my arm. (It was my own fault and should have been more careful, but be cautious!) We took the ferry to Cozumel for the Jeep tour. My boyfriend vomitted on the way to Cozumel and I came very close to doing the same (we sat inside the ferry towards the front) We were okay for the trip back to Playa del Carmen b/c we bought Dramamine at a pharmacia, and sat outside in the very back part of the ferry. Get there early so you can get a good seat! I thought parts of the Jeep tour were okay. The snorkeling was fun, and we stopped at a beach to do some swimming and eat lunch. My boyfriend liked it a lot (once he recovered) but you do go on very rough, unpaved roads, so if you are older or have back problems, you should not do this. The rough driving was not for me!! I wore my hair parted down the middle and I burned my scalp. Wear a hat! The hotel itself was very nice and clean. The hotel and Funjet staff were very nice. Just about everyone spoke English! The animals were amazing. There were lots of monkeys, lizards and flamingos which were fun to watch. There are always buffets or restaurants open so you can eat any time of the day that you want to. The nightly shows were lots of fun. The host is amazing, because he speaks in so many different languages. (There were a lot of guests from Europe) We never made it to the discoteca, because we were always exhausted after our adventures during the day, or even from laying on the beach or by the pool. The pool was wonderful, very big and the temperature was perfect. The weather was in the 80's and 90's during our stay and always sunny! Coming home to Chicago (30 degrees) has been rough!! All in all, I would recommend staying at the Quetzal. If I were to go back to Playa, I would probably try a different place, only to have new experiences, not because there was anything wrong with Quetzal.","ratings":{"Overall":4.0},"author":"Carlie O'Connell","date":"2014-06-06 14:58:54 +0300"},{"content":"Just returned from a week at the Quetzal, December 20-27. We are an \"older\" family with 3 young adult offspring -- all of whom loved the beach, the sun, and the atmosphere. The setting is quite spectacular, and they have integrated the natural jungle into the landscape of the hotel --- including all the wildlife. Saw monkeys, peacocks, and many other species. Gorgeous pool, and magnificent beach. We were always able to get beach chairs, but the place wasn't entirely full. On the day we left it seemed to be getting much more crowded, and it was harder to find a spot -- especially at the pool. Enjoyed the free sailing on catamarans and kayaks. Some of us also went snorkeling. Had one visit to the Mayan ruins in Tulum, but other than that we pretty much stayed at the resort -- aside from some strolls into the nearby town of Playa del Carmen , about 3 km away. The most positive attributes are the following: 1 - the staff are friendly, available, helpful, and always smiling. This included everyone from bartenders, to waiters, to maids, to front desk staff. Any request was dealt with promptly and effectively. 2. The place is kept immaculately clean. The grounds are continuously being cleaned, floors scrubbed, etc. 3. It's very nice not to have to carry a wallet around, and still be able to get a drink on the beach, an ice cream, a snack, etc. 4. The facilities and beach were lovely. The water in the ocean was actually warmer than the water in the pool, however. A lot of people were complaining that the pool was too cold. The rooms were very nice, although it would be nicer to have a clock radio. Beds are indeed very hard (as we were warned), but we didn't mind. Minibars are kept stocked with bottled water. On the negative side, my biggest complaint was the food. While there was lots of variety at the buffet restaurant, I found the quality to range from poor to mediocre (but I am personally very fussy about food quality and restaurants). Even the specialty restaurants were mediocre, in my opinion. I think this is one of the inherent hazards of \"all-inclusive\" resorts, where you have prepaid all of your food and they are feeding the masses. The shows in the evening were pretty amateur, but this was not a big deal for me as I had low expectations and even less interest. I was happy to return to my room and read a book. The rooms are quite nice, each with a balcony. There is no dresser, just a few shelves in the closet, so it would have been nicer to have a little more storage space. Also, there were very tiny ants on the counter top all the time --so we ended up unpacking our bags at home in the laundry room and washing absolutely everything. Also, the towels in the bathrooms are all fairly thin and could use replacing. The best advice I received (from this website) before leaving was to bring about fifty $1 bills to use for tips. While tipping isn't required, it's probably a good idea to leave 1 or 2 dollars for the maid each day, and to look after waiters or bartenders if they have been particularly attentive. These tips are much appreciated. My complaints are minor in the context of the overall vacation, which we found very relaxing. It was our intention to have a \"do-nothing\" vacation during which we could finish a few good books, get lots of sun, enjoy being together as a family, and not have to worry about what to do and where to eat. In that sense, our goals were met and we liked it a lot.","ratings":{"Overall":4.0},"author":"Ilene Wyman","date":"2013-11-26 06:45:47 +0300"}],"public_likes":["Neil Bogan","Brisa Botsford","Oran Mueller","Tre Adams","Abigail Borer"],"vacancy":true,"description":"Caravanning, camping, fishing, golfing, walking, children's play area","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}