{"title":"Inverness","name":"Kingsmills Hotel","address":"Culcabock Rd","directions":null,"phone":"+44 1463 237166","tollfree":null,"email":null,"fax":null,"url":"http://www.kingsmillshotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.472878,"lon":-4.207119,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12242,"country":"United Kingdom","city":"Inverness","state":null,"reviews":[{"content":"Our grandson was having surgery at the Children's Hospital and my daughter booked us here at a very good price. Four of us stayed in adjoining rooms and it was perfect with only about a 10-15 minute drive to the Hospital. The Interstate is right there and only a 15 minute drive to downtown, except during rush hour. The staff was friendly and helpful (save for one of the women who took care of the breakfast area - no smile or personality and needed to be a bit more attentive to cleaning tables and spills). On the other hand, they have one of the better continental breakfasts that we have experienced at a hotel. You can tell they are trying to do a good job. The building may be a little old but it is obvious they have made renovations, painted and decorated nicely, especially the lobby, which was also comfortable. The rooms were clean and bright and despite being on a busy and noisy thoroughfare, it was quiet. We had a good nights sleep every night. There is a nice Indian Restaurant next to the hotel that we liked and they provide room service. There is a Starbucks (of course they are everywhere) and convenience store across the street. A mall, with many different restaurants, is within walking distance. This is not a luxurious hotel and some people my not care for the exterior, balcony access to the rooms. That did not bother us at all and we found Nexus to be the perfect place to stay. It is in a good location and the price is right.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Miss Ali Tremblay","date":"2013-10-21 00:10:38 +0300"},{"content":"Following peoples ratings can be hard as it comes down to what you're used to in a hotel. If you're used to things being spotless, this is not the hotel for you. A water leak, upraised carpeting, patched walls and ceilings, grease all over the window, patched and repainted sections everywhere (including behind the front desk) is what welcomed us. The staff is young and 1 was more interested in texting than helping me. I will say however, that the location is good and the hotel was quiet. Room service was polite and fast. Shopping and a couple good restaurants are close by. Service can fluctuate everywhere you go, but I couldn't get past the patch jobs. Hate to be a snob, but I'm looking for spotless.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Arne Mohr","date":"2015-03-28 12:19:03 +0300"}],"public_likes":["Roberta Harvey","Gabriella Ferry I","Meta Nienow","Mrs. Trent Rosenbaum","Reta Gottlieb","Emory Stoltenberg","Lia Mertz","Melyssa Orn","Claude Haag"],"vacancy":true,"description":"Four star hotel about 1 mile from the centre of Inverness.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}