{"title":"Gardenstown","name":"Two Bears Cottage","address":"High St","directions":null,"phone":"+44 1772 863214","tollfree":null,"email":null,"fax":null,"url":"http://www.twobearscottage.co.uk","checkin":"4PM","checkout":"10AM","price":"£250/£400","geo":{"lat":57.67101,"lon":-2.33822,"accuracy":"APPROXIMATE"},"type":"hotel","id":9724,"country":"United Kingdom","city":"Aberdeenshire","state":null,"reviews":[{"content":"We stayed for 7 nights from 5th August. We were anxious after reading some of the poor reports however we need not have worried as everything was great. All staff were friendly and helpful, the room was very clean, had all we needed and everything was in good working order. Location was good and the view from our balcony was lovely. There was no noise during the night - its probably the quietest hotel we have ever stayed in. We had the buffet breakfast on our first day - selection was fine, service was good and price was reasonable. The resort fee was clear at check in and we had no problems with the lifts or parking. We asked for extra pillows on arival and they were delivered within minutes. Pool area was good; the sun disappeared late afternoon but that wasnt a problem for us. We didnt use the gym and had no need for childrens facilities as our daughters are teenagers. All in all this is a great place to stay. We have been holidaying in Orlando for over 20 years and are Disney Vacation Club members so we ususally stay at Disney properties but for the last few years we have stayed at Disney for one week and tried soemewhere different for the second week; I can honestly say the standard of accomodation at Lake Eve is as good as any of the 5 star Disney resorts we have stayed at. We had a lovely relaxing week and would be happy to recommend and return to this hotel.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Aubrey Kunze","date":"2015-12-09 12:34:27 +0300"},{"content":"Lake Eve is a great place to stay while on holiday in Orlando. we are a family of 4 with 2 teens of 15 and 13 , great location and lots to do . special mention to Frank at the main desk who helped out when I locked the car keys in the hire car, once again thanks Frank","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Agustin Tillman","date":"2015-08-13 09:39:37 +0300"},{"content":"Stayed between 2-16 May 2011. The apartment surpassed our expectations. Absolutely loved our 2 bedroom apartment, although probably a little too big for just the two of us, although it did mean we could both get showered at the same time. The reception staff were extremely helpful and accommodating - couldn't have asked for anything more. We did experience a problem whilst we were there however someone was sent to our room with 90 minutes (and that was at 22:00). The view from our 13th floor room was fantastic, overlooking the pool and Lake Eve. The pool area can start to get shaded by 14:00-15:00 hours in the afternoon, but this didn't seem to bother most people. Location wise, there is a Walgreens and Publix just down the road (you could actually walk there). In the other direction there is a petrol station and Pik N Run mini-supermarket which also sold hot/cold food. We absolutely loved it here and the location is fantastic the only thing that I could comment negatively about is the housekeeping. It was tidied around everyday but I don't think that the floors were mopped or vacuumed the whole time we were there. When you got out of the shower, your feet would be dirty again within 10 minutes! On the whole though we had a great time and we would definitely stay here again.","ratings":{"Cleanliness":3.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Ole Welch","date":"2013-04-18 10:18:46 +0300"},{"content":"Wonderful stay at Lake Eve. Large, clean rooms. Great location, hand for I-Trolley (right outside hotel) and good hotel shuttle to Disney Parks (would have been better if last bus left Disney a little later - 10pm last service) but overall a good service. A special mention to Keith and Diane on front desk concierge who really made our holiday - always willing to help and genuinely interested that we were having a great time. We stayed at Easter (spring break) but the hotel and pool never felt full or overcrowded and was lovely to return to after a busy day. Definitely reccomend Lake Eve to friends and hope to stay here again in the future. Thanks to everyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Drew Stoltenberg","date":"2013-12-06 21:41:51 +0300"},{"content":"Most of the reviews on here are very accurate. If you're looking for a great deal - inexpensive, nice, clean resort that's within driving distance of the major attractions, Lake Eve is great. We were a bit hesitant to stay here with the negative reviews, but felt that the issues were ones we could deal with for the price we'd be paying. The front desk staff were kind & everything went as planned. In terms of the other issues mentioned here: Valet - you do not need to use the valet services & can park anywhere else in the lot easily. On the weekend nights, it did get a little more crowded, but the lot itself is small, so it's not a far distance. Pool - the pool is nice, but you will not get any sun as it sits behind the hotel, on the lake. Ads/Menus - Yes, during the afternoon, menus are slipped under the door from local pizzerias. We live in NY, so this was not something we were concerned about. Cleaning - The cleaning staff made the beds & cleaned up the towels. Any clean items in the dishwasher were taken out for you to use. The cleaning staff came once a day - if you were not ready at that time, they weren't able to come back later. Food - save yourself the hassle of trying to determine when/if the restaurant is open. You can easily go down the street to one of about 5 Publix grocery stores & pick up anything you need. This hotel had families, couples, and business travelers, but never felt crowded or too busy. The rooms are huge & new. They have all the amenities of home, which helps you save money when you're visiting the area. Having a full kitchen + washer & dryer is amazingly helpful. Although the hotel is on I-Drive, it is further away from the hectic parts & has very little traffic. The pictures on the website are 100% accurate.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Miss Cristian O'Connell","date":"2015-01-12 04:54:35 +0300"},{"content":"We stayed at the Lake Eve Resort 3 different times in 2010. We liked what you get for your money and couldn't think of staying anywhere else for the price. Great 2 bedroom units with kitchen, 2 baths, second bedroom has 2 queen beds which our kids were very glad to see. The resort is just over a year old so there are some growing pains but we couldn't complain about a thing.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Vanessa Hickle","date":"2015-02-05 02:59:31 +0300"},{"content":"Had a great time. Room was clean and reasonablely priced. Check-in and out were efficent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Royce Volkman","date":"2014-10-15 03:04:21 +0300"}],"public_likes":["Eino Halvorson","Ken Dickens","Brant Cole","Annie Hodkiewicz","Everette Goldner","Reyes Jacobson","Floy Dibbert"],"vacancy":false,"description":"Award winning charming old fisherman's cottage. Excellent sea views from all windows. En suite master bedroom. Visit Scotland 4 star accredited.","alias":"4 star Self Catering cottage","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}