{"title":"Santa Monica","name":"Oceana Santa Monica","address":"849 Ocean Ave","directions":null,"phone":"+1 310 393-0486","tollfree":null,"email":null,"fax":null,"url":"http://www.hoteloceanasantamonica.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.02156,"lon":-118.50658,"accuracy":"APPROXIMATE"},"type":"hotel","id":26502,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"I stayed at the Westin LAX May 21-22 2009 and What a big disappointment, this hotel is really not up to par with other Westin hotels. I found it to be dirty and in need to a complete renovation. The elevator was broken during my entire stay; the carpet and lobby furnishing were worn, torn and dirty. The room was very dusty and carpet was stained and dirty, the view was horrible, overlooking a dumpster. A few good points the bed was comfortable when I could stop thinking about all the dust in the rest of the room, and the TV was nice. There is a trolley right across the street that will take you to Manhattan Beach, the ocean, restaurants and a few nearby malls for $3.25 round trip, buy the tickets from the Bellmen. Again, I was very disappointed and will not stay at the Westin LAX again.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":1.0},"author":"Bridgette Graham","date":"2012-04-15 22:01:58 +0300"},{"content":"We got this room on Hotwire so we got a great rate and it was very last minute. We were not sure what to expect. To our surprise the room was very large, comfortable and clean. We had just spend a weekend in Lake Tahoe and had a room half the size for twice the money. The hotel was very crowded due to a dance convention, but we still found the staff great and the following night the dancers left and we had a lovely stay. The beds were super comfortable. My onlt complaint is the restaraunt was a little pricey for what you got. I would go back. Also the self park was very easy .","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Ricardo Rolfson","date":"2012-10-17 05:40:59 +0300"},{"content":"This Westin is definitely not up with the quality and standard of other worldwide Westins. OK for a stop over hotel but wouldnt book for a long term stay. Very close to runway of airport and rooms are noisy so get a room on the road side. Beds and towels and sheets are not from the Heavenly collection - they are old and tired and need replacing.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":2.0},"author":"Marcelo Bernhard","date":"2015-04-05 18:19:16 +0300"},{"content":"I spent three nights in LAX Westin, It was not good as I expected from a four star hotel. When I checked in, I was told that the room I booked through Hotwire is not available as the hotel was running high capacity then. Instead of getting two double beds, I was assigned room with a king bed and sofa bed. Fine, I assigned to one elder kid to safa bed. After we settled down, kids started to pick up candies on the table. In order to prevent them absorbing too much sugar, I asked service department to take out all candies during my stay. But during check out, we found minibar charges were quietly added on bills. We parked our car in hotels for three days. The reception gave us two day free parking as the reimbursement of room changes. On check out date, parking were fully charged for 3 days. Gladly, those problems were eventually corrected. My impression is this hotel lacks of communication among different departments, but service staff were willing to help. Their managment needs improvement to qualify a four star hotel.","ratings":{"Service":2.0,"Cleanliness":4.0,"Check in / front desk":2.0,"Overall":2.0,"Rooms":3.0,"Location":3.0},"author":"Lowell Oga","date":"2015-03-30 09:54:15 +0300"},{"content":"18 dollars per day for parking, ridiculous...No other free parking around. Shuttle to airport was nice. Everyone expects a tip even for directions or questions... Room was clean and fairly quiet. Room service was good but as usual expensive. Everything in the room u had to pay for. The coffee maker and coffee. The fridge couldn't be used to store anything cause there were all kinds of stocked items u had to pay for in it and a 25 dollar restocking fee for using anything. WILL NEVER STAY AT ANOTHER WESTIN AGAIN.","ratings":{"Service":2.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Lily Koepp","date":"2012-11-20 23:20:39 +0300"},{"content":"I had to move out of my house in an emergency, and was desperate for a place to stay with my pets. The booking agent over the phone for the property was very understanding and supportive in helping me find the best room (amongst all their properties) for the best price. When I arrived, pets in tow, the front desk was a little taken aback, but handled it in stride. From the time I pulled up until checkout , I have only received excellent service. The carpet is a little stained an worn in the room, not sure if this is a room reserved for pets or if they are all in that condition. The cooling system is a little erratic, and it seems not all the light switches work. However there are signs around the hotel that say they are in the process of upgrading, so maybe the rooms will be done soon.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":3.0},"author":"Ana Carroll","date":"2013-03-27 23:28:12 +0300"},{"content":"I needed a hotel located on the Westside, a reasonable distance to the Southbay, not too far from Hollywood and reasonably priced. I have stayed at the Westin LAX many times when I held SPG Platinum status. Now I am down to Gold without much chance of getting back to Platinum. I tried booking via the SPG website but could not get a room for under $200++ a night for my Sunday to Friday stay. The hotel is good, but not worth it at that price. I decided to try Priceline and bid $85 for a 4 star hotel in the LAX/South Bay areas. Boom. The bid is accepted and it is revealed the I will be staying at the Westin!! Quite happy with that rate, but would have been better to maybe start at $70. Priceline remorse, but excellent value. I checked in at the SPG area and despite booking via Priceline the staff was very easy to deal with and I was given access to the 12th floor lounge which is basic but good for an early morning cup of Starbucks and a Granny Smith apple. They have a big television, microwave, couches and computers with internet access. Not great but better than a poke in the eye! It is well documented that the rooms have seen better days, the Heavenly Beds are great, linens are clean and crisp, small bathrooms, good toiletries, ok water pressure, small coffee maker with individual Starbucks packs, old 29\" swiveling television sets, no DVD players, no inputs which would allow you to plug in your travel DVD player and no WiFi. Internet for a charge is available and isn't it ironic that motels give away WiFi and better hotels always gouge for plug & play. The hotel is often used for parties which I find lively. There are often times large groups milling around the lobby, obviously enjoying themselves and maybe having a few drinks. The lobby restaurant and bar are absolutely fine and not really overpriced. There is absolutely nothing of retail note outside the hotel within running distance of. Some fast food and plenty of car rental lots. Thrifty is next door and they have great Dodge/Chrysler lines for reasonable rates. The hotel has a more than acceptable pool which is often out of service, but functional during my stay. There is a coin-op washer and dryer which is a nice touch. The Westin-Workout gym is in need of some maintenance but much better than 95% of the competition. They even have a men's shower and sauna. Don't expect any amenities in there, but again ... not bad. Parking is attached to the hotel and $17 a day for self park is the usual ding that most of us hate. With all the people streaming in and out for functions, corporate training and mid-term airport parking you'll have to hunt for a space, likely walk a bit, but it is safe and covered. Hey folks, what's with all the complaining??? Hotel rates have gone way up in recent years. Just try traveling with weak dollars. It is not pretty. The Westin LAX works extremely well for me. Give it a try, with realistic expectations, and you may find that it works for you too.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":3.0},"author":"Elijah Bins","date":"2012-02-18 20:04:12 +0300"},{"content":"This is a great airport hotel. It's fairly far down Century Blvd. from LAX, but the van goes every 15-20 minutes 24 hours. You don't have to call for it or make reservations. Typical Westin rooms, very plush and comfortable. From my room I had a great view of planes landing. At first I thought it was going to be noisy, but finally realized they had the window open. Once I closed that, it was quiet. Staff fawns on you. They don't have much in the way of food outlets. As for the reviewer who complained about the hotel's being isolated and there not being food around, that's a bunch of hogwash. Likewise the complaints that the neighborhood is \"dangerous.\" There is a Taco Bell across the road, as mentioned. (It's also a Pizza Hut Express.) But just continue a few steps down Century and there's a cafe at the LaQuinta. And just on from that is a McDonalds. On the same side of the road as the Westin, just a few doors down, is a 24 hour Subway sandwich place, and a few doors from THAT is a diner/cafe of some sort. You can walk to all of this in less than 10 minutes max, and mostly much less. Century Blvd. is in an industrial neighborhood, but it's a huge, busy road with lots of businesses around. I felt very safe. For the kind of overnight stay between flights that I had, it was ideal, better than the Crowne Plaza because there were more fast food places around.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Elmo Sawayn","date":"2014-07-25 02:34:56 +0300"}],"public_likes":["Mikel Kertzmann","Ms. Presley Barrows","Ludwig Wyman","Vicky Mohr","Elna Wolf","Mariano Leffler","Bridget Schaden","Beau Ziemann","Elza Donnelly"],"vacancy":false,"description":"Located on Ocean Avenue, Oceana Santa Monica is a boutique hotel featuring a restaurant open only to guests.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}