{"title":"Puy-de-Dôme","name":"Chateau Royal de Saint-Saturnin","address":"Place de l'Ormeau, 63450 - Saint-Saturnin","directions":null,"phone":"+33 4 73 39 39 64","tollfree":null,"email":"SaturninILA@ila-chateau.com","fax":"+33 4 73 39 30 86","url":"http://www.ila-chateau.com/saturnin/","checkin":null,"checkout":null,"price":"€150-190","geo":{"lat":45.65874,"lon":3.09258,"accuracy":"APPROXIMATE"},"type":"hotel","id":23386,"country":"France","city":"Saint-Saturnin","state":"Auvergne","reviews":[{"content":"A Little Gem I can only re-iterate what the other reviews on here say.The reception staff are friendly and very helpful. On check in, they asked if it was our first time in New York (it was) and then gave us a free tourist map and pointed out where the attractions were and the best ways to get to them.The room was very clean and meticulously maintained. A nice touch for a hotel in this price bracket was the bathrobes that were provided. The only thing to note about the room was that the bed was a standard double (not too much of an issue for my wife and I as we're quite slim people) but that might not be acceptable for everyone. Ricks cafe was great for a self service breakfast. Snacks and Coffee were available all day and there is complimentary wine and cheese in the evening.Saving the best until last, the location of the Casablanca is fantastic. Just steps away from the hustle and bustle of Times Square, but on a quieter street that doesn't appear to be used as a main thoroughfare.We'll be back.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Sigmund Marquardt DVM","date":"2013-04-07 06:02:57 +0300"},{"content":"the great Casablanca Hotel My daughter and I have stayed at the Casablanca every January for the past 4 years as part of our Girls' Weekend in NYC. We love everything about the hotel. The staff is very attentive and efficient. The room is always very clean and comfortable. The wine and cheese in the evening and the continental breakfast are really wonderful. It is especially nice to have a cozy place to relax and have a glass of wine or a cup of tea/coffee/hot chocolate away from the crowds. The location is perfect for what we needed. We look forward to next year!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Maeve Kutch DDS","date":"2014-08-31 07:16:09 +0300"},{"content":"Perfect! I was hesitant in booking this hotel as I had never heard of it, but decided to rely on TripAdvisor's reviews. The Casablanca was a wonderful place to stay; literally steps from Times Square, courteous and helpful staff, rooms exceptionally clean and well maintained. We'll be back!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Constantin Douglas DVM","date":"2015-02-17 13:14:07 +0300"},{"content":"Best hotel in NYC My friends and I stayed at the casablanca for 5 nights from 6th December to the 11th December. We had a fantastic stay. The hotel is a jewel in the crown to say the least. The staff were wonderful, the cheese and wine every night from 5pm till 8pm was amazing.We were up really early on our first night (with the time difference) and it was great, we all sat in ricks cafe with our latte's , in our pyjamas , you would never imagine we were only minutes from times square.The hotel was immaculate. We had a mini suite which was fabulous.There is nothing negative to say about this hotel. If you are planning a trip to the big Apple, you must stay here, you will not be dissapointed.Thankyou casablanca, we will definately see you next yearxx","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Miss Wilfredo Rohan","date":"2013-09-10 22:17:22 +0300"},{"content":"Superb customer service As I expected, after reading the unbelievably glowing reports of the Casablanca - the concierge service and general friendliness of the staff was absolutely excellent. The only reason I haven't given the hotel the same kind of review is because of a few minor things, but none of them serious.Yes, the complimentary breakfast is really useful, but after 7 days it was a bit samey - but remember, this is FREE!! so no real complaints there.We didn't really make use of the free cheese and wine as we were out virtually all day and into the night, but I did use it on our first night and was stunned at the quality of the wine and cheese available - shame it didn't start sooner and end later as we would have used it every day. If you're the sort of tourist who likes a 9-5 day with an evening out after getting changed, then this is ideal for you.We were in the hotel over Thanksgiving, so it was pretty packed but we never had a problem getting a table at Rick's cafe. Noise - didn't affect us at all, all you need to do is ask for a quiet room, we were on the sixth floor. In fact I was absolutely amazed at how quiet the hotel was considering that THE noisiest and busiest place in the world - Times Square is literally 30 yards away!Our toilet got blocked too (is this a hotel plumbing problem?), but there was no problem getting it unblocked. I was surprised to hear that another reviewer met an unhelpful member of staff, as everyone we met was superb. Considering some of the ridiculous requests we heard in the breakfast area from some of the guests, I'm amazed that the staff were so courteous. I sometimes wonder why people go on holiday at all if they only like things done in a certain way.Yes, the room was small but we weren't really in the room for long enough periods for this to be a problem. Towels changed every day as were the toiletries.We also received a free bottle of champagne, as it was our wedding anniversary - this seems to be standard practice now for decent hotels if you mention a special celebration. I just hope people don't start abusing this and make up a birthday just to get a free bottle of bubbly.Overall, our stay at the Casablanca was brilliant and I have no hesitation in recommending it - but don't go there if you like faceless corporate hotels.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Wyatt Greenholt","date":"2015-02-27 22:50:09 +0300"},{"content":"Best hotel in New York Just back from a stay in this wonderful hotel. I have been to New York 8 times now and this was my first time to stay here. Have stayed in the likes of the Plaza on 5th ave before and have to say that i found this hotel the best of the lot. I can not recommend this place enough. the friendliest staff you will ever find anywhere. The hotel itself is very clean. I though the room was a fine size considering what i have read. the bathroom was also fine. Only problem was I would have liked it to have air con as when opening the window the smell from the Italian next door was not to pleasant. Rik's cafe was fantastic. Great breakfast and great wine! When we checked out i couldn't believe it when we were told to make full use of the cafe until we had to get the flight. We were also told that if we had a late flight the make sure we came back for the wine and cheese later, even though we were checked out! They were truly amazing. Cant fault anything, location, cleanliness, friendliness, food, everything was great. Try Tony's next door for the best Italian food ever (and apple martinis!) Jimmy's Cornor around the block is an experience. A dive but a fantastic dive! Owned by a professional boxer who serves behind the bar this place has so much atmosphere. Want to meet true New Yorkers well here is the place to go. Also try St. Andrews 2 doors up.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Tierra Kuhlman","date":"2013-11-25 04:55:35 +0300"},{"content":"A wonderful hotel WOW what can we say, the hotel is fantastic, the location is fantastic (just off Times Square)  the staff are fantastic! We only had 3 nights in this lovely hotel I just wish we could have stayed longer. We're definately staying there again when we go back to NYC. The hotel is spotlessly clean  we had a free room upgrade (which was gorgeous) The staff were so courteous and friendly, nothing was too much trouble. We can definately recommend the complementry cheese  wine every evening before heading out to paint the city red, white  blue. We had a fantastic stay thank you Casablanca.","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Sallie Davis","date":"2014-04-27 13:14:49 +0300"},{"content":"Outstanding hotel We loved the location  the staff was great. They went out of their way to be friendly  helpful. Delightful breakfast  wine  cheese hour. My husband was thrilled to have the internet available. We look forward to staying there next time we are in New York.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Abdul Grant","date":"2012-01-14 04:21:36 +0300"}],"public_likes":[],"vacancy":true,"description":"13th century chateau-hotel in the Volcano Regional Park. Table d'hote restaurant, large car park, all rooms have en-suite bathrooms.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}