{"title":"San Diego/La Jolla","name":"Grande Colonial Hotel","address":"910 Prospect St","directions":null,"phone":null,"tollfree":"+1-888-530-5766","email":null,"fax":null,"url":"http://www.thegrandecolonial.com/","checkin":null,"checkout":null,"price":"$200-650","geo":{"lat":32.84718,"lon":-117.27527,"accuracy":"ROOFTOP"},"type":"hotel","id":25197,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I had a lot of sleepless nights thinking of this hotel with the bad reviews it has received. It was not as bad as it has been described, granted it is not a Sheraton, Hilton, Four Seasons or Ritz Carlton but for the price it was very good. I have stayed at all brands and this was a very good value. I was there with a colleague for a conference at the convention center right across the street. We spent 4 nights there and not one bed bug bite or other bad experience. The staff at the front desk was GREAT! Yes there is a homeless shelter next door but they did not bother you at all. The parking was about a 2 block walk into Chinatown and cost $15 a day with a coupon from the hotel. The continental breakfast was enough (muffins, bagels, cereal, coffee and tea). If you are going to the convention center and don't want to spend a lot of money this hotel is fine.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Kristy Schoen","date":"2013-10-31 03:47:23 +0300"},{"content":"We were running a bit over budget on our vacation so we dropped down market for our last night before flying home. Probably a bit more than we should have done. There are actually many positives to this hotel - friendly and helpful staff and a passion for cleanliness. The carpets were being shampooed when we arrive and the smell of bleach was clear in bathrooms and restrooms. While this is clearly a hotel that is lacking investment, to the point of shabbiness, the local team obviously take pride in their work and want to do their best with what they have got. So we come to the negatives. Other reviewers have commented on the location - the Convention Center is a massive barrier to feeling part of Center City and the hotel is at the end of a long tunnel through the Center that does not always feel very safe. It is next to a homeless shelter, although this seems to be well run and we certainly did not experience any hassle from the neighbours at any time. The rooms are small but manageable for the odd night - I wouldn't stay here for any longer. The bedding and towels were clean but threadbare. The towels did not absorb any moisture and the bedding - well I have seen thicker fabric on showgirls in Las Vegas. The complimentary breakfast had reasonable coffee but is otherwise best passed over - Reading Market is less than five minutes walk and a much better option! This hotel is in the wrong location ever to command a premium price, even in the budget sector, but the staff team do deserve better support from the owners in terms of investment.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":3.0,"Rooms":3.0},"author":"Antonietta Tromp","date":"2014-02-15 00:48:12 +0300"},{"content":"My son and I had to make an unexpected overnight trip to the Philadelphia area and booked the Travelodge Philadelphia the day before travel. We stayed at the hotel the night of 16 January 2007. We paid about $96.00, including taxes, for the night. The Travelodge is located in a convenient location for visiting the city center and is in easy walking distance to the Convention Center, Chinatown, and historic attractions. Unfortunately, the location is also on a dark (at night) street in an unsafe looking area, where I would not have walked outside at night if I had not been accompanied by my son. There were many homeless people hanging out two doors down. The hotel has no parking on site, but recommends that you park in a 24 hour attended garage about a block down the street on the right just as you enter Chinatown. The garage is clearly labeled Travelodge Parking and the parking (at the time of writing) is $15.00 a day. The front desk clerk was extremely helpful and friendly. Unfortunately, we got a first floor room (#108), across from the check -in desk. I should have insisted on changing rooms right then, as I knew that a room next to the desk (and there are several of these) was going to be extremely noisy, and I was right. Not only was there noise off and on all night, at 3 am there was a great deal of commotion which resulted in the police being called, who ran around the hotel shouting for over 20 minutes (I never did find out what happened). They then spent several more minutes loudly gossiping with the front desk clerk until I called to complain about the noise and they left. Our room was TINY, the smallest I've ever stayed in, and that includes hotel rooms in New York City and Europe. There was just room for 2 double beds and there was no closet area. Instead, there was a coat rack which partially hung over one of the beds. The one window gave a view of the hall, so the curtains had to be kept shut all the time, unless you wanted everyone entering the hotel to look right into the room. It was rather like being in a tomb. On the plus side, the room was clean. Due to the very small rooms, noise level, and unsafe feeling location, I cannot recommend this hotel. I would especially caution single women travelers to stay clear, as it just didn't feel safe there.","ratings":{"Service":5.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":1.0},"author":"Serena Ortiz","date":"2015-10-12 17:56:41 +0300"},{"content":"A great location adjacent to PA Convention Center makes this hotel a great value for the money. Clean rooms, free high speed internet, free continental breakfast, and no problems of any kind. Parking lots within 1/2 block. Note most rooms do not have exterior windows but do have a window facing the interior atrium which does allow in some natural light. We were lucky and got a room with an exterior window.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":3.0,"Rooms":3.0},"author":"Jaqueline Mohr","date":"2014-05-27 11:22:09 +0300"}],"public_likes":["Adella O'Hara","Bobbie Batz","Julio Emard Sr.","Trycia Ankunding","Hellen Nienow","Korbin Bednar","Lauriane Price","Garth Huel"],"vacancy":true,"description":"A landmark, historic hotel overlooks the shores of the Pacific Ocean and ideally located just steps away from the beach.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}