{"title":"Birmingham (England)","name":"Hotel du Vin","address":"Church Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48232,"lon":-1.89996,"accuracy":"APPROXIMATE"},"type":"hotel","id":3648,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Lovely hotel. Hilton Honours guest so was consequently upgraded to an Executive Room (it was also our wedding anniversary!). Executive floor was great - complimentary canapes each evening and breakfast thrown in. Had to pay for alcohol though but soft drinks/tea/coffee complimentary at any time. Internet was also free which was a great bonus. Check-in quick and friendly. Room was spacious and well appointed. Bathroom was a bit small as others have noted but wasn't looking to hold a party in there so not really a problem. Shower was two headed and one of the best experienced in hotels stayed in. Was concerned about the reported thin walls from other posters and also had reservations when saw that the room we were given had an adjoining door to the next room (why do hotels have these!!!!). Needn't have worried though as sleep was not disturbed at all. Only downside was the bar downstairs - service was terrible. Despite sitting at the bar, my wife and I were still ignored by the bar staff on two occasions. We took our business elsewhere!!! Next door to the hotel is Millers Bar - good food. Recommend the ribs. Cocktails at the top of the Hancock Tower also to be recommended. Italian Village also did good food and Yolk is excellent for breakfast. All in all a fab trip - even though it was mighty hot!!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Raymond Nolan","date":"2015-01-14 11:42:35 +0300"},{"content":"Spent one night at Palmer House while on a weekend trip with my 9-year-old. We took the L from Midway. The hotel is just steps away from the Adams St L stop. The Art Institute is about a block away. We used CTA buses to get around and it was very convenient to go to the museum complex and Navy Pier. The hotel lobby is beautiful. Our room was also very nice. The decor was lovely. They have some really cool lamps. We had a double room The room was a little small, but larger than I expected from reading reviews. I saw the interior of some of the single rooms as I passed in the hallway and they seemd to be very small. The bathroom was nice, very clean and appeared to be newly redecordated. We grabbed a quick breakfast at the Starbucks on the lower level of the hotel. There is a restaurant and lounge in the hotel, as well, but we didn't try those. We had Mother's day lunch at Miller's Pub which is on the corner by the hotel. The staff was very friendly, the service was good and so was the food. I highly recommend it. The down side at the hotel was the lack of any soundproofing. I was awakened in the middle of the night by a man's voice in the next room. I could hear every word just as clearly as if he had been in our room. We could also hear the L trains clearly from our room but that didn't bother me. It noticed it when II was awake, but it wasn't loud enough to wake me up.. The swimming pool was closed when we were there and they told us we could use the pool at the Hilton which they said was about 25 minutes away, which seemed silly to me. Overall we had a nice stay, the location was great, and we paid the $89 non-refundable rate, so it was a very good deal. There are a lot of other hotels in the area though, so I will probably try a different one next time and hopefully it will be quieter.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":5.0},"author":"Isadore Rodriguez","date":"2012-04-28 03:53:17 +0300"},{"content":"we will always stay here when we go back to Chicago. wonderfull service everyone was very helpful. rooms were very nice, a little small and could tell a little dated but looked like they have started updating them. the web site needs to go more into the history of this hotel, it makes you want to go into every nook and cranny. just a wonderful hotel !","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Oma Heaney","date":"2015-01-10 22:25:29 +0300"},{"content":"The historic Palmer House has undergone a beautiful renovation, but it's hard to change the size of the rooms. Our king was so small, we could barely move around. The bathroom was good for one person only, and that's if you kept the door open. Finally, the walls seemed paper thin. I would go back, but only if I made very sure what room I was getting and where it was located. The staff was great!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":1.0,"Location":5.0},"author":"Kelli Smitham","date":"2014-07-27 08:04:51 +0300"},{"content":"I've been staying at the Palmer House since I was a kid. We spent our honeymoon here (even though we really could not afford it at all back then). So I'm biased - I love this place. No other lobby anywhere has the grandeur, the opulence or the flair of the Palmer House. Book the executive floor just to ride in the private elevator with a COUCH! This is awesome. Stunning 2 bedroom suites - great views of the city, perfect location to take in the museams, grant park,etc... I've had the staff bend over backwords to assist me (crazy late check-out once 6pm - was on a business call should have ended at 2pm.....they kept talking and talking....). The executive floor - nice. This is a great hotel all around.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alfonso Lemke","date":"2013-07-10 22:24:46 +0300"}],"public_likes":[],"vacancy":false,"description":"Offering a dark take on its lush Victorian common spaces, the Hotel du Vin brands itself as lifestyle accommodation, with a number of facilities to match, including a cigar lounge.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}