{"title":"Snowdonia National Park","name":"Plas Gwynfryn","address":"Llanbedr, Gwynedd LL45 2NY","directions":null,"phone":"+44 (0)7767 473505 +44 (0)1341 241363","tollfree":null,"email":"enquiries@plasgwynfryn.co.uk","fax":null,"url":"http://www.plasgwynfryn.co.uk","checkin":"16.00","checkout":"10.00","price":"£1400+","geo":{"lat":52.82126,"lon":-4.09107,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":27627,"country":"United Kingdom","city":"Gwynedd","state":null,"reviews":[{"content":"Maybe it was because we had high expectations (for over $600 a night!), or maybe it was because we had heard such positive reviews, but we went to the Grand Floridian with a very optimistic attitude. From the minute we arrived things started to go wrong. Our first room was not a Magic Kingdom view, even though we had paid extra for it. The next room was barely a view, but we did not want to move again. The rooms are very modest, and the balcony was tiny. Then after all this fuss we were all thirsty, but the bar key was missing. We had to make several calls to the desk to finally get someone to come after close to an hour with a key so that we could spend some morre money on water! The room was very average...and not so clean. We found a pacifier near the bed, and gum on the bathroom floor - neither was ours (YUCK)!!! The front desk/concierge were never helpful or well-informed. We requested room service menus (again, to spend more money!) and they were never delivered. Once when we were coming home from the parks at 11pm the door to our part of the hotel was stuck. Our family, and several others, were stuck outside in the torrential rain until someone came to open it. We waited almost 30 minutes, after a long day in the parks, which we all felt was unacceptable. Breakfast was mediocre, and we never could get refills on our coffee! The shuttles took forever to come. The pools were O.K., albeit very crowded. Nothing spectacular. My husband and I have traveled extensively...both with and without children. Neither of us is particularly picky or high-maintenence Yet we both agreed that this was our worst hotel experience ever. This is unfortunate, as the Grand Floridian is very expensive! I wish I could go back in time and book a more moderate resort. Then even if there were some snafus we could more easily overlook them. I have never written a bad review/complained about a hotel before. Please head my advice and stay somewhere else!!!","ratings":{"Overall":1.0},"author":"Zoey Dooley","date":"2014-05-17 12:18:02 +0300"},{"content":"We checked in on December 14, and checked out on December 17. My birthday was the 15th, and this was my birthday present from my husband. The hotel was beautiful. We stayed in Building 9, which was Big Pine Key. Our room was very nice, it had 2 queen beds. When my husband checked in they asked if we were celebrating something and he told them that it was my birthday. So on the 15th, when we came back from the parks, there was a plate with candies and cookies and a 10\" tall white chocolate Mickey MOuse, along with a personalized card from Minnie. I felt that this was quite nice. We ordered room service, it was very nice, although it was over $50 for a salad, a fruit plate, a cheeseburger and 3 canned cokes. The monorail was very convenient, although it was crowded at times. The beds were wonderful. However, the walls were quite thin, I was not feeling well, so we stayed in the room all day, and we could hear people talking in the hallway. We had a lagoon view, we could see the Polynesian, but there was a tree directly in front of our balcony, if it had been summer, I doubt we could have seen anything, but all the leaves had fallen off the tree so we could see the hotel and the water parade, however if was hard to get pictures as the branches were in the way. Housekeeping was wonderful, as was the turndown service at night. I would have expected free internet service, but there was a fee. Overall I really enjoyed the experience, but I do not think it was worth 435 dollars a night.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":4.0},"author":"Ms. Cyril Ward","date":"2015-05-15 22:42:25 +0300"},{"content":"We stayed here Sept 27 - Oct 7 and were very suprised. Having stayed at the other deluxe properties and always thought that this property would be too frilly and too victorian. To our suprise not at all. As you can see we found ourselves here by the Contemporary overbooking. But being Disney they had everything done and even better to make sure that your \"magic\" was not ruined. Not only were we upgraded to the Grand, but were given concierge service and a Magic Kingdom view. Service was exceptional all requests granted and everyone went above and beyond. Common areas vey nice, room always spotless, dinning very good and just an overall wonderful experience. If you have a daughter,a great place for your little \"princess\" to stay and feel like royalty. Keep in mind it is still disney and not a four seasons. Lastly, can not say one bad thing!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Carolina Shanahan DVM","date":"2013-09-26 21:27:01 +0300"},{"content":"My girlfriend and I spent 4 nights at Disney's Grand Floridian. The hotel was very clean and just about what you'd expect for a hotel in this class. Room service was on top of their game, and would often show up on multiple occasions during the day. The only complaint we had was more on the fault of Disney's Magical Express service (gets your bags from the airport & to your room when you arrive), but other than that, very nice stay. They have a 24 hour \"restaurant\" located on the premises where you can get drinks, pizza, sandwiches, etc. any time of the day. This was helpful on more than one occasion. It also had at least 2 different pools with nice lounge areas. Location is about as good as it gets, having the monorail right outside your room! A bit pricey, but location is everything.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Gunner Hodkiewicz","date":"2015-12-10 20:02:23 +0300"},{"content":"We stayed at the Grand Floridian for 9 nights from 21st June with our 2 year old son. The Hotel is fabulous with an impressive entrance and excellent staff. We arrived at the Hotel, tired and jetlagged but our spirits were soon lifted by the excellent staff and service and the first view of our room which although didn't have one of the more expensive 'Magic Kingdom' views overlooked the pool and was lovely. The staff were continually friendly and the maids did an excellent job of cleaning the room with a turn-down service in the evenings. In the mornings you can also see the maids doing a little parade through the gardens before they start work! The Hotel is across the lake from the Magic Kingdom and provides an excellent view of the Wishes fireworks from the jetty, or beach (or if you are lucky enough to have a view from your balcony!). There is also the monorail which is one stop away from the Magic Kingdom and is excellent with a little one. We dined at the cafe and at the grill with the food being very good and a variety for all. I would recommend this hotel to anyone and can't wait to visit it again one day.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Sadie Keebler","date":"2014-07-25 23:27:09 +0300"},{"content":"Having stayed @ most of the Disney Deluxe Resorts, I was a little apprehensive about spending the extra $$ to stay here. turns out, totally worth it! We were checked in right away and upgraded to a better view. Upon learning that it was our anniversary, champagne and flowers were sent to our room. The service was outstanding everywhere. We had drinks @ both Narcoosee's and Citrico's as well as dinner @ V & A. All together, awesome! The 2 minute monorail ride from the MK was great and I loved laying by the pool and hearing faint MK sounds (the train, the parade etc) The beach is really great too, lots of cozy cabana's! It was easy to get a drink @ the pool bar too! Did I mention the beautiful live orchestra in the lobby each evening? Wonderful! Or how my husband forgot a shirt and had to buy one for dinner in the store and they quickly ironed it for him to wear that night? All in all, an amazing experience!!!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Monte Mohr","date":"2012-12-03 02:26:04 +0300"}],"public_likes":["Hosea Hickle","Leonor Hansen PhD"],"vacancy":false,"description":"An Edwardian Country House available to hire for self catering holidays. Sleeps 14 - 18. Visit Wales 4* Accommodation. The guest bedrooms consist of four double ensuites, two family rooms and a twin room. Sea and mountain views.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}