{"title":"Birmingham (England)","name":"Awentsbury Hotel","address":"15 Serpentine Rd","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.awentsbury.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.44389,"lon":-1.92422,"accuracy":"APPROXIMATE"},"type":"hotel","id":3624,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Stayed at the Monaco on my way skiing at Easter & loved it. Staff were helpful & friendly, room was huge with fantastic view of the river. Central location, 5 min walk to the EL. Adjoining Restaurant/Bar, great food & service. I have stayed in more expensive, supposedly better, hotels in Chicago, but this is the best. Thanks Monaco, I'll be back.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":4.0,"Rooms":5.0},"author":"Josiah Dooley","date":"2013-05-02 02:02:38 +0300"},{"content":"My husband and I stayed at Hotel Monaco for a weekend getaway. The hotel staff was courteous and helpful with suggestions for dining, transportation, etc. The hotel room itself had lots of character and was very charming. The only downfall to our trip was the hotel's restaurant, the Southwater Kitchen. We waited 45 minutes for our breakfast to be served in the restaurant and finally got up and left. I'd definitely stay here again!","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Ebony Wintheiser","date":"2015-05-12 04:00:44 +0300"},{"content":"My family and I satyed at the Monaco for one night and had a wondeful time! The hotel was in the center of it all. The staff was friendly form the check-in to the valet. We love the window seat and spent all the morning lookig out of it. We had a suite and it did not let us down. The colors were vibrant and inviting, very comfy! The bathroom wa also gorgeous. The jacuzzi was relaxing and the bath products scented the room the whole stay! Overall, WONDERUL!","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":3.0,"Rooms":4.0},"author":"Meagan D'Amore","date":"2012-04-02 02:06:45 +0300"},{"content":"Stayed for 6 nights, first time to Chicago. Took the train in from Midway and will take the train back to OHare, Simple to do, forget the taxi, only set you back 2.25! This hotel is within walking distance to everything you want to see and do in the windy city. Nice to have the seperate sitting area from the bedroom. Beds are comfy and clean. Bathrooms are nice, not luxurious, but granite and tile, clean with lovely bath soaps and lotions. Become a member of the Omni loyality program and get free WiFi and daily delivered coffee/tea to your room, nice touch! The work out room is smallish but adequate, the pool is for kiddies! Not an adult lap swimming pool. Would definitely recommend to friends or family.They apparently have a shuttle service within a few miles to drop you off to your destination, we did not use. Also the concierge was extremely helpful and knowledgeable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ashleigh Davis","date":"2014-12-08 21:16:18 +0300"},{"content":"I chose the Omni Chicago for our recent trip to Chicago because of the great location, its excellent value, instant rewards program and indoor pool. My husband and I traveled with 2 other couples and we were all very pleased with the beautiful suite accomodations, and the friendliness and courtesy of the staff.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Billy Hane","date":"2012-11-07 22:18:39 +0300"},{"content":"Great all suite hotel right in the middle of Michigan Ave shopping! Rooms are very clean and spacious with separate living room and bedroom. The corner suite we had was quiet and spacious. Staff was friendly, welcoming and extremely helpful from check-in to check-out. Doorman recognized my wife and I after the first day, and always asked how our day was, or if we had any questions/plans for the day, etc. We even struck up a bit of a conversation once or twice. Take advantage of joining the Omni Select Guest (free) and you will receive complimentary drinks every morning delivered to your door, free WiFi, and even free shoe shines if you want! Best of all, the great shops of Michigan are right at your doorstep. Will definitely stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lambert Padberg","date":"2012-12-22 00:40:09 +0300"},{"content":"This was our second time to stay. From valet, checking in, our room, checking out, valet service- It was all excellent !! We will be staying here next year as well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Winona Osinski DVM","date":"2012-06-04 21:46:36 +0300"}],"public_likes":["Jabari Bartell"],"vacancy":false,"description":"Selly Park (''close to the university''). Offers mid-range B&B in a quiet environment within 10 minutes walk from the university.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}