{"title":"San Francisco/Nob Hill-Russian Hill","name":"Hotel Mithila","address":"972 Sutter Street","directions":"at Hyde","phone":"+1 415 441-9297","tollfree":null,"email":"mithilahotel@aol.com","fax":"+1 415 441-2379","url":"http://www.mithilahotel.com/","checkin":null,"checkout":null,"price":"Average Price $115","geo":{"lat":37.7884,"lon":-122.4164,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25958,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Although the resort entrance and clubhouse are still under construction, it in no way affected service or comfort (they just started to construct the clubhouse). The shuttle service is incredible. Golf carts to take you from the room to the front, small busses to take you to various points on the strip every hour, freemont street at night, and even a grocery store in the morning. The rooms were clean, modern, and very comfortable. The pool areas are excellent as well, with lots of lounge chairs, clean washrooms, great spa, heated pool, open 24hrs., music until 10pm, bbqs, picnic cabbanas, and no problem enjoying beverages (in non breakable containers of course). The Wi-Fi internet was difficult to get connected to, but we were informed on the info sheet that it still was being created, so it was not a surprise we had troubles. The resort is located two streets behind Imperial Palace, so about 10 min walk to the strip. You have to cross vacant land (still on a sidewalk and street), and the vacant land is a little messy, and can be a little intimidating, but no problems with it. My wife and I were very happy with the resort, and felt it was a great place to hang out while we were taking a break from the other activities that Vegas has to offer, and will return again in the future.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Rogers Will","date":"2013-01-07 20:18:20 +0300"},{"content":"Resort was still under construction when we stayed, but it didn't bother us one bit. This resort is definitely 5 star quality, and if it is available the next time we go to Vegas, we will stay there again!","ratings":{"Overall":4.0},"author":"Gregorio Reichel","date":"2012-09-23 19:44:50 +0300"},{"content":"Stayed here through RCI points. We stayed in a brand new 1 bedroom on the third floor. Everything was brand new - granite countertops, nice appliances, washer/dryer. To have all the comforts of home was great. There was even a huge walk-in closet and a bathtub that could fit an entire family! The staff was very friendly and helpful when we needed directions. They also helped us get a good deal on a rental car. The location was convenient to the strip. You could walk if you want but the street there seemed a bit shady and I would not have wanted to walk through that way at night. However, the available shuttle's to Harrah's were great because it let you off mid-strip and you could walk wherever else. The pool was open 24 hours which was awesome. Parking is readily available. The balcony was great too.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Furman Kunze","date":"2012-08-31 12:46:40 +0300"},{"content":"My wife and I stayed at Summer Bay from Aug 24-31, 2009 on an RCI exchange (but they rent on a retail basis also). In a nutshell, only a great deal on pricing would bring us back—at least until the place is finished. Pros. Staff was uniformly friendly and helpful when possible. (Maintenance came to fix our microwave 10 minutes after calling—even though it was about 1 AM!). Our two BR unit was nicely furnished and looked recently renovated. I’d rate it a 9 out of 10. Grounds nicely manacured and floral. An hourly shuttle service takes you to various locations on the strip or you can simply walk to the nearest Hotel (Harrah's) in about 12 minutes. Golf carts will shoosh you around the resort if you call, but it was small enough to walk in. It was certainly quiet if that's what you came to LV for. Cons. No curb appeal at all. The front area is a construction eyesore of half chewed demolished buildings and dusty pavement (but oddly, there was not much actual construction activity while we were there). The ‘resort’ is actually a recently converted residential condo cluster of some 600 units. We’re told that the resort had been across the street but was bought and demolished by a nearby big hotel and SB took over and renovated these residential condos. Thus, sitting between this new resort and the strip is one LONG block of desolate no-man’s-land: fenced in dust and debris, some employee parking, scrub weeds. Big plans for development we’re told, but no construction as of yet. (The economy?) We walked to the strip day and night (Harrah’s) numerous times, feeling no unease, but when it’s 107 degrees and an ugly nothing, you might want to wait for the shuttle--if it's going where you want at that time--plan well. There is no gym, no club house, no spa, no consistently functioning internet, and no welcome activities. They do their best to back fill (in-room spa treatments, for example), but it’s simply an apartment you’re getting--not a resort. Lacking a finished office area, all the check-in and other resort services are handled in converted guest rooms—cramped and un-inviting. The shuttle goes to different spots at different times and is often too small for the number of passengers. There is only one shuttle per day to Von’s supermarket. The three pleasant pools/hot tubs are nestled among groups of condo buildings but are small and un-interesting (but were uncrowded). Remember, these were apartment pools, not luxurious hotel or resort pools. (But their proximity and fences would be ideal for families with young children.) The construction sign says “Gold Crown Rating” (an RCI standard of excellence) but it is not. A Summer Bay internal “Crown Club” is in the making, which will allow SB owners to get into the other 9 or so SB properties (Missouri, Tennessee, Florida…) Bottom line: If you can snag a 2-BR $249 RCI last-minute RCI special here it’s a comfortable, if a bit out of the way, place to nest for the Las Vegas strip experience. Shuttles (common everywhere in LV) make up somewhat for the heat and distance. If you’re spending many hundreds, however, look at discount packages at strip hotels. The older properties start at $39/nite. You’ll only get a cheap room, but you’ll be in the thick of the action. In 2010 there should be some relief from the dust and lack of facilities.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":5.0},"author":"Kamille Leannon","date":"2012-10-14 03:21:45 +0300"},{"content":"We stayed at this location June 12-19, 2009 and had a great time. Very clean and neat property. My only issue was that on the weekend (saturday & Sunday) the pool at our building was full so I had to walk to another pool farther away from our unit. We had a 2 bedroom unit and it had large flat panel tv's in every room. Was fairly quiet since its a few blocksaway from the main strip, but you can take the shuttle to Harrahs and be right in the action.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Daniela Nikolaus","date":"2012-05-16 01:53:28 +0300"},{"content":"Newly renovated suites are simply wonderful and very well appointed including an in suite laundry. The staff is friendly and accommodating. Only a block from the Strip - walking distance if not too hot. The resort does have shuttle buses coming and going to different locations often. Complex is still undergoing some renovation and will only become better!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Cielo Blick","date":"2014-12-16 07:42:48 +0300"},{"content":"I stayed at the old Summer Bay and loved its close vicintiy behind Imperial Palace - easy walking to the strip. I prefer the apartment syle units as opposed to a hotel room. They recently moved across Koval Lane and are still doing renovations (only three of five pools open) but the heated pools, jaccuzis, landscaping were wonderful. The furnishings were all new and toprate. In our two bedroom unit we had three plasma TVs. We ate out all the time on the strip so never used the full kitchen except for putting drinks in the fridge. We walked to Ellis Island casino for breakfast and to Tuscany casino (both off strip) for good deals. It was a dirty sight to walk to the strip with the beer bottles and litter but we could have taken the free shuttle from the resort to various locations on the strip to avoid this view. It's also nice to avoid walking through a smoke-filled casino to get to your room. The rooms could use a radio/CD player. Overall it was a nice quiet stay in spacious accomodations and I know I will be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":4.0},"author":"Rylan Johns","date":"2014-11-05 16:19:12 +0300"},{"content":"I'm always amused by some of the scathing reviews I read about this resort! My wife and I ( and sometimes with grown-up kids and friends) have stayed here on many occasions and have never had a bad experience. We have been in various rooms around the resort and some are nicer than others but were always clean with nothing missing. The one time we had a problem was when there was no hot water. They immediately sent a repair man and after an hour or so, they couldn't fix it. The front desk was very helpful and they quickly relocated us to another unit. A word of advice to those of you who complain about problems after you have checked out - if you have an issue with something, get them to fix it or ask to be moved. They will gladly accommodate your requests. We own a timeshare in Las Vegas at Peace Canyon which is a high-end resort but we seldom use it since we can get better value for our points at Summer Bay plus Summer Bay is a great location. We didn't book this year because of the resort move but we can't wait to see how the new resort shapes up!","ratings":{"Service":4.0,"Cleanliness":3.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Eduardo Walter","date":"2012-05-30 18:39:32 +0300"},{"content":"Wow, the reviews are so varied that I felt compelled to respond. We stayed at Summer Bay in June and plan to return this summer as well. We had our two children (ages 4 and 1) and felt very safe in the area and resort. Plenty of parking was right outside our door and we felt safe enough to leave the GPS in the car. It was great to be close enough to run outside and start the car to get the a/c running ahead of time- June can be very hot! We must have had an updated unit (in the Suites section) as our furniture, carpet, king sized bed, granite vanity, and appliances were new. The leather sofa sleeper had a memory foam mattress and was very comfortable. We usually have to put sofa mattresses on the floor. There were two tv's in our 1BR unit and the kitchen was well stocked, not that I'd ever want to cook in Vegas. The resort is one block off the strip so we walked to the buffets with the kids and then drove to Hoover Dam and other attractions. I liked to get my complimentary coffee and go for a morning walk before the crowds and heat hit the strip. They offer a poolside luau, but we already had plans that night. The concierge \"Scary Cary\" was fantastic with many coupons and discounts. They even printed our boarding passes before we left. I'm not saying that the other reviews are untruthful (except the one that said it's far off the strip) only that every experience is different. I also think the section within the resort must make a difference. We enjoyed the \"Suites\" but I heard that the \"Towers\" (main building) is best for proximity to pools, concierge, gym, monorail, etc. Just my 2 cents, for what it's worth.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Lilian Ward","date":"2015-01-11 23:12:04 +0300"}],"public_likes":[],"vacancy":false,"description":"Established in 1920, this is a relatively clean hotel and reasonably priced.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}