{"title":"Death Valley National Park","name":"Stovepipe Wells Village","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.xanterra-stovepipewells.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":36.60624,"lon":-117.1467,"accuracy":"ROOFTOP"},"type":"hotel","id":7387,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"Staff were very friendly and helpful. Rooms were large and clean and well appointed with tv, kitchenette, etc. Great shower. Even though this is a timeshare there was no pressure to buy. All staff went out of there way to be helpful..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ed Rice","date":"2012-02-01 08:44:03 +0300"},{"content":"My sister and brother and I met in NO to celebrate my sister's birthday. The three of us stayed in a one bedroom unit and didn't feel crowded. My sister and I shared the bed (which was comfortable and plenty big enough) and my brother slept on the hide-a-bed. Everything was clean, we didn't notice anything unusual or badly constructed in our room, and the staff was quite friendly (except one guy that we only saw once right before we left). Didn't have any problems with the elevators, and never saw the staff in them. We heard a little bit of construction noise once or twice during the day, but nothing serious. There was a full-length mirror in the bedroom in addition to the one over the sink in the bathroom (other reviews complained about lack of mirrors - perhaps this was in a studio room?). Also had no problems connecting to the internet from our room. The only real complaints we had were with the water temperature in the shower, and the shower set up in our room. The temperature rarely got above barely warm (although it was not ice cold), and only once or twice did it get anything close to hot. Also, we somehow ended up in an \"accessible\" room, and there was no separate shower in the bathroom - there were drains on the floor and the shower head was on the wall - not even a shower curtain! It would have been OK except no one else could be in the bathroom if someone else was showering - modesty aside, you would get soaked from the spray! My sister and I usually share the bathroom and one can use the sink/mirror while the other is showering, but this set-up slowed us down when we were trying to get ready and out the door for the day. We liked the neighborhood - it was kind of nice to be away from the hustle and bustle of the French Quarter. We also really appreciated having the streetcar right outside the door - saved a lot of money in transportation costs! You do need to be a little patient with the timing of the streetcars (especially late at night) and be prepared to stand when it's crowded. Zara's grocery store (a few blocks away) was the best one we found (more selection than the one St. Charles, which I think was Williams Market). Zara's is not a \"supermarket,\" but had a better selection than the other one if you are planning to do any cooking in your room. There were a few restaurants within walking distance on St. Charles, but we didn't get a chance to try any of them (we mostly ate in the French Quarter). There's also a Walgreens nearby (easy walk for an able-bodied adult). We got a nice little packet from the concierge for a self-guided walking tour of the historic Garden District homes, and this is a great option for the budget-conscious who don't want to pay for a tour. Note that only one home is open for indoor tours, and it's only open on Mondays (New Orleans Opera Women's Guild Home on Prytania St, $7 pp). Lafayette Cemetery is within walking distance and seemed perfectly safe during daylight hours (it closes at 2:30 pm). We rode the streetcar to the end of the line toward the Upper Garden District/Uptown neighborhoods, and if you go at a time of day that's not crowded so you can sit down, it was a great way to see the architecture - we thought many of the homes we saw were more impressive than the ones near the hotel that get so much attention. We took a walk in the residential area at the end of the line and saw some really cool houses. Highly recommend booking Charles Ritz Enterprises for transportation to/from the airport - same price as a cab but his vehicle is much nicer/cleaner. We were running late on our way back to the airport (and it was at the start of rush hour), but he knew the shortcuts and still got us to the airport in just over 30 minutes. Also: Our mother is a Worldmark owner, and in other Worldmark stays we've been pressured to attend a presentation, but that didn't happen here.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Felton Witting Jr.","date":"2014-07-12 01:52:12 +0300"}],"public_likes":["Cecile Morissette","Curtis Reynolds","Christine Mayer"],"vacancy":false,"description":"Motel-style lodging in Stovepipe Wells. The rooms are not fancy, and the running water in some rooms is not potable, but it is a perfectly comfortable and convenient place to stay. Rates tend to be cheaper than at Furnace Creek ($111 for a Deluxe room). Beware of the restaurant at Stovepipe Wells, though; it tends to be wannabe fancy and overpriced. Call early for reservations at the lodge. 760-786-2387","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}