{"title":"London/South Kensington-Chelsea","name":"54 Boutique Hotel","address":"54 Queen's Gate, SW7 5JW","directions":"tube: South Kensington","phone":"+44 20 7761-4000","tollfree":null,"email":"enquiries@fiftyfourboutiquehotel.co.uk","fax":"+44 20 7761-4040","url":"http://www.fiftyfourboutiquehotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4964,"lon":-0.1794,"accuracy":"ROOFTOP"},"type":"hotel","id":16456,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Just returned from a wondeful weekend at the Ames. It was my boyfriend and I's first trip to Boston and we had the pleasure of staying in a beautiful suite at the Ames. The staff is very helpful, friendly and polite and the rooms are beautiful. We were lucky enough to have suite with goregous arched windows and the bathroom had a lovely shower and a nice deep tub to take a relaxing bath. Nice flat screen tv's and super comfy beds....I'll definitely be back to the Ames in the future. Thanks for everything Nina, you helped to exceed our expectations at the Ames! Also had cocktails at the hotels restaurant, the Woodward which was trendy and the drinks were delish.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Allie Weber III","date":"2014-12-16 03:54:17 +0300"},{"content":"I booked the Ames because it looked really modern and trendy and was close to an event we had for the weekend. The front of the hotel can be easily missed because it blends right in with the other business buildings in the area, but rest assured once inside it is just amazing. On the first floor there is a restaurant and bar that is fun to go to at night. The check in was very easy and the staff very friendly. However when we got to our room it wasn't what we expected. One of the best features of the hotel is getting the glass bathroom and this one didn't have it. They quickly switched our rooms and accommodated our request. We then were in a room with a a great view of the city. The room itself was trendy with modern furniture, a large flat screen tv and a comfortable bed. This set a great tone for the weekend and the staff were nothing but helpful for the rest of our stay. I would definitely recommend to stay at the Ames.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Nikko Kovacek","date":"2014-08-03 00:57:34 +0300"},{"content":"As of today the Ames is the only hotel I'll use in Boston. The other reviews are spot-on, but I would stress three things. First, the hotel staff is exceedingly well trained with a strong focus on customer service and courtesy. Better than I got at the Four Seasons. Second, the location is beyond convenient. We could walk to all our meetings and for others, both cabs and transit are available right outside. Third, the building is beautiful. The Morgans group did an impressive job preserving the natural beauty of a very old office building. I'm really surprised that its ranking on tripadvisor isn't higher. I think it's the best.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Linda McKenzie","date":"2015-03-09 23:24:36 +0300"},{"content":"This place is just wonderful. The staff is so accommodating and the rooms are really smart and modern. It made for such a nice stay in Boston. I can't recommend it enough. It is a steal on Priceline.com.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Eliseo Walsh","date":"2013-07-15 12:29:59 +0300"},{"content":"In HK for weekend, arrived Friday very late (delayed flight from Beijing), felt frazzled but once we arrived at this sleek, elegant establishment we were - well, transported. Being upgraded to a suite was a delight. Friendly welcome from the staff. Showed us around our room, then up to 49th for midnight martinis and a cheese plate. Incredible attention to detail. Nice toilettries, several newspapers to read, minibar (not mini) had many nice wines to select from. Espresso machine. Dazzling views of Victoria Harbour. And the \"experience managers\" are terrificly helpful. This will be our new 'home' whenever we're back here.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Zoey Eichmann","date":"2013-01-07 15:15:00 +0300"}],"public_likes":["Ibrahim Lindgren"],"vacancy":false,"description":"Across the road from the Natural History Museum.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}