{"title":"Joshua Tree National Park","name":"Sheep Pass Group Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20/$35 per night","geo":{"lat":33.99967,"lon":-116.12005,"accuracy":"ROOFTOP"},"type":"hotel","id":12929,"country":"United States","city":"Riverside County","state":"California","reviews":[{"content":"Shower room make us sweet dream. Free wifi is good enough for me to play online game.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Ms. Amalia Walsh","date":"2014-03-29 03:55:35 +0300"},{"content":"We chose this hotel for its convenient location, reasonable rate, and positive reviews on TripAdvisor. We were not disappointed! We stayed five nights. The hotel is located in Kowloon, just a few blocks from the Tsim Sha Tsui metro station, the waterfront and the Avenue of the Stars, Kowloon Park, and plenty of shopping. It's in the middle of a vibrant neighborhood with lots of authentic noodle shops, delicious street stand food, restaurants/bars, and modern convenience stores. The hotel is modern and bright and although the rooms are small, they are very comfortable with flat screen TVs and a good selection of English channels, a fridge, microwave, safe, free Wi-Fi, and a hair dryer. It had all the amenities you need. The bed was comfortable and I was most happy that the room was very quiet despite the street noise below. We had a room on the 12th Floor and I recommend a high floor to ensure that you are high enough to avoid noise. The staff was helpful and polite and provided a good city map upon arrival. I couldn't get the Wi-Fi working on my phone initially but the hotel staff quickly helped resolve the issue. Although the hotel does not have breakfast, there is a great option half a block down the road called, DeliFrance. They had good bread, croissants, muffins, as well as, eggs and ham. Their set breakfast meals are an excellent deal, being about US$3-5 each, including coffee. Overall, we had a great experience. I highly recommend Butterfly on Prat!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Lonny Stark","date":"2014-01-23 04:58:38 +0300"},{"content":"i wanted to try a new hotel while in HK so i booked this place based on reviews and photos. i wasn't disappointed. pros: the ipod dock in the bedroom comfy bed! great location quiet room cool decor cons: no instructions on how to use the nespresso machine tiny bathroom compared to the size of the rest of the room odd mirror placement (hard to view an outfit outside of the bathroom) low powered hair dryer slow elevators","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Nolan Larkin","date":"2015-03-28 19:03:45 +0300"},{"content":"This was our second stay at Butterfly. This time we chose a larger room, and it was well worth it! We found the position central not only to our needs, but also the MTR which takes you everywhere you need to go in Hong Kong, but within walking distance of shops, markets, walks and attractions. The staff at the hotel bend over backwards to give service - which is really appreciated. Loved the room, large shower facility, wifi, and did I mention the service? Thank you Butterfly. See you on our next stay.","ratings":{"Overall":5.0},"author":"Seth Jacobson","date":"2012-12-09 02:00:53 +0300"},{"content":"the room is new and no any smoking smell in modern style. it's close to the town so easy to go anywhere. free wi-fi and a great service of reception.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Jackie Stoltenberg","date":"2015-12-20 12:45:02 +0300"}],"public_likes":["Dewayne Ondricka","Dominic Breitenberg","Felicita Ankunding II","Ryley Herman","Emily Corwin","Winnifred Schamberger","Marta Rohan","Kennedi Stokes"],"vacancy":false,"description":"Groups only, located along the West Entrance Road. Six sites, no water available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}