{"title":"Paris/16th arrondissement","name":"Hôtel Gavarni","address":"5 Rue Gavarni","directions":null,"phone":"+33 1 45 24 52 82","tollfree":null,"email":"reservation@gavarni.com","fax":"+33 1 40 50 16 95","url":"http://www.gavarni.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.85867,"lon":2.28269,"accuracy":"ROOFTOP"},"type":"hotel","id":21662,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I booked 3 nights at the El Cortez for two friends and I just to prove what a great hotel it really is, and they were knocked-out with the great room, service and food, just as I had anticipated. First, check- in was quick, and our Tower Strip-View room was very cool inside with outdoor temps hovering over 110... The classic hardwood furnishings and decor pleased my most particular friend. The beds were extremely comfortable. The bathroom was of adequate size, regardless what others have posted here...We're average sized guys and none of us felt confined in there. Plenty of hot water for our 3 long showers, and the drain drained properly too... The soaps, shampoos and etc were of fine quality, and supplied daily with the thick towels provided. What more could we ask for? The room was quite soundproof, and we didn't hear any noise from other guests at any time during our stay, and we slept at all sorts of hours too. The housekeepers did an excellent job of cleaning daily, so a hefty tip was in order! The casino is great for us low-rollers, and we were able to play for quite a long time on our budgets. Cocktail service was excellent too, no matter where in the casino we were. That $1 tip brings that server back often! Oh, the food was great, especially with our $5 'Fun Book' coupons. A large Prime Rib dinner with all the etc in Kitty's for $6 was primo! The breakfast buffet will have you full all day too. All the El Cortez servers were top-drawer and courteous... I now have a couple more friends to join me for a gamblin' vacation anytime for little $$$, and we highly recommend it too!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":3.0},"author":"Travon Will","date":"2014-04-01 19:11:05 +0300"},{"content":"Great place to stay. Very cordial staff. Let me check in very early without question. Tower rooms are the best deal. They are very large and comfortable. This isn't a ritzy strip type place so don't expect it to be. For a Downtown place it can't be beat. Probably not the best for first timers or youngsters but for the middle aged crowd and up it is ideal. Lots of security and very comfortable. Good food choices in all price ranges.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Linnie Predovic Sr.","date":"2014-12-25 08:22:21 +0300"},{"content":"We booked this hotel via travelworm.com for $60/nt for two nights on Dec 28-29. We got a two-queen-bed Tower Room above the garage. The room is big, the beds and sheets are clean, but the bathroom is small. It's a smoking room, but we felt comfortable and didn't sense any bad smell (we're not smoking persons). It's located in LV downtown, two blocks from Fremont Experience, and about 5-10 minute drive to the strip. They also have free parking lots, but no free internet. So far, everything is good as we spent most the times out of town and just needed a place to sleep. However, the lobby/casino area is very stinky with smoke. It's so stinky that we didn't even care to use their free $20 gambling coupon as we had to run into the lift every time we had to pass this area. Fortunately, we rent a car and could access the lift from parking lot. Overall, it's good value hotel for budget-minded travelers. If you need an up-scale hotel, it may not suit you.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":2.0},"author":"Willow Mosciski","date":"2013-07-25 03:30:00 +0300"},{"content":"Got two rooms for $49 each. It is smokey downstairs and on some of the lower floors you can smell it. It was a good way to ease into the Vegas style, where you could be overwhelmed on the strip. Cheap and open tables could always be found. People say that is in the dodgy part of downtown, but i dont think that at all. Never felt that way at any time walking around at night. They have a security guard right on the corner as well. Just one block from the Freemont Street Experience. If you want to save a few bucks while staying downtown I would recommend here.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Dr. Mabel Kautzer","date":"2013-07-27 19:06:36 +0300"},{"content":"The place seems to be remodeled. Tower rooms are spacious, well designed and clean. Staff was courteous. There is a lot of construction around the hotel but it was a minor inconvenience. For the price we found we could take a cab to the Stratosphere pool which is way nice. Close walk to Fremont Street. We never felt unsafe outside at any time of day or night. The Casino was not as upscale and peppy as Main Street Station or the Golden Nugget but again, for the price and close walk its a great place to sleep. This is an up and coming place with the urban renewal occuring in the area. The south side has a great view of the strip skyline. Take advantage of the the low price.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Maxime Armstrong","date":"2013-08-06 01:57:17 +0300"},{"content":"Plaza vs El Cortez? After seeing the reviews and the recommendations.......we chose the El. 2/8-2/12 3pm check in time, but earlier check in was no problem. We had a great room (tower) with double queen beds on the 12th floor (Rm 1207) facing the strip. With our 2-4-1 coupon found in the American Casino Guide (a must to buy, but check the book when you receive it in case there are missing coupon pages if you buy thru Amazon or E-bay) and our meager slot play return, we payed $277.20 for 5 nights for a fantastic stay. Soda and ice machines on each floor. Don't put their Vegas tap water in a water bottle to save $ from buying high cost water on Fremont St or the strip. Tap water tastes horrid but suitable to brush your teeth with. Front desk clerks were sooo nice and very helpfull. They had lost our information on our stay, so thankfully I had brought a copy of our confirmation that was done thru their web site. I recommend that everyone print it out and bring it. We asked for a fridge, which was rolled in on a nice size cart that we were able to set up our own one cup coffee maker on top of. My husband loved that . Also the love seat with coffee table which he loved relaxing on after a long day of walking. The t.v was a bigger than what we saw in the other reviewers pictures and worked great with lots of channels. Again, nice to relax to for the short time spent in the room. Plenty of super hot water, great water pressure (even during peak usage times) and tub drained quickly. No water backed up. The bathroom and large window in the room opened up (4 inches) for ventilation. The beds were soooo comfy & very clean. The curtains darkened the room so we never knew what time it was in the a.m. Housekeeping never bothered us in the morning when we had the \"do not disturb\" sign on the door. Great!! We were there 5 nights (including weekend) and thought we had the whole floor to ourselves because we only ran across two people in the hall on our last night. Very quiet rooms. The rooms (rugs, furniture, walls etc) were spotless and believe me, I checked under the mattress for the creepy-crawley things that were found, with pictures to prove it from other reviewers, in nice places like the Bellagio (mice) and the Luxor (bed bugs). Nothing to report!!! yea!!! In case you forget them, they provide shampoo, conditioner, mouthwash & hand soap. I tipped Housekeeping a couple of dollars each day, which I left on the bed with a note so they would know it was for them, and left them more on our last day. Please show them your appreciation. I also left them some 2-4-1 coupons that I had leftover from other downtown buffets which I'm sure they could use because they weren't just for players with cards. We won't be back for another year so no use to us. Feeling safe in the casino and area? Yes....for sure. They had security walking around and I played slots by myself until 3am while my husband retired back to the room to sleep. They also had security on the corner of Fremont & 6th Ave to watch the walkers coming back from the FSE. This is also the corner that we had to wait for our Grayline shuttle back to the airport, so we felt very safe. He actually seemed to know the regulars that were coming and going and everyone was very respectfull. We did Grayline ($14 pp) round trip because we didn't know at the time of our flight booking that the El also provides shuttles. If you use the El's shuttle, please make your rez with them as they request? They're not mind readers and need to know ahead of time of your needs to get you there in plenty of time to get thru the airports security. There's a \"lot\" of constuction going on in that area because the El is fixing up their front door entrance. The road is being torn up, I'm assuming because of the new Streamline condo's needs for bigger water/sewer lines. This shouldn't stop you for going to the El as the strip is also always seeing a lot of construction and it's just a fact of life in Vegas. The gift shop is open 24 hrs with munchies to buy to enjoy before bed. After doing that at 3am every morning, the security at the elevator got to know that I was done for the night and wished me a pleasant beddy-bye and never said \"don't let the bed-bugs-bite\" LOL. Sorry to say I can't comment on the food other than the breakfast buffet. You'll have to find those reviews with the others. The breakfast buffet is o.k. How can they mess up scrambled eggs, sausage, cinnamon rolls and coffee anyway. Our needs are just basic for the a.m........ \"don't stop the coffee refills!!!\" Plenty of different denominations on the slot machines with a lot of the old favorites and new ones. Yes.....even the penny \"Cashman\". They were by far, looser and more available (less people) than the strip but not as loose as the \"Fremont Casino\". One bonus round on a Fremont Cashman gave me $252. Sorry, my secret as to which one. LOL!! More hits on other machines but I won't go into them as this is a review about the El. Sorry again that I can't comment on the card tables, but other reviewers have written about them. Low bets etc. The Duece ($5 for a 24 hr pass and also good on all CAT buses if going to casinos off the strip...Rio etc) is a short one block walk from the El and FSE is a quick 2 block walk. If you ride the Duece and going to the Strip, enjoy the ride from the upper level. If you're 5'7\" or taller, duck your head up there because that's how low the ceiling is. We enjoyd the sick humor of watching people, especially the men, smack their heads when they reached the top of the stairs before they realized the ceiling height.....even though there's a sign stating it. Very funny! LOL I hope I covered everything that you might need to know about the El. I tried to talk about the things \"I\" might want to ask if I was going to try a new place and hopefully covered it all. Go to the El, enjoy its comfort & super clean rooms, feel secure and save your $ for all of the other crazy things to see and do while in Vegas. Rocky's Hun","ratings":{"Overall":5.0},"author":"Anabel Wyman","date":"2013-11-18 05:06:23 +0300"},{"content":"The El Cortez was the worst hotel I have ever stayed in. One bad experience after another. I stayed there for two days. When we got in the elevator to a pavillion room I knew there was a problem right away. When you get off the dirty elevator you are staring at a dirty window overlooking a dirty roof. This was only the beginning, the air conditioning sucked, not to mention the toilet. We saw people getting arrested and were woken up by a fighting couple in the next room. They also put a hold on my credit card even though I paid cash for the room. The staff was rude, when we saw a bell boy and we were tiredly carryng our luggage he did not even offer to take it. I will never stay there again. It was heaven to get out of there. Lori Canyon Country, CA","ratings":{"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Service":1.0,"Rooms":1.0},"author":"Dr. Icie Nolan","date":"2012-05-01 11:55:52 +0300"},{"content":"The front desk is Rude and the note efficient at all! They don't acccomadate any request even though it was already listed on the online reservation. The tower room we booked online was not given to us even though we paid for one. we got ripped off. the bath tubs were scary looking and the shower heads so low, it was hard to take a shower if you were tall. the beds were on the soft side. the rooms and hall ways had horrible smells. the only good thing was the very friendly maid. the walls were thin, you can hear things easily, even when the room above you has the shower head on. Don't stay unless you are dirt poor and have no place to sleep.","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Service":1.0,"Rooms":1.0},"author":"Lorine Wintheiser Sr.","date":"2013-10-30 07:43:33 +0300"}],"public_likes":[],"vacancy":false,"description":"In the heart of the Passy village and its fashion boutiques. It's the first independent hotel in Paris to have been awarded the European Ecolabel. Fully air-conditioned, free WiFi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}