{"title":"Ford and Etal","name":"Hay Farm House","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hayfarm.co.uk/","checkin":null,"checkout":null,"price":"From £40","geo":{"lat":55.6381,"lon":-2.09214,"accuracy":"ROOFTOP"},"type":"hotel","id":9335,"country":"United Kingdom","city":"Northumberland","state":null,"reviews":[{"content":"We have been here 4 times in recent years, the staff are friendly & helpful, quite a bit of refurbishing has been done since our last visit, super pool & adjacent areas, easy access to one of the best beaches there is, plenty of local restaurants, looking forward to our next visit.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Caden Grady","date":"2012-08-24 11:32:27 +0300"},{"content":"We stayed at the Sandcastle for 2 nights in november 2004. Enjoyed our stay from beginning to end! We had room 212, right on the oceanfront, beautiful views, even to Sunglow Pier, where our favourite restaurants for years is: Crabby Joe's!","ratings":{"Overall":4.0},"author":"Tre Heaney","date":"2015-10-12 01:23:40 +0300"},{"content":"The location of this large resort made it very convenient to drive to the Disney Parks every day (we had a rental car). For us, since we were not staying at a Disney property, the location of this Resort was a huge plus. We stayed in the North Village and it was a very quiet area. By contrast, the West Village area seemed quite busy when we were checking in. The two bedroom condo was comfortable and clean. The screened-in porch with screen door access outside was nice, though there was a pile of cigarette butts just outside the door, which should be cleaned-up in my opinion. The \"backyard\" of the condo we were in was part of one of the golf courses. The golf course was lighted for night play, which I thought might be annoying if you were trying to go to bed, but it really did not cause any trouble. I'm not even sure when the lights go off - we were all so tired after spending every day in the parks we didn't really care. It also made the stay unique. I mean, how often do you see a lighted golf course? The course was not busy and my youngest son and I had some space to throw the football around. We did not use any of the pools while we were there, but did have some food and drinks in a couple of the pool areas. The pool areas seemed nice and the food and drinks were tasty. Check-in was easy, though once we checked in they did hit you up for the timeshare sales, which we declined and were never bothered again. The resort was clean and well maintained. There was no maid service for the week (although I believe you can request room cleaning for a fee), but it did have a washer and drier, which allowed us to pack far less for the week. The condo kitchen was very minimally stocked (nothing at all in the pantry or fridge so they probablty clean out anything that is left by prior vacationers). Fortunately, Target and Walmart are close (Target was right across from the resort) and there is a Publix (grocery store) that is right at the entrance to the resort, so there is no problem getting what you need to stock your condo. We did not take advantage of many of the resort's amenities and used the place as a convenient and cost effective place to stay off Disney property. It was perfect for that purpose. From what I could tell, I imagine that you could have a wonderful stay here if you wanted to use it as a \"destination resort\" with golf, swimming pools, food, activities, etc. It certainly appeared to have everything you would need for that purpose too.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ewell Rolfson","date":"2014-04-28 13:16:57 +0300"},{"content":"We had a great time here, had been made aware of the \"time share\" experience at the check-in, but arriving late at night and after a 18hr plus total trip time I guess the advisor knew that we were not in the mood for anything other than finding our unit. The unit - excellent, very clean, plenty of room (we had the 2 bedroom type), Kitchen, dining and living area very good. Two big bedrooms, both with en-suite, showers and one even had a jacuzzi bath!! Stayed in East village, quiet, views over the golf-courses and not too far from the main \"River Island\" pool area (be aware, European and UK approach required to the sun-beds!!! - none available after 10:00hrs...) Location: as said before you are on the Bronson highway and can get held up in the traffic, but that is all that can be expected as it is on the route to Mickey land. We did experience one problem, reported it to house services and within 30 minutes some-one was there to fix it! Nothing major, minor or otherwise to complain about and we can understand why so many of the regular residents of the site are very happy and proud of it. If we come back again (to Florida) this will be on the list to choose from. Many thanks.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Waldo Treutel","date":"2014-10-20 11:16:02 +0300"}],"public_likes":["Berniece Hodkiewicz","Tiara Gerhold","Milford Baumbach"],"vacancy":false,"description":"3 room guesthouse","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}