{"title":"Thousand Oaks","name":"Hampton Inn & Suites Thousand Oaks, CA","address":"510 North Ventu Park Road","directions":null,"phone":"+1 805-375-0376","tollfree":null,"email":null,"fax":null,"url":"http://hamptoninn.hilton.com/en/hp/hotels/index.jhtml?ctyhocn=LAXTOHX","checkin":"3pm","checkout":"12pm","price":null,"geo":{"lat":34.185527,"lon":-118.908335,"accuracy":"ROOFTOP"},"type":"hotel","id":30128,"country":"United States","city":"Thousand Oaks","state":"California","reviews":[{"content":"nice hotel, helpful staff, good price. I have stayed here several times and have always enjoyed the staff and hotel room. I will say the price usually determines where I will stay in New York because I visit about every other month, for a short stay.","ratings":{"Location":4.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":4.0},"author":"Maurine Rau","date":"2012-10-20 05:23:50 +0300"},{"content":"My girlfriend and I just spent 3 nights at 4 days in New York City. The location of this hotel was more than we could have asked for. We ate at many excellent restaurants in the area, including the crooked knife across the street. The desk let us check in many hours early and leave our bags for many hours after checkout. Our room was on the 12th (top) floor and had a great view of the Empire State Building and midtown. Unlike previous reviewers, we had no indication of any smoke near our room. My girl said that on her trip to the lone, overworked ice machine on the 10th floor, she encountered a thick cigarette smoke smell, however. Unfortunately for us, the lobby was still under renovation. It is sure to be impressive when it is done. We will return to Hotel 3030 and certainly recommend it.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":3.0},"author":"Lilian Heathcote","date":"2013-04-22 06:51:31 +0300"}],"public_likes":["Nettie Tremblay","Guido West","Ms. Carey Robel","Jeremie Fritsch","Ambrose Raynor"],"vacancy":false,"description":"Guest rooms and suites with complimentary hot breakfast, WiFi, and parking. Pool and fitness center are also provided.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}