{"title":"Swansea","name":"Swansea University","address":"Singleton Park, Swansea, SA2 8PP","directions":null,"phone":"+44 1792 602403","tollfree":null,"email":"conferences@swansea.ac.uk","fax":null,"url":"http://www.swan.ac.uk/conferences/groups/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.609722,"lon":-3.980556,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":28960,"country":"United Kingdom","city":"Sketty","state":null,"reviews":[{"content":"My 11 year old daughter and I stayed here for two nights. Upon check-in, we were surprised to be upgraded to a king suite! Wow! We loved every minute...the hotel is nicely located a few blocks away from Granville Island (and a water taxi) and Granville Bridge...what a view! The pool was nice and refreshing after a long hot day, and the apple pie ala mode room service was sooo yummy! I also was thankful for the secure underground parking!","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Gaetano Howe","date":"2013-10-05 23:43:50 +0300"},{"content":"Our stay was nothing spectacular, but at the same time I don't have anything really bad to say. The beds were comfortable, there is a small pool, the front desk staff were nice, I found the area convenient...close to shopping, transit etc. The only bad experience was with the Restaurant server who i also believe was the manager. We had a visa/debit card and for those who have one would realize that if the company is not set up for visa debit- which they were not, it needs to be processed as a regular debit. Well no matter how hard we tried she insisted she needed to process it as a Visa. She would not listen. She insisted we were wrong, and she was right. This is our bank account, this is what we use day in and day out. She annoyed me beyond belief. Other then this situation we had a good stay.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Willa Hoeger DVM","date":"2015-05-22 14:35:16 +0300"},{"content":"I've stayed at this hotel in the past and it was one of my favorite hotels until this last trip. At check-in the desk clerk, Chris, was rude and embarrassed me in front of a group of people (there was a long line and check in was slow.) After he handed me the key to my room, I asked about breakfast and he informed me my room did not include breakfast. I explained that I had booked the \"Stay and Eat\" package and he informed me I did not. Then he said my room was only $89 a night and that if I wanted breakfast I could pay an additional $20 for it. I told him that I wasn't paying extra for something that was included in my package. Suffice to say, it was not the best start to my vacation. Chris told me if I could show him my reservation confirmation and PROVE TO HIM that I actually did book the package he'd give it to me...he even offered to allow me to use the business center FREE so I could get this information to him. After dropping off our bags I returned to get the key to the business center, but Chris was still busy checking in people (who looked at me like I was some sort of moron trying to get free stuff.) I asked a young woman behind the front desk if she could provide me with the key to the business center and explained that I needed to prove that I had booked the \"Eat & Sleep\" package. The young woman told me that they've had quite a few issues with the new reservation system and said that she didn't think it would be necessary for me to look up the reservation. She went to Chris and told him that she was just going to give me the breakfast coupons. He seemed quite annoyed with her, but didn't argue - which was good because at this point I was ready to check out and find a hotel where they wanted my business. The hotel accommodations are decent. The value fair. However, next time I go to Vancouver, this hotel will be off the list of options. It's kind of sad for me as I've stayed at this hotel probably more than ten times in the past and it had always been great. Must be new management or something. Chris was well dressed, but I sure hope he's not a manager - his people skills are horrific. I wonder if he's the person the other reviewers commented on. On the bright side, the hotel restaurant is great. The service for the morning breakfast was wonderful and the food yummy. Too bad the rude hotel clerk ruined the rest of the experience for me.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Robin Gutkowski","date":"2012-06-30 12:36:53 +0300"},{"content":"We stayed at the Quality Inn at False Creek for a family weekend get-away. The hotel was very nice and was reasonably priced. We had breakfast one day in their restaurant and it was delicious. One of the neatest things about the location is that it is just a 3 minute walk from the Aquatic Center which is this absolutely gorgeous huge pool in this very nice neighborhood. They also had a pool for small children. Walking a few blocks towards the water and then going north takes you on a beautiful walk to Stanley Park, and going south takes you on an equally beautiful walk around False Creek. We took the Water Taxi to Granville Island, and while it's over in a blink of an eye, it's fun for little kids, as is Granville Island. On Davies street very near the hotel there are a lot of eating possibilities--tapas, French Bakery, Tim Horton's, Greek/Italian restaurant, etc.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Julien Muller","date":"2013-01-31 14:55:20 +0300"},{"content":"While checking in, a friendly staff member suggested a rear suite(for light sleepers) rather than facing the traffic bridge at the front. And while the 1 BR suite was spacious, the trade-off was punctual trash trucks picking up dumpsters at the stroke of 7AM the two days I was there. Their write-up promised both wireless AND wired high-speed Internet(complimentary); NOT having access to the latter, I experienced the utter failure of the former, that of a weak/non-existent wireless signal which is probably poached on their unsecured network making it impossible to work by computer except to write a novel. Their first suggestion?...bring my work down to the lobby where \"the signal is guaranteed to be strong\"; yes, I dragged it down there and indeed, it did find and connect to their network but signal strength was spotty and irregular.so it was frustratingly slow at best. Finally, there was no end solution after a call from the technical department, so I did the next best thing by giving up and going elsewhere.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Keeley Will","date":"2014-06-12 05:12:49 +0300"},{"content":"The reception desk staff offered great tips on nearby restaurants and were very courteous. The lobby was clean and comfortable as was our room. The bed was very comfortable and I appreciated the fan and the ability to control the room temperature easily. The breakfast at the restaurant adjacent to the lobby was healthy and delicious.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Liliane Lockman","date":"2015-02-02 16:05:41 +0300"},{"content":"I am in in the \"customer service\" industry, myself and am very respectful of the people who carry out the jobs of delivering EXCELLENT customer service in whatever job it is that they do. When I travel I am very low profile. I make my own bed. I re-use the towels! The FRONT DESK staff were exceptional. They loaned me their stapler without the least hesitation! ( that can be a VERY big deal!) . They came up with a very suitable vase for my parrot tulips I picked up from a street vendor. The ice bucket was not doing them justice. I think \"catering\" was involved too. Thanks. I experienced a taxi driver dropping off a \"found article\" left in his cab the day before by an unknown lady who he had dropped off at the hotel. The front desk knew all about the incident and thanked the driver on the lady's behalf. Very gracious. Concierge Service. The room was large and pleasant. Great bed. Everything was just fine. All the TV channels! VANCOUVER is a great city. No matter which way you walk you'll find water. Turn \"right\" for FALSE CREEK or turn \"left\" and keep walking until you get to Burrard Inslet. Great location. Honest. It's a great little hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dr. Fabian Hyatt","date":"2012-05-14 21:55:42 +0300"},{"content":"My wife and I stayed for 3 nights and found this hotel to be fairly priced for Vancouver (expensive city). Comfortable, good breakfast and very helpful staff. Would definitely stay again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Aryanna Turcotte","date":"2014-09-01 21:40:39 +0300"},{"content":"Hotel is in great location, just across the water from Granville Island. There's also a 7/11 and a little grocery store only one block from the hotel. The rooms were very nice for the price. I paid a little over $300 for a double for 4 nights.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Angelina Beier","date":"2013-05-22 04:01:06 +0300"}],"public_likes":["Nash Smith","Myrna Dach IV","Cora Johnston","Flossie Kassulke","Bertram Robel","Miss Ellsworth Wisozk","Fay Bednar","Cleve Grimes","Octavia Champlin"],"vacancy":true,"description":"Swansea University offers accommodation to the public during Summer and Easter holidays. They can offer a wide range of accommodation ranging from bed and breakfast non-ensuite single rooms through to self-catering apartments. They can accommodate large groups for events and conferences in the local area. Accommodation is available in Swansea University's Singleton Park campus set in beautiful parklands which is 5 minutes walk to the beach.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}