{"title":"Lymm","name":"The Lymm Hotel","address":"Whitbarrow Road","directions":null,"phone":"+44 1925 752233","tollfree":null,"email":null,"fax":null,"url":"http://www.macdonaldhotels.co.uk/our-hotels/the-lymm-hotel/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.38421,"lon":-2.48368,"accuracy":"ROOFTOP"},"type":"hotel","id":37317,"country":"United Kingdom","city":"Lymm","state":null,"reviews":[{"content":"Just got back from week at this resort. It is beautiful. I would give it a 4 our of 5. Good Stuff: - Grounds are unreal and very jungle like. Keep an eye out overhead for the passing monkeys. As you do, watch you step, the paths throught the jungle are not real level. - Staff is very freindly and the specialty resturants were great (Bonsai - Japanese, Italian - Gondola & LaMarimba - Steakhouse). - Main Pool was very nice with refreshing water. Ongoing activities during the day - polo, water v-ball, arobics, etc. - Main Pool Bar was staffed by great bartenders - they worked very hard to meet everyones request. - Lobby bar was a place we all gathered every night before dinner. Nice music and calming after a long day in the sun. - Disco was hit/miss we looked in each night but found Sunday and Friday as the busiest nights - Rooms we very nice and clean - never an issue with anything. Bed is very hard which we actually liked. If you have a ground level unit, do not be surprised to see wildlife on you patio. Could Be Better: - Buffet food was just OK - which we kind of what we expected. - Swim-up bar. First let me say it has a great setting - much like a swimming hole in the jungle with a water fall. The issue is there was so much vegitation around the pool, very little sunlight gets in unless the sun is right overhead. By the way, the water in this pool is VERY cold - the coldest of all the pools and colder than the ocean. We still managed to has a few great times visiting. - We wish there was music which could be heard all around the main pool. It seemed as if it was turned way down. I suppose if it was louder some would not like that either. We would highly recommend this resort but we probably won't go back too soon as there are many other resorts in the area to check out.","ratings":{"Overall":4.0},"author":"Wilton Berge","date":"2012-12-20 19:29:08 +0300"},{"content":"We stayed at the Iberostar Quetzel hotel from 29th December 08 until 05th January 09 at it was great. We just loved this hotel and really have no complaints at all. This booking in was easy, the rooms very clean and of a high standard. From the moment we entered the hotel everything went great with no hiccups at all. Me, my husband and son of 14 went for new year and although we go away every new year I can honestly say that the Iberosatr Quetzel was one of the nicest hotels that we have been. The hotel was right on the beach which i like, and my husband and son did their PADi certificates with the diving school which was great for them as they like to keep active, they even went on the boats and jet ski's. There was plenty of food and a very good variety in all the restaurants and we ate in them all. The place were the hotel is situated is great with all the different animals running around which was nice to see, and the whole ground were kept in real tip top condition. The staff were all very friendly and nothing ever seemed to be too much trouble for them I would without hesitation return to the Quetzel for another holiday as I found it totally relaxing and peaceful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Javonte Stark","date":"2012-04-19 03:44:56 +0300"},{"content":"A COUPLE OF COMMENTS/TIPS BEFORE THE REVIEW: The vacation is what you make it…go with a good attitude and don’t stress over the little things, and your time here will be great! I want to make something very clear – Tucan and Quetzal are EXACTLEY the same resort. This threw me off when I was looking at people’s reviews, since Tucan’s are better. They are the same property and have identical rooms, amenities and grounds. This is a really great value for the money. We booked a month in a half in advance, and got a great deal. Check around on pricing because we ended up going through an agent and got a better deal with direct flights. Make an attempt to speak Spanish, they really do appreciate it! Bring a large insulated mug for drinks, bug spray, plenty of sunscreen lotion and something warmer, since one night it was VERY cold and people wore jackets. By 7am, almost all the spots on the beach were taken! We got up at 6:30am to put down our towels (which you should exchange before you leave the beach/pool every day and keep overnight to save your spot the next morning). If we did not get a spot with a palapa, they had umbrellas you could sign out at the towel hut with the towels, which opened every day at 8am. We downloaded a bunch of movies on our laptop, and watched them in the evenings, and this was a great idea. They have internet service available in the lobby and I believe its about $10 per day. I have T-mobile and my phone had no service. My boyfriend has US Cellular, and his phone worked the whole time. You do not need to exchange money! Every place you go takes dollars or Euro. If you do want to exchange, the best rate we saw was 1 dollar = 13 pesos at the airport. Off course this changes depending on the economy. We tipped maid service every day and the servers as well. They were very grateful and it was a small addition for the great service we received. Prices at the airport for food are very high ($13 dollars for a burger, fries and medium drink, $9 dollars for a slice of pizza). When you are leaving from the resort, they bring you to the airport about 2 hours before your flight, so I suggest you take some food from the resort with you to avoid the high prices. *********************************************************************** My boyfriend and I just returned from a 5 night stay at the Quetzal and we both had a good time. I have been in Mexico before as well as the Dominican and have stayed at all inclusives. I am one of those people that does thorough research before going/staying somewhere and based on on a good deal of research (which my boyfriend was sick of) and reading people’s reviews, Tucan rated very high within the price range we wanted to spend on this trip. Even though we don’t have kids, we didn’t mind going to a family resort. At this time (right before the holidays) there were not that many kids, so we were not annoyed by screaming babies…more so by loud rowdy adults if anything! ARRIVAL AT AIRPORT: Make sure you know which company you booked with since there are a lot of people selling trips and timeshares that will bombard you and tell you they are there to just help you and provide you with information. They are lying and just want you to sign up. Walk straight through to the outside and just tell them all no thank you. Outside the drivers and hotel/agency representatives hold up signs, like Apple Vacations, Lomas travel/Fun Jet, etc. so just look for your contact and they will have your name based on your resort. The ride there, depending on where you are staying, ranges from 30 minutes up to 2 hours. Since people in the van are staying at different resorts, you are dropped off from closest to furthest. We were second to last, so it took us a while. The weather was nice and we just looked out the window. You can buy cold corona in the van, 2 for $5.00. Fyi - the trip back to the airport only took 45 minutes because we were the only ones in the van. CHECK-IN AT QUETZAL The foyer/entrance area is beautiful. Marble floors, thatched roof, water fountains, it was very nice and peaceful. As mentioned in other reviews our room was not ready, but we didn’t care, since we were hungry and ready for some sunshine. We received a drink upon arrival and than went to find some place to eat. THE ROOM Our room was ready in one hour and we were in building 26, which we really liked. Our balcony faced the back, and at first I was disappointed that I didn’t have a jungle view, but we were only in our rooms to sleep, so it never bothered us at all. I read in other reviews that if you e-mailed the resort in advance they would try and comply with your request for certain rooms/buildings. We thought the location was very convenient and didn’t mind the few minutes walk to the beach and pool. FYI - there are not many rooms with an ocean view, and most are given to honeymooners. The inside of the room was as expected and just like the pictures. It was clean and décor was very 90’s. It was completely fine and had everything we needed. The outlets were American, so we didn’t need converters, the TV had channels in both English and Spanish, and the mini bar was stocked with beer, Sprite, Coke, Fanta and water. I’m sure you can make special requests, but we were fine with what we had. The fridge is restocked every 2 days. THE GROUNDS The resort grounds are really great! They have a jungle setting with monkeys, turtles, peacocks, ducks, flamingos, swans, and other birds, turtles and little fuzzy animals that kind of look like beavers/rats/squirrels (without the tails). We are both huge animal lovers and didn’t feel that any of the animals were abused or unhappy in any way. The setting there is ideal for them and there is plenty of cover, water and food. Employees are always cleaning and trimming, so the grounds are very well maintained. THE BEACH It was surprisingly nice! I had read reviews about the “whales” in the water which are there to help protect and allow for rebuilding of the beaches. People mentioned not having space to swim, however after walking along the beach, the resort has the best beach space! The sand was clean, and there were not many whales/sand bags blocking the swimming area. We were lucky that we only had chopy water one day and it wasn’t too bad, and the rest of the days the water was calm, warm and a pleasure to swim in. FOOD Tucan and Quetzal are mirror images of each other. With one main buffet area on each side and a smaller eating areas on each side by the beach – all serve the same food. They also have four specialty restaurants, and based on the reviews we read, we ate at the Japanese and steak house at 8:30, which was a great time since the shows didn’t start until 9pm, they did have a pre show every night that started around 8:30pm. They also had Italian and Mexican. Being from Chicago and living in the city, we have a ton of AMAZING restaurants, so we were not impressed by the food served at the 2 that we chose. They were both fine, but the steakhouse was definitely better…The service in all the places was very good. We tipped every day. The breakfast buffet at the main restaurants was really great with tons of options. I had guacamole and salsa every day for breakfast, lunch, and dinner! The bartenders are accommodating and can take direction well if you want them to make something special that they have never made. We really liked the mojitos and always asked for the better alcohol. If you don’t ask, you’ll get the cheap stuff. I suggest bringing an insulated mug for a large morning coffee and a bigger drink. Their serving cups for beverages are fairly small. Having ice cream in the pool are right near the beach was great, and they had a variety of options every day. The coconut was really yummy! SERVICE As I mentioned everyone there is very nice and helpful, and they do appreciate efforts to speak Spanish. Mine is fairly good and they were really impressed, and seemed to try even harder to please us once I spoke with them in their native tongue. ENTERTAINMENT I think this is based on people’s taste and experiences. One thing for sure is that they work hard and try to entertain. The evening shows were amateur, and we ended up leaving most of the time before they were finished. Some of the singers were good, others….well, should have kept to dancing/performing. I liked boogie nights, and my boyfriend liked the folk dancing, and we both liked karaoke. ACTIVITIES We just kayaked and snorkeled, which did not cost extra. They have windsurfing and scuba diving available for an extra charge. EXCURSIONS Based on reviews we did the Tulum Extreme/Mayan Extreme Adventure which lasted from 7:30 to 3:30. We went to the Mayan ruins at Tulun which were beautiful, and then into the jungle to repel, and zip line (almost 2,000 ft) and snorkel in a cave. Lunch was included, and we had a very good time. Bring your camera, because you can take pictures. The do have someone there taking pictures of you, and will offer you a CD with the pics for $25. We went through our travel rep and I know we could have received a better deal if we went directly through the company. We paid $96 per person plus tips. If you have a bigger group, you should get a good deal based on numbers. Again, check prices with other sales reps and even on 5th avenue. The rep makes commission, so they won’t always be the most honest. Isla Mujeres is supposed to be wonderful, but we ran out of time. This is a great beach destination and has received great reviews from my friends that have been there. We walked to 5th avenue, and it was about 30-40 minutes from the resort (walk) or $5 via taxi. Very touristy and tons of souvenirs and restaurants, including Starbucks and Burger King. Prices went up a lot on food and souvenirs both, and the stores won’t budge on the prices of souvenirs. NEVER pay what is asked at the smaller individually owned stands, and quantity always allows for better deals.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Arno Abbott","date":"2015-03-18 04:07:49 +0300"},{"content":"My husband and I just got back from our Honeymoon at Iberostar. We had a fabulous experience. The hotel is nestled around a lush tropical forest and the view from any room is amazing. There are beautiful exotic animals everywhere too. Our room was immaculately cleaned daily and the double headed shower was quite enjoyable (we're thinking of installing one at home now.) We liked having our own private balcony, but the beds were pretty firm. We spent most of our days poolside, though the beach was very clean with plenty of beach chairs and shade. There was also a wide variety of nonmotorized water sports, but I will warn you there were a few topless women here and there (which I was surprised by since it is a family resort.) The pool is HUGE and its really nice because it slopes down from like 3 ft to almost 6ft. There are a ton of fun pool activities available all day long, that everyone is invited to join in, but if you choose to just relax, the pool is big enough that you won't be bothered by loud games. We loved the adults only pool, which was a bit cooler than the other pool and had a swim up bar. All of the pools close at 8 for cleaning, but by that time we were ready to do eat anyways. I would recommend going to as many specialty restaurants as possible for supper. The Japanese restaurant was AMAZING! The food at the buffets for breakfast and lunch is not gourmet, but it is good, and there is plenty of selection. We also went down to 5th avenue which is only $5 cab ride or you can rent a scooter for $40/day. There is a lot of really nice clean market area there and its also a lot of fun to go there at night for a cultural night out on the town. We enjoyed celebrating the Mexican Independence Day there. I also treated myself to a fabulous massage at Iberostar Spa. They offer a variety of reasonable services and also offer free sauna and hot or cold jacuzzi. We booked several adventures through Lomas travel at the hotel too. There is a van that picks you up and takes you to a marina about 30-45 min away where you can go deep sea fishing, spinning, snorkel, parasail, ride 4 wheelers, ride horses, jet ski, etc. Our last night there we went on a romantic dinner cruise where we got to see the sunset on the ocean then we came back ashore to a scrumptious 5 course candle-lit dinner on the beach with live saxophone music and dancing. It was FABULOUS! I would highly recommend it! If this sounds amazing and your considering a trip to PDC I would suggest that you bring a couple things that we forgot: mosquito repelent and a floatie for the pool. Other than that all you need is your bathing suit, and your sure to have a good time!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Murl Jerde","date":"2015-05-19 14:46:20 +0300"},{"content":"WE HAD A GREAT TIME. Six adults and six children (ages 15 to 19). Food was good, not great, it was the best that we have had at an all inclusive. Pools were good, would have enjoyed the swim up bar if it would have been attatched to the main pool. We could always find a place to lay out. The beach was about as good as it gets. Lots of sand, enough shade and beach chairs for everyone. The sand bags provided for a great place to play on. Iberostar has done the best job on reclaiming their beach. We learned to scuba dive in the pool and then went on a great short dive. We felt like the instructors were very qualified and looked out for our safety first. The location was great. It was a 5 minute, $5 cab ride into Playa which was great. The service was outstanding from top to bottom. We would all go back.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Floy Murphy","date":"2014-12-16 16:53:20 +0300"},{"content":"I'm an event coordinator that had a friend and a client get married this spring at this resort. Both brides and both grooms were very happy with their wedding. Mayra, the wedding coordinator, was great. The entire staff was accomodating, flexible, and extremely helpful. Each couple was able to personalize their wedding for 70+ guests at each wedding. Mayra is VERY prompt at returning emails, which made the planning smooth and seamless. The resort's beach was under construction, but no one seemed to notice. The massive sand bags that extended out into the water looked like rocks at first and people actually used them to their advantage, jumping off and sunning themselves on them. We didn't really have an issue getting chairs for the 70+ guests when we moved poolside. The food was good for an all-inclusive resort and the service at every restaurant/buffet was great. We had heard complaints regarding the hard beds, but didn't notice ourselves. Overall, I would recommend this resort for a vacation, especially if you come with a group of friends or family. I would also highly recommend this resort if you are interested in a destination wedding. It is by far the easiest to correspond with and they work hard to personalize your wedding.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Elnora Mueller","date":"2014-01-17 16:16:46 +0300"},{"content":"We stayed at the Quetzal over the Easter holidays for 1 week. We were originally booked at the Grand Puerto Real and moved the first day we arrived. The Iberostar Quetzal was absolutely fantastic. We loved everything about the hotel. From the check in to check out the staff were more than accommodating. The hotel was full however our tour company was able to get us a standard room that was great for our family (2 adults & 12 year old). We were in the 2700 block that backed on to the nature reserve. Right outside on our patio, we had monkeys swinging, flamingos, peacocks etc. The only problem was how loud the peacocks are, however, we got use to it. Pool lounges were hard to get, obviously people get up way earlier than our family, but were always able to get a chair on the beach for the day. Food was good, the ala carte restaurants were the best, they let us in even without reservations. I see that this website rates it as a 3 *, we felt it was a 5* based on the other five resorts that we have stayed at over the year in Playacar. I would highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Archibald Mueller","date":"2013-08-25 22:46:26 +0300"}],"public_likes":["Magnolia Klocko","Trevor Trantow","Dannie Feest","Jaycee Cole","Rozella Predovic","Sigmund Oga","Jesus Wilkinson"],"vacancy":true,"description":"A McDonald Hotel, AA 3 star. During the 1966 Football World Cup the Brazilian team stayed here!!","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}