{"title":"Sonoma","name":"El Pueblo Inn","address":"896 West Napa St","directions":null,"phone":"+1 707 996-3651","tollfree":null,"email":"info@elpuebloinn.com","fax":"+1 707-935-5988","url":"http://www.elpuebloinn.com","checkin":"15:00","checkout":"12:00","price":"$150-$250","geo":{"lat":38.29366,"lon":-122.47584,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":27821,"country":"United States","city":"Sonoma","state":"California","reviews":[{"content":"We booked two suites at this property for a week. The suites are big enough, but lighting is poor, furniture uncomfortable. Nice TV's though. My grandson enjoyed the pool--no one was ever there. The staff was very friendly and responsive to any request. There was a managers reception on only one night of our stay--not every night like our past experiences with Residence Inns. The parking is a nighmare---not enough conveniently located, and the gate often does not open. There is a call button, which will get it to open--but it is a hassle. Our bill was charged for multiple daily parking fees, although we only had one car. Check your billing carefully---overall I expected much more for the price--we could have had individual rooms at another property for less. The location is convenient. This property needs some updating---the price is based on location only--not what you get in ammenities. The breakfast seems to rotate every two days---eggs in a bag and lots of carbs! Long waits for the waffle maker. The strength of this property is the staff, which exceeded expectations. We would probably not stay here again should we return to the area however, as it is not a good value relative to the cost.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Danial Spencer","date":"2014-09-03 14:20:10 +0300"},{"content":"Good service, the room is simple but well decorated, the bed, sheets, pillows, were comfortable. The employees are kind, overalls in the restaurant during the breakfast, always willing to help. The location of the hotel is excellent!! either for business or vacations like it was my case, there are restaurants and stores very close, a lot nightlife action!!. The breakfast is very complete and comfortable area. My only complaint is about the elevator that is extremely slow, we had to wait up to 10 minutes to be able to ascend, since we were in the floor 5. I would recommend it to any person.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Delpha Cole","date":"2015-06-15 00:44:34 +0300"},{"content":"Good deal for the price Our stay at the Golden Nugget was very pleasant. Our room was clean and quiet and the staff friendly and more than eager to address our needs. The manager gladly offered us another room because the first room we had needed a lot of work even though we were only there for three nights. He explained that nothing had been done to the place because they were unsure if it would be sold and torn down. Now, that their future is secure, he said, improvements are on the way. The location is perfect; steps to the beach, a variety of stores and restaurants across the street, and public transit at the front door. It is definately not a Hilton or a Sheraton but for the price, well worth it. We will be going back.Mona  Maurice RoyToronto, Ontario","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":5.0},"author":"Aniyah Ryan","date":"2012-10-02 17:55:38 +0300"},{"content":"My favorite part & service of this stay was the bellmen & valet service. Gustavo & Sebastian were superb with their service, direction and hospitality. Not a bad location but a car is necessary to explore Miami. Our 2 bedroom apt was fine. The buffet breakfast included in our package was limited and the hot food warm at best. Would most likely not stay again.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Mylene Deckow PhD","date":"2012-01-21 03:31:09 +0300"}],"public_likes":["Augustine Mertz","Kip Monahan","Coby Buckridge","Yesenia Block","Eldora Ziemann"],"vacancy":false,"description":"A comfortable inn with a Santa Fe feel. Further from the Plaza, a cab, car or bike would be ideal. The more affordable mid-range option compared to it's neighbouring Best Western. They offer a pool and hot tub, 24-front desk services, and a complimentary continental breakfast. Know someone who lives in Sonoma? Have them make the reservation for you - they offer a locals discount!","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}