{"title":"Fontainebleau","name":"Hotel Napoleon Fontainebleau","address":null,"directions":null,"phone":"+33 160395050","tollfree":null,"email":null,"fax":null,"url":"http://www.hotelnapoleon-fontainebleau.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.40433,"lon":2.70046,"accuracy":"APPROXIMATE"},"type":"hotel","id":9294,"country":"France","city":"Fontainebleau","state":"Île-de-France","reviews":[{"content":"The Florida hotel was excellent for our conference. Staff were friendly and efficient. It has its own bar/restaurant serving good food - and a Starbucks - and a convenience store - but is also joined on to a large shopping mall that sells more or less all you would need - lots of food place, jewellry, clothes, drug store etc.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":3.0,"Rooms":5.0},"author":"Fritz O'Keefe","date":"2014-11-13 23:41:33 +0300"},{"content":"I am most fortunate that I stay at this hotel regularly on business. Apart from its central location to all the main attractions and shopping, I find this hotel to be one of the best in Florida and why?? The staff are just absolutely wonderful. They just cannot do enough for you to make your stay as enjoyable as possible. I stay at this hotel at least once a week and the staff make you feel as though it is your first time staying there. So jovial and amazingly friendly without being over the top. For value for money, amenieties and friendliness of the staff. I vote this one No.1 in Florida. You will not be dissappointed in any way if you stay at this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Aiyana Jast Sr.","date":"2015-12-04 14:58:41 +0300"},{"content":"The level of customer service is wonderful, and the fact that it is right at the Mall makes it easy to shop - even for those loast minute items that is needed. It has a complete conference center, and the rooms are spacious, clean and well organized, I would definitely stay here again, and recommend others to do so.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Daisha Bogisich","date":"2013-07-26 15:22:15 +0300"},{"content":"My room was clean (BIG PLUS) and very roomy. The hallway was quite with no running and screaming children or grownups at all times of the night. Very pleasurable stay and I really enjoyed being able to shop without having to get in a vehicle and drive to another location. Wish more folks were this considerate.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Brent Gutmann","date":"2014-10-15 00:25:24 +0300"},{"content":"Rooms were nice, beds were commfy, pillows were awesome. Nice flat panel TV, lots of good cable stations. In room internet (ethernet, not wifi, so good speed). Nice fridge, AC worked good too. Service was excellent, everyone was just super, super friendly! Hotel restaurant was very good, staff there was very accommodating. And happy hour every night 5-9, two for one drinks and two for one appetiziers. Each appetizer was a whole meal. Bring a friend to share!!!! Also very large clean warm swimming pool and comfortable lounge chairs. Private and secure too! And since it is connected to the Florida Mall, it has easy access to plenty of shopping!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Olaf Block","date":"2012-07-05 18:10:33 +0300"},{"content":"We had a wonderful experience at the Florida Hotel and Conference Centre. Hotel is very conveniently located (near many of the theme parks) and enters directly into a large Shopping Mall. The staff were friendly, courteous and helpful. The Rooms were nicely decorated and clean. The","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Mavis Conn","date":"2014-06-23 12:28:59 +0300"}],"public_likes":["Celia Huel"],"vacancy":true,"description":"Until 1849, when the railroad arrived, this address was that of a coach house. The hotel has been repeatedly redesigned and renovated. For two decades, &quot;La Table des Maréchaux&quot;, the restaurant of the Hotel Napoleon, has been under the care of Chef Antony Assis; it offers traditional French cuisine.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}