{"title":"Penzance","name":"Shoreline Guest House","address":"17 Marine Terrace, The Promenade","directions":null,"phone":"+44 1736 365821","tollfree":null,"email":null,"fax":null,"url":"http://www.shorelineguesthouse.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":50.114312,"lon":-5.537223,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":22096,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"We stayed at the Inn during our Christmas vacation. It was wonderful. The staff, both front desk as well as housekeeping, were pleasant and very accommodating. (Polly in particular was a doll!) The breakfast treats were fresh and delicious and the cookies they left in our rooms were amazing! The room was lovely complete with a fireplace and vaulted ceiling. The location was perfect for our first trip to Napa, as there were tons of great vineyards in the immediate area. Twomey, was one of our favorite small tours. Castillo di Amorosa was especially interesting as it was a reconstructed Italian Castle! Amazing! The Wine Spectator Greystone restaurant, part of the Culinary Institute of America is right down the road also. We had a great meal there. Also great for casual dining we liked Pizzera Tra Vigne right at the Inn. Across the street is Taylor’s Refresher, a great old fashion drive-in, recently featured on the Food Network’s \"Diners, Drive-ins, and Dives.\" Worth the wait in line! Our stay was magical and helped to make for a very memorable holiday.","ratings":{"Overall":5.0},"author":"Josiane Jenkins","date":"2015-12-13 02:58:09 +0300"},{"content":"Excellent Service; Friendly, Accomodating Staff; Great Value We took the bus from the main train station to the hotel. The hotel is located in the midst of a lovely olive grove, which is a wonderful setting, but that means the bus stop is not close to the hotel. If you have cumbersome luggage, be prepared for a tedious 10 min. hike. Aside from the jaunt from the bus stop (which they cannot be faulted for since their setting is delightful), we have absolutely no complaints about the hotel. The staff were accomodating and acquired reservations to the various museums for us upon request. We dined once in the evening at the hotel's restaurant and enjoyed the entire meal. They even let us sit by the fire place with our wine after the restaurant had closed down - they just asked that we turn out the lights when we left. The hotel rooms and living areas are furnished like a home - cozy and inviting. To top it off, the price is a steal. We highly recommend Villa Rondini (oh, and you can get great views of the city from the hotel gardens and grounds).","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Noemy Zieme","date":"2012-11-11 01:01:32 +0300"},{"content":"I was visiting relatives with my wife and children in west London and stayed in this hotel for 8 nights. The location is excellent, everything is within walking distance, the prices unbeatable, the rooms were very clean and the staff were friendly. The price also included breakfast which was continental. The reception was open 24 hours. We do recommend this hotel and we will definetely come back.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Emmie White","date":"2015-09-21 19:57:05 +0300"},{"content":"I had to stay at this hotel because all the others nearby were fully booked. The Continental advertises cheap rooms in the London Evening Standard, but when I rang up the cheap rooms were not available and the man who answered the phone at the hotel was rude to me and said they were fully booked. I then called in at the hotel, where I was offered a cheaper room - but still not as cheap as their adverts. The room itself was dreadful. The radiator didn't work so I could not regulate the temperature. The tiny television only had one channel. There were no towels in the bathroom, which was cramped and filthy. The hotel is very noisy and seems to be right next to a main train line as trains were thundering past all the time. Avoid this place at all costs. I told the man that was rude to me on the phone that I would be writing a review and he said go and do it. I sincerely hope he is reading this.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0},"author":"Maxwell McLaughlin","date":"2015-05-28 13:36:26 +0300"},{"content":"Dauphine is in a perfect location. It's one block north of Bourbon Street and a sanctuary away from the crowds. They have some of the most comfortable beds that we've stayed in in the Quarter. The continental breakfast has a good selection, but shorter hours than other hotels we've stayed at in New Orleans. We really enjoy our favorite bartender, Lisa. We visit her when we are in town. Their bar is an old brothel and is a relaxing setting. They also have a nice poolside garden setting. The hotel is clean and comfortable. I recommend it highly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kamille Kris","date":"2013-06-10 21:51:05 +0300"},{"content":"We stayed in the Hermann annex across the street from the office and had a beautiful room upstairs with exposed brick and beams. The mattress was a memory foam that was so comfortable it prompted us to come home and buy one. The breakfat offers everything you couldimagine and far surpasses the routine breakfast that is included with most hotel and motel stays. From here, you can walk almost anywhere in the Quarter or downtown.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Gabriella Stracke","date":"2013-06-25 01:52:49 +0300"},{"content":"Overall we liked the ascetic of the rooms in the Hermann house. They have exposed brick and beams, track lighting on a dimmer switch, non-ugly carpet, modern bathroom/vanity area, and sooo important for older buildings: good water pressure in the shower! Tempurpedic beds - some may not like that - we didn't mind. No complaint with cleanliness. However, we did put the card out to request new sheets one day and didn't get them. Staff is generally good. One guy provided a great recommendation for a place to get delivery dinner on a night my boyfriend hurt is back and we couldn't walk around too much. The continental breakfast does the job. Cereal, hard boiled eggs, yogurt, juice, and various breads/pastries. Waffle station, but we didn't see anyone attempt to use it. Available till 11 on the weekends and 10 weekdays. We did have some noise issues carrying in from the street, but not bad. More annoying was the yappy dog in the room two doors down. We finally called the front desk around 1am and they confirmed they are pet free hotel and would send security. Whether or not they did, we're not sure. And would guess the owners were probably still out clubbing so not much the staff could have done anyway outside of kidnap the dog. But it did eventually quiet down, for whatever reason, and we think they checked out the next day. Note: the Carriage Courtyard is where the breakfast room is located. We peeked in one room while it was being cleaned and they do look really nice as well, but you might get foot traffic noise from people going to and from the breakfast area.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Ulises Swaniawski","date":"2013-03-31 02:07:33 +0300"},{"content":"I really like this hotel. We were 2 adults, a teenager, and a 5 year old. Our room was in the back and it was perfectly quiet and clean. Not terribly large, but comfortable. The breakfast was nothing to write home about but we were satisfied. The location was good and close to everything we wanted to see and do. There was a discrepency on our bill when we checked out. Make sure you you print out the confirmation with discounted rate if you have one, if booking in advance. It was fixed immediately and easily with that one piece of paper! The staff is great!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Heaven Turner V","date":"2012-01-04 00:39:12 +0300"},{"content":"We loved this hotel The room was in the main hotel - we had asked for a quiet room after reading some of the reviews and ours certainly was. It was a little dark but then in January that suited us fine. The town was extremely busy with revellers as there was a key match on at the dome but we heard none of it. The front desk were most helpful we had arrived very late after a delayed flight but they could not do enough for us. Also when asked about trips etc. The hotel was advertised as bed only but the complimentary breakfast was more than adequate and beautifully fresh. A real bonus. Altogether this hotel made our break most enjoyable","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Leon Stehr","date":"2012-04-04 20:24:35 +0300"}],"public_likes":["Kay Emmerich","Jasmin Quitzon","Christian Considine"],"vacancy":false,"description":"On the seafront with amazing sea views.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}