{"title":"Hadrian's Wall","name":"The Old Repeater Station","address":"Military Road, Grindon, Haydon Bridge, NE47 6NQ","directions":null,"phone":"+44 1434 688668","tollfree":null,"email":null,"fax":null,"url":"http://www.hadrians-wall-bedandbreakfast.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.02487,"lon":-2.28888,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":10850,"country":"United Kingdom","city":"Northumberland","state":null,"reviews":[{"content":"VeioPark hotel had to impress me a lot for I expected it to be perfect: according to these woderful reviews it had. TY TripAdvisor:-) It had. The hotel is the cleanEST I have ever seen both in its design and rooms, the baths are luxuries [you do not expect 3* to be the Ritz accomadation] and has all the little thigns we like to use. All facilities are included. Price is more than fair. Buffet is great. Personel is very kind. ok, Location is 40m far from Rome, but in a 1EUR ticket you get there. If you are old and cranky, if you do not like the 40m\\1EUR train, do not use the hotel. What amazed us most was room service. It was wonderful. They [If I knew their names] folded our pijamas and formed my wifes sweaters in a human form. This kind of service I have never seen. Thank you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Araceli Daniel","date":"2012-04-15 00:52:49 +0300"},{"content":"After our wedding in Pozzili went up to Rome for a couple of days.Picked this hotel as I had a car and didnt want to drive into the middle of Rome.The ringroad around Rome was a nightmare,so poorly signposted.The hotel itself was modern,but tastefully done.The breakfasts very very good.The only downside was it was a good 20 minute walk to the station,I know I picked a hotel on the edge of Rome,but it was a hike to get any transport into the centre.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":3.0},"author":"Monica Boehm","date":"2014-08-28 23:00:23 +0300"},{"content":"I visited Madrid, Spain in 2011. It is one whole square & the structure is simply amazing. It does look old from far, but a lot of history is made at this place. I also heard the ring area was used for bullfighting scenes? There is also tons of souvenir shops just around the corner, & stepping into one...it seems the whole country is very passionate about their football.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Rozella Funk Jr.","date":"2013-08-14 10:46:47 +0300"},{"content":"This is a wonderful chance to be in the city that never sleeps but still have your safe lovely street in Harlem!, looking like it is in an english little town. We were really surprised by this lovely guesthouse, friendly hosts and so easy to get into downtown New York! Although we stayed in Harlem, what might give you the idea that it would not be safe? We never felt unsafe at any moment, we came back late in the evening, walked through the neighbourhood, did our shopping and had nice contacts with the people. Also, in the direct neighbourhood very lovely nice, affordable, hip, restaurants! Just take the 163 street Metro and you will be in Manhattan in a short while taking the express train! We will be back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Rafaela Franecki","date":"2012-03-23 10:03:04 +0300"}],"public_likes":["Margarette Herman","Jasmin Kautzer","Lesley Muller","Adolphus Conn MD","Ben Pouros","Theresia Lind","Garnet Bernier","Keira Leuschke IV"],"vacancy":true,"description":"Bed and Breakfast close to the middle section of the wall and offers very good accommodation, good food, good beer and is only a short walk from the wall.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}