{"title":"Half Moon Bay","name":"Pacific Victorian Bed and Breakfast","address":"325 Alameda Avenue","directions":null,"phone":null,"tollfree":"+1-888-929-0906","email":null,"fax":null,"url":"http://pacificvictorian.com/","checkin":"3PM to 6PM","checkout":"12PM","price":"Rooms:$150 - $195","geo":{"lat":37.49214,"lon":-122.456987,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":10904,"country":"United States","city":"Half Moon Bay","state":"California","reviews":[{"content":"The Standard is painfully hip being in the heart of the Meatpacking District. Staff are friendly and helpful, and were good problem-solvers for us when our baggage went missing. Expect to pay for what you get: beautiful floor-to-ceiling views, comfy beds, good service, and top-of-the-line design elements in your room. Would recommend The Standard to those looking for \"something special\" and who are willing to pay top dollar.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Randi Jakubowski","date":"2014-05-26 01:50:56 +0300"},{"content":"I usually stay at the Ganesvoort, but I thought I'd give the Standard a try. The basic hotel room was small, and the shower had no door. The closet was also small. As opposed to a few other reviews, I found the staff to be friendly enough. The floor below the top floor lounge was noisy. The bass of the speakers reverberated through the ceiling. This wouldnt have been so bad, but they dont even let you in to the bar! (They say guests are allowed in before 9 pm, but who the $@!#% wants to go to a bar in the Meatpacking District before 9 pm?? What a joke.) Another thing that's odd: the hotel straddles the High Line, but it has no access to the High Line. You have to walk south a few blocks to get to it. Odd. There's nothing wrong with the hotel itself, really. But at the Ganesvoort they let you up to their popular bar and pool if you stay at the hotel. Most hotels try to make their guests feel \"exclusive\". The Standard manages to do the opposite. Next time, I'll probably just return to the Ganesvoort....","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Jaiden Abernathy","date":"2012-11-29 02:59:29 +0300"},{"content":"As part of our 50th anniversary celebration, we stayed for two nights at the Standard. From the moment we arrived we found everybody (bellhops, reception) to be friendly warm and professional. We were upgraded to a corner room on the 15th floor with the most spectacular views thru floor to ceiling windows. Bed was very comfortable and to wake up and have the views was fabulous. Went to Top of the Standard and had drinks and more incredible views. The beautiful and friendly servers added to the experience. Even the loo had views. Allin all, for a special treat, this is a very special place in a very happening area!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cheyanne Langworth","date":"2012-01-17 07:37:49 +0300"},{"content":"The Standard Hotel's location is perfect. But when you sleep in the rooms yu hear the people in the hallway and when they bang the doors, it's really noisy. The service is bad, the stuff is unfriendly- as if friendlyness is not cool or so... The Standard Grill is a nightmare- bad, bad service, it was like a comedy we were just waiting to the tv show host to jump out. Food was good, but that didn't help anymore.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":5.0},"author":"Milo Runolfsdottir I","date":"2015-11-26 11:37:32 +0300"},{"content":"We just recently stayed at the Standard for a quick get-away to NYC. We arrived a little early but were able to check in and they even upgraded us (without our even asking). The room was amazing - views of the Hudson River and down to the Statue of Liberty. The room had a wrap-around banquette across from the bed which was a nice touch. The TV was mounted to the floor right in front of the windows which was odd since it blocked part of the view. The bath was split on either side of the room as you walked in, with the shower/bath tub on one side (with a great louvered window to see the view) and the sink and toilet on the other side. I understand set up design-wise but it wasn't all that practical since the sink area was very small and the shower area had no door so water ran onto the carpet. We went to the lounge at the top of the hotel for a drink and snacks before the theatre (love the elevator art installation). It was retro-fun with a wonderful view (take your sunglasses). It was nice but a little chaotic - it felt like they didn't have the seating plan down yet. It is set up like a lounge so the tables were jumbled and and the wait staff kept pushing us to one side or the other trying to decide what table we were sitting at. Service was anything but invisible which was distracting. The menu was limited but nice. We had never stayed in the Meatpacking district before so weren't sure what to expect. We were really interested in seeing the HIgh Line and this was a great way to experience it. The park is beautiful - they did a phenomenal job on the design and details. The whole area was packed with shops and restaurants and had a really good energy. Access to subway and taxis was good so we could get around the city easily.","ratings":{"Overall":4.0},"author":"Dr. Kristian Hand","date":"2012-11-01 13:42:14 +0300"},{"content":"The Standard Hotel is a modern & unique hotel. The staff is very courteous and friendly. The room was small but comfortable. I didn't like the glass wall between the shower & bed. I prefer privacy when showering. The location of the hotel was convenient to subways and I felt safe in the neighborhood.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Brandt Willms","date":"2013-02-26 08:28:21 +0300"}],"public_likes":[],"vacancy":false,"description":"An elegantly decorated Victorian style Inn 1½ blocks from the beach.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}