{"title":"Death Valley National Park","name":"Furnace Creek","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$18 per night during the winter season and $12 a night during the summer","geo":{"lat":36.4631,"lon":-116.86875,"accuracy":"ROOFTOP"},"type":"hotel","id":7388,"country":"United States","city":"Furnace Creek","state":"California","reviews":[{"content":"I booked this hotel because I was looking for a great deal in New Orleans and boy did I find it. The hotel was better than I expected it to be and me and my husband was extremly satisfied. Staff was very friendly and helpful I have already pass this hotel information to my friends so that their stay can be just as great like ours. Job well done staff of the Avenue Plaza Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Louisa Borer","date":"2015-05-21 18:36:58 +0300"},{"content":"My wife has a timeshare we used here. The reviews on TA seemed positive, so we were in for quite a shock. We were given a room on the second floor that was similar to many of the pictures online, minus the bathroom. There were towels in the hallway from the time we check in until we checked out. The room stunk..we had to turn up the A/C to make it even bareable. The whole place seemed dirty. There was a security gaurd checking all the closets that didn't make us feel very safe. The consiegre lady was very helpful booking the tours. The topper was the shower design. It was open and faced the toilet. When I turned on the shower and it sprayed all over the toilet and soaked the toilet paper. Even though our stay was included in the timeshare, we checked out and headed to a hotel in the French Quarter. I would not recommend this place, and despite the street car, I would recommend staying in the Frech Quarter because you can just walk everywhere.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Rhiannon Haag","date":"2015-03-30 07:27:41 +0300"},{"content":"I didn't know this was a time share or member ownership resort as they like to call it. I agree with a previous review on the rooms. I stayed on the 11 floor and the room was nice, next to the elevator, and not disturbing at all. They don't clean your rooms unless you are a member owner, so if you want clean sheets they will send extra to you room, but I had to make the bed myself, Extra towels well you need to wash them at any available washing machine which is free. I asked for extra towel twice and they never sent them to my room. Check in was painless and quick The valet staff is very nice some of the front desk people were snobby. Arvette. I think that's her name checked us in, very friendly and knowlegeable of the area. I would stay here again get area and right at the street car stop. nice resturants in walking distance. nice view of the city on the skydeck","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Laila Osinski","date":"2012-11-22 18:47:18 +0300"},{"content":"The Avenue Plaza is a renovated older building that is kept very clean with helpful, pleasant staff that don't mind going out of their way to meet your needs. The bathrooms have been upgraded and are quite nice. The rooms have a kitchen that helps you save money, if you are inclined to cook. The first room I was given had a nonworking air conditioner but I was quickly changed to a room with everything functioning properly. The only thing I didn't like about this hotel was that the hallways were dated and kind of dismal. The Avenue Plaza is a timeshare but also rents rooms to non-time share people. The cost for three nights was $500. The hotel is located in the Garden District, away from the activity in the French Quarter. This made for a quieter stay but made touring the French Quarter more difficult. The St. Charles Ave. trolley stops in front of the hotel but you must be prepared for the walk from Canal St. into the Quarter. If you plan to go to the French Market, it is a bit of a walk to get there. I paid $60 something for valet parking at the hotel and then drove my car to the Quarter so I wouldn't have to walk so far. I had to pay $13 for parking each day in the lot along the river on Decatur St. I took the trolley one night because I was eating dinner near Canal St. and it was more convenient than driving. The Avenue Plaza is convenient to the zoo and good restaurants in the Garden District. Overall, I would recommend this hotel if you are ok with not staying in the French Quarter. The staff is extremely helpful and kind.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Tia Stracke II","date":"2014-03-24 09:21:47 +0300"},{"content":"We stayed here using a family members time share allotment. It was wonderful! We were hoping for one of the larger rooms with a couple beds as there were 5 adults, but we ended up getting a studio with one king. Three of us slept in the king and we brought a blow up matress. (we were prepared) All the roll away beds were being used but they gladly brought us up more sheets and blankets for our blow up. The king bed was very comfy. Parking is extra, but I must admit having to not worry about parking, walking to the car, and safety was really nice. Just call down before you leave and valet will bring your car around. They did seem to be a little understaffed as the guys doing valet were also bell hopping which delayed our check out. We eventually just went down to get the luggage carrier and brough all our bags down ourselves. It wasn't so bad, but they kept telling us someone was coming and they hadnt. The room was very nice. There was a small table and chairs, the kitchen seemed fine but we only used the fridge and toaster mainly. At the end we put everything we used in the dishwasher (soap provided). The bathroom was updated and you could def tell. The show was soooo great! It had a large shower head that poured straight down and also had the option to switch to a smaller head that was detachable. The toilet seat was uncomforable and too small for the toilet. We complained upon check out and were told they were aware and working on it. Apparently it was some big fiasco when they remodeled?? The pool and hot tub was a little small, but had a nice patio surrounding. The gym was huge and well equipped. We loved the location of the hotel. It was right down St Charles street which is close enough but far enough from the action. We never took the trolley but it was right there if needed. It was very popular and we saw many people took advantage. The hotel is connected to a resteraunt but they were closed during our stay. Nextdoor though is a small place called Igors which is a bar, grill, laundromat, and game room. We went there one evening and the drinks and atmosphere was very nice. I really have no true complaints about anything. I would gladly stay here again and recommend to anyone.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jillian Reinger","date":"2012-03-08 03:52:38 +0300"}],"public_likes":["Romaine Upton","Miss Heath Upton","Jimmie Lebsack","Destini Bailey","Allison Dare","Hassan Kassulke","Providenci Feil","Miss Berneice Trantow","Oran Champlin"],"vacancy":true,"description":"(Year round).  Located 196 feet below sea level, Furnace Creek has 136 sites with water, tables, fireplaces, flush toilets, and dump station. No showers, but nearby Furnace Creek Ranch offers pool and shower for $5 per day.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}