{"title":"Offa's Dyke Path","name":"Station House Caravan Park","address":"Station House, Bodfari LL16 4DA","directions":null,"phone":"+44 1745 710372","tollfree":null,"email":null,"fax":null,"url":"http://www.stationhousecaravanpark.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.21978,"lon":-3.36053,"accuracy":"ROOFTOP"},"type":"hotel","id":21031,"country":"United Kingdom","city":"Bodfari","state":null,"reviews":[{"content":"We have stayed here several times, at least once on the concierge level. This time we just had a standard room, typical Marriott, comfy beds, nicely furnished, granite countertops, single serving coffee/tea maker, mini frig, about average size for a hotel in the heart of the city. The location cannot be beat - the T is right outside, as is the harbor, the aquarium, the (very good) Legal Seafood restaurant and, of course, Quincy Market and the North End. Even the tour buses and harbor tour boats are right there. Also positive - great view of harbor from our room, a new lobby with a very welcoming bar/restaurant, with tv screens everywhere including some for your private viewing in the booths. A few negatives - no newspaper delivered to the door, USA Today and WSJ are available in lobby but no local newspapers. Would be nice to have the Boston Globe to check out local events and get a feel for the city. For the first time, our stay here was very noisy. We are silver Rewards members with standing request for quiet room, which has always been honored in the past. Our room was on the fifth floor, but it fronted on the atrium, right over the bar/lounge/restaurant. Not sure if they had a convention meeting there or just a large crowd, but it was noisy well into the night. I would definitely ask for a room away from the atrium if we return, and stay elsewhere if they couldn't guarentee it. Also, they charge for internet use, even in the lobby and the business center. They do have computers in the business center for free use, but center is not very private (no door, and it's open to the lobby). I also found that I could not navigate on their computers as I would on my laptop, there seemed to be some limitations -- and I was not trying to access any racy sites!! Just gmail, trip advisor, and some event listings. The towels were also extremely thin, not at all up to the standard that the price of the room would suggest. The room lacked a magnifying mirror, which is surprising with all the business people (incl women) who stay there. Altho the new lobby was nice, we did miss the seating near the Starbucks downstairs (the ground floor has just Starbucks, registration & lobby are up a flight). Before the renovations there was seating for Starbucks so you could have breakfast there or relax with coffee and pastry in afternoon. Now it is \"to go\" only, so you'd have to bring your coffee and treats back to the room or eat/drink on the go. Wondering if they eliminated seating to encourage guests to have breakfast in their newly renovated restaurant??","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":5.0},"author":"Caesar Rempel","date":"2015-05-26 09:54:25 +0300"},{"content":"I have been to this location before children a number of times. However, did not realize how unsafe the inner balcony design was until my 22 months old son tried to climb. We almost lost him, I just turned around for 2 seconds to open the hotel door when I saw him half way up on the balcony. There is no safety measure built under, so it's a straight drop to a few floor down. It was a scary experience. Tried to write and talk to someone in the hotel regarding this matter but no one seemed to notice or care. Also, there were a lot of drunken people being very loud outside the corridor in the middle of the night.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Travon Little","date":"2014-07-23 03:16:22 +0300"},{"content":"We had a wonderful time staying at this Marriott. We stay in Boston quite often, but usually dont stay right down on the water. We had the kids and thought this would be fun. This hotel is wonderful, right across the street from teh aquariam, shopping, and food vendors. Parking was also very, very easy as they will valet everything. It was surprisingly easy to get to, but we knew how to avoid the traffic. We did see some of the notes regarding the construction, but to be honest, we never heard a thing. Looking forward to going back","ratings":{"Location":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Louvenia Harber","date":"2014-10-16 23:22:18 +0300"},{"content":"We took the kids to Boston for a sightseeing weekend to kick off summer break. I debated whether to reserve two rooms or pile into one room. We have one pre-teen and two teenagers. I ended up reserving one room and requesting a roll away. We arrived very late on our arrival day (nearly midnight) and were relieved the roll away was already in our room. The hotel was under renovation, so felt compartmentalized and rather plain, but the cleaning staff added her own sense of sparkle to our stay which dramatically improved our opinion of the hotel. (Smiles, fresh towels, spotless room, etc...) The location was picturesque and easy. You can hop on the T literally right outside the door and there were dining options within steps of the hotel. One evening, our tired kids grabbed dinner across the street at Quincy Market and headed back to the hotel while my husband and I had a leisurely dinner at Legal Seafoods, also across the street. We did not spend a lot of time at the hotel, but found it convenient and comfortable for our stay. Positives: location, comfortable beds, excellent staff. Negatives: a little noisy.","ratings":{"Cleanliness":5.0,"Sleep Quality":3.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Reginald Goodwin Jr.","date":"2012-04-10 07:52:42 +0300"}],"public_likes":["Josh Dooley","Malcolm Cummerata","Golden Muller","Wellington Hilll","Rachael Walker","Bertha Heaney","Marcella Conroy IV","Teresa Smith"],"vacancy":false,"description":"Campground with a local pub nearby.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}