{"title":"Chippenham","name":"The Pines (B&B)","address":"81/82 Marshfield Road, Chippenham, SN15 1JR","directions":"Exit ''M4'' at Junction ''17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi. At the roundabout, take the 1st exit continuing straight onto ''Malmesbury Road(B4158)'' for 1.2 mi. At the roundabout take the 3rd exit, turning around the ''The Bridge Brasserie'' onto the ''B4069'' for 282 ft. Continue onto the ''New Road(A420)'' (joining one way system) for 0.1 mi, get into right hand lane. At lights follow road around to the right [follow sign for ''M4''] staying on ''New Road(A420)'', after 79 ft joining ''Marshfield Road(A420)''. Another 700 ft hotel will be on the left","phone":"+44 1249 461212","tollfree":null,"email":"bookings@thepineshotel.net","fax":"+44 1249 443579","url":"http://www.thepineshotel.net/","checkin":null,"checkout":null,"price":"Rooms from £25, late bookings available, includes full English Breakfast","geo":{"lat":51.4623665,"lon":-2.1218231,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5844,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"not a good room experience Did not like the room i got. Payed $199 dollars for it. Received a corner room. Only 6 inches of room to get inside the room because a bed dresser was in the entrance way next to the bed. the bed was facing the window. Bad feng shui for chinese people. Bathroom was good. But terrible room layout. I couldnt get my luggage through the entrance that i had to pick it up so i wouldnt hit the dresser with my luggage. I will never sleep at this place again especially at a rate i paid. I should of just stayed at Clarion near the airport where i've stayed before and paid half the price and received a larger room. Customer service was okay. Nothing special.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Buford Hodkiewicz","date":"2013-01-09 20:55:29 +0300"},{"content":"Could be a great hotel, but... I thought this hotel would be much better based on the reviews. It's true that the lobby is spotless and when you're there it seems like it will be a great stay, but it seems like they gave, like, 75% effort on our stay. Some of the disappointments were:1. No ice bucket. Had to call downstairs and wait 15 minutes for one to be brought up. (Isn't there a checklist of some kind for the housekeeping staff?)2. Broken shower bracket meant I had to hold the shower thing by the handle the whole time. An almost relaxing shower.3. Sliding glass doors to balcony is shared with the room next door. Before you jump out of bed, swing the curtains open and say Good Morining San Francisco! be sure to check the folks from the room next door aren't looking into your room. Also, the balcony sliding doors where unlocked when we arrived which means if we hadn't checked, we'd have left all our stuff in there totally accessible by the next door neigbors via the shared balcony.4. Bare wall patch where they had done some repairs in our room, but not repaired enought to paint or paper over. Oh yea, very Zen spackle job there.5. Security Risk - although there is a sign when entering the hotel through the totally Public parking garage in the basement saying someone will have to buzz you into the hotel... we just parked, opened the door to the hotel and took the elevator directly to the 10th floor and our room! How can you ever trust a knock on the door for room service after that kind of a security hole in a major city?Anyway, this is a nice location and the lobby and decorating hint at superb service, but it's like the management is alseep at the switch, so you get good service only when a particular staff member feels like it... 75% of the time.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Elvera Yost","date":"2013-05-28 09:01:33 +0300"},{"content":"Excellent stay!!       View out of north sliding door (14th floor)","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Giovanny Mraz","date":"2014-02-25 15:49:50 +0300"}],"public_likes":["Crystel Dooley","Donny Nikolaus","Rory Labadie","Michele Murray","Vernie Wiza"],"vacancy":false,"description":"The Pines Hotel is fully licensed and prides itself on its home cooking and friendly atmosphere. Over 20 rooms, wireless internet, private car park and wheel chair access. There are facilities for small conferences, wedding receptions and private functions. A beer/patio garden open all year. New restaurant serving Greek and Cypriot cuisine, the Chef is Greek national","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}