{"title":"Birmingham (England)","name":"Castle Bromwich Inn","address":"1200 Chester Road","directions":null,"phone":"+44 121 694 6700","tollfree":null,"email":"reception@castlebromwich-inn.co.uk","fax":"+44 121 694 6701","url":"http://www.castlebromwich-inn.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.51,"lon":-1.798,"accuracy":"ROOFTOP"},"type":"hotel","id":3626,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"What a great stay at the OMNI. The only hotel I stayed at that had free wifi, large rooms, and a great hot tub. The service at the front desk was impeccable and even switched my room to a double bed suite when I found out a colleague was going to be staying with me. (At no charge). You have a customer for life. I will be staying at the OMNI in Dallas next","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Greg Reichert","date":"2013-12-03 03:41:11 +0300"},{"content":"The service was wonderful (front desk, bell staff, doormen, housekeeping), the fitness center was very clean and up to date, the pool and hot tub are tiny and at peak times PACKED with kids. When my boys went down closer to closing time, all the little ones had gone to bed and they enjoyed the pool. The location on Michigan Avenue is perfect. Unfortunately, the neighboring building is expanding upward about 20 feet (maybe less) from your windows on the south side of the building. So, if view is not important to you, this remains a fantastic hotel. If seeing a concrete wall right out your window is disconcerting, either make sure you reserve a room type that faces Michigan Avenue or consider other options.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Ruby Wilkinson","date":"2015-08-13 20:57:30 +0300"},{"content":"Beware those traveling with your children who think you will have a seperate living space when the kids are asleep in the \"other room.\" All of the pictures online indicated a seperate sleeping area with a door. We specifically chose the Omni for this feature so that my friend and I could be in another room while our young daughters slept. There is a seperate sleeping area, but our room had no door, despite specifically requesting one. When we called to ask for a room change, another room was not available to us. Also, we asked for cribs and a refrigerator to be in the room and even called ahead of time to verify the requests we had through our online booking. Despite our efforts, the cribs and a refrigerator still were not in the room when we arrived. Housekeeping quickly did bring them to the room, but while we had planned ahead, the hotel had not. We will not be returning to the Omni Chicago with our young children.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Miss Kennith Erdman","date":"2015-02-06 10:46:13 +0300"},{"content":"Very classy, hospitable, and impeccable service from the moment we stepped out of our vehicle. We were treated like royality. We stayed the weekend for the Lights Fest in Michigan Ave. They had gifts for our children. We were accommodated with early arrival. Michigan Ave. are at the doorstep. We took a nice walk then went to their Boardroom and viewed the parade in nice cozy festive room with hot chocolate, coffee, hot cider & cookies galore! They went the extra mile to prepared our sheets & children's bears . Thank you Omni for making great memories for our children!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Duane Turcotte","date":"2012-10-08 17:39:49 +0300"},{"content":"We have just returned to Ireland from the Omni Hotel Chicago and all i have to say is excellent...from the moment we entered the lobby the staff were just so friendly they couldnt do enough for us. We stayed at the Omni for 3 nights and the only regret i have is that we didnt stay longer, our room was just amazing spotless with all the extras. The location is just perfect right on Michigan avenue where you will find plenty of shops ranging from designer shops to retail shops suitable for all. The city of Chicago was amazing and to top it all the weather was just fab. I would return to this hotel without question and if i ever get the chance to return to Chicago i would certainly be returning to the Omni Hotel Chicago...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Norma Smith","date":"2013-01-25 04:36:18 +0300"},{"content":"My mom and I just took a long weekend getaway downtown for our usual mom and daughter trip each summer. We decided on the Omni Suites Chicago and boy am I glad we did! One top thing I noticed was the outstanding customer service. From the computer help desk I was connected to when I had a question using my wifi, to the men out in front helping us get taxis. They were very friendly and courteous. The room was very cozy and spacious. The bathroom was great as well. We had a nice view of Michigan Ave. as well which we loved. And the room was super clean. In some places you stay, you notice bed fabric torn or a stain on the ceiling, but our room was pristine. The only thing that was annoying was the pocket door leading into the bedroom from the bathroom. Every time we got up to use the washroom in the middle of the night, it makes a lot of noise. Also-the bedroom could use another lamp, such as a floor lamp for more lighting. But otherwise what a cozy room !!! And I have to add that the breakfast buffet is awesome! I will definitely be back to stay for sure. Great location and great price!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Santino Kuvalis","date":"2014-01-06 02:07:40 +0300"},{"content":"The Omni is a good quality hotel in the Magnificent Mile district. The rooms were comfortable and quiet. The staff was very responsive -- they were able to switch our room immediately when there was an unexpected plumbing problem.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Wilhelmine Hegmann","date":"2015-06-17 12:43:33 +0300"},{"content":"Liked many things about this hotel. The quality of the service provided by all staff was very impressive. Location is awesome and loved the suite aspect to the rooms.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Darrel Leuschke","date":"2015-07-04 13:58:15 +0300"},{"content":"Great location and super helpful staff. I would definitely stay there again. The lobby is not that spectacular but the room was perfect and we had a great view. Booked on hotwire and there were no glitches at check in.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Kayli Champlin","date":"2015-01-18 01:32:38 +0300"}],"public_likes":[],"vacancy":false,"description":"A former Holiday Inn Express by the M6 motorway in Castle Bromwhich, west of Brimingham","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}