{"title":"London/Hammersmith and Fulham","name":"Grantly Hotel","address":"50 Shepherds Bush Green, W12 8PS","directions":"tube: Goldhawk Rd","phone":"+44 20 8743-4345","tollfree":null,"email":"grantlyhotel@gmail.com","fax":null,"url":null,"checkin":null,"checkout":null,"price":"£67","geo":{"lat":51.5032,"lon":-0.2226,"accuracy":"ROOFTOP"},"type":"hotel","id":16169,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Don't Get All the Bad Reviews My husband and I just returned yesterday from a 5 night trip to the Riu Bambu. I just don't understand how some of the reviews can be so very negative. Just so you know something about us - I travel in the States extensively for work (Federal Gov't), so I don't get to stay in hotels that are considered, by vacation standards, to be be more than 2-3 star hotels, we both ride motorcycles and love to fish. I love to read, love the tropics and beaches. My only request when traveling is that I have a clean room and clean sheets on my bed. My husband hunts and plays golf but not much of a travel-type person; therefore, tends to be a bit more high maintenance when we do travel together. We both were very pleased with our stay at Riu Bambu. We stayed in Building 3 in Rm 312, second floor - very close to everyting and located on the left side of the resort (looking in from the beach). We had an issue with the air conditioning not working, called front office and within minutes, literally, it was repaired and we had more air than we needed. One afternoon the hot water wasn't working. A pipe had broken and the whole building was without hot water. We called, they came, we went to the beach. By the time we came back they had already exposed and repaired the pipe and hot water was working - this took less than 3 hours. By the time we came back from dinner, same day, the hole was filled in and plants were replanted and you couldn't tell anything had ever happened. - alot quicker than we are having the water pipes fixed from recent storms here in Maryland (USA) (two days and counting)!!!! This is not a new resort and things can break down; however, never was an issue and definitely did not affect our vacation. This resort is absolutely beautiful, spaceous, and the location is the best on the beach. I have seen most of the Caribbean and this beach was the most unique in that it had a forest of palm trees right on the beach. The beach was very wide and there was plenty of open sunny places on the beach as well (for all us sun worshippers). Never had a problem with finding chairs. Everything was very clean and never had a problem with cleanliness in the room or anywhere else. The food was good for us as we are not picky and only there for 5 days. We did not get sick, which was my greatest concern since we both like to take advantage of eating different foods and drinking all the specialty drinks. Took a Pepto Bismal chewable tablet every morning and started taking acidophylis two weeks prior to trip and during. Doctor prescribed cipro (antibiotic), just in case, but didn't need it.The beds were a bit hard, but oddly enough, neither of us minded it. We took snacks for the room but never ate them, as we weren't in the room long enough to need them. We even took some small battery operated fans to cool off on the beach - what were we thinking?! - the breeze was constant and perfect on the beach.Took our own towels but never unpacked them. Never a problem with towel thieves.Left tips everywhere we went because that's what we do, but didn't notice that anyone was treated differently - service with a smile and Hola for everyone - and we did notice more people did not leave tips than did - too bad.My only regret on this trip was that it was way too short. We will definitely go back to the Riu Bambu and, for the life of me, I don't get the bad reviews!!!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Judson Powlowski","date":"2015-08-10 01:40:38 +0300"},{"content":"Two thumbs down for the Riu Bambu - Beds...Harder then a slab of concrete and the mattress had a ton of nasty stains all over it. I took cushions off the pool chairs to make the bed bareable.- Pillows...I swear the pillowcase was filled with newspapers. I never knew a pillow could be so hard.- Curtain...Covered in black mold.-Pool-Cloudy and the water was dirty. The swim up bar seats were slimy.-Food- Horrible! Your best bet is to eat dinner at the buffet and that sure doesn't say much. -Beach- This was really a beautiful beach. The beach was really clean!- I am not sure what the rooms look like but, the Riu Palace was 1,000 times nicer from the outside and the inside of the hotel then the Bambu.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":2.0},"author":"Cecile Legros","date":"2014-09-24 00:48:16 +0300"},{"content":"Just back- April 12-19- Loved it ! Just back from Riu Bambu. April 12-19- fantastic time!Our first time to Punta Cana and just loved it. Apple Vacations charter with Ryan Airlines out of Boston, direct to Punta Cana. A very relaxing week, we did no excursions.I must say, I don鈥檛 know where some of the complaints that I鈥檝e read about are coming from. They must be extremely picky and unhappy people. We could find no fault.FLIGHT: Flight was delayed an hour coming and going, which was annoying, but other than that, no complaints. Movie shown during the flight, had to purchase headphones for $5 unless you had the foresight to bring your own. They sold sandwiches for $5 each, also, complimentary beverages and some chips. AIRPORT: Departed plane on the tarmac, which was a treat, stepping out into balmy air. For some reason, they held us on the ground for awhile before allowing us to proceed into the terminal. We paid out arrival fee of $10 per person, found our baggage and apple rep fairly quickly, and were on our way to the Riu Bambu at 10:30 pm. The driver dropped us off first. RESORT/ROOM: Check it was quick, they assigned us Bldg 28, which was fine. I鈥檇 emailed requesting Bldg. 25, but as it was close enough, didn鈥檛 say anything, as they had the papers all made out in advance. We were quite happy with our room, a very short walk, and it was very clean and all you need. There was a crack in the wall up near the ceiling, but heard from someone who stayed at a better resort, that their wall had cracks too. Overall, it was very comfortable, the beds were firm, but we got used to them. We were very glad we鈥檇 brought our pillows, as suggested. I don鈥檛 know what the complaints were about regarding the bedding. I thought the sheets and bedspread were fine, and of a perfect weight for the air conditioning. . Bedspreads could do with updating to a pretty floral, perhaps, instead of the rather dull blue. The only other preference would have been for a bureau instead of the desk with 6 small drawers, but after hanging as much as we could, we had plenty of room. Bath towels were plentiful and nice and thick, as were the pool towels. LAYOUT OF RESORT: We absolutely loved the smallness and layout of the resort. It was such a short walk from room to lobby and on the the pools and beach. We explored all of the adjacent RIU鈥檚 as well as the Iberostar, and despite the grandness of some of the others, would prefer to return here because of the size. DINING: We never did get to try one of the ala cartes. One day the Steak house was available, but not till 9pm, so we decided to stick with the buffets, which were fine. Food was good- some nights great, and you could always find something you liked to eat. Breakfast was our favorite with omelettes to order and yummy croissants, pancakes and French toast were wonderful also. I was disappointed in the desserts. They looked beautiful, but all tasted the same, rather bland. We ate lunch at Mamajuanas after the first day. POOLS; The only thing I wish they鈥檇 had was a 鈥渜uiet pool鈥?for adults. The children鈥檚 pool was right next to the main pool, and the towel game was on in full force. But since we preferred quiet, we stayed under the palms on the beach. I was surprised at some women going topless around the children鈥檚 pool. I thought that was supposed to be reserved for the beach, but people just don鈥檛 care!BEACH: The beach was spectacular, and after walking the beach all the way to the beach markets, feel ours was the biggest and best, even over the larger hotels. Plenty of sun loungers available. We spent all our time there, a short walk to the bar.BARS: Bars were great- always cheerful and accommodating in whatever you wanted. SHOPPING; We walked up the beach vendors one day, and were a bit disappointed. After hearing from everyone, including our Apple rep to offer a third of what they quote, we found that they would not even take $5 for a tshirt- they quoted $10, which is what the gift shops in the resort were asking, so bought them there instead. I did get a set of Larimar necklace, earrings, bracelet for $25. He started out asking $65. Bought one of the small paintings at the resort with the Taino symbols on it for $10. STAFF: We found all the staff very friendly and helpful. Some didn鈥檛 speak any English at all, which wasn鈥檛 a problem until I was trying to ask the masseuse if she could shut the hut鈥檚 door for privacy. I finally gave up, figuring to just let it go- there was much more being exposed on the beach than what might be glimpsed of me getting the massage! Animation staff was wonderful- always something going on, but if you didn鈥檛 want to participate, they left you alone. DEPARTURE: Quickly went through checkin and security with no problems as mentioned on previous posts regarding luggage weight or going through bags. They didn鈥檛 even have us remove our shoes, and never looked in a thing. Again, they walked us out on the tarmac to board, holding us up at one point for a while again, for some unknown reason, and then boarding from both front and rear of plane. Immigration and Customs was effortless at Boston. OVERALL: We absolutely loved it and would consider coming back to this resort again. It鈥檚 not the grandest, but size trumps opulence for us, in this case!","ratings":{"Service":4.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Ashtyn Hackett","date":"2015-08-08 23:32:56 +0300"},{"content":"Please read before booking it was terrible, outdated for only being four years old. the staff was so rude unless you gave them a tip! The tubs/shower wERE so small. The food was good but it did not offer variety. They played the same music over and over again. There shows were good but redundant. Cleanliness was great. The beach and weather was just perfect. Don't expect to go into town. We paid $70.00 to be taken to a supermarket. they do not have markets to buy souvenirs. The hotel products are very expensive. Drinks were very water downed. Expect to walk far to your room.","ratings":{"Service":1.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":1.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":1.0},"author":"Amya Bogan","date":"2015-05-30 00:13:59 +0300"},{"content":"Love It! My family and I have travelled to the Riu Bambu twice (once in August of 2001 and again in March of 2007). We love the Riu Bambu. It is an amazing place to stay. For all of you out there who are worrying about all the negative comments, IGNORE THEM! The Riu Bambu is amazing, just like any other Riu hotel because the chain is fantastic. My mom and I are actually travelling to Riu Vallarta next week which is in Puerto Vallarta. We have been to many Riu's, such as this one, Riu Palace in Cabo San Lucas, as well as Riu Cancun (the name says it all).Food, ENTERTAINMENT (#1), Beach, Service..its all amazing!If you want good entertainment, go to the Riu Bambu in Domenican and NO WHERE ELSE! EVeryone else from the Palaces would be at the Bambu at night getting the best entertainment!Overall, the RIu Bambu is amazing and we were going to return this year but we are going to try something new! However, most likely next march break I will be returning with a group of friends!Enjoy your stay everyone!","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":1.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Effie Champlin","date":"2012-09-25 04:00:00 +0300"},{"content":"Never again ! We were staying in Riu Bambu from February 10 to February 17. Our agent charged us for 5* hotel but it supposed to be rated as 3-3.5* maximum. This hotel is for budget people-everything is very simple-small rooms, the same food all the time, beach towels are very old with allots of spots on it. I would never stay there agan.Chicago, USA","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Heber Stiedemann","date":"2015-04-29 18:15:56 +0300"},{"content":"Riu Bambu leaves a lot to be desired After the excitement of booking this trip, the actual visit was a letdown.Rooms 鈥?upon arrival we had small spider/aphid like bugs in our room and asked to have it sprayed. This was done right away and worked for a few days, but needed to be re-sprayed and there were always a few around. Beds very firm, pillows very thin and hard. Bathroom water pressure fine, but rust around tub. Food 鈥?Well, the hot food was hot, the cold food was cold. Not much variety from day to day. Yes a few dishes were different every day, but was very repetitious. Having said that, you could always find something to eat. A la Cartes 鈥?the Caribe Grill is fantastic, but you have to be in the lobby to line up to book by about 6:50 a.m. Steakhouse 鈥?so so.Bars/seating areas - very crowded, not enough room for everyone. On a popular show night, we sat at the table by 6:30 p.m., then ate our meals in shifts so we could save our spot. Otherwise by showtime there was absolutely no place to sit.Front desk staff 鈥?Friendly, English not a problem while I was there. On one occasion we needed to call our Sunquest Rep and asked to use the desk phone. We were asked to pay for the $2.00 connection fee. When this came up while talking with our Sunquest Rep, we shouldn鈥檛 have had to pay. The clerk was probably pocketing the money. Our Rep arranged a gift from the hotel for the inconvenienceAnimation team 鈥?AMAZING!! They work so hard and are happy all the time. Very friendly and mingle with the guests all day.Beach 鈥?WOW!! Not one rock in site, however water very rough. Out of 14 days 9 were red flag, 4 were yellow, and 1 was green. Had to be at the beach by 9:30 to get a lounge chair. Is it a 5 star? Not a chance. Would I go back? To the Dominican 鈥?yes in a heartbeat. To the Riu Bambu 鈥?no. As a matter of fact I was so disappointed, I will not go to another Riu in any country.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":2.0},"author":"Junior Abbott","date":"2012-12-08 23:58:22 +0300"}],"public_likes":["Niko Hane","Abdul Effertz","Glenna Crona"],"vacancy":false,"description":"No-frills budget hotel in an converted Edwardian house. Single, Double and Family rooms available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}