{"title":"London/East","name":"Newham Hotel","address":"349-353 Romford Rd, Forest Gate, E7 8AA","directions":"rail: Forest Gate / tube: Wanstead Park","phone":"+44 20 8534-8400","tollfree":null,"email":"info@newhamhotel.co.uk","fax":null,"url":"http://www.newhamhotel.co.uk/","checkin":null,"checkout":null,"price":"From £44","geo":{"lat":51.5469,"lon":0.0276,"accuracy":"APPROXIMATE"},"type":"hotel","id":16113,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Amazing 2 weeks at a brilliant Hotel This Hotel is amazing. It is a must for anyone looking for a fantastic relaxing holiday with activities on hand if you want them. The all inclusive nature means that you don鈥檛 take any money with you as all food, snacks, drink, water sports, and activities is included. We had the best time and are definitely planning to go back.  Travel Company: We flew with Direct Holidays through My Travel and paid for an upgrade to Premier Class. The flight was great and the upgrade was well worth it for the free drinks and extra legroom. However the crew were a bit snooty.  The Staff: The staff go out of their way to ensure that you are happy and encourage you to join in with all the activities such as aerobics, darts, shooting, football etc. The 鈥榮tar friends鈥?organise the day activities and at night put on shows in the theatre, which are great, fun and good to watch whilst sipping on one of the many cocktails.  The Food: The food was amazing and I'm a very fussy eater but every night was spoilt for choice. The main buffet restaurants are full of salad platters, meat platters, and have an amazing array of hot foods. The speciality restaurants are also great and the beach side steak restaurant was fab. At lunchtime you can chose to eat either in the buffet restaurant or down at 1 of the 2 beach bars/restaurants. The drinks are great to; good wine, beer and all the iced cocktails are to die for. Everyone tells you to beware of buffet style servings and not to eat fruit or veg, but we ate it every night and weren鈥檛 ill once during our 2 week holiday  The Rooms: The rooms are great and the junior suite that we had was huge. There is a slight musty smell, but I have found this in many hotels in tropical resorts due to the humidity. All you need is to pack a small fragrance candle and the scent of that will solve the problem.  The Activities: After eating so much every day, all day, I had to keep my size 8 beach body trim so I did the aqua and beach aerobics. It鈥檚 great fun and a good 30 mins of exercise. The tennis courts are also included in the price and the courts are great to play on in the late afternoon.  The Pool  Beach: The pool is huge, and very clean. There is a slight problem with early rises reserving sun beds, but my advice is head to the wonderful beach. Usually we are pool people, but the sand is so nice and white and the water fairly clear that you鈥檒l probably end up there every day. Plus there is a lovely breeze that comes of the ocean that you need to cool you down, cause it is hot!!! Unlike neighbouring hotels, Iberostar Dominicana has parasols for shade on the beach and the seaweed is cleaned away from the sand every morning.  This hotel is 1st class, and you will not be disappointed.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":-1.0,"Location":-1.0},"author":"Gaylord Smith","date":"2014-06-05 19:19:19 +0300"},{"content":"Loved it and will go back I have just come back from Punta Cana Domenican Republics, and I stayed at the Iberostar Domenicana. Let me first off say that the hotel was paradise, it was beautiful and big, and comfortable. The people (waiters, waitresses and animateurs) were fantastic. They made sure that my vacation was great. The animation team was also spectacular, always doing activities, and inviting us to dance and participate in the shows.The food was everything you would want.. from seafood, to meats, veggies, and fruits. I never ate the same thing twice. If you do go I recommend you try the oriental and tropical restaurant. The weather was very very hot... it rained once but for 5 minutes.The room itself was spaciaous and clean at all times. The whole hotel is actually kept clean at all times.. the grounds are constantly attended, and you feel like in your own little world.I would go back to Punta Cana in a second, especially to stay at the Iberostar.I do not have any compliants, but if you are going with children many europeans go topless, it took some getting used to.I recommend this hotel to anyone who wants to visit Punta Cana. It is a Paradise resort.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Jazmyn Olson","date":"2014-10-29 15:49:22 +0300"},{"content":"Not a Great hotel-Horrible w/ hurricane! 9/13 Before hurricane Jeanne hit Iberostar Dominicana/Punta Cana it was beautiful...well the beach. As for the rooms they were suppose to be 5 Apple through Apple Vacations which is about equivelant to a Red Roof Inn in the states. You don't hear to many complaints because not much time is usually spent in the rooms. Well, with the hurricane we were in our MUSTY smelling room alot and our room got cleaned twice in 6 days! The food was good before the hurricane and then after that it was the same cafateria food for 3 days strait! Hurricane not their fault, but poor planning did not help. Not a great trip overall...would not recommend or go back if someone payed me!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mariana Hammes","date":"2013-08-29 10:50:17 +0300"},{"content":"It was FANTASTIC!! We had a great time!! The hotel was beautiful. I was a little nervous about going b/c of a lot of things I had read about the food. But the food was Good! The dinners in the restaurants were Great! The Japanese was our favorite!! The beaches were beautiful. The grounds of the hotel were beautiful. Everyone was so helpful. It was a truly wonderful vacation!!! (We were there 7/15-7/19)","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Trystan Ryan","date":"2015-08-06 07:49:40 +0300"}],"public_likes":["Shaniya Langworth","Katelynn Wolf","Reilly Champlin","Tyson Keeling IV","Esther Durgan"],"vacancy":false,"description":"Budget hotel in the Forest Gate area of Newham","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}