{"title":"Derry","name":"Travelodge Derry Hotel","address":"22-24 Strand Rd","directions":null,"phone":"+44 870 1 911 733","tollfree":null,"email":"derry@travelodge.ie","fax":"+44 28 7127-1277","url":"http://www.travelodge.ie/derry-hotel","checkin":"3PM","checkout":"from £35","price":null,"geo":{"lat":54.99956,"lon":-7.32165,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7782,"country":"United Kingdom","city":"Londonderry","state":null,"reviews":[{"content":"My Wife and I plus our 3 adult sons (24-32) spent two days at this Hotel in mid May this year. We were given adjoining rooms on the 12th floor overlooking Powell Street and the famous cable car line. The rooms were well furnished and clean but with no coffee or tea making facilities, these were downstairs in the reception area and meant a bit of a hike if we wanted coffee in the room. The fact that the rooms were adjoining ment we could circulate between them without having to go out in to the hallway though. The Hotel provided a rollaway bed for one of our sons which made their room a bit of a squeeze and we were told that they were phasing them out but it meant not having to pay for a third room for the 5 of us. We found the staff very pleasant and helpful and the reception area had nice settees with a large bowl of fruit and a breakfast bar beyond which we did not use. We had picked up a hire car from the airport and used the multistory car park in Sutter Street which the Hotel has an overnight arrangement with. Be careful though, the car park is a little difficult to find and we heard one couple complain that they had used the wrong park and had been charged the full overnight rate. The proximity to the Powell and Mason Line enabled us to see most of the city very easily using the day pass which I think was about $20. Don't forget to visit the Cable Car Museum which is a real revalation as to how this ingenious system works. San Fransisco is a city worth another visit, as is this Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hiram Schmidt","date":"2013-08-16 10:21:33 +0300"}],"public_likes":["Ardith Jaskolski","Desiree Moen","Jefferey Abbott","Talia Lehner","Isabella Stiedemann","Mrs. Alicia Keebler"],"vacancy":true,"description":"Centrally located, 200 metres from Guildhall. Use of adjacent multistorey car park.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}