{"title":"Glossop","name":"Windy Harbour Farm Hotel","address":"Woodhead Road","directions":null,"phone":"+44 1457 853107","tollfree":null,"email":null,"fax":null,"url":"http://www.peakdistrict-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.46327,"lon":-1.943125,"accuracy":"ROOFTOP"},"type":"hotel","id":10159,"country":"United Kingdom","city":"Padfield","state":null,"reviews":[{"content":"We just got back from staying in New Orleans at the Avenue Garden Hotel. We were very impressed with the hotel. With paying such a cheap rate ($59/night), I was a little nervous about what we'd get because 'you get what you pay for'. We arrived in town around 11 a.m. and didn't figure our room would be ready, but figured we'd stop and see anyway. Well, it wasn't so we decided to take the street car down to the French Quarter and start our sight seeing. We left our luggage in the car because we drove down, but they were also willing to store your luggage in a side room for you if you needed to. We had left our phone number with them, so they called us when the room was ready, which was nice so we didn't have to keep wondering. We chose to park on the side streets, not in the garage that was offered, and had absolutely no problems. The hardest time we had finding parking was in the French Quarter, not around our hotel. After checking in, showing us our room and offering to help carry our luggage for us, the girl working the front desk left us to get settled in. Our room was great!! It was number 47 which I would definitely recommend. It was on the top floor on the front so we had two double doors going out to the balcony and a king size bed. They made this room very modern, as well. The bed (king size) was not the most comfortable, but it served its purpose. My only two complaints about this hotel would be the light in the bathroom above the mirror didn't work and the light bulb in the ceiling didn't work all the time as well. My husband was trying to get the bulb in the ceiling to work, and it shattered everywhere. They came up and cleaned it up very quickly, but never got it replaced, so I had to do my hair/makeup in the main room with the light from a lamp. My second complaint is there's no phone in the room. That made our previous problem a little inconvenient. Overall, I would recommend this hotel! It's location was great with the street car right out front and two great restaurants on each side of it! We never walked to the French Quarter, but it was definitely do-able. Kudos to the Avenue Garden Hotel!!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Lindsey Hammes","date":"2012-06-16 09:09:12 +0300"},{"content":"This is one of the nicest hotels that i have stayed in. It is idealy located on St. Charles and the staff is great. The room was very nice, clean, and spacious. I will definatly be back. i have been visting New Orleans for years both business and pleasure and have stayed in many hotels this on shines above the rest","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Blanche Berge","date":"2013-12-10 03:08:39 +0300"},{"content":"My husband and I stayed at the Garden Avenue Hotel for our 41st wedding anniversary. We had a huge room overlooking St. Charles Street. It was very clean, very nicely furnished and convenient to everything. The streetcar stopped right outside the front door. The staff was very friendly and helpful. The breakfast was quite nice with English Muffins, Blueberry muffins, Bagels, milk, cereal, coffee, etc. We ate dinner next door at the Voodoo BBQ. The meat melted in your mouth, and was great. We were very pleased with our stay, and would definitely stay there again.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Elyse Armstrong","date":"2012-04-19 19:32:13 +0300"},{"content":"I was prepared to give the hotel a 4 (of 5) rating, except for one snafu, which I will describe later, that dropped my rating to a 3. The hotel certainly not a \"4-star hotel\" by the standard definition, but it deserves 4 stars based on the price-to-quality ratio. My wife and I, who are both \"poor\" students, stayed there 3 nights, right before Christmas, and paid $53/night. The hotel was acceptable; the hotel itself was definitely a good value for the price and location, especially considering most other hotels in the ZIP code were nearly twice as expensive. It's not in the heart of the French Quarter, but that section is loud and crowded anyway, so I liked being a mile away from the \"action.\" The St. Charles trolley stops 20 ft. from the hotel door and will take you right to Burbon Street/French Quarter within 10 minutes, so, if you want to save $30-$50 by not staying in the F.Q., this hotel is a good bet. The best deal for transportation is to buy a 3-day trolley/bus pass, which is available for $12 at Williams Grocery about 8 blocks up St. Charles. (It's easy to miss the sign, unless you're walking on the opposite side of the street.) If you fly in, don't rent a car unless you must. Parking is scarce and expensive, and the streets are narrow and confusing. We took the E-2 bus, which runs from the airport's upper deck right into the heart of the N.O. business district (downtown). It is about a 10-15 block walk to the hotel from the final stop of the bus to the hotel. It's around a 15 minute walk, quite an exercise when you're towing luggage, but it is not too bad compared to the $26-$28 that you would spend on a cab or a shuttle for two. The hotel is fairly clean, though older. It is like a mediocre bed and breakfast. There were places that could have used a touch of paint, and there was a little rust on the metal fixtures. You must be rung into the building by someone at the front desk, and there is no one manning the desk in the middle of the night (11 pm to 7 am, I believe), so they give you a key to get into the hotel along with your room key. All in all, though, it was not that bad. Unless you're used to staying in the Ritz-Carlton, this is a fine choice for those on a budget. Besides, when you're a tourist to N.O., you don't really spend much time in the hotel anyway. Each morning, there is a continental breakfast. It's decent--bagles, English muffins, cereal with milk, orange juice; one morning there was also cinnamon bread and hard-boiled eggs. There is almost always free Twinnings tea and mediocre coffee (though sometimes they ran out of tea bags; you can ask for more, though). Next to the small eating area (gets crowded in the morning), there is a small outdoor patio where you can eat if the weather permits. There is also a sitting room/computer room. Internet use is free, but there is sometimes a line of 2-3 people waiting to use the one computer during popular hours. The decoration of this room is a bit tacky and outdated (ugly green cover on the couch, old unread books on bookshelves, antiquated computer manuals with the books, etc.). The room was acceptable, TV had dozens of cable channels, bathroom was fairly clean, and maid was competent. There was no \"Do Not Disturb\" doorhanger, so I guess you have no choice about maid service. The bed was large and comfortable, and the room, as promised, included ironing board, table, chairs, and extra pillow. There was an ice bucket, but it did not come with a liner bag, and I never saw an ice machine anyway, so we didn't use the bucket. The staff seemed nice, but I didn't get the extreme friendliness that other people have reported. We arrived a few hours early, and William let us check in early after a 15-min wait to get the room ready, so that was nice. He wasn't especially friendly, but was not rude either; he was just \"there.\" The other staff members were just \"there\" for us too. I have no specific complaints or praises for them. The one main complaint I have happened one week after we checked out. We prepaid for the room, so we did not have to pay when we checked in or out. However, since we had paid in advance, when we checked in, we were charged a provisional $60 to offset any expenses we might incur while there. This was fine with me; many hotels do this, and I knew we would have no other expenses of importance on the room. We were supposed to have this provisional charge refunded when we left if there were no other charges. While we were there, the only additional expenses we had were 2 local phone calls (35 cents each)--that's it. Well, a week after we checked out, I viewed my credit card statment and found that we had been charged $43 extra!! (not 70 cents!) I immediately called the hotel and asked for the reason for this charge. The woman who answered appeared to be new. She looked at my account in the computer and could not find any record of this extra charge. She said (this is a direct quote), \"We didn't make no charges on your card.\" I told her I was looking right at my credit card statement with the extra $43 charge, so someone obviously did. She could not explain it, so I asked that William to call me the next day, since he was the one who checked me in. I thought maybe he could explain the extra charge. I didn't receive a phone call, but I did contact my credit card company to challenge the bogus charge, and they took it off. I'm still not sure why this charge was made, so I recommend anyone staying at this hotel to double-check your credit card statement to make sure your card is properly charged. If it hadn't been for this frustrating surprise, I would have granted the hotel a 4 rating. I would probably stay here again if I return to N.O., but I'll be sure to watch the charges to my card.","ratings":{"Overall":3.0},"author":"Catalina Weber","date":"2013-07-21 04:10:10 +0300"},{"content":"Myself and a few buddies arrived in New Orleans after a long drive to escape the hurricanes in Florida. Once we checked into the Hotel we were greated by gorgeous smiles and the best service we have experienced in the whole of the USA. Thanks to first class service we soon started to relax and enjoy ourselves once again. Hopefully this review will encourage others to stay at such a wonderful hotel, and I'm sure you will have as good a time as us if you do. By the way the locattion was very good and the prices were very reasonable too. Special thankyou to all the staff especially Kristen and Alexis. Love Jerome Andy Stevie Mark Daylo","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Madge Stanton","date":"2013-12-17 15:18:19 +0300"},{"content":"We stayed at the Ritz Carlton 4/6 through 4/8. My family and I thought it was a great hotel and really liked the location. The Davenport lounge was a nice place to have a drink and listen to great music at the end of the day. There were 4 in our party and I requested 2 beds. When we checked in they only had a king bed available. They gave us a roll away bed and guaranteed us another room the next day. For two days we decided to stay in the room and not move. I'm not writing this as a negative but just to let people know to confirm reservations over the phone if you need a special request","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brandon Stoltenberg","date":"2014-06-26 08:46:10 +0300"},{"content":"Well it was St Patricks Day in the Quarter so green was the color of choice, not just on faces but the clothes too. The Ritz is an oasis, it has a superb location front door onto Canal and back door you fall into the Quarter. Well appointed rooms and smiling happy service. The A/C was broken in our room upon arrival, but repaired within the hour. We enjoyed coming back in the evenings to settle into the lounge for the live jazz trumpet & songs, and for that one last drink you always seem to need. We booked through American Airlines vacations with air, a good deal.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Adah Jacobson","date":"2014-02-06 13:01:39 +0300"},{"content":"Had a wonderful time at a first class hotel. Only negative was the concierge desk trying to push tours on me. Big negative!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eudora Pfeffer","date":"2013-06-10 07:57:12 +0300"}],"public_likes":["Blake Homenick","Lisette Bechtelar","Janie Grant","Maximo Denesik","Leonard Nader","Ulices Bode","Johnson Stracke","Mr. Kacey Predovic","Dena Kshlerin"],"vacancy":false,"description":"Woodhead Rd, Glossop","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}