{"title":"St. Raphael","name":"Hôtel Les Amandiers","address":"874 Bd Maréchal Alphonse Juin","directions":null,"phone":"+33 494 19 8530","tollfree":null,"email":"sarljr@aol.com","fax":null,"url":"http://www.les-amandiers.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":43.414852,"lon":6.790429,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":28676,"country":"France","city":"Saint-Raphaël","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"We chose this hotel partly based upon the excellent ratings noted on tripadvisor. We were not disappointed. Customer service was excellent. From booking our reservation directly, to their reasonable dealings with us related to the recent hurricaine which arrived during our stay, to their going the extra mile to ship to us an item left behind in a room. Outstanding.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Wallace Bode","date":"2015-01-30 08:43:04 +0300"},{"content":"This property offers terrific value and service. The price is right, the staff friendly and hospitable. The rooms are clean & up to date (if a bit on the small side; not a problem for most recreational visitors in New York). The AC was awesome; we like a cold room at night and NYC temperatures were over 100 degrees F during our stay. Wifi was free and problem free. One thing Doubletree does well is offer free breakfast (which was quite good). They will even let you forgo the buffet and cook an omelet for you. More important to me, as an early riser, they provided free coffee (upon request & with a voucher) in to-go cups so I could read the (free!) paper in the comfort of my room. Why is it that mid-priced hotels provided these nice perks but higher-line properties (at least in NYC) force me to search for coffee and paper every morning? Go figure. The immediate neighborhood left a little to be desired. There was a homeless man sleeping on the sidewalk next door to the hotel and 29th St. is a little dark at night, with little foot traffic.This left my wife feeling a little uneasy, however we were with another couple and did not feel threatened (safety in numbers). We spend 2 or 3 weekends per year in the city and I prefer neigborhoods with more activity in them, from both an entertainment and security point of view. Access to subways is OK, however East side subway service generally means more transfers to other parts of the city. We used cabs more that we usually do.","ratings":{"Cleanliness":3.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Lon Muller","date":"2012-03-25 16:08:46 +0300"},{"content":"Surprisingly for an NYC hotel, I have no complaints whatsoever. Stayed in a small ish room with a king bed which was fine and spacious enough. Perfect location close to the subway and just a walk away from times sq. Would definitely stay again. Should probably mention that I chose it off the back of an Expedia promotion so it probably felt better value because of that. In any case, the rooms are modern and very clean: rare for midtown.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Gia Schmeler","date":"2012-02-26 03:08:05 +0300"}],"public_likes":["Jayden Considine","Kimberly Langworth","Eulah Dickinson","Connor Ratke","Golda Zulauf Sr.","Wellington Littel Sr.","Marty Tremblay","Heber Schaefer"],"vacancy":true,"description":"The hotel rents apartments too, some of them have sea view.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}