{"title":"Offa's Dyke Path","name":"Mellington Hall Hotel","address":"Mellington, Churchstoke SY15 6HX","directions":null,"phone":"+44 1588 620456","tollfree":null,"email":"info@mellingtonhallhotel.com","fax":null,"url":"http://www.mellingtonhallhotel.com/","checkin":"15:00","checkout":"11:00","price":"£90-140","geo":{"lat":52.52015,"lon":-3.09445,"accuracy":"APPROXIMATE"},"type":"hotel","id":21042,"country":"United Kingdom","city":"Mellington","state":null,"reviews":[{"content":"End of a wonderful trip saw us land here. In a nutshell - rude bell staff (note I will not tip poor service and bad attitudes just because you expect it), rude front desk staff and staff who had to be kept out of the room - you may have been desperate to clean it but check out is 12 (and no later). This hotel has the smallest hotel room I have ever seen in the USA. Poor beyond words. Great location but that's all it's got going for it (don't be hopeful from the grand entrance and internet pictures!)","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Stephen Graham","date":"2012-12-10 00:55:54 +0300"},{"content":"I spent one night here on a quick getaway to do my own historical walking tour. The hotel touts its own history and though nice, I was not particularly impressed overall. The Park Plaza seemed almost as though it was trying to be too many things to too many people...more than one wedding booked (large lighted ,glossy photos and names of couples in lobby detracting from the historic decor), lots of high maintenance vacationers, European travelers, even airline flight crews. Amid the shuffle, I felt a bit overlooked as a lone traveler. At one point, I waited in a long line for the Concierge to ask for a walkable map of the historic African-American sites trail, only to be told hurriedly that they didn't have any but \"the trail starts on the other side of the park\". The group in front of me in line however, booked a boat tour, made dinner reservations for a family of 4, and got directions from the Concierge. All I wanted was a map. Maybe it would have been better had I not been traveling in the middle of the summer? In any case, the rooms have a nice historic flair (skeleton key doors) and are small but perfectly acceptable. The room was clean but my bed sheet was stained, which was pretty unexpected considering the caliber of the hotel. Overall, I could not have asked for a better location and for the seasoned traveler who needs little direction or attention, it was a reasonable choice.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":3.0,"Value":3.0,"Service":2.0},"author":"Madelyn Rolfson","date":"2012-10-31 12:13:29 +0300"},{"content":"I booked a junior suite at the Park Plaza for our family vacation. Upon check in, there were no junior suites, so we were upgraded to some fabulous 2-room suite on the 15th floor of the Towers. It was lovely and the 15th floor suites include complimentary evening appetizers and morning breakfast. The 2-room suite accomodated us nicely and we were very gracious for the upgrade. However, the airconditioning would not go below 77-degrees (It was set to be 64-degrees when we arrived)!. Granted, on day one, Boston got hit by the near 100-degree heat wave. On day 2, i made 3 requests between 9 am and 10:45 pm for the AC to be looked at and i also requested a portable fan for the room. Sleeping night number one was miserable, difficult and hot! Anyhow, after my 3rd request for assistance, and it was now 11:15 PM and I needed to go to bed, so i walked down to the front desk and nicely explained my unhappiness and discomfort. The desk clerk appologized profusely and gave me her portable box fan from behind the counter. I was happy to have a fan at last, but displeased that my 3 earlier requests were disregarded. On day number 3 the room temp with AC would still only go down to 77, although the weather out was pleasant and mildat 78-degrees. We opened our windows and slept with them open because it was cooler out than in. All other aspects of the hotel were grand. The location right by a T station and 1 block from the Boston Public Garden can't be beat. The hotel is not cheap to stay at, and we were still paying a good chunk of change to stay there regardless of recieving an upgrade, so it is not accecptable to disregard a guests request for room comfort. Still, despite the AC situation, I would recommend this hotel and I would stay there again.","ratings":{"Cleanliness":5.0,"Sleep Quality":2.0,"Overall":3.0,"Value":4.0,"Service":2.0},"author":"Fabian Langosh","date":"2012-04-28 07:11:15 +0300"},{"content":"We stayed on the 15th floor in the Towers. The price was very reasonable for a major city hotel ($130/night) and if you get a room on the 15th floor, you have access to a private elevator, free wifi, a private lounge with free continental breakfast and afternoon hors-d'oeuvres. The room was very clean and comfortable. The location is fantastic - a block away from the Gardens/Boston Common, two blocks from the shops in Back Bay, close to the beginning of the Freedom Trail. We caught a Red Sox game and actually were able to walk all the way to Fenway Park without much problem (took us about 40 minutes). You can also walk to the South End where there are some great restaurants.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Makenzie Towne","date":"2013-03-21 08:42:31 +0300"},{"content":"I found my room to be somewhat dark and gloomy but I suppose that relates in part to the age and historic ambiance of the hotel.The garage parking was expensive,$44 per day.Also they charge for internet access and local calls.The staff however were helpful,especiaaly the concierge Frank Gallagher.He recommended Old Town Trolley Tours who were excellent.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Trevor Predovic","date":"2015-10-03 02:34:55 +0300"}],"public_likes":["Stuart Zieme","Ms. Abel Pacocha","Geovany Toy","Elisabeth Von","Cynthia Jerde","Junius Schaden PhD","Heidi Huel","Mckayla Lind","Noah Robel"],"vacancy":false,"description":"1870's Gothic mansion set in 280 acres of mature gardens and tranquil parkland with mullioned windows, oak panelling and beautiful staircase. 10 individually designed rooms and suites, all ''en suite'' with unlimited Wi-Fi. No pets allowed. Afternoon tea and home made cakes in the ''Offas Dyke Bar''. Lunch 12.00–14:00, Dinner 18.30–21:00 served in one of 4 restaurants: the ''Cwm Dining Room'', the ''Mahogany Panelled Restaurant'', the ''William Morris Room'', or the ''Shropshire Lounge''. Local ingredients and suppliers are used wherever possible with many ingredients traceable to source. Graded *** with Welsh Tourist Board. The most luxorius camp site I have met. Camp by lake next to facilities block. Phone owner for entrance code. Pay £5 pppn (2014) in the morning to groundsman. 5 star hotel next door are polite but claim to know nothing about camping as its under separate ownership. Hotel","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}