{"title":"Birmingham (England)","name":"nitenite","address":"18 Holliday Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47664,"lon":-1.90681,"accuracy":"ROOFTOP"},"type":"hotel","id":3633,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"The Palmer House Hilton is an historic hotel. Its lobby area is spectacular. Some of the public rooms are truly beautiful. The location is great; e.g, in the business district, within walking distance of the Art Institute and Symphony Hall. Huge convention type hotels often have employees who are either pleasant but vacant/unknowledgeable or non-comprehending of even simple requests. In contrast, the Palmer House has excellent staff, all pleasant and responsive including the housekeepers, doormen, etc. The food is the standard Hilton fare (somewhat overpriced) but there is a Starbucks on the lower level, and right on the corner are places for breakfast and lunch. The rooms, however, are way below what one would expect from a standard business hotel of modest price. For instance, there were bedside tables on each side of the bed, but a lamp on only one side (so if two people were in the room, and the one by the lamp wanted to go to sleep earlier, the other would have to get into bed in the dark). THe desk chair could not be adjusted regarding height. There was not enough lighting in the room (partly because of what might have been high efficiency bulbs, but some gave off that harsh, greyish light). The closet was small and the door would not stay open and the ironing board hanging on the door kept banging everytime one moved the door. The bathroom was small but ok; however, it looked like it had not been redecorated in 20 years, had no makeup mirror, etc. If one is travelling alone and will not be in the room much, this hotel is acceptable. Finally, when I was there the ethernet connection for high speed internet would not work. I called the free number and they said there was a problem at the Palmer House. There was still a problem the next day. [The literature in the room said there was a \"nominal fee\" for this service. There was only the 24 hour option, at a charge of $19.95 which is not nominal.]","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":5.0},"author":"Carli Gleason","date":"2013-02-25 13:59:23 +0300"},{"content":"We stayed at Palmer House the week after Christmas. It was beautiful! I have read other reviews saying that the rate was expensive. We had a very good rate that was inline (or a bit lower) than most Hilton properties of this class. The staff was helpful for the most part - the front desk check in woman was apparently clueless about how to manage the phone versus Hilton Diamond members standing in front of her - However, another check in gentleman picked up her slack and set things straight. Good location for staying if you plan to \"play\" in the city! Bed was actually comfortable and pillows were plump- Room was clean. Retro feel to rooms and hotel - It is THE Palmer house after all!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Stacey Lubowitz","date":"2013-06-09 00:46:32 +0300"},{"content":"Was the size of a match box. The Starbucks inside hotel has poor-poor service.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":1.0,"Location":5.0},"author":"Rita Stokes DVM","date":"2012-07-01 20:56:00 +0300"},{"content":"We've been staying at the Palmer House when we visit Chicago for 20 years now. It has the charm and ambiance of the great hotels in history. It feels like going back in time to an era of opulence where hotel visitors were treated like royalty. The rooms are always wonderful. The staff is incredibly attentive to everything. The hotel is also a good value for the level of service and quality of the hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ova Beer","date":"2012-02-06 16:32:44 +0300"},{"content":"I went to Chicago for a conference the week after Thanksgiving and was very disappointed. I was there about 5 years ago and was booked at the Palmer House but it was overbooked and I was sent to another Hilton Hotel. The lobby is gorgeous! It is so vast and beautiful I thought I was in a palace. When I went to my room I thought I was in a prison cell. I was on the 15th floor. When you went into my room you walked about 3 steps and you were at the bed. It was so close to the hall (that was noisy) that I thought I was sleeping in the hall. When you were at the end of the bed there were 2 large wooden doors. One was the bathroom. The bathroom door could not open if you had the room door open since they were so close. The bathroom was tiny. The other door opened to a closet (or a very small square box). Again tiny. Outside of the window was a fire escape that obstruted any view you might have had. I guess the real disappointment was there were none of the amenities I have grown accustomed to when I stay at a hotel. No bottled water, no coffe/tea maker. Nothing! Next conference in Chicago I will be staying at another hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Cordie Dicki","date":"2015-10-26 22:04:20 +0300"},{"content":"This hotel was ideally located, and beautiful inside. The downside was my TINY room. When I opened the door into the room, it touched the bed. There was no room to put a suitcase on the floor - there simply was not enough floor space. That said, I arrive about 5/6 hours before the correct check in time, and the hotel had a room to give me straight away - I was not expecting that, and it was a blessing after an overnight flight. Given the size of the hotel, it was also very quiet, and the room service was AMAZING. Speedy, hot and very tasty. Overall, I was really happy, I just wish I'd had a bigger room.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Herman Boehm","date":"2014-03-07 21:47:44 +0300"},{"content":"Traveled to Chicago on business an brought my son. We stayed at this grand old hotel on the executive suite level. Service was excellent. The suites have two full baths, are very large, and the hotel overall was very nicely restored. One block from the Metropolitan Museum of Art. The subway is right outside. The restaurant is OK at best, room service is terrific.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Miss Jena Hickle","date":"2015-03-01 03:00:30 +0300"}],"public_likes":[],"vacancy":true,"description":"The property brands itself as a boutique hotel, where postmodern common space appointments are meant to make up for the ultrasmall (7 sqm) cabins that serve as ensuite rooms.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}