{"title":"Santa Monica","name":"Sheraton Delfina","address":"530 Pico Blvd","directions":null,"phone":"+1 310 399-9344","tollfree":null,"email":null,"fax":null,"url":"http://www.sheratondelfina.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.01051,"lon":-118.48562,"accuracy":"APPROXIMATE"},"type":"hotel","id":26492,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"I have stayed in this hotel 4 different nights in 3 different rooms, and they were all quiet, recently renovated and very nicely decorated. The hotel is walking distance to many sights, some restaurants and bars. Guests can take yoga and other classes, as well as use the athletic facilities. The hotel serves a good (and free) breakfast, and the bar on the third floor is very cool and hosts happy hour. My friends and I took one of our drinks to the rooftop where we had an amazing view of downtown. I did love the hair and shampoo products, but my one complaint would be the towels; they weren't very fluffy/soft but instead more on the scratchy side. Also, the jacuzzi in the women's locker room needs a facelift, as it is a little dingy and old. The dry and steam saunas were good, however! I will definitely go back to the LAAC!","ratings":{"Location":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Grayce Bosco DVM","date":"2015-09-21 19:06:34 +0300"},{"content":"If you need to be in downtown Los Angeles, then this is a great option for travelles. $180 nightly rate included: WIFI in room Breakfast buffet Use of LAAC fitness facilities (if you want to work out, now hotel gym can compete) The rooms were recently remodelled and very clean. The only downside of the room is that the bathroom is fairly small. Think of a boutique hotel in an older building in the heart of the city. The location is not the best in downtown Los Angeles but you can easily walk to public transportation, bars and restaurants in less than 5 minutes and the conference center is a 5 minute cab ride away.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Tracey Kemmer","date":"2015-12-21 19:12:24 +0300"},{"content":"I am traveling on a holiday across the US and we choose this hotel due to its price, decor and good reputation on trip advisor. We were not disappointed and were very impressed with the choice. The service provided by the front desk was warm and felt like they genuinely cared instead of a man/woman in a sharp suit but with an arrogant and blase attitude. The front desk were helpful in providing directions and both check in and check out was efficient. I might just add that we were also upgraded to a king size bed for no cost or apparent reason at check in other than the fact that we got off a 15 hour flight and looked probably like we had no sleep. A plate of welcome fruit was also provided. In terms of the room, if you are a fan of the more classical looking decors, this one would suit you fine. The photos on websites/trip advisor does it total justice. The complimentary gym is great and as good as any commercial gym (well it is a commercial gym) and the complimentary breakfast was good enough given it was free. Also, free Wall street Journal for those who care. Only con's - could provide more toiletries as we were running low but they weren't replaced. For those who are particular - the bathroom does show a few signs of aging but more than usable for my standards. Overall, this hotel felt like it wasn't big enough to be arrogant and cared about its customers, provided the amenities we needed, great service, great price, great location if downtown is where you want to be and one of the few hotels that i have visited globally that I'd say had true historical character. Well done guys! ps - girlfriend wanted me to add in that its proximity to transportation both Pershing Square and 7th Street Metro makes travel to other parts of LA (including Disneyland) effortless","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hilton Stiedemann DVM","date":"2014-03-21 20:35:20 +0300"},{"content":"I stayed here with a friend for several days this month. What a unique and elegant place. Our room was beautiful, large and elegant, the free breakfast was delicious and generous, the common rooms and athletic facilities are beautifully restored and maintained. There is a romantic and nostalgic quality that reminds one of expensive private clubs of another era. The only problem? THERE WAS NO COFFEE AVAILABLE FROM ANY SOURCE OTHER THAN THE 7-11 ACROSS THE STREET BEFORE BREAKFAST WAS SERVED (no room service, no coffee pot in lobby, no coffee maker in room). WHO WANTS TO GET DRESSED AND CROSS THE STREET IN DOWNTOWN LA JUST TO GET A CUP OF COFFEE? Since only three floors of this lovely club contain hotel rooms, it would be SO easy and convenient to place a coffee service in the elegant, marble elevator lobby of each floor beginning at 6 AM and to maintain it until 8 AM.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Miss Gisselle Osinski","date":"2013-11-14 08:36:01 +0300"},{"content":"The Los Angeles Athletic Club is an odd duck as a hotel, which might be why there are so few reviews on Tripadvisor. Most of its 12 story Downtown LA building is taken up with seem to (non-athlete) me to be topflight athletic facilities. There's what I'm pretty sure is a full length, multi-lane swimming pool with a kiddie pool next to it. There's a basketball court that might be full length too. There are exercise machines, a sauna, even a billiard room. The hotel rooms only take up the top 3 floors and there didn't seem to be a whole lot of people staying there one Friday night. I thought they might be there more as a convenience for club members and their families than as a full-fledged hotel. The floor by floor dress code (I kid you not) explained on a paper in my room might fit that image. The rooms are extremely dowdy. The place's elegance has a faded a bit too much, at least in the guest rooms. They're so dowdy that the club plans to renovate them this summer into a richer, retro, yes clubby look. They had photosimulations of the rooms posted on the floor where I stayed. It might have been nice if they'd told us this on the website. For now, the rooms are just tired, the chairs, all the furnishings, the bed lines are all faded. There aren't enough light fixtures in the room, though mine got some eastern natural light, amidst the buildings of Downtown Los Angeles (I liked that part). The carpet was really stained all over the place, not something I normally notice. I don't think there was true dirt around and nothing bit me, but it did add up to a depressing feeling. I'd note parenthetically that I tend to discount complaints on Tripadvisor that something is, horrors, old. Some people seem offended that buildings--like, say, the Waldorf-Astoria--were built more than 10 years ago. But the LA Athletic Club is old in the bad sense. After the renovation it could be much better. I didn't feel a lot of warmth from the people working there. Most were OK, but at least one seemed to be mocking me, not a feeling I usually get in a hotel. Maybe by wearing a daypack backpack I was violating the dress code! It really didn't work well when I tried to check in (at normal time, with a reservation) and the front desk clerk called and called housekeeping to find an available room. Positives: Well located within Downtown LA, close to most Downtown locations and plenty of transit including numerous bus lines and Metrorail lines. They included a free, large, if mediocre breakfast in one of the many dining rooms. City views of a historic part of Downtown LA. A roof deck with nothing but some chairs on it, but even better city views. All those athletic facilities, which might be good with a kid.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Keyshawn Schuster","date":"2013-02-17 17:42:35 +0300"},{"content":"This was out first hotel for our holiday - The location was very good as it was not too far from the airport and very close to a large shopping complex and bus routes and some attractions. The rooms were old but clean and basic. The people at the front desk were not very helpful at the best of times and they had a complimentary breakfast but the room was way too small for the amount of pople that were trying to get in! All in all if you are looking for a small cheap but clean place to stay that is in a great location then this is the place.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":3.0,"Value":4.0,"Service":3.0},"author":"Holly Bogan","date":"2012-09-10 22:52:15 +0300"},{"content":"I have now stayed here twice. As previous reviews have stated the location is EXCELLENT. My traveling partner and I wanted close to the Magic Castle and a decent room rate. That is what this basic \"no frills\" hotel has to offer. PROS: Location Decent size rooms and bathrooms decent quality bed. great \"budget\" price. CONS: Limited parking (lot was full when I pulled in late Saturday night and had to leave keys at front desk for consideration of other guests.) No bottled water or sugar free beverages in the nearly out of product vending machine. Not ADA complient. No elevator, lots of stairs and finally, their bookkeeping department! Re: bookkeeping: I reserved 2 nights (Friday night and Saturday night) departing Sunday morning. After being on the road 1/2 way home to the SF Bay area, I get a call from the hotel bookkeeper. \"You owe us for another night.\" she says. I told her we left at 11:00 am check out time, gave our keys to the housekeeping lady because the front desk guy was tending to something else. She then asks me to mail her or fax her my receipt when I got home as she did not have a copy of it. (WHAT? no reciept copy which I signed???) We hang up, she then calls me back (as I am driving) and then tells me she made a mistake and apologizes. So, other than this customer service incident, I would reccomend this place highly as you get a nice clean space. Pay cash and get a receipt.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Rosalyn Bahringer","date":"2012-03-01 11:30:48 +0300"}],"public_likes":["Donnell Klein","Ariane Funk","Ibrahim Walter","Wilhelm Jewess","Mikayla Satterfield III","Loren Willms"],"vacancy":false,"description":"Four blocks from the beach.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}