{"title":"Witney","name":"Oxford Witney Hotel","address":"Ducklington Lane","directions":null,"phone":"+44 (0)01993 779 777","tollfree":null,"email":"witney@four-pillars.co.uk","fax":"+44 (0)01993 703 467","url":"http://www.oxfordwitneyhotel.co.uk/","checkin":null,"checkout":null,"price":"£90-185","geo":{"lat":51.773849,"lon":-1.48982,"accuracy":"ROOFTOP"},"type":"hotel","id":33539,"country":"United Kingdom","city":"Witney","state":null,"reviews":[{"content":"My room was so small I began to feel uncomfortable, the \"infinity\" pool was nothing more than a Koi fish pond and faced buildings with no sight of the ocean and extremely windy, a very empty feeling to be out on that Lanai with employees jumping at the chance to make a quick buck! The spa was nothing more than 4 rooms with no amenities, no ladies or gents locker facilities, nothing but a few showers and a dangerous large bath tub, the service at the spa over the telephone was ridiculous, I felt like I was bothering them asking simple questions. Because I am an avid spa-goer I decided to visit the spa to have a face to face conversation as their prices are very high for a simple treatment. I got the same attitude just in person. Both the gentleman and lady were abrupt and discourteous, I did not book any spa treatments thank goodness, that spa was nothing more than a few rooms thrown together, total joke for a \"Trump inspired spa\". I dined in their restaurant and after finishing my mediocre and over priced meal overheard the waiter complaining of the amount of tip I had left to his colleagues! I checked out the next morning and moved to the Royal Hawaiian Hotel where first class service is always given, This is a joke of a hotel, the amenities are a bore, the gym is again facing buildings and with no life, the entire property is a cold experience, it actually gave me the creeps. The service from start to end was horrific, there was so much pretension, no ALOHA as they used that word every step I took. As a world traveler and an avid hotelier I would not recommend this property to anyone and will never step foot there again, take your vacation to a true destination not some want-to-be hotel where everyone that worked there was miserable, fake, quick to take your money, NO ALOHA, Trump International Hotel is Waikiki is a major thumbs down, if you want a real escape The Royal Hawaiian Hotel is where its at!","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Mina Barrows","date":"2015-09-10 08:58:55 +0300"},{"content":"Everything was impeccably clean. The staff are friendly and address you by name which was nice. The bathroom is roomy with plenty of towels, although the water pressure is on the weak side. The bed was very comfortable, the flat-screen TV was large, and the free wireless Internet was really appreciated. The hotel is a short walk from the beach, and I mean a very short walk. You just cross the street from the hotel and the beach is like 50 ft. away through some green space. I was on the beach everyday and the proximity was a big surprise because looking on a map, it seemed a lot further. Also nearby are the shops and malls, and also plenty of restaurants to choose from. For a first time visit to Hawaii, it did not take much effort to find what I needed. I tried the spa and found it pricey for the experience that I got. I was there during the marathon weekend and the staff made the effort to make sure all guests were aware of the traffic issues and to help you get to the airport through the traffic mess. I would definitely recommend this hotel, and would stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Morgan Gibson","date":"2015-12-31 18:22:06 +0300"},{"content":"I'm just back after over 3 weeks in the Adagio. The studio was fine, very modern, clean, the space was well used. It was sufficient for 1 maybe 2 people max. There were few maintenance issues, and everybody seemed to experiance some issues with internet conection. Once you arrive you should ask for a cable but you will only be able to use the internet at the desk. When it works its good, when it doesnt, it doesnt and i usually abandoned my computer for few hours. There is wifi in the lobby. I had some issues with cleaning. Sometimes i would be left with 4 towels, sometimes just two, sometimes there would be no bin bags in the bin. the electricity card would be taken out and laptop would go out of charge. Small things. The self service washing machine costs 6eur, you get a tablet/powder for it. Dryer is 3 Eur. It works on time so this buys you two hour use of each.The bed is big and comfy but the pillows are square and not great. I must admit the staff seems a bit not interested and wont go out of their way or anything but they are not rude. Over all despite the small issues described above I would recomend the hotel even for a long stay. Ps. there is a little Italian restaurant near hotel called Pizza Factory and its quite cheap but nice.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Lyric Hirthe","date":"2015-01-22 11:59:52 +0300"},{"content":"This modern \"business\" hotel actually offers a lot to the vacation traveller as well. It is very well positioned just one block back from the K'Damm, the iconic shopping and entertainment street of Berlin, and only 10 minutes walk from the lively Savignyplatz restaurant and shopping area, and the Savignyplatz train staion giving easy access to the rest of Berlin. My room had a small well-equipped kitchenette, which, with two supermarkets a block away, made preparing odd meals very easy. However there are plenty of restaurants nearby if you don't want to cook. The front desk staff were extremely helpful with little problems such as the cable TV not receiving English channels - quickly fixed. Free Wi-fi in the ground floor area actually made for quite a convivial atmosphere as people brought their computers and iPhones down to the lounge area.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Pascale Effertz","date":"2014-02-02 09:11:10 +0300"},{"content":"Location was just five minutes walk from the popular Ku'Damm with it's shops and U-Bahn stations. The buses to and from the airport also run along the Ku'Damm, even in the middle of the night if you have an early flight. Hotel room was spotless and had stylish decor with lots of storage and a comfy bed. I particularly liked having a safe within the room. This hotel is an \"Apart Hotel\" so rooms have a kitchenette. This was very useful meaning you could make your own breakfast and snacks if you liked. Our slight issue was that workmen are currently renovating a building next door and made noise quite early in the morning but on the positive it gets you up to make the most of your stay so it didn't spoil things! Besides, there is an incredible amount of building work going on in Berlin anyway so I expect many hotels have a crane next door to them so I'm not going to mark the hotel down for that as it's beyond their control. I would definitely stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Zaria Harber","date":"2015-10-22 15:38:54 +0300"},{"content":"Very good place to stay in Berlin- just what I was looking for! Comfortable and professional service, I will certainly stay again in this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Tyrese Prohaska","date":"2012-08-09 04:03:07 +0300"},{"content":"The staff were very friendly and all welcoming and most helpful when sorting out issue with one of our travel agency (quite rude one). They were very responsive to any requests we had and left us with a very warm feeling. This hotel is nicely located to access Berlin's attractions and also restaurant. Rooms were clean and very clean, which then gave us excellent sleep, and also there is the bar and restaurant which provided the very good service. Will come back !","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Jules O'Kon","date":"2014-08-22 01:17:11 +0300"},{"content":"One of the best hotel i have ever stayed. Hotel located 10-15 walking distance from San Marko square in a very quate place. I stayed in Junior Suite with the canal view. It was unforgatable. Large room with antuque style and furneture.We have 5 oclock tea with the cake in nice room with the red furnuture. the breakfast was very variety even with the champagne. If you are looking for lovly and romantic place for a good memories Paruta hotel is the best ever!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Zaria Blick","date":"2013-01-28 18:48:50 +0300"},{"content":"My daughter and I spent 3 nights in Venice for my Birthday at Palazzo Paruta, what a fantastic experience, the staff were wonderful, the location could not have been better, Venice was spectacular!!! The room albeit small (standard room) was spotless we did look at the suites whilst in the hotel and they were just to die for!!! Huge and the furnishings wonderful well worth paying the extra, however saying that our standard room was excellent value for money. The breakfast exemplary cereals, croissants, crepe's to your taste, scrambled eggs bacon & sausage, all types of cake, yoghurts, bread rolls and bread for toast a selection of cold meats and cheeses, what a selection. We will definately return and would advise anyone to visit Venice and stay at Palazzo Paruta.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jana DuBuque MD","date":"2013-03-12 06:37:27 +0300"}],"public_likes":["Marlin Gerlach","Everardo Bogisich"],"vacancy":true,"description":"This 87 rooms hotel of the Four Pillars chain is on the outskirts of town, just off the A40/A415 roundabout. It offers modern 4 star rooms and a good on-site spa and pool.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}