{"title":"Paris/18th arrondissement","name":"Terrass Hotel","address":"12, rue Joseph-de-Maistre","directions":"Metro: Place de Clichy","phone":"+33 1 46 06 72 85","tollfree":null,"email":"TerrassILA@ila-chateau.com","fax":"+33 1.44.92.34.30","url":"http://www.ila-chateau.com/terrass/","checkin":null,"checkout":null,"price":"€280-410","geo":{"lat":48.88661,"lon":2.33284,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21680,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I was looking forward to staying at this resort and left extremely disappointed. There seems to be no desire to have repeat customers at this place. I should have known better when I found out that the Grand Wailea is in bankruptcy. The optimistic side of me thought this would cause the staff to be more appreciative of their guests, but boy was I wrong. It's almost as if they know their jobs are unstable and have just stopped caring. I've never experienced such a lack of customer service skills in my life. It's as if your very presence is some sort of inconvenience. From the rude valet personnel and front desk staff to the pool Nazis demanding to see your papers (wristbands) just to walk in the pool area, it was just plain miserable. It felt like being in an airport where you have to constantly be ready to prove it's okay for you to be there. The property is pretty nice, although maybe a little gaudy and \"circus\" like for some. The rooms are okay, but nothing too special considering the price and the constant nickel and dining that guests receive ($25 just to park there). I really wanted to like this place and it has some positives, but I suggest potential guests stay somewhere else. It was honestly the one bad decision I made when I scheduled my trip to Maui. The rest of my trip was absolutely wonderful though! I highly recommend visiting Maui.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Location":4.0,"Rooms":3.0},"author":"Alexys Jacobi","date":"2014-01-04 14:42:41 +0300"}],"public_likes":["Karine Douglas"],"vacancy":true,"description":"Excellent four star hotel in Montmartre with 98 rooms, en suite baths, air conditioning, Wi-Fi, good restaurant, business facilities. The rooftop restaurant with fantastic views of Paris is open May-Sep.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}