{"title":"Birmingham (England)","name":"Britannia Hotel","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.britanniahotelbirmingham.info/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.4791,"lon":-1.89711,"accuracy":"APPROXIMATE"},"type":"hotel","id":3625,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Spent the week of oct 10-15 first time visiting Chicago . we took the package with valet parking & restaurant package . Everything was done with world class service from checking in to the valet!!!! We also loved the restaurant at the Omni we had the buffet in the am . we had the hamburger & sweet potato fries during the afternoon (fantastic ) , they gave us $25 dollars per day per Guest to spend the menu is reasonably priced . Wait staff at the restaurant we're AWESOME you wanted for nothing !!!! Our room was a corner room it had lots of room with a Great view of Michigan Ave!!! City of Chicago Speaks for itself Show Up & Be Moved !!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Talon Stiedemann Jr.","date":"2014-10-27 15:24:35 +0300"},{"content":"From our first greeting by the Concierge staff to our final check out at the Front Desk we felt welcome and valued. Rooms were spacious and well appointed. Location was super convienent to all attractions and great room service!","ratings":{"Location":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Howell Bahringer","date":"2015-11-25 04:27:52 +0300"},{"content":"Wonderful location just off the magnificent mile (great if you like your shopping). Nice gym and pool. The rooms were very dated however. Peeling wallpaper and tired furniture. No free wi-fi either (9.95 a day!). Dark as well. For the price I think the Embassy Suites (Lakeshore) are much better.","ratings":{"Cleanliness":1.0,"Sleep Quality":2.0,"Overall":3.0,"Value":3.0,"Service":3.0},"author":"Forrest Moore","date":"2013-11-14 20:06:21 +0300"},{"content":"We stayed here for just one night with our 6 and 4 year old girls. Having lived in Chicago for 15 years, we wanted a hotel close to Michigan Ave and Near North for our kids, knowing they would love this area. The Omni's location really was perfect...Water Tower, Hancock, Navy Pier, Millenium Park, great food, museums, shopping, river, loop, etc. all located within walking distance. Upon checking in, the kids were given these cute little backpacks filled with activities and treats. They thought this was great and wore them for the next 2 days. At the check-in desk, I asked about a room with a view. There wasn't one ready (and I didn't pay for one) but the clerk said it would be about an hour if I wanted to wait. He took my cell phone number to call me when it was ready. So we stored our luggage and walked down to Navy Pier for a boatride. Sure enough, within about 55 min the hotel called to let me know we could check in. The room was quite spacious for a downtown, city hotel room. A small living area with a sofa and tv, desk and bar area made up the first part. Through a set of double doors was a bedroom, also a decent size, with two double beds. The bathroom was nice as well and the closet had a lot of room. Went down to the pool, which was a bit of a dissapointment. It is a little small, but being a city hotel I can understand that. The three main issues I had were: 1) the temperature of the pool area was freezing! Everyone in there (I'd say 12-15 adults/kids) were either in the pool, which was warmer than the air, or wrapped up in the pool towels for warmth. It was very uncomfortable and not enjoyable at all. 2) the hot tub wasn't on and wasn't filled. Considerng the temp of the air, this was even a bigger disappointment. At least 6 people came down to use the hot tub while we were there, only to be disappointed by its emptiness. 3) the pook deck itself is made of tile and is incredibly slippery when wet. Why in the world this kind of tile was chosen for the pool area is beyond me. Three people, including myself, almost wiped out. I was really worried the kids would fall and hit their heads. It really was poorly designed. When we got back from dinner, housekeeping had turned down our bed, replaced all of our towels (which we had used when we got back from the pool) and left milk and cookies. The kids were so thrilled with this little gesture. The last thing I'll report about is leaving something in our room. Unfortunately, after we checked out and were driving out of the city, we realized that our 4 year old's favorite stuffed animal had been left in the room. I called the hotel and was connected with Chris in security. He took my name and number and promised to call me back after looking for the stuffed animal. Within 10 minutes he had found the bunny, called me back and offered to FedEx it, on Omni's dime, to our home. It arrived today. I was very impressed with the Omni and will definitely return on our next visit. The service was excellent and their treatment of the young kids was really refreshing.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Bernie Keeling","date":"2013-07-24 11:50:46 +0300"},{"content":"This is a beautiful, well kept property in the heart of Michigan Avenue. It is located within an easy walking distance to popular attractions, the train and the lake. The room was a suite style, very attractive, clean and comfortable. The brunch was excellent but on the pricey side. There are several garages within 1-2 blocks that offered less expensive parking.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Katelyn Conn","date":"2015-12-26 12:04:47 +0300"}],"public_likes":["Wilfrid Beatty","Mandy Langosh","Idella Gutkowski","Ambrose Howell","Cesar Rippin"],"vacancy":false,"description":"City centre (''close to the university''). Offers mid-range accommodation for business and travelling guests.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}