{"title":"North Uist","name":"Uist Outdoor Centre","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.uistoutdoorcentre.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60694,"lon":-7.15833,"accuracy":"APPROXIMATE"},"type":"hotel","id":20737,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"Well I was there these past 10 days since I was working at the LA Auto Show at the convention center. Last year I stayed at the Westin (see review). So, I have to admit that this location is definitly MUCH better. Much more within a 3 block radius, including a supermarket, Ralphs. The hotel is brand new. The rooms are spacious, the bathrooms are huge. The pool on the 4th floor is gorgeous, and I LOVED the Illy caffe in the lobby...my favorite coffee place...sure beats starbucks anyday. That being said theres a starbucks within steps from the hotel..as is so many restaurants, and the staples center! Now as far as service...I guess it was fine. Nothing in particular happened for them to demonstrate extraordinary service, but they were always friendly from the moment I arrived to the moment I left. Now I just had 2 complaints. ONE, no free wifi/internet in the room. Its $12.95 a day!!! I thought this is ridiculous since this isnt a run of the mill hotel. BUT!!!! i found out the way around it! ish! There IS free wifi in the lobby. So you can connect to the wifi in the lobby then go to your room and you have a free hour! et voila! The other thing is that they dont provide microwaves. Now if you are only staying a few days, who cares, but since I was there for almost 2 weeks, to save money I bought alot of groceries and it would of been nice to have (as i had in the westin). So considering that was my only 2 complaints, which neither are too significant, I definitely give this hotel 5 stars!!! And did I mention the pool area is GORGEOUS!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Berneice Herzog","date":"2013-01-11 22:19:15 +0300"},{"content":"My husband and I stayed for 2 nights this past week. First the positive: Front desk and concierge service is top notch. Rooms are spacious and clean. The location Is great if you are attending an event. Areas that need serious improvement: The service in both the lobby lounge and the mixing longe is absolutely terrible. On a Monday evening we went to the mixing lounge and sat at a table (the bar was full but the seating area only had 8 people seated) and waited for approximately 10 minutes to order. There were 2 waitresses working but seemed to be more interested in talking to each other than serving customers. I finally went to the bar and ordered. In the hour I was seated at a table not 1 of the staff asked if I would like anything else or even approached me. this is unacceptable particularly when you are paying top $$ for cocktails. The lobby bar is not much better. I was also really disappointed in the housekeeping service. I left my room at approx. 1 PM and saw that housekeeping was servicing the adjacent room. I returned to my room at 5PM and the room had not been cleaned. I spoke with the front desk and they acted like it was no big deal and they would have someone service it. I'm sorry but at $300+ a night it was a big deal to me. The gym is great but he again the staff really need to work on their customer service skills. Too long of a story to bother with... For $300+ a night there should be free internet service for all guests in their room. Also, be aware that overnight parking charges are ridiculous at $40 per night.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":5.0},"author":"Lavada Stiedemann","date":"2014-10-13 04:09:00 +0300"},{"content":"Very nice rooms, restaurants and appealing design. Mike at the concierge desk was great - helped be get all around LA. One negative - they need to wash their exterior windows... couldn't tell if it was overcast or sunny, they were SO dirty.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Jefferey Waelchi","date":"2015-06-27 22:55:03 +0300"},{"content":"I was in LA for a quick trip to visit some friends and stayed here for two nights. Located right next to LA Live, and while there isn't too much to do here unless there are events going on (ex: sports, concerts etc) it was a pleasant and enjoyable stay. I came in late morning and they were still able to accommodate an early check-in and room upgrade (junior suite) with a view overlooking their pool. The room itself was very nice and I appreciated the early check in as well as the upgrade. The Lounge is great to grab a few snacks on the go, and the pool is a great place to relax at. I was visiting friends in the area and was not familiar with the area so Concierge was very helpful in helping me get to where I needed to go. Staff was very friendly and helpful. Overall, a great experience","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Service":5.0},"author":"Kariane Kassulke","date":"2014-02-28 06:30:31 +0300"}],"public_likes":["Miss Cornelius Gibson","Mac Streich","Angelica Olson","Ellsworth Yost","Dina Senger"],"vacancy":true,"description":"self catering - 20 beds in 4 person rooms.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}