{"title":"Nelson (England)","name":"The Oaks Hotel, Leisure Club and Spa","address":"Colne Road, Reedley, Nr Burnley BB10 2LF","directions":null,"phone":"+44 1282 414141","tollfree":null,"email":"oaks@lavenderhotels.co.uk","fax":"+44 1282 433401","url":null,"checkin":"14:00","checkout":"12:00","price":"£70.00 breakfast included","geo":{"lat":53.815867,"lon":-2.234487,"accuracy":"ROOFTOP"},"type":"hotel","id":36154,"country":"United Kingdom","city":"Burnley","state":null,"reviews":[{"content":"I stayed at the Byblos hotel for 6 nights in Nov 2010. check in was friendly and speedy Room Service was good Room Designed very well,good Air Condition and lightings. The Internet connection is too Expensive and disappointing , The Traditional English Bar is boring for me but better than nothing. You should walk 10 min in dusty ways to Metro Station. The Taxis doesn't known the Byblos hotel. You should notice them to take you to Tecom Area. You should pay a lot of money for taxi because this hotel is to far from every where The View is too bad; Just Under construction buildings. the Pool is a fake Tank ( very small 2m X 5m, max Depth 1M) Break Fast was Ok , Egg, Fruits , Sausage, Cereals , Cookies, Milk , Fruit Juice.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":2.0},"author":"Axel Conroy","date":"2012-08-12 22:15:00 +0300"}],"public_likes":["Garnett Kerluke"],"vacancy":true,"description":"50 bedrooms with free Wi-Fi, restaurant located within the ‘old house’ offering locally sourced produce, lounge bar, conference suites (largest accommodates up to 200 delegates), extensive grounds and outdoor terraces. Disabled access level 2, accepts children of all ages, gym, health/fitness/ beauty facilities, indoor pool, sauna, solarium. Pets and LGBT accepted. Special provisions for cyclists and &quot;Lone Female Travellers&quot; (sic).","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}