{"title":"Gower Peninsula","name":"Rhossili Bunkhouse","address":"Middleton, Rhossili, Swansea SA3 1PL","directions":"Rhossili Bunkhouse is on the B4247 in Middleton in the village of Rhossili, at the south-west corner of the Gower Peninsula.","phone":"+44 1792 391509","tollfree":null,"email":"bookings@rhossilibunkhouse.com","fax":null,"url":"http://www.rhossilibunkhouse.com","checkin":null,"checkout":null,"price":"From £15 pppn","geo":{"lat":51.567,"lon":-4.2789,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":10289,"country":"United Kingdom","city":"Swansea","state":null,"reviews":[{"content":"OMG! This was disgraceful. The four of us arrived at Copley house only then to be driven to our dank studio, not 1 bedroom apartment as per our booking. The kids had to sleep on a single airbed, there was a hole in the floor in the bathroom. The room was so hot that we needed to keep aircon on, but that was so noisy so we didn't sleep at all. It wasn't only dated, it was way past its use by date. I see some good and bad reviews for this place her. From what I can determine it seems if you stay in the Copley House house then maybe that is good, but if they ship you to the one of the other properties beware. Maybe get in writing of which room you are booked in and actual photos of that room before you pay.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Shanelle Streich","date":"2014-03-08 05:37:15 +0300"},{"content":"The good - location on a quiet street of townhouses, it was clean, it had a good new TV, the bed was comfortable. There was a small deck (Apt. 211). Free WiFi and local phone calls. I did not use the kitchen. The bad - ad does not say you will have to walk 3 blocks and perhaps climb up to third floor. Furniture and rug were stained, slats in blinds were broken, screen on patio door was off. I had to reset closet doors into track. Window frames were rotting, peeling, screwed shut. The one night I needed AC, it did not work. The emergency number gave no help. The rate was higher than the ad indicated.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Ellsworth Green","date":"2012-07-07 11:51:40 +0300"},{"content":"Great location, very quiet and pretty. The room we had was downstairs, so the windows were a little under pavement level however we had a full kitchen and plenty of space. The staff were sometimes in the office, sometimes were just around and we found weren't too much help. The room was clean and the building was great however it would have been good if we had a choice of a room upstairs, or were told that the room we booked was below ground level. Overall was good, clean and reasonably priced with a great location to base our day trips from","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Stanford Stoltenberg Sr.","date":"2012-09-17 14:47:18 +0300"},{"content":"From the previous reviews, it seems like rooms at Copley House can be very hit or miss, but I was quite pleased with my room at the property. I booked a medium studio (Room 104 at 215 W. Newton) not knowing exactly what to expect, but was pleasantly surprised to find a larger than average room with a new flat screen TV. The kitchen was fully stocked with utensils and cookware and had pretty much anything you would need to cook your own meals (minus the food, of course). The bathroom was clean and stocked with towels, and the rest of the room was clean as well. Now for the drawbacks...the bed certainly wasn't the most comfortable bed I've ever slept in, but it didn't negatively affect my sleeping habits. The room I stayed in also faced the street, so any street noise could be heard, but it wasn't any louder than average. The hallway was also slightly dingy, and one minor complaint was that the blinds didn't reach all the way to the bottom of the window sill, as the room had windows that were quite tall. Other than that, I would definitely stay at Copley House again and recommend it to anyone needing a place to stay in Boston. The location is very hard to beat, especially for the price, as it is a few short blocks to all the shopping and the T at Prudential Center. And for a New Yorker like me who is used to walking, it's a short walk to Newbury Street and many other sites in the city.","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Adam Gibson","date":"2012-09-20 12:56:06 +0300"},{"content":"I made an on-line reservation for $70 per night plus tax. I called the hotel the next day to find out check-in times, and was told at that time they were not honoring the rate I had reserved. They were more than happy to reserve me a room for $120 per night plus tax. The employee said \"they were going to call me\" to let me know my rate was nearly doubling. Yeah, right. I had my cell phone with me all day, they never even tried. I'm sure they were hoping I would show up and agree to pay almost double to avoid being on the street. If you want to get ripped off by a hotel with no business ethics, then by all means, stay at this hotel.","ratings":{"Overall":1.0},"author":"Ms. Rudy Breitenberg","date":"2013-07-20 22:51:07 +0300"},{"content":"Not great but good. All you need to be comfy, especially if you have to catch a 5:00 a.m. flight out of Boston Logan. Clean, modern, will stay there again. Let's face it, who loves airport hotels, but we sure need them!","ratings":{"Overall":4.0},"author":"Anita Mueller","date":"2015-02-09 23:12:39 +0300"},{"content":"Comfortable rooms. Had an excellent meal in the Connollys Publik house - seared tuna with wasabi dressing followed by cod - yum. Breakfast was not great as it came out cold and was expensive. It also took 20 mins and mine was the only breakfast order in the kitchen. They did not charge me, but I then had no time to order anything else. The shuttle bus service is excellent. I was able to ask for a pick up from the car hire place and the bus came in a few minutes. Staff were all very friendly and helpful. Would recommend this hotel to others.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Khalid Howe MD","date":"2015-04-06 02:25:42 +0300"},{"content":"We stayed at this hotel at the start and end of our trip to Iceland. It was nice to be able to walk from the terminal (15-20 minutes via skywalk). The room was large,comfortable and quiet.We ate dinner at the airport before walking to the hotel since there were more choices. This hotel is a good alternative to going to a downtown hotel. I'd stay here again.","ratings":{"Overall":4.0},"author":"Kay Roberts","date":"2013-08-12 21:06:45 +0300"},{"content":"Stayed for one night, catching an early plane the following morning. Really easy to get to from airport: a short walk from Terminal A and Terminal E. Helpful staff, quiet room and a comfortable bed. Good food in the bar downstairs.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Destini Doyle","date":"2015-05-06 01:50:08 +0300"}],"public_likes":["Rashad Witting V","Dorothy Gutmann","Wallace Price","Valerie Moore","Wilson Gulgowski","Karli Schaefer DVM","Sharon Walter","Luna Schumm","Jermain Frami"],"vacancy":true,"description":"Rhossili Bunkhouse is within easy walking distance of three beaches. It is great for groups of friends or families. Opened in 2007, the Bunkhouse is run by the Trustees of Rhossili Village Hall for the benefit of the community. Open: All year except January.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}