{"title":"Buena Park","name":"Portola Inn & Suites Hotel - Buena Park/Disney-Anaheim Area","address":"7921 Orangethorp Ave","directions":null,"phone":"+1 714 739-5885","tollfree":null,"email":"info@portolainnbp.com","fax":"+1 714 228-9663","url":"http://www.portolainnbp.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.859395,"lon":-117.994475,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":4398,"country":"United States","city":"Buena Park","state":"California","reviews":[{"content":"Oh so comfortable! Walking to enough wineries to take care of a whole day!","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Mrs. Lilliana Christiansen","date":"2015-09-24 03:30:04 +0300"},{"content":"This was my most favourite hotel on my entire trip to the US recently. The rooms were spacious and comfortable and I loved the nice touch of the complimentary half bottle of wine. The bathrooms were also spacious and the shower was fantastic - you could have a party in there! I only wish I had been there with my lover....... The gardens and mountain views were outstanding and I would plan a whole trip around the Harvest Inn. The only thing that would have made it perfection would be if they had their own restaurant so everything would be in easy walking distance.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kallie Langworth","date":"2015-10-30 15:38:32 +0300"},{"content":"We just returned from an amazing 4 night visit. We stayed in one of the King Fireplaced room. what a great room! The highlight was the custom designed fireplace which dominated thye room. Every night, the staff leaves a starter bag and several well aged hardwoods. We had a fire every night. Room was very large and bathroom was very clean and contemporary. I read some of the reviews on this site re. service quality and I must say, \"i have no idea how those people felt the service was bad\". Everyone at the property was incredibly friendly and helpful. On check-in, they left us a complimentary bottle of Chardonnay. When I mentioned to the service person, we enjoyed reds, he immediatley found us a bottle of the \"Harvest Red\". also, complimentary copy of Chris Botti CD was a nice romantic touch. Breakfast in the Country KItchen was very good, diverse, and pleasant. overlooking the Vineyards. I guess if I had to find a criticism is that the rooms were not well light (big deal). We will find a way to return. This place will always be special to us. Also great central location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Fay Hand","date":"2015-06-21 17:48:24 +0300"},{"content":"We split our stay between Sonoma and Napa Valleys, and we were initially undecided as to whether to stay at the Harvest Inn or at Bardessono. We were SO happy that we went with Harvest Inn. The hotel itself is lovely; the grounds in the morning with the fog on the mountains are a sight to behold! The breakfast each morning was wonderful. We really enjoyed the delicious, flaky pastries. Paired with the view of the vineyard and the fireplace, it was incomparable. The service was wonderful, so attentive, and the rooms were large, spacious, and luxurious. We will DEFINITELY return and recommend the Harvest Inn to our friends.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Angie Maggio","date":"2015-05-06 23:59:18 +0300"},{"content":"We booked two rooms (a dog-friendly deluxe king room and a double-queen room) for a family trip to wine country for Christmas. The Harvest Inn provided very pleasant accommodations. The hotel's scenery is wonderful--it backs onto a vineyard of cabernet and merlot grapes--and the rooms are spacious, if simply furnished (we stayed in the \"Rose\" section of the hotel). Check in: the reception area is in the main building, which formerly was used as a winemaker's club, apparently. Lots of carved wood, bricks, and \"lodge-y\" ambiance. It was decorated very nicely for the holidays. We encountered a problem at check-in (we were given keys to two king rooms, and had to return to get another room for the double queens), which the hotel remedied quickly if a little grumpily. There's no one to help bring your bags to your room, so be prepared to shlep bags from your car to the room. Rooms: the rooms are really spacious and offer a mini-fridge and some complimentary beverages. The decor feels a little dated, and the plumbing fixtures in both of our rooms were a little \"off\" (you had to turn the shower knobs several times to get the water going). For me, the worst part was the beds--they felt really old, with tired springs that were truly uncomfortable. Amenities: Though there are 2 pools on the property, the one closer to our room was out of service. The other, working pool has a hot tub and a nice view of vineyards and redwood trees. The breakfast buffet was basic but very convenient. Overall a very nice stay but somehow we felt that the Harvest Inn fell a little bit short in terms of service and quality of room for the price we paid.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":4.0},"author":"Elise Kertzmann","date":"2013-10-07 19:08:43 +0300"},{"content":"We stayed two nights at the Harvest Inn for a birthday occasion for my brother, who went upscale elsewhere (his birthday splurge!). My daughter had one room and we had another. The staff was very welcoming and helpful. There was complimentary wine and cheese both evenings (Friday and Saturday). The location in St. Helena is very convenient to the charming town and local wineries. The room we had was a deluxe king, with fireplace (it was in the 90's outside, so we didn't use it). The room was large, clean, although darkish. The bed was very comforting. The fridge had complimentary water and cola. The bathroom was spacious with tub/shower and two sinks, which we consider a plus. The closet was roomy and detached from the sleeping area. There was a large tv with dvd player. Breakfast was included and plentiful -- quiche, hot sausages, fruit, cereal, excellent baked goods, yogurts, juices. My daughter enjoyed her upstairs room, with a deck. There were two pools and jacuzzies on the property. There are spa/massage services available. The grounds are beautiful -- redwood trees, large lawns and roses, adjacent to a vineyard. A wedding was going on Saturday. Call the hotel directly for the best room rates. There are some great restaurants in St. Helena: Greystone on the high end; Cook and Cindy's Backstreet Kitchen were excellent in the moderate range. We definitely would stay at the Harvest Inn again and recommend it to friends.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Niko Kessler","date":"2014-08-12 02:16:19 +0300"},{"content":"We stayed here on the travelzoo promotion and it blew my expectations away. The grounds are lush and simply amazing so take a nice long walk. The country breakfast was a real treat, actually a huge spread. We had a couples massage in The Redwood grove and that was such an awesome experience. Super cool place to stay. We found a hidden gem at this place for sure.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Nelda Gutkowski","date":"2014-01-10 23:14:30 +0300"},{"content":"The most romantic room my husband and I have ever had. We stayed in the hot tub room with wood burning fire place. The hot tub is on a brick patio outside this overlooks the vineyard and mountains. YOu just take several steps down from your patio and you are in the actual vines. lovely in early December with the fall leaves on the vines The room is very large with the largest wood burning fireplace I have ever seen. Request room 203--the receptionist told me it is his favorite room upon check in and we loved it. Last nite my hubby and I had such a romantic evening by the wood burning fireplace (wood supplied free of charge by the hotel) and the jacuzzi outside. It is so private out on your patio you can easily sit out in the lounge chair or go in the hot tub in your birthday suit. The complimentary breakfast is very hearty and has a wide assortment. The lobby is so beautiful with all the wood and fireplaces. The grounds are stunning. If you are looking for a quiet, relaxing, romantic hotel with lots of unique charm then this is your bet. The hot tub room has got to be the best value in Napa Valley. The experience is truly amazing. You don't want to leave your romantic spacious room--you just want to nestle up with your honey.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Fritz Reichel II","date":"2014-10-20 00:47:20 +0300"}],"public_likes":["Dasia Cronin","Isabell Feest","Dana Bednar"],"vacancy":true,"description":"Offers free wifi, comfortable accommodations, complimentary breakfast and is walking distance to many local restaurants.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}