{"title":"Oxfordshire Way","name":"Shaven Crown","address":"Shipton-under-Wychwood","directions":"just off OW in centre of village; turn right on reaching A361","phone":"+44 1993 830330","tollfree":null,"email":"relax@theshavencrown.co.uk","fax":null,"url":"http://www.theshavencrown.co.uk/","checkin":"2PM","checkout":"11AM","price":"£50–£115  (double)","geo":{"lat":51.859,"lon":-1.597,"accuracy":"ROOFTOP"},"type":"hotel","id":35080,"country":"United Kingdom","city":"Shipton-under-Wychwood","state":null,"reviews":[{"content":"There is alot of construction ,lots of hammering other noises all day.Restaurant closes early and moves outdoor seating at early times. Th rates should be reduced during that construction phase.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Lavon Homenick","date":"2012-11-23 02:35:27 +0300"},{"content":"We stayed at this hotel prior to our caribbean cruise and post cruise prior to flying back to Nor-Cal. 1.Location ,Location,Location-Right in the heart of Old San Juan,all the great shopping,walking distance to the Forts of El Morro and Christobal -a stones throw to the Carnival embarkation pier. 2.Grreat service-as a longtime SPG member check in was a little crowded on cruise sunday -However George at the front desk provided us with excellent service and upgraded us to a suite-Nice! 3.a 5 minute cab ride to the Pan Ameician pier for Royal. 4.The Casino 5.The live music in the Casino 6. A bell staff that never dropped the ball-no fiascos If our expecting a expansive property such as Westin -this is not a resort If you need a great pre or post cruise stay this is your property","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Dr. Levi Rath","date":"2013-06-04 21:48:41 +0300"},{"content":"We stayed at the Sheraton in Old San Juan from 3/3-3/7, and again from 3/15-3/17. Having read previous posts, I was a little apprehensive about staying there, although we had already booked the room. We had nothing but a great experience. The hotel staff were wonderful, especially Frances who I believe is a supervisor. The rooms were clean and spacious, and we had a great view of the cruise ships coming in to port. The location is the best around. There are many hotels in San Juan, but not that many in Old San Juan. So if you want to be within walking distance to all Old San Juan has to offer, this is the place to stay. I just have to say a few things to those of you who mentioned the staff or the pool in a negative connotation. First, the hotel is very very busy. They are directly across the street from the harbor, so they are booked solid a lot of the time. They have many many guests to attend to, and I think as long as you are patient, they will be patient with you. Second, for the hotel to even have a pool is a pretty great thing, considering they are in the middle of a very busy city. The pool is on the rooftop, with a spectacular view of San Juan and the water. Yes, it is small, but what do you expect in a city? Anyway, if you are hesitating staying here, don't. We would stay there again in an instant.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Laney Stiedemann","date":"2013-11-04 19:01:24 +0300"},{"content":"We arrived on a Wed at 2:30pm. No problem getting into the room. We had reserved the AAA rate and we were upgrade free of charge. All staff we met were very pleasant and helpful. The room was clean. We were on the 8th floor and the hallways were very musty. The pool is small. The view from the pool area is fantastic. The hot tub was only lukewarm. The location of the hotel can not be beat. You can walk across the street for a free shuttle around OSJ. There is a Harley Davidson clothing store in the Sheraton shopping complex next door. I would stay here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Johanna Wilkinson","date":"2014-12-18 20:42:34 +0300"}],"public_likes":["Beau Trantow","Sammie Treutel II","Jovan Welch","Kaylee Heller","Seth Raynor","Mr. Ebba Boyer"],"vacancy":false,"description":"Comfortable accommodation in fabulous historic building (14th-century gateway and Great Hall). Evening meals available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}