{"title":"Chamonix","name":"Hotel Le Faucigny","address":"118 place de l'Eglise","directions":null,"phone":"+33 4 50 53 01 17","tollfree":null,"email":null,"fax":null,"url":"http://www.hotelfaucigny-chamonix.com/","checkin":"3PM","checkout":"12AM","price":"€90","geo":{"lat":45.92437,"lon":6.86916,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5337,"country":"France","city":"Chamonix-Mont-Blanc","state":"Rhône-Alpes","reviews":[{"content":"From beginning to end our visit to the Encore was first class. Service was professional and attentive from the valet who greeted us to the front desk associate to the housekeeper. Our suite... loved the floor to ceiling windows, the king bed was fit for an emperor and the soaking tub... heaven on earth. Society Cafe was excellent for any meal! We especially loved the succulent Cowboy Steak!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jovani West","date":"2015-10-29 23:48:10 +0300"},{"content":"Our hotel room was amazing! My boyfriend and I stayed there for an entire week in the mid july. The room had a great view and the design was very modern. The room had a flat screen tv. The hotel had many different restaurants. The staff there is also very friendly. We were always greeted in the hallway by a staff member. The only down side was that it was a little loud---they host outdoor parties.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Vance Pfannerstill","date":"2013-10-13 17:50:15 +0300"},{"content":"As the third and final instalment of our honeymoon we decided to spend a week in Vegas.  We've been before, staying in the Paris hotel - but as it was a special occasion, Encore was the hotel of choice.  We flew in from Hawaii and got to the hotel at about 1am Vegas time. There were 3 staff on the reception desk, and no queue. The girl was very nice, and when she read 'honeymoon' on the paperwork, she upgraded us to a suite on the 58th floor.  The room was stunning, and the view down the strip at night was amazing from so high up. It wasn't until the morning I could see a huge empty golf course on the left, and numerous swimming pools! It was a huge room, beautifully decorated and even had remote control curtains!  The TV in the bathroom didn't work, but as we didn't spend much time in the room we didn't care.  Once we'd unpacked, we decided to have a brief 'explore' as we were hungry. We found a small shop in the hotel that sold sandwiches and drinks - so bought some stuff. A sandwich, 2 bags of crisps, 2 bottles of juice, a bottle of water and an ice cream mars bar - $38! At that point we decided to avoid the hotel shop and get 'supplies' elsewhere! We went to the pool on a couple of occasions. It was really nice and had plenty of loungers available. They gave you towels, and often handed out bottles of water. There were also water dispensers around the pool too.  With the 115degreesF temperature at the time, I guess they wanted to keep everyone hydrated.  We ate in Switch restaurant in the hotel which was one of the best meals I've ever had. The food was divine and the setting is amazing. It was probably the most expensive meal we ate in Vegas, but it was worth every penny. (approx $240 for 2 mains, 2 deserts and a few drinks).  We also ate at the pizza cafe in the hotel which was lovely and pretty cheap.  The duelling pianos bar was really cool, but you HAD TO purchase at least a drink each before they'd let you in! $30+ for a beer and a cosmo!  We discovered the best way to drink in the hotel was to play slot machines - as you don't have to pay (just a tip to the waitress). That way, the $30+ rounds cost $5 each! Our plane had a huge delay on it, and we ended up staying an extra night (which BA paid for - thanks!). The staff were really helpful when sorting it out, and even gave us our better room at the standard rate.  As we'd originally booked a package we didn't know about the 'resort fee' - but on our extra night we had to pay it. The benefit of paying the 'resort fee' is that you get free wifi.  Although the hotel is on the strip, it's maybe a bit far away from most things. It's a fair walk to some of the other hotels since it's located quite far up the strip. It's good for the Fashion Show Mall - which is a 5 min walk. If I return to Vegas I'd probably try and stay somewhere nearer the middle of the strip so that I have easy access to all the hotels / casinos.   On certain days they have a Beach Club - which is essentially a night club during the day. We never attended - but it was a nightmare trying to get a taxi at 6pm as there were hundreds of drunk youngsters trying to get home. We stood in line for about 25mins - which made us late for our restaurant reservation. We also went to get a taxi at 4am to go home... just as the Surrender nightclub had come out. Thankfully the doormen had the sense to let us skip the queue since we had 4 suitcases! Although we were on the 58th floor, we could hear the music from Surrender when in bed. In summary, Encore is an stunning hotel. It's beautiful both inside and out, and the staff are brilliant. It does come at a price though! Would I go back - probably not. I'd rather try somewhere else a bit more central... However I would recommend it for a one off.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":5.0},"author":"Amalia Murphy","date":"2015-12-26 23:27:43 +0300"},{"content":"Encore is a very nice hotel. The regular rooms are like a small suite. Very nice having the extra space. Rooms were clean, cleaned daily by a very nice housekeeping staff. Beds were very comfortable, linens were nice. Towels large and plenty of them. Love the seperate tub and shower. Televisions in the bathrooms were a nice touch.","ratings":{"Location":4.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Eladio Walker","date":"2015-09-07 15:18:56 +0300"},{"content":"My husband and I are not the biggest travelers, but when we travel, we want to stay in nice hotels and \"splurge\" on accommodations. We selected the Encore after reading quite a few reviews of LV hotels. We've never been to LV before, and the Encore just blew us away. I have stayed at many wonderful hotels, but the Encore by Wynn was just wonderful on every level! I loved the \"suite\" feature of all of the Encore rooms and the bathroom was HUGE. Beautiful linens, room spotlessly clean, excellent amenities. I liked the fact that we were on the North end of the strip, and could get away from the noise and the crowds. We like to walk and had no problem navigating the rest of the strip. After visiting almost every hotel on the strip, we definitely made the right choice. Wonderful staff as well - the concierge was great securing reservations and even just making recommendations. We ate at several of the restaurants and thoroughly enjoyed every meal. Pricey, like all of Vegas, but excellent with top notch service. Love the shopping within the Wynn complex as well! Especially the Manolo Blahnik store! Hands down, the best place we've ever stayed and we will be back. Worth every penny.","ratings":{"Location":4.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Mrs. Octavia Mills","date":"2013-11-20 02:07:49 +0300"},{"content":"Speedy check-in on arrival - courteous and friendly staff. Rooms were huge and well-appointed. Comfy bed and great view over the strip and downtown. Everything worked well during our stay. The TV in the bathroom was a nice touch. Bit of a walk to any attractions or restaurants outside of the hotel/s but access to the fashion show mall shouldn't take more than a 10 minute walk.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Liza Greenfelder","date":"2014-12-27 21:58:00 +0300"},{"content":"Yet another wonderful experience at this marvelous resort.  Although I didn't have a salon suite like I had prior (I tipped my desk clerk way more than $20 bucks, that trick didn't work for me loolol) but the panoramic tower room was phenomenal!! We stayed on the 60th floor with an awesome view of the strip.   Something I realized this trip is that there are no casinos or hotels in Vegas that even compare to the Wynn.   It was so nice to see such a clean resort with fresh flowers placed throughout it daily.  No one else does the little things like that.  Not even the newer Aria has anything to compare.  Now, even as a big fan of the Wynn, here's  a couple of things I disliked... We arrived on Thursday to a partially empty casino, it was awesome!! Not a lot of smoke, not a lot of people and we were actually winning money!! Everyone was happy... This was short lived because as soon as Friday arrived EVERYTHING changed. Like a switch was switched..  I guess the pro's arrived and took over.  The place became super packed, the smokers arrived in herds and I lost all the money I had won, plus some.  I know, I know - it's a casino, duh...but I think the next time I go I'll try to go during the week with the other amateurs.   Oh and another helpful tip,  park on the top floor, level 4 if you get a car rental..  It's a lot cooler with plenty of parking.  Unlike the other $@!#% casinos, the Wynn makes parking and entering the resort a breeze.   Love the koi ponds they have at the entrances to their uber elite villas.  I always love to go there and just hang out for a few minutes, so very refreshing.  Thanks Wynn, <3 you for being the best!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Pasquale Treutel","date":"2014-09-07 00:53:22 +0300"}],"public_likes":["Shaina Hickle","Owen Mohr","Mr. Gregorio Hammes","Caden Turcotte","Sofia Miller"],"vacancy":false,"description":"Hotel Faucigny is situated in the historical center of Chamonix Mont-Blanc, close to shops, ski schools and mountain house, at 100 m from ski buses. Private car park.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}