{"title":"Shrewsbury (England)","name":"Hawkstone Park","address":"Weston Under Redcastle","directions":null,"phone":"+44 (0)1948 841 700","tollfree":null,"email":"enquiries@hawkstone.co.uk","fax":"+44 (0)1939 200 311","url":"http://www.hawkstoneparkweston.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.857315,"lon":-2.642852,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":27165,"country":"United Kingdom","city":"Weston","state":null,"reviews":[{"content":"WIFI is really fast 8mbit up/down. Very luxurious interior and superb view from window.","ratings":{"Overall":5.0},"author":"Reba Osinski","date":"2015-02-10 18:54:10 +0300"},{"content":"I stayed at the Sprinhill Suites last July with my cousin. She didn't want to stay at a Casino Hotel and since I am a Marriott Member, I wanted to pick a Marriott property. I chose the Springhill Suites since it was pretty new around the time we stayed last year. The rooms were nice, clean and very modern. It is off the strip across from the Las Vegas Hilton if any of you know where that is. We always rent a car so getting to the strip and around was okay for us. The free buffet breakfast was nice. Nothing elaborate but more than enough. Eggs, Bacon, Potatoes, Oatmeal, Cereal etc..... The price for the hotel was good and I would stay there again if I didn't want to stay in a Casino hotel or needed to save a few bucks but I usually stay at the huge hotels on the strip.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":3.0},"author":"Fernando Rath","date":"2012-04-09 03:59:47 +0300"},{"content":"We stayed at SpringHill Suites when we were on our national Knocking Out Obesity tour. We traveled through 28 cities and stayed at many hotels. This was our favorite! Beautiful, great room design and full of all the amenities you need.","ratings":{"Overall":5.0},"author":"Isai Price","date":"2013-08-31 10:19:46 +0300"},{"content":"I stayed four nights at this hotel with my husband. The room was very roomy, clean and comfortable. We could see the view of the nearby golf course and the bright lights of the Las Vegas strip from a distance from our room. We felt safe and liked the idea of having a security pass to even get to our floor; this prevents people from just walking around. The hotel is very quiet in the evenings. The pool on the roof top was a treat, especially the beautiful views of all Las Vegas. We also enjoyed the very delicious breakfast buffet each morning. The free parking in a well lighted and secure parking garage is also a plus. I will definately stay again at this location and recommend it to all.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mariano Brekke","date":"2013-01-21 09:36:52 +0300"}],"public_likes":["Derick Lindgren"],"vacancy":false,"description":"This property includes 2 championship golf courses.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}