{"title":"San Francisco/Twin Peaks-Lake Merced","name":"Days Inn at the Beach","address":"2600 Sloat Blvd","directions":"at 44th","phone":"+1 415 665-9000","tollfree":null,"email":null,"fax":"+1 415 665-5440","url":"http://www.daysinncalifornia.com/html/days-inn-hotel-california-sanfrancisco.asp","checkin":null,"checkout":null,"price":"$125–$160","geo":{"lat":37.7357,"lon":-122.5024,"accuracy":"APPROXIMATE"},"type":"hotel","id":26167,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We were disappointed with our three nights at Dockers July 19-21. The room was not vacuumed in corners & at walls, dust was thick on headboards and also when I went to plug their clock radio behind nightstand. Clock radio gained half hour overnight,. And TV remote did not work, nor did the one they replaced it with. We stayed off-site near the pool area. When discussed with staff, she replied \"we haven't had a housekeeping complaint in 3 months\", which I found hard to believe. The location was good and the pool area nice. Thee Sunday evening buffet in the restaurant was pretty \"common\".; but the breakfast buffet in the restaurant was better.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Tre Lubowitz","date":"2012-07-31 20:56:39 +0300"},{"content":"This is a great place to stay while in Branson. It is not on the main main strip, yet close enough for all shows to be readily accessible. The hotel is clean and in good repair (a must for a positive veriew). The staff is wonderful, helpful, knowledgeable, and eager to assist in any way possible. High speed wireless internet access is available only from close vicinity of the lobby, but I was told that this will expand in the very near future. The breakfast provided by the hotel has waffles, toast and jelly, cereal, juices, coffee, pastries, and fruit - certainly enough for a good kick-start for the day. For the price, this hotel is great! I highly recommend you give it a try.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Miss Yasmeen Schultz","date":"2012-12-21 09:57:19 +0300"},{"content":"We had a Wag Jaunt for a 2 day stay this past week for 4 friends ( my 19 yr dtr. and her friend and myself and a friend). We had no trouble getting there - handy to Lakeshore Blvd. Walking distance to so many things to do and see. Cora's is just down the street for lunch. They let us have early check in and late check out. I thought it would be noisy at night when the clubs close but we were on the 9th floor on the east side and did not hear a thing. Breakfast was wonderful- the staff encouraged us to take whatever we wanted to go - with paper bags made available. Nice lobby with fresh cookies in the evening. We would love to come back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Caden Quigley II","date":"2013-06-04 12:12:02 +0300"},{"content":"This was my 1st time in Toronto so maybe there are better locations but I felt everyday we were there we walked in a different direction and found great things to do. Our room also had 2 queens which was nice since I went with a bunch of dudes. Great rates, Great location, friendly staff. Weather you want a night club, pub, strip club, rock bar, resturant, or shopping ... it was all minutes from the door step. What else can you ask for?..... I know... it also came with a fridge and mircowave. : )","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Micheal Douglas","date":"2012-08-13 10:47:15 +0300"},{"content":"This hotel is a perfectly acceptable business style hotel, nicely located in Toronto. What annoys me is that have repeatedly taken money from my credit card account without providing documentation and without discussing or agreeing the amount with me first. They just take the money! I'm not saying the funds weren't due, but the first I knew about it was from my credit card statement. That can't be right. The no documentation makes claiming expenses a nightmare. I won't be back.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":1.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Ms. Chaim Crist","date":"2012-06-01 15:46:15 +0300"},{"content":"My stay at the Hilton Garden Inn was as comfortable as being at home. I recommend this hotel to anyone, be it for business, pleasure or a family vacation. The price was also amazing, especially for being right downtown.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Daryl Lind","date":"2013-04-09 18:31:35 +0300"},{"content":"Great Location , great price. staff was lovely except the lady who checked me in , wasnt a happy person , she didnt check me in until she make sure that i m a hilton employee , which i m not very happy about . it doesnt matter if im hilton employee or not , check me in first, make me feel welcome and then when i leave the front desk , call to check the level of my honesty , and if im not hilton employee , all you have to do is switch rate and give me call to let me know !!! Abbas was great GSA , very professional , and he was a lot of help . thank you abbas .","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Olin Schimmel","date":"2015-01-16 16:28:09 +0300"},{"content":"I was on a business trip and never expected to stay in such a nice hotel. Perfect location (CN tower and Rogers Centre just a short walk from the hotel). Friendly and helpful staff. Clean. Loved the in room coffee machine and microwave. I stayed at the hotel for 3 weeks and next time I'm coming to Toronto I'll ask my hosts to get me a room in Hilton Garden Inn again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Service":5.0},"author":"Dangelo Olson","date":"2012-05-13 16:08:24 +0300"}],"public_likes":["Olaf Gorczany","Louisa Wisoky","Graham Schoen","Madilyn Torphy","Camille Brown","Kory Sipes"],"vacancy":false,"description":"Your typical Days Inn; across the street from the zoo.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}