{"title":"London/Hammersmith and Fulham","name":"La Reserve Hotel Chelsea","address":"422-428 Fulham Rd, SW6 1DU","directions":"tube: Fulham Broadway","phone":"+44 20 7385-8561","tollfree":null,"email":"info@la-reservehotel.co.uk","fax":"+44 20 7385-7662","url":"http://www.la-reservehotel.co.uk/","checkin":null,"checkout":null,"price":"£95","geo":{"lat":51.4802,"lon":-0.19105,"accuracy":"ROOFTOP"},"type":"hotel","id":16175,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Great staff and Lovely place A ++++ Having just returned this week from the Dominican Rep. for the first time, me and my party all had a fantastic time. There really is something for everyone here whether you have children or if you are just a couple you will not be disapointed, the staff are wonderful particularly the Animacion team they work so hard and as they keep telling you they really do Love their job The team come around and get you up joining in with activities all through the day but if you are not interested they will not pressure you into doing these. They have many things such as Beach Volleyball and Soccer, Table Tennis, Darts, Water Polo, Aerobics, water aerobics and even dance lessons ! - Cappucino, Oliver and Richard were our favourites but all of these guys make you feel welcome and help break up the tediousness of a long day sunbathing.There is lots of things to do in the resort but the Bambu is the best hotel and because of this you do get people coming from the Palace to hang around you but this should be taken as a compliment as the palace is supposedly better. After ivsiting the Palace we found it to look more asthetically pleasing but there was no atmosphere at all around the pool and felt like people looked down on you if you didn't have a white band on your wrist ! You are much better off staying around the Bambu, day times as well as evenings as the entertainment is much more fun. We all found the food to be of a good standard and with each evening in the main restaurant havung a different theme to it meant that you had a wide variety and you weren't stuck with the same choices each night. The other places to eat near by were also good, in Mama Jawana's you can either go for the Steak House or Mediteranean which is split into 2 halves. These are both 5 courses and are nice but we found that once was enough even though the service is great there was not as much variety of choice. There is also the Caribe Grill restaurant which is on stilts and overlooks the sea, we found this to be the least appealing of the 3 as the staff were not as good and neither was the food but it was a nice change over 2 weeks.The only problem with these 3 is that you have to really book them at 7am in the restaurant because they are limited with space, the Cribe Grill only has a few spaces as the majority have been reserved for the Palace guests and as we found out 1 day, trying to book it at 8.45 am was too late !Many people will be happy with the restaurant but a word of warning for non smokers is that this is allowed in about half the room but this is not seperated from non smoking so if you are near by then it may put you off your food. Only 1 of us became ill in the 2 weeks but whether the food was to blame we do not know, it was all well cooked and fresh, due to a pregnancy we checked that the salad etc were washed with bottled water and were told yes and the ice cubes were not tap water so we were happy. The pool area is well kept and clean and there are plenty of loungers to choose from ( some people reserve these early in the morning or even late at night even if you are not supposed to ) There are plenty of places on the beach and this is vast meaning you don't have to be close to anyone if you don't want to which is great if you just want to sleep in the shade. There are lots of free things to do at the Scuba Caribe places but they will always try to sell you the Scuba Diving and Parasailing rather than you do a free activity such as Kayaking, Snorkelling and Catamaraning ( also if you do want these free ones they tend to be no where near as friendly or heplful and they do not allow these in even slightly choppy water. )There were plenty of bar staff on all the bars so we never waited more than a couple of minutes and they are all friendly and recognised you instantly after the first night. The cocktails are very nice and they make so many that there is no waiting around for them. The beer is very good and the soft drinks all are slef service along with popcorn and peanuts so that saves time anyway.The rooms were very clean and spacious with plenty of clean towels brought daily along with a few toiletries to keep you going. We didn't see any cockroaches or bugs in the room and the air conditioning was so good that we nearly asked for a blanket at reception !! The maid came daily to make beds and tidy up and we found nothing to be taken. The mini bar was stocked every other day and we found this to be enough.The grounds were very well looked after by the gardeners who do a freat job and the public toilets were cleaned round the clock.* Please be carefull of the steps leading up and down from the poolside to the bar as these are deadly - we saw one man slip down them with a glass in hand from the bar and was badly cut as he landed on it. * The reception floor can be slippy when it rains again we saw many people lose their footing.* They do many activities in the main pool and around 5pm these usually involve physical activity, they do move people out of the way but unfortunately one accident happened and a lady was landed on by a man falling off an upturned boat and she had a neck brace on for her whole holiday - Not nice so be wary of children around this time in the main pool area.Overall - great place, Excellent staff and Lovely Facilities but you will hear the same 5 or 6 songs played about 300 times during your stay !!!!Richard and Friends x","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Maryam Osinski I","date":"2014-07-31 01:29:55 +0300"}],"public_likes":["Arden Hintz","Keyshawn Conroy","Mr. Weston Kertzmann","Rafaela Bednar","Dr. Delia Von","Kailyn Hegmann","Leanne Borer"],"vacancy":false,"description":"Small hotel offering 43 en-suite bedrooms in the extreme south-east of the district bordering Chelsea. The hotel overlooks Chelsea Football Club.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}