{"title":"Joshua Tree National Park","name":"Jumbo Rocks Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":33.99164,"lon":-116.06253,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12927,"country":"United States","city":"Riverside County","state":"California","reviews":[{"content":"Loved this hotel! Great beds and bathroom ... the two most important things in a hotel. Also found the concierge very helpful in suggesting and booking beau wine tours for us. Liked the location close to everything.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Rebeca Marquardt","date":"2015-02-22 23:49:12 +0300"},{"content":"Good hotel at a good location. I would stay here again. It was relatively quiet for our stay.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Dolores Littel","date":"2015-12-30 13:33:42 +0300"},{"content":"we arrived at the hotel fairly late at night due to delays by the airlines, but we called ahead and the friendly staff were informed of our delay.. we stayed at the hotel only a few short months after its opening and if i could describe it in one word..WOW !! the hotel is amazing.. the surrounding area is in the heart of napa but still up and coming, there were many of new business( store fronts) buildings that were vacant. the staff was very nice and polite and the concierge station was extreamly helpful in planning some great wine tours, they even gave us free sampling cards of other local shops and winemakers. the patio area has a fireplace which is great for enjoying a bottle of wine and winding down after a long day. the rooms were very nice, clean and had a safe in each room along with flat screen tv and a incredibly big walk in shower!! valley parking is expensive but there is a free parking garage literally right behind the hotel !! ( 30 second walk if you go out thru the dinning room exit ) altho you must park on the 3rd floor for free overnight parking. you will get towed on the first 2 floors!! hotel prices were little on the steep side but it is Napa Valley !! i would absolutely stay at this hotel again.. also anyone planning a trip to Napa .. the wine train dinner is a must !! great 4 course meal with a relaxing view of the Napa countryside","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":2.0,"Location":3.0,"Rooms":5.0},"author":"Dallin Thompson","date":"2015-07-04 14:33:51 +0300"}],"public_likes":[],"vacancy":true,"description":"The largest campground in the park, located near the junction of the park roads in the northern part of the park. Sites are surrounded by scenic granite formations.  124 sites, no water available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}