{"title":"South Uist","name":"Howmore Youth Hostel","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.gatliff.org.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.30281,"lon":-7.38606,"accuracy":"APPROXIMATE"},"type":"hotel","id":28177,"country":"United Kingdom","city":"Na h-Eileanan an Iar","state":null,"reviews":[{"content":"A group of us stayed at the Ritz and had an excellent time. I am surprised by the inconsistent reviews as we found our rooms and service and the common areas to be great. We did upgrade to the Maison Orleans, which is essentially a club level, and well worth it. The \"club\" area has free food and beverages virtually all day. Service was excellent. Room service was a 10/10. Rooms on the club side are hardwood floors and upgraded features. Hotel is beautiful inside and out and very close to the main part of the Quarter. Location was superb. Lots nearby and very convenient. As you expect with a Ritz, food and beverage there was expensive. Upgrade to the nicer side of this hotel and you will really enjoy it. So much to do and see around there--we will go back. Lobby bar and live music was superb too. Heard the spa was great, but we missed out.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Gaston Welch","date":"2014-07-20 04:01:42 +0300"},{"content":"Spent several weeks off and on in New Orleans this past winter often staying at the Ritz Carlton. Wonderful service and fine rooms. The club level is quite nice with great food and drink spreads. The clientele are a bit older and the atmosphere is a bit stuffy, but you kind of know that going into a Ritz, although they are working on redoing all of that I guess. Overall great location right off Bourbon street and wonderful staff. They regularly opened up the gym for me after hours so I could get a work out in. Good people, and I'll be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Hillary Zemlak","date":"2013-06-30 06:40:44 +0300"},{"content":"We had reserved a room at the Iberville Suites which is attached to the Ritz-Carlton, however, upon check-in we were notified that our room was in the Ritz-Carlton. The hotel itself is very lovely and the staff was quite attentive and friendly. Our room was spacious, however, housekeeping seemed to appear irregularly and quite late in the day, which was a little inconvenient. The hotel bar is nice and had some very good jazz bands playing. The layout of the hotel is somewhat annoying. We had to take multiple elevators and stairs to reach our room. Being in the heart of the French Quarter, we were somewhat surprised at the absence of street noise. However, in the room adjacent to ours we heard a lot of noise from the children there, so if your neighbors are noisy, you will hear them. I had left some luggage in my car and when I went to where the valet service had parked it, my car had been left unlocked. The valet area is accessible from the sidewalk, so you may want to be sure your car is locked after it has been parked. Otherwise, the valet staff was friendly and attentive.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Edmund Shanahan","date":"2015-06-02 20:04:58 +0300"},{"content":"We are just back from a 3 night Mardi Gras stay at the Ritz on Canal in New Orleans. This is a beautiful property that is very secure and in a perfect location to enjoy all the fun of Mardi Gras and the beautiful city. First the positives. We were on the parade route with a view out the front window onto Canal. The hotel provides you with a wrist band to show so that non-guests are not allowed in. We saw several people being turned away at the door. We liked that security was tight. The lobby is on the 3rd floor and you have to change elevators to get to the room floors. Added to the security element I guess, but it was a little annoying. Our room was ready at 3 PM as promised although we saw many people who were waiting well after 6 pm for their rooms. Our king room was not big - and the bath area is completely seperate - which was nice but it makes the room feel even smaller. The room decor was identical to that pictured on the website. The bedding is very nice with a feather bed on the mattress - comfortable! Our one window was large with a great view of Canal St. There is a TV, mini bar, large desk and a comfortable chair. Plenty of drawer space for a long stay if you need it. Bathroom amenities were Bulgari. The room and carpet were very clean - even the outside windows had been recently cleaned! The entire lobby smelled of fresh Gardenia - ahhhh and the lobby floral arrangements were stunning! Cabs are not plentiful in New Orleans right now. We had trouble getting cabs more than once. We managed one to Commander's Palace for Sunday Brunch, but we never even thought to ask him to return to get us. We ended up walking all the way back to the hotel (almost 3 miles) which wasn't a bad idea after a big brunch - but I could have used other shoes to make the trip! One cabbie told us there are only 1/3 of the cabs left in town that were there before Katrina. The Ritz is a 1 block walk to Bourbon St. It is on the very end of Bourbon, which is a great location - still on the outside but close enough. It seems as though most of NOLA is headed in a positive direction. Once again we were treated to great southern hospitality and met very friendly people. The staff of the Ritz was pleasant, but not overly stuffy. My guess is that people who have negative opinions of the service here are used to getting fussed over a bit more (spoiled?). We saw a nice demonstration of that at the front desk as a man threw a fit that he needed help with his bags immediately because his \"private jet\" was due to leave asap! Whatever dude! We found the service to be excellent - especially during the busiest time of year. The hotel was spotless and if you weren't in town to celebrate Mardi Gras this would be the place to stay - it was downright quiet even though the hotel was very full. I would stay here again if the price was right, but I don't know if I will ever find the great deal that we had again!","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Marcus Adams","date":"2012-11-20 23:38:02 +0300"},{"content":"I just returned from a trip to New Orleans and was somewhat disappointed by the Ritz Carlton. I can't say that anything especially bad happened to me when I was there, it's just that the service was not up the Ritz standards. I travel a fair bit for work and usually stay in Ritz Carltons and Four Seasons and I like this hotel less than any other Ritz I've stayed in. I thought the decor of my room was pretty horrifying. There was dark Victorian-looking wallpaper with matching drapes and near matching comforter. Suffice it to say that it was not my thing stylistically. Also, there was hair on the shower walls in the bathroom (not a lot but enough to make you wonder about how thoroughly the rooms are cleaned). The service was pretty good but just not as crisp as a typical Ritz. For example, when I called down to get my car brought up the morning of my departure, the attendant's answer was \"gotcha covered.\" I didn't think that was especially appropriate. Finally, once I got downstairs 10 minutes after calling, the car still hadn't been brought up. I had to wait another 5 minutes. Maybe that would have been understandable if it was busy, but this was 5am and no one was around. Until I find a better hotel in NO, I'd probably stay there again but would certainly lower my expectations.","ratings":{"Overall":3.0},"author":"Addie Lowe","date":"2014-04-12 17:56:15 +0300"},{"content":"We just returned from visiting the Ritz for our 20th anniversary. As I'm originally from Pascagoula, MS, I was anxious about seeing how New Orleans was rebuilding (lives as well as buildings). Many thanks to all of you who posted encouragement to visit, you were right...it welcomes visitors with open arms. I'll try to be concise with my info, so here goes. Where we ate: Breakfast at the Club Level-light stuff, fruit, berries, etc. which was good, considering our other meals. Lunch-Masperas (sp?) one day as I was scouring the city for a soft-shelled crab po-boy. Hot and hungry, settled for a shrimp sandwich (po-boy like, but on a bun) and it was good. The line outside cracked me up-all these cranky and hot people waiting to get in-you feel like you've won the lottery to get in AC. Other lunch-New Orleans School of Cooking which is in the quarter, 2 1/2-3 hrs., good food, very entertaining. Loved their jambalaya, bread pudding and pralines but the gumbo was just soso as they had to make it in less than 4-6 hrs. Dinners-the hotel restaurant. Crab trio was great, filet with crab was good, hubby's was so bad he had to complain (very unusual as he'll eat most anything). Great jazz band in there, preceded by a female singer who was also good. Also went to Commander's Palace. The BEST service I've received that I can remember, ever. Very reasonable ($39 for appetizer/entree/dessert!)-started with the waiter's suggestion of crawfish something-it was divine. Hubby said the turtle soup was good, not great. He regularly eats it at the Brennans in Houston which he prefers. Entrees were soft-shelled crab prepared with some other stuff-I'm sorry I can't remember. The crab was very good. DH had a fish dish that had crabmeat which he loved. The dessert...I truly have never tasted better cheesecake in my entire life! They make their own cream cheese! Hubby had the praline parfait but couldn't stay out of my cheesecake. We had the rest wrapped up to fit in the little fridge. It was that good. The hotel: Smells WONDERFUL! Beautiful flowers, great service (although they forgot turndown both nights), nice bathrooms with separate toilet area, nice furniture in the rooms, and frette linens!!! Slept like a baby... Other things we did: lots of walking around, antiquing, looking at art, took a nice carriage ride and got to see a funeral! You must see a New Orleans funeral! The band plays jazz (happy or sad, depending on the direction they're going) and the mourners follow it, carrying umbrellas. It was so moving, we got out of the carraige to pay our respects. I know this probably doesn't sound very action packed to most of you, but we really needed to relax this weekend. We did walk around with a 'hand grenade' which was a green drink in a silly glass. Thats always fun. And we spent Sunday morning watching Nadal beat Federer...again! Thanks for reading and please don't hesitate to visit NOLA. Yes, its hot (just like Houston), and yes, some areas you don't want to venture down-like empty streets, but we truly never felt unsafe. Oops, not so concise, but I tried","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Keaton Murazik","date":"2015-05-02 21:31:59 +0300"},{"content":"I have to start by saying that the following stay occured during the weekend before Mardi Gras. With that said, when we arrived at the hotel at 3 o'clock in the afternoon we were first told our room was ready, then it would a few minutes, so they would buy a drink, very nice. After an hour we were told, someone else actually had our room, so it would be a few more minutes. I should interject here, that some of the staff were very poorly trained and acted as if we were inconviencing them because they were so busy. We were told to go to the lounge and wait they would call us on our cell phone. Finally at 5:30, 2 and 1/2 hours after we arrived, we went back to the registation desk. The woman said, \"We have plenty of rooms in the club section, we will upgrade you\". But what she meant was we will put you in club level and charge you more. It was an extra $150 per night. We were tired from our flight and said fine. So finally after now 3 hours we were about to get to a room. Here is the kicker, when we got to the room it was occuppied. I mean, the bell boy, actually opened the door, we walked in and someone was in there! Finally got a room 3 and 1/2 hours after arriving. By the way, many other people had to wait for their rooms and we were told they were short staffed for cleaning rooms. I'd like to assume that my experience was due in part to Mardi Gras, problems finding staff in the wake of Katrina, and a hotel being renovated. ROOM Nice bed, but suprisingly a regular TV, 24 inch, limited cable. Great bathtub and a menu of exotic baths they will prepare for you. Bulgari bathroom amenities. High speed internet, but they charge you an additional $12.95 on top of the $500 plus a night they are already getting during Mardi Gras for a club level room. CLUB LOUNGE While they state 5 \"tastings\" or meals, in reality there is only 5 on Friday & Saturday. The other days it is really only 4, in fact the 4th or last of the day is simply drinks and some desserts. Overall I'm not sure if the club level is worth the extra money, in our case about $150 extra per night on top of a standard room for around $350 during Mardi Gras. In addition, it should be noted that getting to the club level requires 2 elevators and a walk. To get to your room requires a 3rd elevator. They claim a new elevator direct to the street will be open in April, so that should no longer be an issue. LOCATION While you are close to Bourbon St. and the French Quarter, it is not in the safest area of New Orleans. Be careful at night near the hotel and DO NOT WALK THE WRONG WAY UP CANAL ST. If you've been drinking, take a taxi back to the hotel. Also, always ask taxi drivers to turn on their meters. New Orleans taxi drivers are notorius for ripping off their fares. CONCIERGE We had really wanted to go to Jaces Imo's restrurant. We asked the concierge to make a reservation and she simply said it is closed. I would've expected another recommendation at least. Granted she was busy, but hey I thought this was the Ritz Carlton and they could handle Mardi Gras with their usual high level of service. They certainly knew how to charge at a high level.","ratings":{"Service":2.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":5.0,"Location":1.0},"author":"Gerald Koch","date":"2012-12-19 01:37:29 +0300"}],"public_likes":["Mylene Kovacek","Alfredo Conn","Herta Quigley Sr.","Emely Swift Sr.","Dr. Ahmad Padberg","Naomie Morissette","Oceane Kub"],"vacancy":true,"description":"Simple hostel with no advance booking (and no phone)","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}