{"title":"London/South Bank","name":"Park Plaza County Hall","address":"1 Addington St, SE1 7RY","directions":"tube: Waterloo","phone":"+44 20 7021-1800","tollfree":null,"email":"ppchinfo@pphe.com","fax":"+44 20 7021-1801","url":"http://www.parkplazacountyhall.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.5014,"lon":-0.1159,"accuracy":"ROOFTOP"},"type":"hotel","id":16351,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"The only place I stay in Berlin is Casa Camper. I've been 3 times this year and 1 time last year...unless I actually move to Berlin it's where I will be staying. The rooms have a great layout (I would like the table/chair to be a bit more desk like for laptop use and sitting), smart design. You can flood the rooms with natural light or totally black out. The shower makes you want to never leave. Upstairs the 24 hour cafe is a godsend for snacks, juice, a place to get a bit before or after a visit to Berlin nightlife.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaitlin Herzog","date":"2013-05-20 23:05:39 +0300"},{"content":"Hip hotel. Red, loud, vibrant, clean edged. Great bed and quite an amazing multifunctional shower. Loved the focus on the bathroom, light and views. Hotel not inexpensive so the comp buffet much appreciated. Service wonderful. Location will suit those with a thing for markets, and who crave shopping locations that focus individuality. Easy walk or bike ride everywhere but then that is the allure of Berlin.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Justyn Rutherford","date":"2014-06-23 02:22:49 +0300"},{"content":"We travel every year and have visited many big cities in many countries, NYC, Wash.,D.C., Rome, London, Madrid, Barcelona, Paris, etc. and we can say this is the best hotel ever for the money, and worth every penny. Every small detail and comfort has been taken into account. Felt bath robes and bath sandals are provided. Very good quality assortment of towels. A truly spacious hi-tech room, very well laid out, comfortable bed, flat TV, chaise lounge, practical spacious counter space with internet connection, safe in the room, A/C easy controls, plenty of outlets throughout the room, total darkness control, a delightful true shower with additional hand-held shower. Excellent location, within walking distance of chic shops and plenty of restaurants. A metro station is at the very corner of the hotel. Most outstanding of all: the top floor is a 24-hr self-service cafeteria, with true cloth table tops and napkins, where there is always a complimentary variety of sandwiches, breads, desserts, fruits, cold-cuts, and an assortment of beverages, coffee, teas, chocolate. On the same floor there is a reading room with daily newspapers, local and foreign, and a separate area for two Wi-Fi enabled state-of-the art Apple computers (very smart choice!) and a lasser printer. The service and attention of the staff throughout the facilities is absolutely superb. We were very fortunate to have found this gem and enjoy it for a few days. Next year we may visit and stay at their Barcelona hotel","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Vita Ledner","date":"2015-01-21 23:57:47 +0300"},{"content":"We absolutely loved our stay here. The hotel is located in my favourite area of Berlin (I know the city really well, having previously lived there), which has a great vibe, full of cafes, bars, old courtyards to explore etc. From the moment we arrived the staff were super-friendly and helpful. Rooms are really spacious and well-designed, with the bathroom cleverly integrated partly into the bedroom to make them feel bigger. Unlike many hotels where you eat breakfast in a darkish ground-floor room, they've put the breakfast room on the top floor, with floor to ceiling windows giving a great view over the rooftops of Berlin. Breakfast is an excellent buffet, with plenty of choice, and the option of also ordering eggs/pancakes etc. And what's really nice is that the room is kept open for the rest of the day, and they serve free food (light snacks like breads, sandwiches, small bowls of couscous, chocolate mousse etc) and drinks (delicious homemade smoothies, tea, coffee, juices). It's a really nice touch. There were other places nearby which were slightly cheaper, and where we considered staying. But we're incredibly glad we chose this as it really made our weekend in this most engaging of cities.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Roderick Mohr","date":"2015-04-13 05:29:46 +0300"},{"content":"Stayed there for business. Liked the design and practical things such us the iPhone docking station. The lounge is very nice and the free wifi as well.didn't like the fact that they charged the whole amount for the first night which I cancelled 3 days prior to arrival","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Eriberto Carter","date":"2013-10-03 05:05:53 +0300"},{"content":"That's a really cool place to stay! The rooms at the casa Camper are nice, the bathroom located at the front window of the room ist a fantastic thing, and the shower is absolutely gorgeous. The food is included, talking about snacks, available 24h a day. Drinks are included too. We stayed there for two nights and all of us had a great time.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Raphael Hamill","date":"2015-07-01 04:18:16 +0300"}],"public_likes":["Kelley Cummerata","Cesar Howell","Felton Larson","Damaris McKenzie","Valentina Willms Jr."],"vacancy":false,"description":"Stylish and reputable.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}