{"title":"London/South Kensington-Chelsea","name":"easyHotel Earl's Court","address":"42-48 West Cromwell Rd, SW5 9QL","directions":"5 min from Earl's Court tube station","phone":null,"tollfree":null,"email":"enquiries@earlscourt.easyHotel.com","fax":null,"url":"http://www.easyhotel.com/hotels/london_earls_court.html","checkin":"15:00","checkout":"10:00","price":"£varies","geo":{"lat":51.4938,"lon":-0.1979,"accuracy":"ROOFTOP"},"type":"hotel","id":16439,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Great place : Lacking service We have just returned from the Natura Park Resort on Jan 15th. I must say that on the whole we had an enjoyable and relaxing holiday.The hotel and the grounds are beautiful and well maintained. It was fun to feed the fish and the birds that are there.The room we had was clean and very comfortable. Our maid kept us supplied with towels, coffee and bottled water. Our minibar was replentished every day with Pepsi and beer and it kept our water cold. We had a nice balcony to sit and have morning coffee or an early evening drink. We did tip our maid and leave some small gifts daily. The only problem we found was before the disco closed they tended to turn up the music for about half an hour. When we asked guest services about this he laughed and said he did not even know they had a disco.The food was good but not great. There was no need for you to go hungry as there is plenty of choice. My wife is a picky eater and she always had something she liked. They do have to make more of an effort to serve food that is hot. This problem was even noticed in the a la carte restaraunts.The service in the restarants is fair to poor. Tipping did not seem to help. At times I felt that when given a tip it embarased them and they would not come back.The bars and bar service was very good. They quickly got to know what you wanted and even with long lines they worked quickly and happily. Tips are appretiated here.All other areas such as activities, beach and pool have been thoroughly covered in previous reviews.Remember you are in the Dominican Republic Do not let the negative things like cold food and slow service in restaurrant ruin you holiday. Relax let it happen.PSTake mosquito repelant and apply it for the evenings.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":4.0,"Rooms":5.0,"Location":-1.0},"author":"Berenice Sporer","date":"2012-06-05 12:50:58 +0300"},{"content":"Very Relaxing Stayed at Natura Park on a last minute booking. Contrary to some of the reviews on this site our stay was a pleasure. Rooms: Well-maintained rooms.Grounds: Excellent grounds, very well kept with plenty of wildlife. Lovely for children to enjoy. Only lacking in benches. Despite all the water bugs were not terry bad as long as one took care at night.Beach: Very large given the hotels size, pleanty of excellent shades. A bit too much boating activity. Food: In general good and very good at the a la carte restaurants. Entertainment: Mediocre entertainment and a very hot poorly ventilated stage area. Health and spa facilities: GoodOverall a great place to relax, but probably not so good if one is looking for entertainment and nightlife.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":-1.0},"author":"Mr. Adeline Botsford","date":"2015-05-08 04:50:51 +0300"},{"content":"Animals are treated better! 4- days no water, could not flush toilet, no shower not even offered different room until 4 days later...food was good waiters, waitress, bartenders and maids great. Would never go back to that resort or country again!!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Roosevelt Lesch","date":"2013-02-22 07:30:10 +0300"},{"content":"Fabulous! I had ready all of the reviews I could get my eyes on before we left, and I have to disagree with many, many of the complainers I read about. Yes, there was a bit of seaweed here and there and more on certain days, etc.; however, nothing overwhelming and certainly nothing to stop me from enjoying wading or swimming in the water. The buffet for breakfast and dinner did leave a bit to be desired, but I still managed to pack on some pounds, so there must have been enough to keep my hunger pangs from being outrageous - that and the constant food display down by the pool/beach throughout the day. When we first arrived, our room was not was we requested (not a King bed), but once we found out and told them that's not what we asked for, next thing we knew, we were in our King-bed room.We didn't understand a whole lot of the people around us as we were minority speaking English, and found that to be the perfect thing for relaxing. We knew enough spanish to make our way around, as well as found several other couples who too spoke English if we really felt we needed to rattle off a conversation with someone other than ourselves and the excellent bartenders who were always fun to try and communicate back and forth with (by the way - Jose down at the beach bar is the man you need to see - a little Mamma Wanna each night and you'll be set). The resort is perfectly located down from a shopping area, as well as it offers snorkeling, horse-back riding, parasailing, sun bathing, exercise, sports, and there are reps who offer taking a boat to other places to get dinner and/or do shopping elsewhere. I recommend the Lobster/seafood place (Langosta del Caribe) about 15 minutes down the beach by boat - fabulous food, more shops to see (inside a little community) and all the drinks you can take in while you sit and dine through a several-course, great meal. It even downpoured while we were eating, and the Cana tree awnings provided all the protection we needed - didn't get a drop on us! We brought the wash clothes as recommended in other reviews, but noticed there is one included in the hotel, it's just a little unnoticeable as it's in the basket under the shampoos, comb, etc. they provide for you... so if nobody ever seems to use it, yeah, I imagine people think the hotel doesn't have them. The room itself was cleaned very well, and the maid was excellent to us - leave a dollar next to the bottle of water and she'll bring you more bottles of water than you can even drink the next day.I highly recommend for buying your jewelry or pictures to take a walk down the beach to the left. There is a man that boats in his stuff daily and sells it cheaper than the gift shop and WITHOUT ANY HASSLE!Only thing I would have liked to see in Natura Park resort that wasn't offered is a disco place. I was hoping to dance a little while I was there, but that wasn't an option.I don't have any other experiences to compare it to as it's my first time being there, but I do know that I would return to Natura Park - great place, great people, great time, great sites. Wish I was there now!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Harmon Wilderman","date":"2014-10-19 11:21:53 +0300"},{"content":"Good Value, But Too Noisy The resort offered a great value with the meals and bar tab included in the price. The food was decent and the staff atentive. The grounds were clean and well kept and the rooms were fine. However, if you are looking to rest up from a stressful lifestyle this is not the place for you. The nightly bar entertainment was noisy and that was expected. What was not expected was how noisy the hotel was in general. The marble courtyard and thin wall construction made for loud nights and mornings with the other patrons and staff having their conversations bounce off the walls and onto your thin wood door. I got more rest at home working two jobs and exercising 3 times a week. If you sleep late and wake early, then this is place for you.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Miss Kris Lueilwitz","date":"2014-04-06 00:54:02 +0300"},{"content":"Great place to stay Natura Park Spa and Hotel is a wonderful place for someone looking just to veg out,enjoy the sun and relax,relax,relax, I've been there two times already and when I save up more money I will likely go back again. I'm pretty fussy about traveling as to where I stay and accomidations and room,etc. This place met all that I wanted except for just one small problem and that I don't speak spanish, but managed to get along and the other problem was the beef. I found their beef very hard to chew and therefore was dissaponited about that only. The food is pleantiful especially the breakfasts, lunch also very good and dinners, well if you stick to chicken and their fish you won't be dissapointed. Go early and watch the sun rise, reserve your chairs and then have breakfast and then enjoy, enjoy , enjoy. The staff are excellent and the spa for a massage or sauna or both is great and the cost is unbeatable. I would suggest an early flight and a late return flight to reap the benefits before leaving. I strongly reccomed it. I would give it 5 stars as a rating...","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Shane Pfeffer","date":"2015-10-03 03:05:43 +0300"},{"content":"Extremely Nice Grounds Since i saw some of the reviews of this place i had second thoughts about my up vacation coming up. However i am pleased to say that the hotel gardens and grounds were extremely beutiful. I loved all the flamingoes and geese and wildlife on the resort. The geese seem to attack you and bite you for your food. My family found it quite comical and laughed at the fact of those damn man-eaters that would hang out and bite the people walking by. Ive been down to the carribean as well as Mexico and I thought that the hotel as a whole was well kept and alot of fun. The food is great. Im a picky eater and I still thought the food was better then all the other resorts that ive stayed at. I do have to say the drinks could have been better. THEY dont even put a banana in a banana mama. They seem to have a different method of doing things. The pina coladas were pretty good and your beer and mixes are the same were ever you go. The beach was really great. There are no waves so if you are a surfer and wave rider dont plan this area to ride waves. The waves break out on the reef way out in front of the hotel. The snorkeling could not have been any better. I mean right by the shore there isn't much corel but if you take a boat out for like $10 dollars/person you go to the coral reef and that is absolutely incredable. Bring in a piece of bread and you will have thousands of fish swarming around you of all different colors. The water is as clear aqua blue as can be. People some what complain about the seawead that washes ashore but it is cleaned up every early morning. If you want all you have to do is walk down the beach for like 2 minutes to the nature park and that is nothing but white sand and few if any weeds. Over all i would definatly recommend the resort to people. The service is great these people would bend over backwards for you more then other caribean peoples. The food is great. The water is great. The resort is great.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Cristian Franecki","date":"2013-12-18 15:51:17 +0300"},{"content":"Make English a lanuage in Punta Cana The shows seemed good if you could understand the. Everything was done in a diffrent language. Never ENGLISH","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Wilfrid Rutherford","date":"2014-02-19 15:38:44 +0300"}],"public_likes":["Mr. Tessie Wintheiser","Bill Ziemann","Bryon Quigley","Rolando Flatley","Zita Lesch","Madyson McClure","Mr. Simone Schuppe","Octavia Fay","Earnestine Ledner"],"vacancy":false,"description":"Guests can only book an easyHotel on the website and rooms are priced on the basis of the earlier you book, the less you pay.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}