{"title":"Paris/8th arrondissement","name":"Radisson Blu","address":"Avenue Marceau 78 Bis","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":48.87199,"lon":2.29695,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21856,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"This could have been the perfect beach front hotel. My wife and I stayed at the Maui Prince for 5 nights in April 2005. We booked an oceanfront room at just over $500 per night including taxes. We were looking for peace and quiet, service and a great oceanfront location. We got 2 out of 3. While we were there, the hotel was changing the room locks. All day long the whine of the worker's drill could be heard. We did not spend a lot of time in the room during the day, but by the second day, this was very annoying. But even worse, twice while we were in our room *with* the Do Not Disturb sign on the door, the hotel staff knocked on our door because they wanted to change the lock. After it happened the first time, I complained to the assistant manager, but the next day, same thing. To me, this is unacceptable. The second time, the excuse was \"you are the only room left to do on this floor\". Apparently that trumps a Do Not Disturb! Well, you can see where management's priorities are. At $500 per night, this sort of work should not be scheduled when the room is rented to a guest. Not recommended.","ratings":{"Overall":2.0},"author":"Jaunita Kub","date":"2014-01-12 23:52:18 +0300"},{"content":"I have to be honest, having read mixed reviews (especially the one about the bugs in the beds), I was a little concerned about the Maui Prince. It was the only hotel with availability during the holiday season so we didn't really have a choice on hotels. After having stayed for 7 days, I was very pleased with the hotel. I did not see any bugs and our room was very clean and tastefully decorated. I am sure that it is not as nice as some of the other resorts on Maui, but I was pleased with the property. I have stayed at the Ritz Carlton, Four Seasons, and many other expensive hotels and the Maui Prince met my standards. The grounds were very peaceful and like eveyone else has said, quiet and relaxing. The beach is beautiful and a wonderful place to snorkel. Many of the snorkel boat trips came to the ocean in front of the Maui Prince because it is known as Turtle Town. I saw a ton of turtles, eels, beautiful fish, and coral! I saw more snorkeling off the shore of this hotel than I did on my scuba dive! The food was great at that Hakone but the Prince Court was typical hotel food. The staff were all extremely nice and I have to say, probably nicer than any hotel staff that I have ever dealt with. I am glad that I stayed on that part of the island. It is just beautiful there and less tourist like than other parts of the island. Please know that there is a ton to do and you aren't too far away from everything. The only rude service that we had on the island was at the Kobe Japanese restaurant in Lahaina. Do not go there under any cirumstances. Regarding the Maui Prince, an overall nice place to stay so don't believe some of the bad reviews that it has gotten. I wanted to make sure to post to this site because it really had me concerned and I felt it was necessary to help others going there to feel more at ease with their choice than I did. Have a great time in Hawaii!","ratings":{"Overall":4.0},"author":"Ashlynn Tremblay","date":"2013-12-17 20:57:39 +0300"},{"content":"After spending 5 nights at the Prince Maui, my wife and I were left with the feeling that it could have been so much better with a few simple things being done that other hotels of the same class all seem to manage. When you arrive, I expect a real flower garland not some cheap sea shell made in the phillipines. A glass of something fizzy to welcome you would be nice. A customer relations manager to take your round the hotel on arrival so you know where everything is. We were on a wedding anniversary trip, so some sort of effort would have been nice on the hotels part. Fruit basket, something. I do not expect to have to pay $18 a day to have an umbrella on the beach. Personal attention, even if its something silly like asking if we need our sunglasses cleaning when by the pool.. it does make a difference. The hotel needs a refit, the pool is tiny, the spa is a joke, they need to sort out a proper beach service, cheap and nasty sun loungers don't cut it. After speaking to people on Maui basically allot of things I've mentioned were there once like a proper Maui welcome, but the human resources manager has cut them all out trying to cut costs. Anyone with any brains gets fired, she doesn't want to feel bettered by anyone. So while the head office is happy with the cost cuts the clients leave unimpressed and unhappy. Staff morale is very low, although we found staff friendly. Lots of people have left the hotel. Others are trying to go to the four seasons, which i think is the best hotel on the island at the moment. The idea of the Mau Prince being away from everything is a good one but the hotel isn't upto the job. They should look at other hotels like Legends in Mauritius who do the same but a lot better. In the end over our five night stay we didn't eat once in the hotel restaurants which you may think is a shame but when you see that you are paying an extra for everything, even internet access(!), you don't want to spend anymore in the hotel. So we ate most nights at the four seasons and at Wailea.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Service":3.0,"Rooms":2.0},"author":"Manley Haley","date":"2012-11-08 00:07:29 +0300"},{"content":"Our stay was perfect at this four star hotel. We had over twenty five relatives from six states at various rooms within the hotel. We had a partial ocean view room on the lobby level for our family of four. Our room was nice but not extravagent. The view of the pool, ocean, and grounds from the balcony was very pretty. Our children were part of \"the kid's eat free\" package which was great. The flowers and koi pond on the grounds were beautiful. The room service was quick and food prepartation was exceptional. We ate almost all of our meals at the hotel and were never disappointed. The sunday brunch was incredible. The pools are average, but we were not there to stay at the pools all day. The cabana's were free, a bonus, if needed. The beach was the highlight. Expansive and uncrowded, swimming and snorkeling was perfect. Turltes visited every day to the coral reef twenty yards off the beach. The golf course was five stars. We played the south course and the views of the ocean and island were breathtaking. We rented clubs (talyor made r580 driver and RAC irons) and they were almost brand new. I would definitely stay again at the Maui Prince.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":4.0},"author":"Frank Windler","date":"2015-08-16 02:10:34 +0300"},{"content":"We just returned from our honeymoon at the Maui Prince. We had a lovely time. The rooms were big and the ocean views were beautiful. We had no problems with bugs whatsoever. It was nice that the hotel was not that full; it was nice to lounge by the gorgeous beach and the pool was also very nice (it is not too small). Only ate at Hakone, the Japanese restaurant, and it was decent. If you want more luxury, we spent some time at the 4 Seasons down the road, which was absolutely gorgeous. I recommend staying on this south side of Maui, as it is so beautiful, much warmer, and less touristy. If you are watching your budget, there is nothing wrong with the Maui Prince, and I promise I am a picky traveler!","ratings":{"Overall":4.0},"author":"Marianna Jacobs DVM","date":"2012-04-12 03:26:27 +0300"},{"content":"Spent five nights at the Prince last January. The grounds were beautifully designed and well cared for, each room faces the ocean, each with its own VERY PRIVATE lanai, and wonderful restaurants. We really enjoyed the pool area, which was spacious but without waterslides or waterfalls. Because of this, the hotel wasn't loaded with kids, which we really loved. The Prince is the last hotel on the southwest side of Maui, about a 5 - 10 minute drive past the previous hotels, and we just loved the quiet atmosphere, laid back feeling, and privacy of it. We are going back next year, and will definitely stay here again. Spent one night at the Grand Wailaiu, but was way too busy and noisy for us.","ratings":{"Overall":5.0},"author":"Amelia Rath","date":"2012-04-13 09:37:31 +0300"},{"content":"Maui is a busy island but I discovered Heaven at Napili Kai. It is what Hawaii used to be before the big multistory hotels were built: ceiling fans, doors that open to the beach and no noisy and unnecessary air conditioners! The two story buildings surround a gorgeous bay and beautiful beach. The rooms are comfortable, updated , including a kitchenette, with privacy from the next door neighbors. Our room was maybe 25 yds, from the water. The spacious and open grounds have two pools, lovely, well manicured gardens, a terrific and reasonable restaurant and super bar for after beach cocktails.. AND manicures and massages are available in a quiet corner of the grounds.The staff is beyond amazing and helpful in the old Hawaiian style of O Hana. We played golf every other day for two weeks at fabulous golf courses that are a short distance from the resort. Wish I played better golf! Most of the guests have returned for many years and so are friendly but not intrusive. There are morning programs and demonstrations about life in Hawaii. It is perfect for families and couples. Amazingly, all the children were well behaved and sociable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hailie Becker","date":"2013-07-28 09:50:21 +0300"}],"public_likes":["Jeanie Orn"],"vacancy":false,"description":"Compared to the many opulent and extravagant hotels in the 8th arrondissement, the Radisson does not come across as spectacular, but can provide good value with the balconies of its front-side rooms offering views of the Arc de Triomphe.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}