{"title":"Chamonix","name":"Auberge de Jeunesse Chamonix Mont-Blanc","address":"127, Montée J. Balmat, Les Pélerins d'en Haut","directions":null,"phone":"+33 (0)4 50 53 14 52","tollfree":null,"email":"chamonix@hifrance.org","fax":null,"url":"http://www.hifrance.org/auberge-de-jeunesse/chamonix-mont-blanc.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":45.9089,"lon":6.8547,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5332,"country":"France","city":"Chamonix-Mont-Blanc","state":"Rhône-Alpes","reviews":[{"content":"Somewhat Dissapointed For the price, I have to say that this place is average. The dimly lit entrance way, bar and restaurant area set a very relaxed, sexy atmpsphere and perhaps if that vibe was carried up to the actual floors of the hotel then it would work better but after the elevators open to your floor your eyes are surprised to see lilac hallways with white trim (reminded me of a dollhouse)- I never thought I'd be one to care about these things much but it just doesn't go and the color is just ugly. Also, noise travels throught the rooms. My room looked identical to the person before me who posted the pics - small for the price and bed wasn't that comfy. I have to say though, I thought the staff was very nice and overly accomodating. Also in a good area - accessible to everything. I probably won't go back because it is expensive for what it is but would def stop in for a drink at the Redwood Bar - very cool hotel (downstairs that is).","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":2.0,"Rooms":3.0,"Location":-1.0},"author":"Gia Ankunding","date":"2012-03-12 11:24:48 +0300"},{"content":"Come on Ian!!! I've spent nights at the Delano and the Mondrian and the Clift doesn鈥檛 even come close to my other experiences...For the amount of money you spend, the place was absolutely horrible ... My room was like walking into my grandmothers room and the staff was not even noticeable from the time you walked in the door to the time you checked out... very disappointing... Ian should be ashamed of himself...","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Marjolaine Metz","date":"2014-12-31 07:37:45 +0300"},{"content":"Do not stay Tiny Rooms..Bathrooms the size of the closet...MOST OF ALL...my wife and I were asked to not sit on a particular couch, and Could we move to the seating over there?????? When asked why another couple was enjoying a glass of wine across from us...the response was they have a reservation to sit there!!!!! Amazing!!! Not to mention being stopped from entering and questioned as to what room you are staying in, your name, etc..... Save Your money--stay somewhere nice.If you must see it, go to the bar, wait 30 minutes to get a half full martini for $12, be rudely insulted by some super hip, brand new hairstyle bartender.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Gabriella Schmeler","date":"2012-12-17 10:35:29 +0300"},{"content":"If image is all that matters to you... Your first clue is the lack of signage. The Clift is far too trendy to identify its location by anything so common as a nameplate visible from the street.The valet parking staff is friendly, though, assuming you can find a place for your car on the crowded curb in front of the hotel. Plan on a hefty $40 per night for valet parking.Once inside, the clever theatricality of the lobby, dining room and bar make the efforts to arrive seem worthwhile. Check-in is efficient, if not exactly friendly or welcoming.A warning, though. If you get a room with a pass-through door to the room adjacent, immediately return to the front desk and ask for or pay for a room with solid walls. I did not and my neighbors stayed up all night long playing music and entertaining guests. Despite a call from the manager at 12:30 PM and a call from myself at 3 AM, the noise continued unabated till 4:30 AM, leaving me no recourse but to spend a very early morning in the lobby. Why the lobby? Well, the night staff informed me that while they were sorry, they could not give me another room until the morning manager arrived. Three hours later he did arrive and did give me another room. According to the bell staff, there were ample empty rooms. Apparently due to my group rate, the night staff wasn't authorized to give me another room. In effect, their rules were far more important than my comfort or inconvience. So...no sleep at all at this 4-star hotel the first night.The next night of my four-night stay, a friend and I decided to investigate the bar. The hostess condescended to find us a table and with a great deal of attitude announced that we might have one in a few minutes - depending on how long we were staying!We decided we weren't nearly important enough to enjoy the gloomy darkness and thumpa-wumpa music of the bar at the Clift, so we crossed the street and discovered the delightful Cafe Grand at the equally delightful Hotel Monaco. Evidently Kimpton hotels regard guests as valued friends and Schrager properties - like the ever-so-precious Clift - do not. Unless you share the attitude, of course, and enjoy trading superior glances with the staff.I'll give the Clift ample stars for design and poseur-power. But as a fine hotel...truly, they have a lot to learn about hospitality.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":-1.0},"author":"Mrs. Sabrina McLaughlin","date":"2013-12-04 09:53:56 +0300"},{"content":"Great Time An excellent hotel with top notch service. It is a welcome respite from a busy day in the city, both the lobby lounge and the rooms are incredibly comfortable and the staff is welcoming. A great choice for travelers looking for a hip, progressive, yet friendly hotel.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Vivien Gaylord","date":"2013-06-09 18:15:28 +0300"},{"content":"Poor poor poor We went to the Clift on honeymoon. The rooms were minimalist and stylish, but the walls are paper thin and you can hear the person snore in the room next door. It's massively overpriced, the space is cramped, and anyone who wants a boutique hotel experience is best off finding it elsewhere. There are plenty of better hotels in San Francisco I am sure","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Agustin Flatley","date":"2012-10-14 00:14:25 +0300"},{"content":"Two words: Bed Bugs My first trip to San Francisco was memorable as a result of staying at the Halcyon. Trying to save on accommodations, this hotel was the least expensive while still being within SF proper. The adage Penny wise, Pound foolish could be the hallmark for this establishment. The room was barely wider than both my arms spread apart. The bed took up almost all floorspace. The bathroom was only slight smaller than the room itself. Fortunately, I didn't unpack my things upon checking in (I left everything in my bag, in the closet). At around 3 in the morning, I felt something against my skin. When I turned on the light, I could see something moving on the sheet. Instinctively I smacked it, and the result was a bright red stain on the sheet. Immediately I threw the covers off, only to find 3 to 4 more of these bugs scampering away. When I called the Manager and showed him the blood stain on my sheet, I asked him did he know that there were BED BUGS in the room?!?!!! His response: we've had them before (WTF?!?!?!?!?!?!!!). After showering and scrubbing off the top layers of my skin, I ended up going to the downtown Marriott. Yes, its cost was 4Xs the price of the Halcyon, but at least the room was clean, spacious, and I didn't have to worry about being bitten in the middle of the night! Believe me, it's worth paying more rather than being infested. If you do decide to stay here, best to keep your clothes packed (and wrapped in plastic) so you don't bring anything back home with you. Like I said before, I was fortunate to have not unpacked. I made sure though that the clothes I was wearing were BOILED before I went to the Marriott.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mr. Micheal Runte","date":"2012-07-20 13:20:12 +0300"},{"content":"big value for money I have to disagree with earlier reviewers and let you know my expirience. I got to know this hotel through the Lonely Planet Guide and booked by e-mail a room in advance for 3 weeks. No problems, booking was confirmed immediately and the room was kept for me on date of arrival. I even received the entrance-code. On the money-aspect, I got a room for only $ 300 a week, less than moderate, given the advice in most travelguides that for less than $ 100 a day almost nothing of any standard is available. But then the place self, on Jonesstreet it is very central located and easy to reach by foot from Marketstreet or Union Square and surroundings, even from Fishermans Wharf with an astounding view of the bay on one of the highest points, especially at night. The room was cosy but comfortable. It had a private bath and toilet, was cleaned up regulary and fresh towels were supplied. On day of arrival there was even neatly placed a tray with shampoo, a sewing kit and wethaircap. Later on a small soapbar was given. Being an European I asked for a electricityplug for switch from Dutch to American use and they immediatily offered to buy one by my self but get a discount from the hotelroomtarif. What a service! In the room were further on a refridgerator, microwave, TV-set, telephone (local calls are free!), alarmclock, even cups and saucers, coffee (!) and sugar, also a coffeemaker, forks and knives. Where do you get this elsewhere for a comparible price? Nowhere I guess. I had the time of my life staying in SF for 3 weeks and at the end of the day returning to a safe and proper place. If I get the opportunity I will repeat my stay in near future, again in the Halcyon Hotel. Thanks Dennis and Mark, helpfull staff members. More questions? You can ask me by e-mail, hanstalsma@zonnet.nl. PS I am just a guest of this hotel, not the owner nor shareholder or whatsoever.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":-1.0},"author":"Asha Hudson","date":"2014-10-08 07:19:21 +0300"},{"content":"Las Vegas in itself is an amazing experience and it's easy to lose yourself in the glizt and glamour. If your staying at the Encore then this will be no different. What a hotel, great service, great casino and an amazing club called XS. Any club that has a casino in the middle of the pool is alright by me! Visit it, live it, love it and I'm already planning my trip back later this year","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"D'angelo Ryan","date":"2014-02-12 11:31:14 +0300"}],"public_likes":["Elias Lemke","Amie McLaughlin","Ervin Wisozk","Jennings Howe","Dr. Bo Kuhic","Foster Hauck","Caleb Schumm","Garrick Yundt","Oda Fisher"],"vacancy":true,"description":"A hostel in the town, member of the Fédération Unie des Auberges de Jeunesse and Hostelling International.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}