{"title":"Lancaster (California)","name":"Homewood Suites by Hilton","address":"2320 Double Play Way","directions":"Exit Highway 14 at Avenue I, turn west, go one block to Valley Central Way, turn north, go one block to W. Doubleplay Rd., turn east.","phone":"+1 661 723-8040","tollfree":null,"email":null,"fax":null,"url":"http://homewoodsuites1.hilton.com/en_US/hw/hotel/PDLHWHW-Homewood-Suites-by-Hilton-Lancaster-California/index.do","checkin":"3PM","checkout":"12 noon","price":null,"geo":{"lat":34.70057,"lon":-118.17195,"accuracy":"APPROXIMATE"},"type":"hotel","id":15148,"country":"United States","city":"Lancaster","state":"California","reviews":[{"content":"We have friends in PR, so have travelled extensively in the country. This resort is on a quiet seaside road, about 2 1/2 hours from San Juan. The resort is not large, but is well laid out and has all of the amenities that a large resort has. We didn't select the all inclusive option, but did eat at the restaurants on site, and were blown away at the quality of the food. The service was fair - if you have travelled in PR, you'll be familiar with this. The rooms were great. They were large, and had either a balcony or a terrace. Each room had a fridge and a huge shower! One of the best parts was the fact that they had Aveda bath and hair products! The pools and hot tubs are a great way to stay cool. The beach is not that great, but if you have a car, take a drive and explore local beaches - you won't be disappointed. Our favourite part of Copamarina was it's direct access to Gilligan's Island!!! For $7US/person, Copamarina had a private shuttle (pontoon boat) to take you to Gilligan's Island. Gilligan's is a nature reserve in the middle of the bay. It has shallow warm water, and you swim through the mangrove to the open water. It is a fantastic experience, and you cannot travel to Guanica without going. We loved it so much, we went twice on the same week! Be prepared to take absolutely everything you'll need for the day. From food, to beverages, to chairs/towels etc. There are picnic shelter and grills - if it's a PR holiday, it will be packed, so book as soon as main reception opens. You can only book travel for the same day. Enjoy your stay!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Arianna Glover","date":"2013-03-24 08:16:38 +0300"},{"content":"Had a lovely dinner at the restaurant!! The Mofongo is to die for!! The views of the beach are super beautiful but the best this hotel has to offer is the live music!! The guitar player , (I believe his name was Tito) was amazing. It was very relaxing sitting at the bar and listening to his music!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Braulio Hudson","date":"2012-11-20 20:13:16 +0300"},{"content":"This trip was intended as a honeymoon for our best friends and an escape for us during school.The attention and effort to offer us a room suited for both reasons were amazing. Haydee and Jen from reservations and Leslie in Front desk help to chose the best room in the hotel. All employees were kind and genuinely devoted to make you feel cherish the whole time. This is my 5th time here and won't be my last. Puerto Rico is full of beaches, but the human factors make it outstanding. If you want great service and a nice place to relax, look no more than the front desk and you'll be blown away. Thank for the Manager Mr.Ortíz, your crew are the best.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Brandyn Wyman","date":"2015-08-02 21:00:10 +0300"},{"content":"I grew up in Puerto Rico and going to Copamarina as a child and adult. My husband and I currently live in the US but were going to visit family in Puerto Rico. As part of our trip we decided to go and have a few days in the south coast in Guanica with our 6 month old son. Before we went I told my husband that I grew up going to this resort and that it was quite lovely and tropical. When we got there it was not the hotel of my childhood. Our room was full of mold, spider webs, not cleaned thoroughly and the A/C was not working. The first (and only) night our A/C woke us up in the middle of the night making banging noises. The next day we requested for the A/C to be fixed. They immediately came and \"fixed\" it. In the middle of the day when our baby was taking a nap the A/C started to smoke. After we stopped the A/C, I told my husband that we could not stay. Our baby had gotten diarrhea and allergies from the mold and dust in the room, the A/C was blowing smoke, and the room was moldy and not really clean. We instantly decided to leave and informed the front desk. They told us that they would charge us for the remainder of the day and night, but we did not care. At no point during checkout did they ask why we would leave late in the afternoon, if there was something wrong, or if there was something making us leave. I apologize for the long story, but I had to share my unfortunate experience in Copamarina. I really hope that they fix up the place and make it how it used to be.","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":3.0},"author":"Joyce Schaden","date":"2014-01-08 12:42:04 +0300"},{"content":"After seeing some of the negative reviews I wanted to clarify a few things for prospective guests. If you are looking for stuff to do late at night, you will not find it here: this is a place for relaxing. The beach in front of the hotel itself is mucky, as it is adjacent to a mangrove swamp. At times the smell of the swamp gets to the hotel. On the other hand we got to see some of the amazing birds, no doubt due to the proximity of the mangrove. A short walk away is Caña Gorda Beach which is nice, and the hotel has a private shuttle boat to beautiful \"Gilligans's Island\" (Cayo Aurora, officially). Gilligan's can get very crowded on weekends, beware- get there early. We have stayed several times at this hotel: the service has been outstanding and the facilities impeccable always. The all-inclusive package is worth every penny. The one time we did have a problem with our bathroom somebody from the hotel staff was there to check it in less than 5 mins, and when they couldn't fix it they changed us to an equivalent room, all within 30 mins... on New Year's Day. You can also take a short drive to some of the outstanding beaches to the east (like Tamarindo). And the adjacent dry forest is definitely worth exploring - with the necessary precautions: the heat can be suffocating even in the early morning, some of the smaller trails are poorly marked, and you must keep an eye out for mountain bikers. Overall an excellent experience. Every time we leave we are already thinking of when we will come back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Fredy Lueilwitz","date":"2012-03-12 00:08:17 +0300"},{"content":"My boyfriend and I stayed at the Copamarina Resort last week and we had the best, relaxing vacation ever!!! The staff was friendly, very clean rooms, quiet setting away from the tourists!!! It was a little hard to find, being it was in a remote area, but that is exactly what we were looking for. The food was good, weather was PERFECT!! We will definitely be coming back.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Lina Harber","date":"2013-07-12 04:10:13 +0300"}],"public_likes":["Miss Brooklyn Corkery","Maxie Miller","Franco Herman","Effie Koelpin","Clifford Ortiz","Alisa Nader","Sally Koepp","Rubie Kling"],"vacancy":false,"description":"An all suite hotel equipped with full kitchens and free high-speed Internet. Complimentary hot breakfast, a light dinner with beverages (Monday-Thursday), and a grocery shopping service.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}