{"title":"Hereford","name":"Alberta House B&B","address":"5-13 Newtown Road Hereford HR4 9LH","directions":null,"phone":"+44 1432 297 102","tollfree":null,"email":null,"fax":null,"url":"http://www.thealbertaguesthouse.co.uk","checkin":"12:00 - 21:00","checkout":"10:30","price":"Single from £35, Double from £50, Family from £60 (see website for details)","geo":{"lat":52.063782,"lon":-2.715283,"accuracy":"ROOFTOP"},"type":"hotel","id":11485,"country":"United Kingdom","city":"Hereford","state":null,"reviews":[{"content":"Great location, staff, beds, so-so rooms Stayed here for the location. Which is excellent. Next door to convention center, around the corner from Pacific Plaza mall. 10 short blocks to Pikes Place, 5 to Capitol Hill. The room I ended up with was extremely small, I was alone so it worked out, if there would have been two of us it would have been challenging. The room was on the 8th floor facing the court yard which made for no noise but was interesting to see the other high rise residentials surrounding the courtyard, we could all look into each others windows, kind of disturbing and at the same time intriquing, I had to remind myself not to be rude and watch people eat or watch TV.The hotel is undergoing a name change and will be undergoing severe renovations which are much needed since it is in an upscale area, of course hwne they get done it will probably double the price of about $100 which I paid. scedule is to be done by summer of 2007.I would definately stay here again but probably spring for the suite rather than the standard room. Also parking is $21/day, kind of steep, but the internet was free, and even if it wasnt there were enough unsecure WIFI networks in the area to not worry about it if they did charge.A decent experience overall, now that I know what to expect.","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":2.0,"Location":5.0},"author":"Jaylen Shanahan","date":"2013-05-08 17:54:41 +0300"},{"content":"Nice hotel and good location I stayed at the Summerfield Suites for 2 nights over the Easter long weekend, April 14-16. We made this reservation on hotwire. Check-in was quick. There was a business competition next door at the convention center so there were many high schoolers at the hotel walking around. We were given a room on the 8th floor, close to the elevator. When we opened the door, there was someone in the room so we walked back to the reception desk and asked for another room. The check-in clerk saw that he made a mistake so he gave us a suite on the 8th floor. The suite was big with a full kitchen, living room, a separate bedroom and full bathroom. A very good trade for the small inconvenience.Everything in the suite was clean, the bed was comfortable and the bathroom was spotless. They now have toiletries with Hyatt on it. There is a workout room with hot tub and outdoor swimming pool on the 5th floor. They don't have a business center although they offer wireless internet in the rooms (so take your laptop). Every morning, they serve complimentary continental breakfast (includes bread, bagel, waffle, fresh fruit, cereal, juice, coffee). This was our first time to Seattle so we wanted to see everything. The location of the hotel is great. You can practically walk everywhere although you will be tired. Pike place market is 8 blocks down towards the water. The hotel offers a free shuttle in the downtown area which we used to drop us off at Pioneer square. We also found out that the buses in the downtown area are free and the last stop is 1 block from Summerfield Suites, right in front of the convention center. Parking - the hotel charges $20 for parking each night. We had a car but did not want to pay the fee so we parked on the street at night (free after 6pm and on Sundays). During the day, there is a parking lot on Pike, between 5th and 6th that offers $5 all day parking on the weekends. We paid a total of $5 for parking during our stay.On the second night, there were people who stayed a few doors down from our suite with dogs. You can hear them barking loudly until 11pm. After that, it stopped. If you have allergies to pets, you may want to confirm with the hotel that you get a room that have not have pets there before.All in all, we had a great stay at Summerfield suites and would stay here again the next time we are in Seattle.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Marcelino Nolan","date":"2013-02-27 11:55:40 +0300"},{"content":"Great Location I had to cut short a previous trip to Seattle and the manager allowed me to transfer my pre-paid days to Labor Day weekend, which I thought was generous since they had done nothing to warrant my not honoring my earlier stay. The front desk personnel were helpful and friendly, the room was clean, even though the furniture could use updating. I was off the main street, so it was quite quiet. The shuttle service is very convienent, and dropped me off and picked me up from a football game at the stadium. My only real complaint is that the fitness room is not for anyone who wants to any more than ride on a stationary bike or take a dip in the pool. Even one universal machine would have made a big difference. The local bus service goes right by the hotel and connects to the rest of the city. Would definitely stay there again!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Zackary Cole","date":"2013-07-04 15:55:58 +0300"}],"public_likes":["Riley Koelpin I","Ms. Mallory Kuphal","Shaniya Smitham","Dorris Wunsch","Brett Ledner","Pansy Bartoletti"],"vacancy":false,"description":"Pleasant, great value family-run B&B with comfortable rooms and ample private parking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}