{"title":"San Francisco/Golden Gate","name":"Americas Best Value Inn - Golden Gate","address":"2322 Lombard St","directions":"between Pierce St and Scott St","phone":"+1 415 921-4980","tollfree":null,"email":null,"fax":"+1 415 921-4042","url":"http://www.americasbestvalueinn.com/bestv.cfm?idp=1164","checkin":"3PM","checkout":"11AM","price":"$84-$124","geo":{"lat":37.7996,"lon":-122.4399,"accuracy":"APPROXIMATE"},"type":"hotel","id":25792,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The customer service was excellent, from the front desk to the food service to the cleaning staff. The building is an older building, with some of the disadvantages of an older building, but everything was spotless, updated nicely, and completely comfortable. I was traveling alone, and I felt very safe. It's in a great location if you are doing anything on or around the UW campus. I love the decor--retro look because of the older building, with an artsy-feel because of the furnishings. Oh, and the view from my room was spectacular. I hope to go back again soon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Roosevelt Gulgowski","date":"2013-08-25 09:09:48 +0300"},{"content":"Four nights, excellent service, quiet, very comfortable, great value for money. Also, in my case, perfectly located for work with colleagues at UW.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Antwan Block","date":"2014-11-05 10:12:21 +0300"},{"content":"This was by far one of the best experiences we have ever had with a hotel. The hotel Deca was just as it appears on their website. The room was very clean and extremely comfortable. It was the best night sleep I have ever had away from home. We will most definatley be staying here again and i recommend this establishment to anyone who asks. THANK-YOU HOTEL DECA!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Clifton Volkman","date":"2012-12-20 00:23:03 +0300"},{"content":"The Deca was nicer than the usual cookie cutter accomodation. The Hotel from the 30's is nicely updated and has great style and a great rate. The U district location allows you to be in a community rather than a parking lot. My only complaint was a musty room odor but that was short lived. Will stay there again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Laverne Jast DVM","date":"2012-04-05 12:59:19 +0300"},{"content":"We got what I felt was a great deal on this place, especially over the Thanksgiving holiday. The location is good, but you are still a drive away from Pike Place and all the down town stuff. U District has lots to offer though. Great hotel with a cool lobby and adjacent cafe. Plenty to do within walking distance. Looking forward to staying there again. Parking in their lot is $10/day.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Alvena Stanton","date":"2013-03-04 01:26:54 +0300"},{"content":"The Hotel Deca exceeded all of our expectations. We stopped there overnight, prior to an Alaskan cruise. The hotel has been recently remodeled in an older building in Seattle, and the decorator did a wonderful job. The lobby is especially beautiful, in a modern art deco style. The rooms are also artfully done, though there's not enough counter space in the bathroom. The restaurant was excellent for dinner and breakfast, one of the best we've tried in the past 30 years. Our stay included free parking while on the cruise, and a free shuttle to the cruise ship dock, all for less than $190 per night, total. We'd enthusiastically recommend it to anyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Enoch Leuschke","date":"2013-04-19 23:45:13 +0300"},{"content":"I was here for a 2 day conference with UW. The location was perfect, just a block away from University Way, where there are plenty of restaurants, shops, and interesting people watching. Tully's is adjacent to the hotel and convenient for coffee in the morning, since there is no coffee maker in the room and breakfast is not included. Rooms are nicely decorated, modern style, comfortable beds and very clean. My main gripe is that the shuttle is COMPLETELY unreliable. They make a list of who needs to go where and at what time, but they don't use the list. They booked too many people at the same time and it was a big cluster trying to get a group of about 10 people to and from our conference. They basically told everyone to just show up at a certain time but there was not enought room for everyone in the van. In addition, one lady had to wait over an hour at night, in the rain, to get picked up at the Space Needle after dinner -- when she was told the shuttle would be coming shortly. This place if fine in every respect but don't hold your breath on the shuttle. They have a parking lot where you can park your car for free - and you may want to plan on driving your own car around or catching a cab instead of relying on the shuttle. The front desk staff were young and not helpful in making restaurant recommendations - and certainly not helpful with arranging the shuttle. The District Lounge restaurant/bar in the basement of the restaurant had good food but very slow service. There was live music in The Lounge most nights. The fitness center was adequate with 2 treadmills, an elliptical, a bike, and a bench/dumbbells.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tina Labadie I","date":"2015-06-21 23:06:06 +0300"},{"content":"Received this hotel on a priceline bid. It is convienent to the U. Checin was quick and the employees friendly and helpful. The room was nice but the bathrooms are small. It is an old hotel that has been remodeled nicely and has an art deco theme. There is free wireless. The workout room is a joke. The breakfast in the basement restaurant was just OK but it may have been what I ordered. The beds are comfortable. Rooms on the upper levels have great views of the sound, the U, space needle, etc. My son tells me opposing teams stay here when they are in town. All-in-all it is a nice, mid-range hotel and I would return.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Vern Russel DVM","date":"2012-01-09 04:33:24 +0300"}],"public_likes":["Elmore Morissette","Arturo Lubowitz","Selmer Effertz"],"vacancy":true,"description":"A 100% non smoking hotel with 40 rooms; the Golden Gate is on Lombard St and so has good access to public transportation. They have a restaurant and bar on the premises, and offer free wi-fi, free continental breakfast, and limited free parking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}