{"title":"Venice (California)","name":"Venice Beach Hotel & Hostel","address":"1515 Pacific Ave","directions":"corner of Windward Ave.","phone":"+1 310-452-3052","tollfree":null,"email":"info@planetvenice.com","fax":"+1 310-821-3469","url":"http://www.planetvenice.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98778,"lon":-118.47251,"accuracy":"ROOFTOP"},"type":"hotel","id":32174,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"First, I'd like to advise readers that the words \"spa\" and \"resort\" are freely bandied around in relation to the motels in Calistoga, and somehow I missed that when researching the Roman Spa Hot Springs Resort. (The word \"motel\" is on their sign, seen if you go directly to their site online.) This is an important distinction that I overlooked - a Motel as opposed to a Hotel - and this evidences itself in terms of austerity in accomodations. All the glowing reviews on this site caused me to abandon a more comprehensive research, so I'd like to give a very thorough review so people can make up their minds with a variety of info. I was hoping for a hot springs soak, and a rejuvenating stay at this \"resort\". I left feeling very tired and discouraged. The pros are that indeed, the staff is friendly, the grounds and rooms are clean, and the springs are used to full advantage, whether you rent a private whirlpool room as I did, or wish to avail yourself to the pool or hot tub outside. The cons of the place? I was a bit unhappy to detect the scent of chlorine in the outside pool, thinking I would be getting the same unadulterated hot spring soak as I could get in my room. It would have been easier to revel in a body of water that is \"pure\" hot springs water, rather than swimming in something with chemicals in it. But the water was nice, the moon was full, and I continued to try to get into the spirit of my retreat. Back in my room, my partner and I excitedly tried to use our new laptop for the first time...he had bid on an auction item online that was due to close. (I admit that not asking the Roman Spa Motel whether or not they had wireless internet service is my own fault, but since I've seen the rankest little motels advertising it, I erroneously assumed they would have it.) We went to the office to see if there was a complimentary PC for guests, but this was not the case either. I was also able to let this detail go, and my partner and I slipped into the whirlpool in our room. This was a nice feature, hot, pure sulpher-smelling water filled the nicely clean tub...but I was disappointed that the tub wasn't just a bit deeper. My partner and I are small people, so if you're a big guy, be advised that in a sitting position, your shoulders will be way above the water line. Scooching down into the tub, we found it difficult to find a comfortable position and hung the back of our necks on the squared edge of the tub. Romance was not to be....We retired to a hard mattress, and closed the curtains that didn't block out the light from outside to our satisfaction. During the night, we finally surrendered and shut off the window-heater-conditioner unit that vibrated and clanked every time it came on...so I woke up cold the next morning. Huddling under the blankets to attempt the last couple hours of precious rest, I was disturbed by the sounds of maids using the laundry next to my room, and the distinct sounds of another guest in an adjoining room, stirring something in a cup and speaking. I was amazed that the walls were so thin! Getting up with sore hips from the hard mattress, I searched the room in vain for a coffee maker...another amenity I guess I've been taking for granted. I guess in short, even if my destination has some charm and the draw of natural features, if I can't get a good night's rest, I won't be inclined to return. Hope this review helps someone's decision-making.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":3.0},"author":"Domenick Bayer","date":"2012-04-27 20:23:20 +0300"},{"content":"Calistoga Nov. 8 & 9th, 2006 This was our second visit, having stayed only one night last year. Very relaxing experience. Enjoyed all of the pools and the other guests. Grounds were very clean. The room was very clean, but the bed was not comfortable and the pillows were too hard. This will not deter us from coming back. Staff was very friendly. Looking forward to our third visit.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Ms. Kathlyn Rau","date":"2015-03-29 16:59:52 +0300"}],"public_likes":["Rachael Spencer","Justine Koch","Cheyenne Conroy","Nick Feest","Blaise Schuppe","Sally Fritsch"],"vacancy":false,"description":"Private and shared rooms, housekeeping apartments, all with free internet.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}