{"title":"San Diego/Downtown","name":"USA Hostels San Diego","address":"726 5th Avenue","directions":null,"phone":"+1 619 232-3100","tollfree":null,"email":null,"fax":null,"url":"http://www.usahostels.com/sandiego/index.html?lang=10","checkin":null,"checkout":null,"price":"Dorm beds start around $20/night, privates around $50-$60/person","geo":{"lat":32.71297,"lon":-117.1604,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25157,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I stayed at the hotel in July 2012 for a business trip. It is convenient to restaurants, stores and attractions. It is 2-3 blocks from Canal Street. The hotel is going through a huge transformation in the lobby so wonder if the rooms will also be updated. The sleeping rooms are simple and fairly small. But it served it's purpose - I have a desk to work and a bed to sleep in. I do have to complain about the bathroom. There is really no place to place your toiletries. The hotel does have a restaurant but cannot comment on it because all I ever got in there was coffee. I would consider staying here again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":4.0},"author":"Meredith Haley","date":"2014-05-18 23:08:13 +0300"},{"content":"I was there with a travel group mostly from the Chicago area. I love travel, and always appreciate my accommodations. This hotel was no different. Yes, the elevator tends to be slow, and yes, there was renovation taking place when we checked in. These things happen, and did not directly affect my paid-for space in the building....not negatively, at least. The bed was really wonderful, as were the TV, shower, and AC!! Much appreciation to the staff of the hotel, and to the folks working to make it a nice looking/functioning hotel for the business district. Thank you for everything!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kiera Littel","date":"2013-11-22 03:46:05 +0300"},{"content":"We were \"forced\" to stay here for The Final Four because there were no other hotels available. The ONLY bright spot was the bellhop, Ray. He was great and very friendly! The people at the front desk hardly said a word to us when we arrived. They seemed awfully smug and acted like we were bothering them when we came in each time. The hotel room was OK - just OK - but the bathroom had serious issues. Our toilet leaked the whole time, so we had a constant pool of water on the floor. gross. The wallpaper in the bathroom was curling up and there was a weird mold patch on the ceiling that had a hole in the middle of the patch. It seriously looked like there was a hidden camera in there or something. I don't normally have allergies but I had 2 different allergy attacks while showering because of the mold. They also gave us fewer towels each day, so by the last night, we didn't have hand towels. I asked for more and they assured me they'd send more. They never did. We were using a few towels each day to soak up the water from the toilet, so we needed more and we didn't get more. The shower curtain was too short for the tub and even more water leaked onto the floor during every shower. We got TWO tiny pillows for our bed - which was only a queen sized bed. I thought I reserved a King. The room was small and humid and the only way to sleep and not hear neighbors next door was to leave our A/C fan running the whole night. We read another review that said to take a different elevator that was to the left when you leave the lobby. Glad we did. The other one was horribly slow. I would not return here again when there are so many other choices of hotels in NOLA. The Sheraton has had my business in the past and will again next time. I would say, \"You get what you pay for\" but the rate was 4 times the regular rate, so I expected at least more than 2 pillows and enough towels for just the two of us. Totally disappointed. :(","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":3.0},"author":"Rashad Reinger","date":"2014-05-10 12:02:44 +0300"},{"content":"I have been staying at the Parc St. Charles on business for the last two months...usually one night a week. The rooms have been updated and are very clean, the new bedding, matress, fixtures really have added stars to the hotel. The staff has been most helpful and always have a smile! Most of all---the hotel is clean clean clean!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Anthony Klocko","date":"2014-07-11 23:21:29 +0300"},{"content":"I had a reservation at another hotel and they \"transferred\" our reservation to this hotel without notifying us at all. We were sad and angry to have to check into this beast. Tiny, stinky, paint peeling off the walls, stains on the carpet, broken tiles, burned out lightbulbs, need I say more? If all you're looking for is a place to crash after a night on Bourbon, this may be fine. If you have any sort of standards whatsoever, it will not meet them.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Ramon Barton","date":"2015-06-07 11:57:23 +0300"},{"content":"My son is at Keesler AFB in Mississippi and we decided that he wanted to spend his first weekend off base in New Orleans. The front desk staff are RUDE, the maid service does not speak a bit of English, we were placed in a room with a queen bed when I reserved a room with 2 beds. I was overcharged for my stay, valet takes forever to get your vehicle to you no matter how far in advance you request it. The place was roach infested and they didn't seem to care when I brought it to their attention. I was charged a $150 fee because they claimed we smoked in our room when in fact we DO NOT smoke. They said there was evidence of smoking in the room (prior to check-out) but the fact is, no one should have even been in our room before our check-out because of the DO NOT DISTURB sign on our door. When I asked to speak with the person who was in our room without my permission, they could not produce anyone who spoke English. The elevator is extremely slow and the AC is set at about 80 degrees in the lobby. The AC in the room could not be set below 75. There is ice available on floors 3 5 and 9 but you have to know how to find it yourself. Vending is only on the 5th floor. The rooms are the size of a large walk-in closet. The only upside to this hotel is convenience of walking to anywhere in the French Quarter. I would NEVER stay at this hotel again.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Dr. Shaylee Daugherty","date":"2012-04-19 20:30:25 +0300"},{"content":"There is no way to describe how AWFUL this hotel is. Everything about the places is out dated. The furniture was was so stained, I do not want to imagine what was stained all over the chairs. The fitted sheets did not fit and would slip down when trying to sleep in the \"very uncomfortable bed\". After the sheets slip down an reveal the mattress, you will find where past guest have written messages all over the mattress. You will hear other guest either entering or leaving their rooms, talking in the halls and rooms, televisions playing all through the night. And the trolly is never ending. I advise you bring ear plugs - and even those will not block out all the noise you hear. The price of the rooms may look good - do yourself a favor and book at another location even if the rate is a little higher. If you book at the Parc St. Charles you will get what you paid for - a CHEAP place to stay.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Jonathan Strosin","date":"2015-03-31 06:38:17 +0300"},{"content":"This was the ideal spot for our 4 days over New Years for our family of 4 (2 daughters in college).. It is close to the French Quarter (one block) and on the street car line. The hotel is unusual for a Hampton Inn because it has enormous room size and high ceilings and huge windows. All the rest is the reliable Hampton with healthy breakfasts. The staff were helpful and the celebrations on the river were just an 8 minute walk away. Also it is away from the New Orleans Convention center which is nice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Coralie Cronin","date":"2013-01-24 12:03:34 +0300"},{"content":"Nice property. The people are very helpful. Have stayed here several times. Internet works well. Easy to get to all the many restaurants and fun spots of the French Quarter. Quiet. I would have preferred a room with a view of something other than a brick wall - but not a real big deal.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Miss Johnson Turcotte","date":"2014-06-28 16:07:49 +0300"}],"public_likes":["Miss Abigale Little","Jasmin Crist","Clint Conn"],"vacancy":true,"description":"Small hostel in the Gaslamp Quarter. The hostel offers free breakfasts, wireless access, lockers, a laundry room, and bike rentals. They run a tour to Tijuana on Saturdays.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}