{"title":"San Francisco/Civic Center-Tenderloin","name":"Rodeway Inn Civic Center","address":"860 Eddy St","directions":"between Franklin St and Van Ness Ave","phone":"+1 415 474-4374","tollfree":null,"email":"rodewaysf@yahoo.com","fax":"+1 415 775-9329","url":"http://www.netopiadesigncenter.com/rodewayinnsf","checkin":"3PM","checkout":"11AM","price":"$60-$110","geo":{"lat":37.783,"lon":-122.4218,"accuracy":"APPROXIMATE"},"type":"hotel","id":25590,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I booked the Chancellor for my first trip to San Francisco, based on the price for the location and on the trip advisor reviews. On subsequent conversations with people about where I would be staying, I discovered that 2 or 3 people I knew had previously stayed there and they raved about the hotel so I was really looking forward to my stay there. I was not disappointed. We stayed for 7 nights in a twin room on the 14th floor. I had emailed the hotel a few days before my arrival to request a high floor if possible – and received a very prompt and personable reply from Kevin, the Reservations Manager. As some others have said, the room was small, but we didn’t need a lot of space, and anyway we spent very little time in the room. The closet was the biggest I have seen and we had our suitcases in there so they were not taking up space. The bathroom was also small, but sufficient. I have a similar sized one myself at home and it’s perfectly adequate. The free wireless internet was a big bonus as you often have to pay for it at more expensive hotels. It worked absolutely fine for me. The internet terminal in Reception is also a great service, as we booked something online that we needed a printer for. All the staff that we dealt with in the hotel were super nice and very efficient. We had an issue where the safe in our room went to ‘sleep’ twice but when we reported this to reception it was fixed in less than 10 minutes on both occasions. The lady at the tour desk gave some great recommendations for restaurants. Although she did tell us that the Alcatraz night tour that we booked online 3 months earlier didn’t exist which sent us into a bit of a spin, but a phone call to the company quickly sorted that it was in fact running !! We ate breakfast in the hotel a few mornings and it was lovely and the restaurant staff were great. The cookies at reception were delicious, I wish I had started eating them earlier in the week than I did!! The location of the hotel is absolutely fantastic and one of the cable cars runs right outside the door. I loved San Francisco and will certainly be going back sometime in the future. I will definitely stay at the Chancellor Hotel again and will tell anyone I know that’s going to San Francisco to book this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Mr. Myah Schaefer","date":"2012-08-28 03:18:30 +0300"},{"content":"The title says it all. Rooms are not large but when spending time visiting, who needs huge spacious rooms?!! They were clean, the hotel although centrally situated is not noisy - always a blessing in a city.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Danny Purdy","date":"2015-08-22 11:06:52 +0300"},{"content":"Just returned home after 5 nights at the Chancellor for our 25th wedding anniversary and we have already told friends of our wonderful stay here. You are given a guest critique form to fill in during your stay and after we filled it in and added our comments we realised you can't fault this hotel. Sure it's not new but so what, the service is efficient and polite, the rooms are very clean, it's located on Union Square the hub of San Francisco, the cable car stop is outside the door, there are loads of restaurants within 3 or 4 blocks and the cost of staying here is favourable. What more do you need? A special mention about the breakfast staff and the lady working the bar who always smile and give great service under pressure. I can't recommend this hotel highly enough. Many thanks for the champagne waiting in our room on our first evening, much appreciated.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Israel Mitchell DDS","date":"2015-03-26 16:17:30 +0300"},{"content":"We enjoyed 4 days staying at the Chancellor. Staff were extremely helpful and polite. Location was fantastic, so easy to go anywhere. Union Square was nearby, plus shops and many many restaurants. The cable car passed in front of the hotel. The rooms were very comfortable, not huge but still very nice. We did not eat breakfast at the hotel (optional in our booking) as most days we were heading out somewhere different. Great bonus of free tea and coffee in the foyer plus oat biscuits. There is a bar in the foyer and big screen TV. Very close to Chinatown, and the BART station is at the bottom of the street. I actually left a small jewellry conainer in my room and hosuekeeping found it. When I contatcted them they were very good in Fed Exing to our next USA address at our cost. I would highly recommend staying here.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Willow Murray","date":"2014-04-28 15:53:39 +0300"},{"content":"We booked this well in advance based on Trip Advisor reviews and found it to be everything we had expected. We were welcomed with a wedding gift of a picture frame which was much appreciated and a (very nice choice) bottle of red wine. The staff were really excellent and clearly on top of their game. We had one small issue (that didn't really relate to the hotel) and this was dealt with most professionally - thank you. I really rate the fact that the management of this hotel post responses to comments on this site whether good or bad - it's a sign that they care about both the hotel and their guests. Free coffee/tea in the lobby along with cookies and apples are a nice touch. The beds and amazing pillow selection were very comfortable and so was the room temperature even without A/C. Our family occupied 3 rooms during our stay and reports from all were very good. We would choose to stay again without doubt. Must also give a mention to the Cheesecake Factory opposite (top of Macys) - great food and very reasonable. Thanks Chancellor.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Carroll Moen","date":"2013-12-15 04:52:28 +0300"},{"content":"I enjoyed my stay at this hotel. It was conviently located close to transit (cable car, subway, light rail, and bus). The cable car which goes to Fisherman's Wharf goes right in front of the hotel. The staff was extremely friendly. They always greeted me with a smile. I stayed in a queen room. The room was alittle smaller than expected but was just large enough for me. And the rubber ducky in the bathroom was a cute touch. The hotel is older, but is in good condition. If you are a big TV person, you may have an issue; there were roughly only about 20 channels and most are news stations. I wasn't in the room enough to really care. I read a few reviews complaining about no air conditioning. First, it says it on their website. Second, if you know anything about that part of the country, very few places have A/C. The temperature is usually mild and there is no need for it.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Arlie O'Connell","date":"2013-03-06 11:07:08 +0300"}],"public_likes":["Devan Conroy","Ernestine Orn","Mrs. Adan Walker","Adalberto Graham","Alexanne Weissnat","Noelia Davis","Gabe Trantow","Quinton Schultz PhD"],"vacancy":false,"description":"This is a pretty standard but comfortable inn near Van Ness. They offer some free limited parking and a complimentary breakfast.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}