{"title":"San Francisco/Western Addition","name":"Hayes Valley Inn","address":"417 Gough Street","directions":"between Ivy and Hayes","phone":"+1 415 431-9131","tollfree":null,"email":"frontdesk@hayesvalleyinn.com","fax":"+1 415 431-2585","url":"http://www.hayesvalleyinn.com/","checkin":null,"checkout":null,"price":"$84–$105","geo":{"lat":37.7772,"lon":-122.4232,"accuracy":"APPROXIMATE"},"type":"hotel","id":26263,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"When my boyfriend and I made last minute reservations in Istanbul, most places were booked because of the UEFA cup final, but we were delighted to find this little gem. The rooms are basic but clean, comfy and good value for around 55 euro. Breakfast on the terrace was a delight. And the neighborhood was fantastic - a bit of real Istanbul - just off the tourist track but near all the attractions of the old city. And the most amazing burek you will ever taste at a bakery just around the corner! (you must try it!!) Oktay accompanied me there personally and made sure I didn't have any communication problems. Oktay and his family were very polite and catered to all our needs. We booked our airport transfers and bus tickets through him at a good rate which was really convenient and he helped us carry our luggage up to the bus upon our departure. All in all I would recommend to anyone looking for low key, good value.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Alicia Kassulke","date":"2013-11-30 17:25:30 +0300"},{"content":"Mystic Hotel is more of a guest house or hostel than really a hotel. It is overpriced for what it is. We stayed for 2 nights because we booked over internet. Our room had a slight musty odour, was not clean or comfortable (possibly due to the dirty carpets) , and the hotel itself was loud making it difficult to get a sound sleep (you can hear every person walk up the stairs, close doors and run their showers). One the plus side, it is well situated and serves a nice breakfast. However, for about US $15 more, we moved to a different hotel in the same area that was excellent in all respects and was overall a much better value.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Location":5.0,"Rooms":1.0},"author":"Bernadine Parker","date":"2012-01-24 20:30:18 +0300"}],"public_likes":["Jacynthe Zboncak","Lura Spinka","Catharine Haag","Terrance Denesik","Bryce O'Conner III"],"vacancy":false,"description":"European Style. Extremely cute, homey, and comfortable.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}