{"title":"San Francisco/Civic Center-Tenderloin","name":"Hotel Whitcomb","address":"1231 Market St","directions":"between 8th St and 9th St","phone":"+1 415 626-8000","tollfree":null,"email":"info@hotelwhitcomb.com","fax":"+1 415 861-1460","url":"http://www.HotelWhitcomb.com/","checkin":"3PM","checkout":"noon","price":"$89-$109","geo":{"lat":37.7781,"lon":-122.415,"accuracy":"ROOFTOP"},"type":"hotel","id":25597,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"What was great about this hotel apart from the great rates and superb location, were the little touches that made my stay perfect. This was the first long haul holiday with my wife and 10 month old daughter. The hotel provided on request a decent cot and a fridge at no additional cost. Upon checking in I was issued with 4 free travel tickets for the trams, which were readily used. The bed was very comfortable and the room clean and pleasant to stay in, this was important as my daughter being so young needed to be in bed by 8.00. The rooms were not the largest I have stayed in, but were cosy. The restaurant was fine (decent breakfast) as was the bar, but being with child we could not utilize to their full potential. The free coffee or tea and complimentary cookies were a nice touch. The staff were helpful and courteous although having all that i needed I never needed press them for anything. Overall everything I needed with no effort . Great hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Ned Stiedemann","date":"2015-03-30 05:51:09 +0300"},{"content":"As an Australian from quiet Adelaide who had not been to the USA before, I didn't know quite what to expect. I booked this hotel on the recommendation of other Trip Advisors. The Chancellor Hotel, was in a great location, had friendly staff and went out of their way to assist in all of our requests. We had three rooms booked as there were six in our group. All three rooms, while small and old, were clean and had everything we required. The free apples, cookies, coffee and internet access were a nice touch. Their tour desk was helpful and booked several things for us quickly and efficiently - they sell stamps and postcards (get the postcards down the street for 1/2 the price) they even posted our postcards for us. For the price, service and location, I would definitely recommend the Chancellor. While there are beggars on the street nearby, they did not hassle us and I felt safe at all times, even late at night. The street is busy, full of people, cheapish eateries and the cable car stop is directly outside the front door of the hotel. The hotel staff recommended a great Italian restuarant, so it's worth asking their advice on where to eat. The shopping in the area is great, with big brands and a huge Westfield about 5 minutes down the street. It's a hotel where they take an interest in their guests. I wouldn't hesitate to recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Isaias Thiel","date":"2012-05-13 10:58:11 +0300"},{"content":"My husband and I stayed at the Chancellor for 5 nights (7-12 September 07). This was our second visit, and part of an anniversary trip, so I contacted Wes the manager before we travelled and he helped me to arrange a special treat for our arrival. Not only did we find a bottle of wine and a special gift for our anniversary, but some beers and nuts for my husband (he is a simple pleasures kind of guy!) The hotel room (1103) was great - we had a corner view of Union Square, and although we could hear the cable cars quite clearly, they just added to the experience of San Francisco. We purchased a pair of MUNI passes from the tour desk and made full use of them during our stay. We travelled regularly on the cable cars (which were quite busy, but another part of the San Fran experience). We also walked down to Market Street and caught the F Line historic trams, which go all the way along the Embarcadero to Fisherman's wharf. Top tip - take the $20 trip across the Golden Gate Bridge - it only takes 1 and a half hours, but you get to stop off at the Palace of Fine Arts and take pictures of the city from the other side of the bridge. We also took a $10 sunset cruise under the bridge, which was well worth the money, if a little chilly!! Anyway, back to the hotel - I didn't get the chance to meet Wes in person to thank him for his help in making our stay special, but I didn't really have the need to speak to any of the staff apart from at check-in, as we had no problems the entire duration of our stay. That said, whenever we made our way through the entrance foyer, we were always hailed with a greeting by whoever was on the check-in desk. Little things like that, along with the jars of sweets and rubber ducky, made our second stay at the Chancellor just as good, if not better, than our first. We had no reason to stay anywhere else when we came on this trip, and we still have no reason to change on our next visit. Look out Chancellor - we'll be back!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Citlalli Sanford","date":"2012-09-21 19:35:15 +0300"},{"content":"It's one of the best hotels for a 3-stars class in San Francisco area. For the last 4 weeks, I have been staying at 5 different hotels in the Union Square area of San Francisco. This is the best one so far. I will not hesitate to go back to the Chancellor Hotel again. The room is nice and clean and it reflects recent rehab. and renovation; yet it maintains its classic character with modern comfort. The service is great and courteous...a lot better than other hotels that I stayed recently in the vicinity. The staff' s always available and very helpful, with a smile, and is ready to accommodate your needs. For me, one other attraction is that the hotel is located rigth next door to my favorite restaurant, the Sears fine foods...","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Delphine Larkin","date":"2015-02-05 06:23:09 +0300"}],"public_likes":["Javonte Price III","Alena Bailey","Trent Bayer IV","Dayne Jacobs","Brandt Franecki","Eden Fay","Jacynthe Terry"],"vacancy":true,"description":"This is a 460 room historic boutique hotel. An elegant, opulent building, it was first used as a temporary city hall after the 1906 earthquake. Italian marble, Austrian chandeliers, and a short walk to the Symphony/Opera and the Asian Art Museum. It also has a piano bar/wine bar.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}