{"title":"San Francisco/Fisherman's Wharf","name":"Suites at Fisherman's Wharf","address":"2655 Hyde St","directions":"between Bay St and North Point St","phone":"+1 415 771-0200","tollfree":null,"email":"guestservicessfw@yahoo.com","fax":null,"url":"http://www.shellhospitality.com/hotels/suites_fisherman/accommodations.html","checkin":"4PM","checkout":"10AM","price":"$175-$250","geo":{"lat":37.8055,"lon":-122.4206,"accuracy":"ROOFTOP"},"type":"hotel","id":25672,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Highly recommend this nice Inn when you visit Seattle. We stayed 2 nights here before catching our cruise for Alaska. It's a great location right next to Pike Place Market and the ports...can walk to Space Needle or SafeCo field for a ballgame, and Pioneer Sq area. The Inn is located at the bottom of an apartment building. The rooms are very spacious (much larger than chain hotels that charge much more), and quaint....ours had a fireplace and cute decor (including a teddy bear on the bed). They surprised us with balloons for our anniversary too (nice touch). Rates include free breakfast, and we aren't talking stale donuts here. A chef actually is baking quiche and other delectable goodies. The concierge was very helpful in recommending restaurants (try the Brooklyn for excellent fish just a few blocks away or the Brazilian place next door).","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Rylan Larkin","date":"2015-05-25 16:27:16 +0300"},{"content":"I have stayed in the Inn at the Harbor steps many times over the past four years. There have been times when I have been in Seattle when the location has not worked for the event that I am attending, or when there is no room available, and I find that I am always comparing the substitute with Harbor Steps and wishing I were there. Whereas I cannot say that my stays have always been without a gliche, the fact is that life is not perfect and I just frankly don't expect it to be. Mistakes happen, and it would be foolish of me not to accept that they are no more perfect than I am. I did have a time when there was a lot of movement in the room above my head, but it was when they were moving offices and that was what created the problem. They compensated me for the noise. All but one of the employees has been gracious and helpful and friendly. The one that was not...I reported the incident and know that the employee will learn from the mistake. The location, the usual extreme quiet, the wonderful relaxing breakfast and the afternoon receptions are too great to be overshadowed by an incident now and then. It is my home away from home.","ratings":{"Overall":4.0},"author":"Melany Kub V","date":"2013-12-11 01:50:24 +0300"},{"content":"Spent 2 nights in Aug,'06 at the Inn at Harbor Steps in Seattle probably the most surprising hotel stays my wife and I have had in years. Great downtown location to reach, by walking, each of the popular locations: 8 minutes from Pike St. Market, 15 to Westlake Center or Pioneer Sq, 25 to Chinatown. At about $150 per night for a large, quiet, King bed, hi ceilinged room, with landscaped courtyard view the real surprises come with the extras. A buffet breakfast (included in the rate) that is more like table service than buffet. A young kitchen staff cooking eggs, meats, potatoes, and quiche for the steam tables as quickly as they are consumed by the guests. Great coffee, pastries, etc. Then there is afternoon wine, coffee, tea, cheese service in a small pleasant Library room...again on the house. A small fitness center, sauna, and heated inside swimming pool also available for guests. When I asked for directions to the pool the desk also asked if I would like a pair of slippers. Add a free paper at the door each morning, heavy cotton bathrobes, and a small fridge in the room with a single free bottle of water & coke. Yes, a coffee maker and coffee and tea packs. There's more, but enough is enough. The stay was so pleasant that I tipped the helpfull desk clerk like one does at 5 star concierge service hotels. It will be our choice until they are acquired some day by a name brand.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Paula O'Reilly","date":"2015-11-19 22:23:35 +0300"},{"content":"The Inn at Harbor Steps exceeded our expectations, with the message passed to our restaurant that it was our anniversary and balloons at the door when we returned. The setting and location were wonderful, and the breakfasts amazing. My only issue was personal - suffering from SAD, I had trouble with the lighting in our room. We had only the dimmest of lights from the lamps, to the point that I couldn't even choose an outfit from my suitcase without checking what I had in the bathroom lights. As the majority of our stay was dark and rainy outside, the option of bright lighting in the room would have been better. But this was incredibly minor - everything else was amazing, leading us to feel pampered and relaxed even in a bustling, downtown setting.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Clemmie Bartell","date":"2014-05-05 22:25:43 +0300"},{"content":"I loved my stay at the Springhill Suites in Seattle. I was in town from Fort Mohave, Arizona, visiting a friend. We stayed here, because it was basically in the middle of everything we were doing in 2 days. The staff was super friendly, the room was perfect, breakfast in the morning was great, and the shuttle service to the Space Needle was a nice plus. We got checked in by 11 am, which was great, because we had a day full of activities planned, and it was nice to get our stuff put away so we could enjoy ourselves. The price was very reasonable as well. I totally recommend staying here!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Amari Borer","date":"2012-11-15 07:45:54 +0300"},{"content":"So....if you want upscale in downtown Seattle, expect to pay the price. This is nice, clean Hotel with reasonable prices. We were out and about most of the day, so it met our needs as far as sleeping & eating. One thing I do have to say is that I think this is the wrong picture of the Hotel. SpringHill is in the middle of the block and you have to know exactly where it is. It doesn't stand out like in the photo. Hotel offer a complimentary shuttle to go to Space Needle, Convention Center and one of the Malls. It was a great plus for us! One night the shuttle did forget us, but we took a cab back and the front desk had no problem reimbursing us for the cab fare. Hot breakfast in the morning which was always busy, but everything was well stocked for us. Front desk is extremely helpful. Anything we needed, we just had to ask. Not much around the Hotel to tour, (subway across the street). Not a bad neighborhood....I think the Hotel does their best to control the homeless around the area. Saw more homeless the closer we got to the downtown area. Again, for the price, you cannot go wrong. If you want **** star, then expect to pay the price!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ross Swift","date":"2015-01-10 11:45:50 +0300"},{"content":"Don't miss their breakfast Walk to town and browse around the market place and walk leisurely in the waterfront. Take the shuttle to go to the Light Train station if you want to go to the airport Don't take a cab from the airport to the hotel, instead take the Light Train to Westlake station and take a cab from there ($50 vs. $10).","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Jalen Hyatt","date":"2013-11-05 18:18:13 +0300"},{"content":"I keep returning to this hotel and after all these years it has not lost its value. The service remains excellent. The rooms are comfortable and clean. The facility is not allowed to deteriorate. Staff continue to treat guests with kind competence. They take pride in their work. The free breakfast cotninues to be a value as well. It took staff 10 minutes to get my room cleaned, but they bent over backwards with me and all other guests in this situation even though we all arrived at 3PM on the dot: free treats at the market, room upgrades. I was not expecting this after a recent stay at the Pan Pacific which touts itself as the epitome of customer service (NOT) and at a famous Chicago hotel whose staff were annoyed at guest requests. Not so, this staff! What a difference! The hotel is in a quiter part of downtown. It was a little over a mile from the theatres in lower Queene Anne (Seattle Center), I was able to walk it. The only down side is the expense of overnight parking which most downtown hotels have anyway.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Elza McClure","date":"2014-02-24 10:04:44 +0300"},{"content":"We stayed the end of May and again in June. May was a great value--AAA rate was $118/night. June was $134, but for a hotel of this type, there was no better deal out there. If you don't mind walking a quarter-mile, it's a great location because you can use the free tunnel bus to get around. Or, when not free, all buses are $2. Rooms are very spacious. There are many more healthy choices for the free breakfast than for most places, including real oatmeal. Internet was great. Room was a very spacious suite. Bed was very comfortable. Ask for a room on the Southwest side and it will be quieter and you'll have a view of the Space Needle. They give you free membership at the 24-hour fitness across the street so I took a fun aerobics class. We took Amtrak, so I don't know about parking, but it's right off Interstate 5.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Vicente Towne","date":"2012-09-10 02:31:56 +0300"}],"public_likes":["Dameon Fahey","Liana Friesen","Pansy Metz","Ransom Bruen","Reanna Padberg","Rebekah Reinger","Nestor Murphy","Sophie Osinski","Rosalyn Hermiston"],"vacancy":true,"description":"The Suites is a small (24 suites) but comfortable and modern hotel that offers one or two-bedroom floor plans with many amenities.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}