{"title":"Palm Springs","name":"Warm Sands Villas","address":"555 Warm Sands Drive","directions":null,"phone":"+1 760 323-3005","tollfree":"+1-800-357-5695","email":"info@warmsandsvillas.com","fax":null,"url":"http://www.warmsandsvillas.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.814735,"lon":-116.536726,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21552,"country":"United States","city":"Palm Springs","state":"California","reviews":[{"content":"If you are expecting Ritz Carlton standards then do not stay here. The rooms are very dated and worn. The white paint on the doors and walls has started to turn yellow. Antique televisions stuck in a corner of the room. The staff switched our room 3 times, but moving us to a lake view room does not make up for the torn and stained rugs. They finally moved us to the Four Seasons around the corner which was excellent in comparison.","ratings":{"Service":4.0,"Cleanliness":1.0,"Check in / front desk":4.0,"Overall":1.0,"Rooms":1.0,"Location":5.0},"author":"Leatha Huel","date":"2015-02-04 10:59:33 +0300"},{"content":"Over the top...every aspect of this beautiful hotel was over the top. Every staff member was lovely, the place is impeccably clean and the hotel is beautifully decorated. It was a huge treat to stay somewhere so special. I just wish that we had more time to relax and enjoy it. We were in Chicago on business which left little time to use all the facilities. On our next visit, we will be sure to add another day to our stay so that we can enjoy the pool, steam room sauna and whirlpool. I will also book a massage and/or a facial. The Ritz couldn't have been nicer.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Casandra Rodriguez","date":"2014-02-12 08:24:23 +0300"},{"content":"Just back fronm a long w/end in Chicago. Stayed at the Ritz Carlton on Pearson St. very central to all amenities. Navy Pier great. Bubba Gumps a great place for Cajun Shrimp. The ferris wheel at the pier has great vieqws of the city. Joes rest. great Coobas has a wonderful atmosphere and Tavern on Rush the same. Have a great time.# this is my second time to Chicago and it's a wonderful city.","ratings":{"Overall":5.0},"author":"Dee Lind","date":"2014-05-28 19:51:29 +0300"},{"content":"I jumped on a Living Social deal to stay at The Sutton Place Hotel. I surprised my husband for his birthday, and I am happy to say that this was the best birthday he's ever had! We checked in and met the most pleasant and helpful woman ever, Michelle G.. She overheard my husband telling the bell hop that it was his birthday so she offered a room upgrade for a very small charge. I have to admit, I had tears in my eyes when we walked into our Grande Suite. We have 6 kids and we don't get out very much, so this was a night that I will never forget. As a matter of fact, I will hold the memories fresh in my mind and look forward to our next visit. I will not \"try\" another hotel, there's no reason to. Everything is within walking distance. We walked to Oak Street Beach, walked to the 900 Shops, had an amazing dinner on Rush Street and had a breathtaking view of Lake Michigan. Every employee was so kind, everything was clean and we couldn't hear any other hotel guests the entire stay. I don't know quite how to say thank you.... Forget the other hotels, The Sutton Place is the place to go!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Emerson Pfannerstill","date":"2012-12-30 04:39:10 +0300"},{"content":"We had read mixed reviews about this hotel and were a little scared upon arrival. We loved it! My husband and I took off for a few days and never regretted our stay at the Sutton Place. Clean room, nice bathrooms, great location and walking distance to Magnificent Mile. The one thing we did not like was there was only one outlet in the room and it was behind the curtain so we did not find it until the last day. The beds were extremely comfortable as well. Concierge was great, they gave us \"priority seating\" for Gino's east pizzeria we also got free breadsticks for using it. O'hare airport is about 20 minutes away with a taxi and will cost roughly $35. Original house of pancakes was right across the street but I recommend eating at Tempo Cafe two blocks down. Pancake house kicked us out for bringing in a star bucks cup. We will definitely stay here again on our next trip to Chicago.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kennedi Feil","date":"2013-06-25 10:09:59 +0300"}],"public_likes":["Grayson Blick","Haskell Herzog","Angel Dietrich","Leanna Nicolas"],"vacancy":true,"description":"Intimate gay men resort, close to down town Palm Springs.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}