{"title":"San Francisco/Nob Hill-Russian Hill","name":"Hotel Vertigo","address":"940 Sutter Street","directions":"on the corner between Hyde and Leavenworth","phone":"+1 415 885-6800","tollfree":null,"email":"Reservations@PersonalityHotels.com","fax":null,"url":"http://www.haiyi-hotels.com/hotelvertigosf/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7885,"lon":-122.4159,"accuracy":"APPROXIMATE"},"type":"hotel","id":25970,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I have to echo another recent review--this Westin is not worth the price of admission. Unless I were returning to Montreal for a convention/meeting at this hotel or across the street, I would not likely return to this property. For the price I eventually paid after upgrades, I would also have been much happier at one of the boutique properties nearby in Vieux Montreal. I am a SPG Gold member, so I am entitled to a room upgrade upon availability. Hoping to get a Club Floor room, I upgraded to a premium room at reservation time for an extra $30/night. At check-in, I was told I could not be further upgraded--Club upgrades were limited to SPG Platinum members. So, my three night stay I paid for an upgrade to a better room which I would have received at no cost otherwise. I asked about the cost to upgrade to Club Floor, and forked over an extra $60/night to do so. So, from an original CAA/AAA rate of $175/night, I paid $265/night for a room and service in a hotel which was lackluster. As a previous reviewer described, the premium room was unappealing. It was a 1-bedroom suite, but the living room had no windows and therefore we never utilized that room. The bedroom was average size in my opinion--probably smaller than the standard size bedrooms elsewhere in the hotel because of the space taken away to create the separate enclosed living room. Bathroom was nice enough, but lacked a bathtub in which I would have enjoyed soaking during this stay. Hotel was very quiet and empty during the three-night stay (Sun-Wed). As a busy conference hotel, it might be fine, but even when empty we felt the hotel was impersonal and we were anonymous as guests (even though our faces were familiar to some of the staff day after day). Location was convenient to Vieux Montreal and to downtown areas--probably the best merit of the property. Club floor privileges were a complete waste of money and rather pathetic. The Club Lounge is essentially defunct. Except for cold beverages available in the refrigerators in the Lounge, there was no other food/beverage service available in the lounge. For breakfast, everyone is sent to the restaurant on the ground floor. Buffet breakfast there was merely adequate. We ate each morning around 9:30 a.m. and consistently found the hot foods barely warm if even warm. Food quality and variety wasn't anything exceptional either, with the noted exception of very good croissants. I certainly wouldn't want to pay $21+ for the buffet otherwise. From 5-7 p.m., you can return to the ground floor restaurant/bar for either tapas or a glass of wine/beer (take your pick) with the SPG coupon provided. The crab cakes we ordered one night were awful. The calamari was fine, as was the coconut shrimp. The only thing that lived up to Starwood expectation, in my opinion, was the typical Starwood quality bed/mattress which provided a comfortable night sleep--that is once we removed all feather products from the bedroom! Otherwise, this was a completely forgettable, albeit expensive, hotel experience.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Sigurd Crona","date":"2015-09-13 23:31:55 +0300"},{"content":"We enjoyed our stay at the Westin. Our room didn't have much of a view but was very large -- two double beds and a nice sitting area. The room was clean, except for a few Swedish Fish left over from the prior guests. The food at the restaurant was excellent although we found the service a little slow. The location was convenient to the subway and Old Montreal and the concierge was very helpful with finding things to do with the kids. Also, the kids loved the glass bottomed pool.","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Uriah Gutmann","date":"2012-11-19 03:40:03 +0300"},{"content":"Beware booking an \"Executive Club\" room. Advertised: \"Spectacular View.\" Reality: Although on the top two floors, many of the Executive Club rooms face a brick wall of the building across the street and have no view at all, much less a spectacular one. Advertised: \"Access To Executive Lounge. Reality: The \"Executive Lounge\" has no service at all. It's basically just an empty suite. No food service at any time of day, and just a refrigerator with a few drinks in it. It's pretty depressing. Advertised: Evening Hors D'oeuvres Reality: They give you a coupon for either one tapas OR one glass of wine in the restaurant. The rooms are very poorly insulated. We were not adjacent to the elevators, but could hear the elevators \"whooshing\" all night. You also could hear the pipes creaking whenever someone next to or above you used any water. In general, the hotel is fine. It's a typical sterile business hotel surrounded by hotels with much more charm. I've also stayed at the St. James, right across the street, and the Place de Armes, down the street one block, and I would recommend looking at one of these hotels before paying the price for the Executive Club. The location is great, and the neighborhood is wonderful.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Alexander Langosh MD","date":"2012-02-25 18:17:34 +0300"},{"content":"I stayed at the brand new Westin Montreal for an extended period of time through June, July and August this year. The staff is awesome, from front desk all the way up to the managers, super nice and accomodating. The service level is just right and if you are looking for that little extra, this is the hotel for you.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Cyrus Grimes","date":"2013-12-16 20:36:50 +0300"},{"content":"I find this hotel is almost perfect in price to serivice & quality ratio. Of course cheper is always nice but I have no complain. The rooms were clean, spacious, updated and comfy. Service was good. Excellent location. Will definitely stay there again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Chance Kuhlman","date":"2012-02-03 11:27:48 +0300"},{"content":"We went there over the 7/1 weekend (national holiday and jazz festival taking place) so Montreal was very crowded. The Check-in at 1am was very slow - and despite the time, there were a bunch of us waiting to check in. The person at the desk acknowledged the wait/frustration and gave us complimentary water bottles which was helpful - since we had a long drive of 7+ hrs. Tried room service but they said they were very busy and wait would be over 40 min so we gave up and went to bed. Positives: great bed and nice room, Nice Gym. Free Wi-fi! Location is great right near Old Montreal and walking distance to downtown. Refrigerator in the room - helpful to keep some drinks in the room. Negatives: dirty/used coffee filter in the coffeemaker filter area covered with condensation - we called the desk and they came to clean the filter but we were repulsed by it and never bothered using it the entire time we stayed. Who knows how long it was in there for? If it weren't for this, I would rate the hotel experience as excellent. Pool was smaller than expected - high children traffic. The jacuzzi- area wasn't much of one - just a warm tub - no water jets. Slow and inefficient valet parking system (they don't take down the model or the car license plate so when you want to pick up the car, the guy ends up looking for it for 15 min and coming back to ask for the car model and color afterall). tip: There are less expensive indoor parking nearby - so you don't HAVE to keep the car at the hotel valet parking (approx $26/night). We didn't take the car out till we were ready to leave Montreal - very easy to get around on foot and subway.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Tristin Rau","date":"2012-07-18 22:03:55 +0300"},{"content":"This is a nice hotel in a great location if you want to be near the \"Old Port\". We had a room on the 12th floor/corner deluxe room.... The views were great and the room was clean and nice but nothing spectacular. When booking the room we chose the deluxe room with the SPA Shower etc. The SPa Shower is a regular shower with one head that has 2 basic settings. I find this to be a bit miss lending on the part of Westin. The Beds are comfortable but the pillows are very firm. The pool is nice but small and they have a sauna(dry), hot tub and cold water plunge pool. This makes for a relaxing time. The Location is great if you want to visit the \"Old Port\" and Gibby's is only 6 minute walk. Over all we had a very good stay at the Westin.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Joaquin Spinka","date":"2014-07-10 05:51:32 +0300"},{"content":"Great experience, it was my first time in Montreal, after long hours of travelling from Argentina, I went directly to that hotel, was refreshing!. Rooms were perfect size, not big, not small just perfect, good business desk, complimentary internet, great speed, ideal for business. Location is perfect, a few blocks from old montreal, and within walking distance to downtown.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Giovanni O'Hara","date":"2013-11-01 23:31:28 +0300"}],"public_likes":["Nedra Kreiger"],"vacancy":true,"description":"A hotel with lots of bright colors and relatively few amenities compared to other splurge hotels in the area, but with nice rooms and a friendly staff.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}