{"title":"Liverpool","name":"Marriott Liverpool City Centre","address":"1 Queen Square","directions":"In the heart of the city.","phone":"+44 151 476-8000","tollfree":null,"email":null,"fax":null,"url":"http://marriott.co.uk/Channels/globalSites/propertypage/UK/LPLLP","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.40783,"lon":-2.98196,"accuracy":"ROOFTOP"},"type":"hotel","id":15914,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"This was my first stay in San Juan and at an Intercontinental hotel. Upon arrival, I found the staff to be very friendly and accommodating. I stayed on the 14th floor with a view overlooking the beach. The view was breathtaking and worth an upgrade. I probably would not have liked the hotel as much with a different view. If you are not into the casino, then go next door to the El San Juan or other close spots for the nightlife. The Intercontinental offered a quieter, more relaxing atmosphere. If you are traveling with children, I noticed that they do offer activities for them. Lying on the beach was like being in paradise. It is not overcrowded and food service is available. I will stay at this hotel again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mathias Dietrich","date":"2013-11-13 15:09:15 +0300"},{"content":"We arrived at the InterContinental from North Carolina around 3:00, June 7th, Rosie assisted us with check-in and we were in our room at 3:40. Fantastic service from Ray greeting us until June 13th the day we left. We did upgrade our room for $150 and it was nothing but perfect. Our room was 818 great views, very quite, fruit and water the first night, 2nd night some kind of chocolate cup cakes with cherries (holla somebody, these were so good), another night a free movie ~ wonderful. We rented a car for one day and drove to the El Yunque - beautiful, then to Luquillo Beach area to visit the kioskos. We eat at El Jefe - omg, this food is to die for, the burger with the puerto rican cheese yummy!!! Great service there also. This was just an amazing trip. Several little places to eat right across the street, however, only one bad review for this trip. We eat at Mi Casita (we read so many good things about this place and the food) the first night it was a little crowded the food was cold and the cornish hen was so dry you could not eat it, service was poor, we gave this place a second chance for breakfast- not many customers this time, but again the service was horrible, they served our coffee and the food arrived 25 minutes later no refills on the coffee, not one time asked if everything was ok, same way the night we eat there also. The staff just stood there and stared at us the entire time, a very uncomfortable feeling ~ needless to say we did not go back and will not in the future. We did a day of sailing and snorkling with East Winds these folks are awesome, we had a great time. Overall one oth the best vacations I've ever taken and would stay at the InterContinental Hotel again - the neighborhood surrounding the hotel however, does need a little cleaning up. PS...anyone staying in room 818 look in the desk drawer in the back there you will find a Puerto Rico coupon book and coupons for East Wind, with the coupon book there are several buy one get one free meals that saved us a ton of money, there was no way we could use them all and a 10% total bill for East Wind...enjoy and pass on to the next guest please. Have a wonderful time, it's beautiful! Booked entire trip through hotwire and paid with the $150 upgrade $81.00 per night, booked 6 months in advance.....about $70 added to credit card for resort fee, hotwire explains this when you book the trip.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Candelario Heller","date":"2014-07-05 22:53:40 +0300"},{"content":"This was a surprisingly nice hotel as \"city\" resorts go. Don't waste money booking transportation in advance. I spent $118.00 for 2 of us with Orbitz for the round trip transfer to and from the airport. It's only a mile and a half and a cab costs $11.00 each way. If you plan on arriving early, keep your beach/pool wear handy. Check in is at 4:00 and they pretty much hold to it. I reserved the \"laguna view\" room which is in the front of the hotel facing a parking lot, the city and in the distance mountains and a lagoon. Floors 7 and up qualify as laguna view. It is noisy in the front. You will hear traffic and planes all day. The balconies are small and no room for chairs. The room was clean although candy wrappers were found. The furnishings were on the old side but the bed was great. There is a separate vanity area for the ladies with a magnifying mirror, vanity bench and plenty of light. There's a safe, old TV, IPOD station and free wireless internet throughout. The restaurants are expensive as well as the drinks. There are good local restaurants all within walking distance. Try Mi Casita direclty across the street. There are also fast food places close by. The pool area is nice with 2 bar/restaurants. The chairs are taken early by way of \"towel\" reservations so go early and pick your spot. The beach is clean, the water perfect. Security all around so you will feel safe anywhere in the area. Overall, a really nice place for rest and relaxation.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":3.0},"author":"Melyna Boehm","date":"2015-04-28 11:42:58 +0300"}],"public_likes":["Yasmeen Lemke","Jay Greenholt","Keira Gaylord","Toby Frami","Cordia Wilkinson","Mr. Elvis Graham","Janessa Kemmer"],"vacancy":false,"description":"Claims to be a 4 star property but is now a little tired. The Marriot is surrounded by the Queen's Square complex with its bars and restaurants.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}