{"title":"Gower Peninsula","name":"Number 38 The Gower","address":"Gower Holiday Village, Scurlage Nr Port Eynon, SA3 1AY","directions":null,"phone":"+44 121 744 3301","tollfree":null,"email":"julia@number38thegower.co.uk","fax":null,"url":"http://www.number38thegower.co.uk","checkin":null,"checkout":null,"price":"270-600 per week","geo":{"lat":51.5645,"lon":-4.2184,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":10291,"country":"United Kingdom","city":"Swansea","state":null,"reviews":[{"content":"We stayed for two nights with our two teenagers. It was a return visit for us although the first time as a paying customer as an airline had picked up the tab last time when we were diverted. It's a decent hotel with reasonable rooms, good service and a nice gym and pool (which I enjoyed using). The hotel honoured our request for connecting rooms although we did have to wait a while for them. It's not a Four Season or Ritz Carlton but those chains don't do airport hotels and it's wonderful to tumble out of bed and stack up the luggage on the trolley (which we had kept since arrival. At $4 per trolley and no refunds when you return them, you want to hold onto them!). We didn't really eat at the hotel as there are many great restaurants to visit in Boston. We would highly recommend staying the night at the hotel before a day flight back to Europe","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lou Hackett","date":"2014-11-22 04:28:16 +0300"},{"content":"We stayed a night because we had an early flight from Logan the next morning. I have almost nothing but nice things to say about this establishment; however, it is ludicrous that the room cost $200 for the night and I was expected to pay for wireless internet service in my room? C'mon, if I pay $50 to stay at an Econolodge, the wireless internet is included. Give me a break.","ratings":{"Overall":4.0},"author":"Alda Weimann","date":"2012-02-11 02:39:19 +0300"}],"public_likes":["Ambrose Leannon I","Malinda Hoppe","Samir Kuhic","Mrs. Malinda Hermann","Kennedi O'Kon","Tamia Wintheiser","Teresa Lynch","Vincenza Gaylord","Mr. Odell Waters"],"vacancy":false,"description":"Self-Catering Bungalow, sleeps 6, pets welcome, free WiFi, Pool, indoor outdoor play areas, shop,pub and fish & chip shop with walking distance.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}