{"title":"Avignon","name":"Au Saint Roch","address":"9 rue Paul Mérindol, 84000 Avignon","directions":"South West from the middle age city","phone":"+33 6 90 16 50 00","tollfree":null,"email":"contact@hotelstroch-avignon.com","fax":"+33 4 90 82 78 30","url":"http://www.hotelstroch-avignon.com/","checkin":null,"checkout":null,"price":"From €48 to €65, €750 for breakfast","geo":{"lat":43.94291203216839,"lon":4.797995427497881,"accuracy":"ROOFTOP"},"type":"hotel","id":1362,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"We stayed at the Maui Outrigger Eldorado in 2005 as well and it was average then. I don't understand how these people rate their rooms. They rated K112 as 4 star -yeah right - I don't think so. Maybe 3 star but more likely 2.5 star. If you have kids, this is an ok place to stay. Everything worked and we used the kitchen to make a lot of meals but this place needs updating in a big, bad way. Oh and we asked for our room to have a door so that we could shut the door on the bedroom when the kids went to sleep. Not sure what was so hard about comprehending that but we didn't get a door to the bedroom so we listened to our twin 1 year old boys scream themselves to sleep. Good times. The pools are ok - not very busy. The beach is great when there's no torrential rain storms going on. Whaler's Village is close enough to walk to, which is nice and Lahaina is a quick drive. The location is great but many of the rooms need to be rennovated. My husband's parents stayed in K200 and although it is a large suite, it needs to be rennovated as well.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Jalen Jacobson","date":"2015-07-14 18:25:22 +0300"},{"content":"We just got back from 5 days in Maui at the Outrigger El Dorado- 02/02/07-02/07/07. It was 3 adults- and we booked a 1 bedroom garden view condo- well, as I read on this site before we went, all the condos are individually owned, and therefore are all a little different. The first one they put us in was pretty bad, the decor was tired and dirty, but the biggest surpise was that while they called it a \"1 bedroom condo\" - it was really more of large room with a partial length wall between the beds and living room area, but no real separation or privacy of the sleeping and living/cooking area. I consider that a studio, and I did see several of these condos. Not what I had in mind at all when booking a \"1 bedroom condo\" for 1 couple and one single adult traveler!! After looking at 4 available rooms, we ended up in a great 1 bedroom partial ocean view condo in with a fully separate bedroom with 2 queen beds, a fold out couch in the living room, and 2 full bathrooms which was a real bonus. Kitchen was small but clean and up to date, and this room was just behind the lobby area so great for parking up front. We were in K204, great ocean view, nice big balcony- and we also saw and liked K104 which had the same layout. This hotel has a great beach which was never crowded, is a 5 min walk to the shops and restaurants in Whalers Village. Main pool was also quiet and had nice BBQ's there as well. If you are shopping for food, I thought the \"STAR MARKET\" just up the road towards Kapalua about 5 min was much better quality and stocked than the Safeway down the road to Lahaina. We got the best fresh local mahi mahi there and that on the BBQ as you watch the sunset from your balcony is pretty great! We ate out at SANSEI in Kapalua for sushi and it was quite good. This is a great condo style set up for familys or couples, and its so nice to be away from the crowds at all the hotels and condos along the beach by whalers village which gets pretty packed, and that is not my idea of relaxing! One last thing, if you are heading over soon, do find a whale watching trip, we did and it was a great experience! I will go back to this hotel for sure!","ratings":{"Overall":4.0},"author":"Braulio Muller MD","date":"2012-01-31 08:22:19 +0300"},{"content":"My husband and I stayed at the Outrigger Maui Eldorado 6/18-6/21. We try to always stay at Outrigger or Ohana resorts when we are in Hawaii because of their liberal policies towards airline employees. We arrived late night and had booked a partial ocean view one bedroom condo. The condo they put us in was not partial oceanview but it was a 2 bedroom and seemed to be larger then our own house back home. We found out the next day that that was the only condo available when we checked in and needed to move as the owners were coming to stay. The entire staff was very apologetic and accomodating. The next day when we returned to the condo we found a large gift basket waiting for us and a card from the manager. The hotel overall had beautiful grounds and we loved the tiled pool. The beach was a bit of a walk but not more then 10 minutes and was well worth it. We would definately stay here again.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Stephan Muller","date":"2014-12-08 03:08:41 +0300"},{"content":"When you save the entire year to go to Hawaii you expect to get something out of it. We have stayed at Outrigger properties before on Kauai so we were extremely dissapointed when we went home. The decor was outdated in the room. The main pool above the parking garage was just a cement pond with water with absolutely no Hawaiian charms at all. In a previous post I agree with the person who said the bathrooms were dark and old. We stayed in G building. On the 3rd night there I heard rumbling in our kitchen. Somebody had eaten thru a plastic bag of food. Well when we mentioned that there was a 3rd party in our room and by the bite marks it was very large they said they couldn't move us for a day and not even a sense of \"we are sorry.\" When they did get us a new room they wouldn't even help us move to K building which wasn't close. I even got some snide comments from the staff \"Oh you are the one with the rodent\" and then a chuckle. The manager admitted to me that they knew of a problem in Building G that is why they had an exterminator there the day I found our roommate. They offered to move us to building H but I refused considering it was fumigate the first 2 days of our stay. We have been to Hawaii 3 times in 6 years and this was the worst place we stayed at by far.","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":2.0,"Service":1.0,"Rooms":1.0},"author":"Jermain Tremblay","date":"2013-12-21 06:14:33 +0300"},{"content":"My room was large & airy. Breakfast was great. The WiFi worked ok once I got it translated. The WiFi provider is http://www.hotsplots.de/en/ and you can find setup help under \"Support & Downloads\" Very good location. Bus stop just down the road for service 249 that will take you to the Zoo station. Also Hohenzollernplatz metro station on the U3 line. The only problem I has was the lack of cleaning. The communal bathroom was not cleaned in the week I was there or my room bin emptied. Apart from that it was great. I would defiantly go back.","ratings":{"Cleanliness":2.0,"Sleep Quality":3.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Dameon Windler","date":"2013-08-22 15:59:26 +0300"}],"public_likes":["Mariam Williamson","Dr. Myrtis Mann","Mara Gleichner","Rahsaan Renner","Loyce Sawayn"],"vacancy":true,"description":"Nice hotel with a very quiet garden.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}