{"title":"Wirral","name":"The Hillbark Hotel","address":"Royden Park Frankby, CH48 1NP","directions":null,"phone":"+44 151 625-2400","tollfree":null,"email":null,"fax":null,"url":"http://www.hillbarkhotel.co.uk/","checkin":null,"checkout":null,"price":"£160+","geo":{"lat":53.360156581328596,"lon":-3.133699893951416,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33536,"country":"United Kingdom","city":"Birkenhead","state":null,"reviews":[{"content":"I had a business trip to Honolulu recently and our company travel agent booked the three of us traveling together into this hotel. I was so excited because it is supposed to be the latest, greatest and best luxury hotel imaginable. It isn't. The hotel feels like something from NY or Chicago plunked down in Hawaii. If I were on vacation and looking for that special Hawaiian feel, I would have felt cheated. The lobby reminded me of the Admiral's Club lounge, not a top Hawaiian Hotel. We all had ocean view rooms and that was nice, but having to look over the tops of the hotels between us and the beach wasn't quite as nice. I knew it wasn't on the beach, but someone reading the glowing reviews and the hotels own descriptions might not get that. It is \"steps\" from the beach, but many more than the 5 or 10 that \"just steps\" conjures up and it isn't the main part of Waikiki Beach and there are scant services. The rooms themsleves were alright, clean fairly well appointed, but pretty small for the price point and I found the bathrooms small as well. The two most disapointing parts of the hotel were the pool and the \"free\" in room Wi-Fi. The pool is very small, a good part of the pool area sits under an overhang so sunning would be a challenge and then because it is on the side of the hotel, not out on an open deck, it is like a wind tunnel coming down the concrete canyon, Reading the paper was difficult it kept blowing so much. The in room Wi-Fi is some of the slowest I have ever encountered. I could get so little work done in my room I gave up and took my lap top to Starbucks to get my work completed. Part of what made it seem so much worse was that after the four nights there, my DW flew over to join me. I couldn't afford the Trump on my dime so I reserved a room at the Waikiki Parc two blocks over for four more night at over $100 less than the Trump was getting. The rooms were about the same size, the pool was much much better and we had breakfast included every day. The Parc just seemed superior in every way and the more we got comfortable there, the more my dissatisfaction with the Trump grew. Maybe if I were looking for a condo with a full kitchen I'd look more kindly on the Trump, or maybe no, because the bad pool area and design would $@!#% any pool time for us on a vacation. I will say the staff at the Trump couldn't have been nicer or more helpful. Everyone always had a smile and seemed genuinely happy to see you.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":1.0,"Location":2.0},"author":"Dr. Ophelia Hansen","date":"2014-06-05 10:52:19 +0300"},{"content":"My husband and I recently stayed at this hotel for a week. It was our first visit to Honolulu. For us, it was a wonderful stay. The customer service given by check-in, valet and concierge was congenial and efficient. We had a partial ocean view room and it was exactly as described. The view was lovely, the room space was cosy but fine. The bed was wonderful. I am a frequent traveller and a good bed is one of the most important factors in my stay. The room and bathroom were clean with elegant marble finishings. The bathroom was quite a nice size and the shower was wonderful as it was not set in a tub but flush with the floor. Housekeeping was always prompt when we asked our room to be made up and the turn down service was at an appropriate time. I had seen the reviews on this site before I booked the trip so I knew about the issues some reviewers had with the small size of the pool. It was not a factor for us as our desire was to experience some gentility, tranquillity and luxurious comfort at the end of our long days exploring Honolulu and Oahu. This need was met. The only minor negative comment I would have is about the food in the hotel. It was not as good as I expected given the rest of the experience. It was not awful just rather lacklustre and very ordinary. Overall, we had a good stay and would stay again as long as the customer service, standard of cleanliness and room quality remain high. This would hinge on management not beginning to rest on their laurels but to strive even harder to maintain and surpass customer expectations. A big thank you to the staff who made it such an enjoyable experience.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Franz Parisian","date":"2014-09-26 09:53:45 +0300"}],"public_likes":["Miss Unique Heidenreich","Dr. Joan Moen"],"vacancy":true,"description":"Grade II listed hotel provides the finest luxury coupled with discreet yet friendly service from the resident owners and their team.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}