{"title":"Carrizo Plain National Monument","name":"Selby Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":35.12814,"lon":-119.84091,"accuracy":"APPROXIMATE"},"type":"hotel","id":5120,"country":"United States","city":"New Cuyama","state":"California","reviews":[{"content":"My boyfriend and I found ourselves with some free time during the week, and decided to meet in San Francisco for a last minute getaway evening. We wanted to stay near easy access to the Golden Gate Bridge, and had the additional need of early check in (very early). After randomly calling 2 other motels/inns from the AAA book, we arbitrarily selected the Cow Hollow Motor Inn $ Suites.....I am so happy we did!!! Not only did the very friendly staff accommodate our early check in request....the room was simply amazing!! The decision to stay was a fluke this time; but will be part of our definite plans in the future!!! This is truly a SAN FRANCISCO TREAT!!!!!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Eugenia Sanford","date":"2015-06-03 21:17:51 +0300"},{"content":"This motel is exactly as other reviewers explained it so there were no surprises. It is what it is. Pros: Price - reasonable. Large room. Basic bathroom with surprisingly nice towels. Clean. Quiet air conditioning - no clunking noise. Great location for Chestnut, Union and Fillmore Streets. Convenient parking. Cons: Bed was comfortable but no euro-bedding or pillowtop mattress. Staff was neither rude nor friendly. I guess I'd describe it as a 1960's style motel, but like most visitors, I only slept there and wasn't looking for a great hotel experience. That can be had on Union Square, but then you're in a whole different atmosphere. I was there to visit family who live in the Marina District so it was the perfect choice. You can't beat it for the price, size and location. Just know you're not getting a luxury hotel, but you are getting a clean basic one.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Carmine Heller","date":"2013-02-02 22:45:08 +0300"},{"content":"We have stayed at the Cow Hollow for several years. The past two years it has really gone down hill. The service at the front desk has always been horrible. They are just down right rude. If you ask for anything specific, backside room, king, etc., they say they will honor it. Most of the time that is ignored. Also, the street noise is increasingly horrible. I have always had a noise machine, but even that did not help this time. I am looking elsewhere for the next trip. Too bad, they used to do a better job. The rooms are very rundown now. Desks with no lamps, bathtubs with no stoppers. They are full because the price is good, but not worth being tired and exasperated for the whole trip.","ratings":{"Overall":2.0},"author":"Johnathan Wunsch","date":"2013-10-23 06:21:46 +0300"},{"content":"My husband and I drove to San Fran from Vancouver Canada. Long drive, but well worth the trip!! We loved San Francisco, the hotel was central and on the flat side!! No huge hills to climb. Area is called the Marina district. Close to all the trendy shops and excellent restaurants. People in San Francisco are very polite and helpful. Gave us some good sites to go walking, like the Marina, Golden Gate bridge, and George Lucas Productions. The rooms are always spotless every morning. Traffic on Lombard Ave., alittle noisy, buy didn't bother us. The area was great!! We will be venturing down the coast again this August and will stay longer this time!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Mckenzie Hane Jr.","date":"2014-08-07 23:34:34 +0300"},{"content":"Couldn't fault the Cow Hollow Motor Inn. The location is just brilliant, especially for nearby restaurants and shops, which are just at your doorstep. Parking is free (a huge plus), and our room was extremely comfortable and really quiet (no view, but no traffic noise either). I researched a lot of hotels in the Fisherman's Wharf area, but was so glad we chose the Cow Hollow area instead. Fisherman's Wharf just seems an area of slightly tacky tourist restaurants and snack bars, \"seaside resort\" souvenir shops and chain hotels, whereas Cow Hollow was full of great restaurants and shops. I looked for a nice restaurant for our last night and was overwhelmed with choice - ISA, Betelnut, A16, to name but a few. We ended up at Bistro Aix which was excellent. The number 30 Muni bus runs along Chestnut St and goes really close to Fisherman's Wharf. Extremely good value for a central city hotel.","ratings":{"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Ariel Hodkiewicz","date":"2013-12-05 19:05:19 +0300"},{"content":"I stayed on a very short trip to SF, and it was nice. Fast check in, nice rom, the only thing was that it doesnt have a view, but there are rooms with a view. Staff was very helpful, the concierge told us that he can get us good reservations if we like, free wifi and business center, an starbucks next by, close to a walgreens, and to all the action.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Dave Hoeger","date":"2014-04-23 20:04:50 +0300"},{"content":"The hotel is ok, is very well located wish is very good. However, the rooms are super tiny, you can barely move around, but they are super cute, the decoration is cool. Anyway I wouldn't stay there again, it wasn't a bad experience at all but it wasn't great either, I would experiment with another place!","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Humberto Gibson","date":"2013-01-20 23:08:22 +0300"}],"public_likes":["Remington Wiegand","Briana Mraz","Vinnie Oga","Ole Mueller","Rachael Kuvalis","Ceasar Ledner","Marley Cummings I","Salvador Koss","Margarett Brakus"],"vacancy":true,"description":"This campground is situated on the eastern foot of the Caliente mountains on the northern end of the monument. The area has fine views of the plains and is well situated for hiking on the Caliente Ridge or visiting Painted Rock and the visitors center.  There are no shade trees but there are shade shelters over the picnic tables.  Selby road, the road leading from Soda Lake Road in to the campground is clay and becomes impassable for days or even weeks after any amount of wet weather.  Do not attempt this road if its wet and if you are at the campground and it starts to rain, leave immediately.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}