{"title":"Annan","name":"The Corner House Hotel","address":"78 High Street Annan DG12 6DL","directions":"In the centre of town, on the corner of Lady Street and the High Street","phone":"+44 1461 202754","tollfree":null,"email":"bookings@thecornerhousehotel.com","fax":null,"url":"http://www.thecornerhousehotel.com","checkin":null,"checkout":null,"price":"Rooms From £32","geo":{"lat":54.98742,"lon":-3.26194,"accuracy":"ROOFTOP"},"type":"hotel","id":37338,"country":"United Kingdom","city":"Annan","state":null,"reviews":[{"content":"We had stayed at the Iberostar Quetzal 2 years ago, and went back Feb. 11- 17, 2006. We thought the overall service was a little better in 2004, but had a very good time this trip with 2 other couples. Although we got into building 21 (closest to the beach with partial ocean view), they put us on the side of the building facing the Rui Palace, which means you get to hear their disco each night from 8:30PM to 12:00AM and beyond! We had room 2150. If you get building 21 (or 22), demand rooms 2148, or 2142, or ANY other room on the inner \"Quetzal\" side, unless you want to hear bad covers of bad songs at 11:45 at night (after a hard day at the pool and beach this was tough). Also, during the day, the kiddy section of the Rui Resort was right outside our door, so we got to hear every game they were playing, whisltes blowing, kids screaming constantly..... not a huge deal, but when you want an hour before dinner to just sit on your balcony, have a beer in relative peace...forget it. Also, you get the nice afternoon/evening sun on the otherside. By the time we were fed up, it was too late to change rooms. We got ear plugs for sleeping at night. Other than room location, the Quetzal vacation was great. People there are super nice, room service was fast. We rented a car at the hotel for a trip to Chichen Itza, no problem at all. The Japanese restaurant was the best, make sure to eat there, food was great.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Serena Farrell","date":"2012-01-26 10:46:21 +0300"}],"public_likes":["Alena Johnston","Zoey Rowe","Eino Heller","Pete Bauch","Cielo Mraz","Onie Jones","Garrett Rutherford"],"vacancy":true,"description":"With 18 en-suite rooms, it provides accommodation with a warm welcome for visitors to the town: free wifi available in the coffee, lounge bar. On-site car parking, with CCTV system","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}