{"title":"Hollywood","name":"Motel 6","address":"1738 N Whitley Ave","directions":null,"phone":"+1 323 464-6006","tollfree":null,"email":null,"fax":"+1 323 464-4645","url":"http://www.motel6.com/reservations/motel_detail.asp?MotelId=4044&state=CA&full=California&city=Hollywood","checkin":null,"checkout":null,"price":"$70 for a double/twin","geo":{"lat":34.102832,"lon":-118.33313,"accuracy":"APPROXIMATE"},"type":"hotel","id":11787,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"I stayed at the Ohio House back in the '80's' and it was around $50/night so when I wanted to go 6/03 I was afraid of what the pricing would be. I paid $89/night for a busy Chicago weekend...the hotels DIRECTLY across the street and down the block were asking $125+/night. All I did was watch an hour of TV and crashed...took a shower the next morning and left. I can't see paying for a lap of luxury in the hotel when there are so many places and things to do up there! The rooms are clean and unlike Motel 6 you get your choice of shower or bath! I am going to stay at Ohio House anytime I go for more than a one day stay.","ratings":{"Overall":5.0},"author":"Ms. Leland Daniel","date":"2012-06-10 18:55:21 +0300"},{"content":"Family owned Motel takes you back in time to the 1950's or 60's. It's a very well kept place and Clean. You open the door and you can smell the use of bleach and pledge. It's not overwhelming but it's very clean. The paneling has been painted but the look is a back in time experience our bathroom was all yellow the retro look for today. yellow tile, tub, sink with stainless steel legs...Like I said it was CLEAN.. The carpets are indoor/outdoor and very clean. The bed was comfy. (Sorry No Pool) You'll see that it's the older crowd that stay there (people in there 50's and up). Your away from the highway so the noise is minimal. Being in Chicago it's not in a scarey part of town and is a safe place to stay. We were there for the Paul McCartney Concert at Wrigley so we saw alot of the younger crowd (50 years and up) The air cond. was inside and control on the wall but it was cool. Outside the temp was a heat index of 105 and the room was 72 and we could've turned it down if we wanted. I was totally amazed with the cleanliness and the up keep Retro but Very Nice. Wish I had pictures to show you.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Marie Hamill","date":"2013-12-01 06:28:29 +0300"},{"content":"I contacted both AAA and the Manager of the Motel on this issue. I recommend that they do not advertise the Wireless Internet until they have their service together. I attended WorkShops during the day and planned to work back at my motel at night. The service frequently cut off Internet Access and I got messages that the Broadband Link was broken, which I did page capture of the \"Broken Link\" message. I tried to use the Internet early in the morning, with the same result. On my last night's stay, I contacted the front desk and the person on desk suggested that I pull my chair out of the room and sit under the router to get a stronger signal. I did this because I needed to work but of course this did not increase my access. They also suggested that I take my computer to the office. So, I hauled my laptop down to the little lobby (where they said I was only allowed to go) and with the same result--no Internet Access. I was told that there may be Internet Cafes up the street. However, I do not know Chicago well and I did not have a car because we carpooled. However, I was willing to go and find a Cafe but I tried to call out on the hotel phone first to see what Internet Cafes might be open and available and only got a busy signal. My only option was to stay up all night and try to put in work whenever I might per chance get a connection. My hope is that management will take their offer of Free Wireless Internet down until they actually offer a solid service. If you are a business person, who needs to have access to the Internet, please reconsider your motel/hotel options.","ratings":{"Overall":1.0,"Value":1.0,"Service":1.0,"Location":5.0},"author":"Madalyn Wintheiser","date":"2013-07-16 05:04:47 +0300"}],"public_likes":["Dortha Hermiston","Harrison Harvey"],"vacancy":true,"description":"This is part of a budget model chain.  It offers clean rooms in a convenient location.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}