{"title":"Birmingham (England)","name":"Staybridge Suites","address":"Martineau Place","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48055,"lon":-1.896,"accuracy":"ROOFTOP"},"type":"hotel","id":3637,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"I try to stay at Hilton properties however I was not impressed with this hotel. It has so much history to it that you would think service would be amazing or al least what u would expect from a Hilton. Everything was just average. The bed was very uncomfortable. Sorry I won't be back until things improve.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":2.0,"Rooms":1.0},"author":"Zackary Price","date":"2014-11-15 04:16:17 +0300"},{"content":"I stayed with a friend here for only one night earlier this week. The place is very cool & nostalgic. The staff is very helpful, pleasant and always smiling. The rooms were nice (not huge, normal for older hotels), clean and decorated like the rest of the hotel in a 20's movie star style. Beds were comfy too. We ordered room service and I was amazed at how good the food was. We both had the roasted chicken and I also had the mushroom soup. Since I was in and out of the room in under 16 hours I didn't get to walk around much however, the train is close by and there were a lot of shops and a starbucks across that stayed open later than the one in the hotel. There is no coffee maker in the room but, the gentleman who delivered room service said we just needed to request one and they would bring it for us. Side note: I didnt know the history of the hotel before arriving but, my cab driver filled me in. Chicago cab drivers are always very helpful :0)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Keara Collins","date":"2014-01-03 13:48:21 +0300"}],"public_likes":["Arlene Terry II","Thurman Vandervort","Brain Hegmann"],"vacancy":true,"description":"A rare occurrence of IHG's extended-stay brand outside of North America, the Staybridge Suites Birmingham offers studios and apartments with kitchenettes and other long-stay facilities, including on-site gym. Breakfasts are included in room rates.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}