{"title":"Newport (Pembrokeshire)","name":"Llwyngwair Manor Holiday Park","address":"Llwyngwair Manor, Newport, Pembrokeshire, SA42 0LX","directions":"Llwyngwair is at the foot of the Preseli Hills on the A487 Cardigan to Fishguard road, 1 mile East from Newport","phone":"+44 1239 820498","tollfree":null,"email":"enquiries@pembrokeshireholidaypark.co.uk","fax":null,"url":"http://www.pembrokeshireholidaypark.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.017661,"lon":-4.813145,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20357,"country":"United Kingdom","city":"Pembrokeshire","state":null,"reviews":[{"content":"Comfortable, large rooms just 5 minutes from any Changi terminal. Fast and easy to check-in and rest after a flight. Beds very comfortable and blackout curtains mean a good nights sleep guaranteed. Breakfast included. The high point is the outdoor swimming pool set amongst islands of planter boxes.","ratings":{"Overall":5.0},"author":"Amelie Thompson IV","date":"2014-02-27 21:42:48 +0300"},{"content":"This was a surprisingly pleasant hotel. It's very convenient - I was checked in 20 minutes after my flight landed at Terminal 2 - there's a train link to Terminal 3 where the hotel is located. The hotel has an internal courtyard with a sensibly-shaped pool and many plants. It gives the illusion of being at a tropical resort with many water features, instead of being at one of the world's busiest airports. Rooms are surprisingly quiet, considering how busy Changi airport is. Rooms are nice - spacious and modern, with large bathrooms, and the hotel designer arranged it so that many of them overlook the relaxing internal courtyard instead of the airport runways. Use of mood lighting in the corridors makes gives the hotel a quiet, subdued atmosphere. The reception area isn't nice though - the morning sun shines right in, and it's - ordinary. The MRT connection makes it easy to connect, but if you're out for shopping or night-life, it's a long way from town! Excellent for business travellers or those who need to catch an early morning flight!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Leonora McClure","date":"2013-01-14 07:32:07 +0300"},{"content":"Stayed here twice waiting for a connecting flight. Very convenient. Rooms surprisingly quiet considering it's an airport! Nice room, pleasant staff and great breakfast. The pool is lovely, you can lay in the sun and watch the planes take off. We just had to jump on the 'Sky Train' to connect with our flight.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Ceasar Corkery","date":"2015-09-14 23:37:25 +0300"},{"content":"Singapore does not have too many options for hotels that are close to the airport. This trumps them all. Conveniently located in T3, it offers walk-in access to passengers. Plus, you have all the usual facilities at Changi airport, that you can use. Also, with the MRT station in the basement, you can move into the city, pretty quickly, without your luggage. Opt for this as waiting in line for taxi at T3, can be pretty taxing, especially during peak hours. Eat at joints, in the airport terminal - you have a range of options. Do check out the bar at the hotel - but, be warned, they close pretty early.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Felicity Harris","date":"2015-08-27 00:16:34 +0300"},{"content":"The hotel is considered very new, and this is reflected in the furnishings and general condition of the room. First glitch was in the booking - I had requested twin beds but turned up to be told it was a room with one King bed. This was rectified, but the service was not with a smile at all. The porters were timely, and the rooms are extremely spacious, as expected with 'out-of-the-way' hotels. Its proximity to Terminal 3 of Changi Airport makes it very handy for transitting passengers though. The porters will provide an airport trolley for luggage upon checkout. Our room faced the communal pool, which was not audible from the 7th floor. However, voices of other hotel guests are easily heard from the common corridor. The lighting in the room was rather minimal too, given its size. All in all, a hotel that serves its purpose in providing a comfortable environment close to the International Airport terminals, but is still considered relatively pricey given its location.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":5.0,"Location":3.0},"author":"Dena O'Keefe","date":"2013-06-05 10:28:21 +0300"}],"public_likes":["Cade Lesch","Arnaldo Runte","Fritz Wilkinson","Zackery Conn","Ephraim Dickinson","Ms. Curtis Beatty","Maximus Dibbert","Dr. Chadrick Yundt"],"vacancy":true,"description":"Llwyngwair Manor Holiday Park is located at the foot of the Preseli Hills. It is overlooked by Carn Ingli Mountain and is bounded by the river Nevern. It stands out for its beautiful location and well kept grounds. The park offers hotel, self-catering, touring and camping accommodation. The park offers onsite fishing, tennis and a licensed bar (available to all) that provides bar meals and sky TV.","alias":"Llwyngwair Manor","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}