{"title":"San Diego/Mission Beach-Pacific Beach","name":"Surfer Beach Hotel","address":"711 Pacific Beach Dr.","directions":null,"phone":null,"tollfree":"+1-866-251-2764","email":null,"fax":null,"url":"http://www.surferbeachhotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.79097,"lon":-117.25495,"accuracy":"APPROXIMATE"},"type":"hotel","id":25245,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I lived and traveled world-wide and stayed in 1-5 star properties. This was the worst night's sleep I have had in 35 years. I was told the day before arrival for a one-night \"staycation\" that an early check-in would not be a problem as there were plenty of rooms available. When we arrived, an upgrade to a suite was not available. I requested a rollaway which took two calls and two hours to arrive and a coffeemaker which also took an hour and a half. Micah at the front desk apologetically gave us a $25 credit. The afternoon at the pools, water-slide and swim-up bar was wonderful. Food at the poolside restaurant was good, service was fair at best. The drama started around 11 p.m. From 11-12:30 a.m. I was awakened four times by young parentless children running down the halls laughing and talking loudly. After reprimanding them myself, I finally had to call a security guard who promptly helped. At this point it was too late. In the morning I staggered to one of the restaurants with my young son, looking forward at least to the $40 breakfast coupon that came with our package. One clueless and apathetically slow hostess tried to field a line of hungry guests. When we finally got to the front she told us there would be another half hour wait. I returned to the front desk and told them of my disappointments (the coupon was not valid for room service). I was told that they could only offer a monetary reimbursement but that they were terribly sorry. That monetary reimbursement has yet to arrive.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":3.0,"Location":5.0},"author":"Donnie Kuhlman","date":"2015-09-20 12:39:04 +0300"},{"content":"The hotel was wonderful! Customer service was timely and very good. We enjoyed our stay so much. The staff was always friendly and responded in a timely manner. The room and balcony were very clean and we enjoyed the view tremendously. The gardens are lovely and we enjoyed walking around the site in the early morning. We enjoyed the deli for a quick breakfast. The hotel environment is lovely; we felt very safe and well taken cared for.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Tamia Kassulke","date":"2012-04-13 21:32:58 +0300"},{"content":"Few hotels anywhere have more beautiful grounds or architecture than the Arizona Biltmore. Unfortunately, however, our recent stay there was terribly disappointing. Most all of the service was unfriendly, unhelpful and unresponsive. With the exception of a helpful bellman, one likable and funny waiter, a hair stylist, and few others, we were greeted with scowls, long waits (including for any phone inquiry), and frequent negligence. The incidents of poor service are too numerous to describe. Although our travel agent made certain that we requested an accessible room, we were put in a worn down room in the middle of the property inaccessible by car. We were taken in a golf cart past the laundry, tennis courts, far away from any services, and brought up the freight elevator since the bellman thought it would be faster than me trying to hobble down the long hallway. We were told that another closer room with a view would cost an extra $175 per night. It took a lengthy negotiation to land in a villa closer to the main building. The room was small with filthy, ripped up carpeting, a small, extremely old television and the worst hotel bed I have slept on in ages. The notice indicates that there is turn-down service, however, you will never need to call for it, since the maid staff turn down the bed in the morning. That's right, they never make the bed up completely. The poor service was more than frowning faces everywhere who acted like they were doing you a big favor to change a bill, or show you to a table. Never before have I been completely blown off by a concierge who I tipped 20$ to make a reservation for me at a local restaurant, and a hair appointment. That's right. I requested that he call and leave a message with the info at our room, but he did not. I left my glasses at the beauty salon, and the operator refused to put me through to the salon directly. I was transferred to security but there was no voice mail, back to the operator 3 times. I tried calling the spa, explaining that I was disabled and had to ask if someone could walk over to the salon to locate my glasses. The spa agent said she would, but she also never returned my call. There was an endless phone que for anything: room service, salon, housekeeping, security, spa. Terrible. The hostess in Frank's restaurant was beyond rude and unhelpful, though the food was fabulous. I will say that the food at the Biltmore was consistently superb: Frank and Al(?), the Wright room, the Cafe, room service. Do go to enjoy the grounds and the meals at the Arizona Biltmore.. Not one person inquired about our stay, and the rooms had no hotel survey about the staff, grounds or service, as most do. No wonder. It is clear that the management really does not care. Terrible, terrible attitude throughout the hotel. One other note about parking. Guests have two parking options: 1) valet parking in the main hotel for over $24.00 per day (excluding tips), or 2) self parking for $12.00 per day. Be advised that there are not enough self-parking places often, and you may have little choice but to pay the full valet parking fee when you return to your room on Saturday night and there is not a free spot anywhere.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Kallie Tillman","date":"2012-05-14 09:08:40 +0300"},{"content":"Traveling as a single lady it is nice to feel comfortable dining solo. I stayed several nights and ate on property most evenings at their bar-restaurant and talked with Olga who was making awesome martini's and great conversation.","ratings":{"Overall":4.0},"author":"Orpha Huel","date":"2013-07-06 01:56:08 +0300"},{"content":"I would like to compliment Chef Todd Sicolo on his excellent culinary delights as well as his delightful personality. I was at the Biltmore on a business conference where over 600 people were fed at the same time. The food was always hot or cold as required, presentation was beautiful, taste was excellent and variety was always a pleasant surprise! The staff always went above and beyond to see to our every request. Linda Alumbaugh, Baton Rouge, LA","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Herminia Welch","date":"2012-05-18 06:36:13 +0300"},{"content":"We had a wonderful stay at the elegant and beautiful Arizona Biltmore. Our rooms were clean, well equipped, and quiet. Best of all is the staff, especially the security staff. A few hours after checking out, I remembered, in a panic, leaving my jewelry in the room safe. The security staff, in particular David and Joel, kept in touch with me until they were able to retrieve my jewelry without intruding on the privacy of the new guest in that room. The staff is first class as is the hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Fausto Ziemann","date":"2014-10-24 00:59:41 +0300"}],"public_likes":["Ilene Rosenbaum"],"vacancy":true,"description":"Right on the Pacific Ocean and features a retro boutique-style décor, a popular onsite restaurant, and private guestroom balconies.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}