{"title":"San Francisco/SoMa","name":"W Hotel","address":"181 3rd St","directions":"at Howard","phone":null,"tollfree":"+1-877-946-8357","email":null,"fax":null,"url":"http://www.wsanfrancisco.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7854,"lon":-122.4004,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26030,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"This is a hotel with great rooms and good customer service, having said that, the pillows in the room are the hardest and most uncomfortable I have ever slept on, and I spend over 100 nights a year in hotels. It appears others have also complained as when I told the front desk personnel, they said others have issued the same criticism and they will be changing their pillows in January. I would recommend avoiding this hotel in January 2012.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Grayce Watsica DDS","date":"2012-03-31 11:38:11 +0300"},{"content":"We were seduced by the hip factor of the Aloft brand of Starwood hotels and appreciated the proximity to the Phoenix Airport. The check-in person encouraged us profusely to take advantage of the Happy Hour at the hotel bar: $4 beer, $5 wine. How could we resist? When we ordered just that and then got a bill for $12 (not $9), the bartender told us it was for house wines and beers only. The hotel is plastered with signs for this Happy Hour, but no fine print about prices. And no apology from bartender. To top it off, we wanted to take advantage of our late flight home the next day by sitting at the pool in the morning and reading the papers. However, we got a random automatic wakeup call at 5 a.m. (which we obviously didn't order) and could not get back to sleep. Absolutely no apology from staff except for a shoulder shrug. Get hip, Aloft, with your customer service if you want this hotel to survive!","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":5.0},"author":"Madison Paucek","date":"2013-08-21 04:39:39 +0300"},{"content":"I experienced a wonderful time at this new upcoming hotel chain. The staff assisted in every way possible. The bar and the bartender was EXCELLENT!!! I was very pleased with the hotel, and everything that they offered. If you are tired of the same hotel rooms and want something different then go to this hotel. Get ready for a change in hotel revolution and enjoy the experience of a lifetime.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dwight Weber","date":"2012-10-16 04:13:04 +0300"},{"content":"I traveled to Portland on business and needed a room at the airport because my flight was so early in the morning. Rather than stay at the Sheraton, it was recommended that I stay at the Aloft which is a Starwood property. The hotel is new, very clean and has super trendy puplic spaces. I was helped by a nice employee named Paul. The bed was super comfortable. The only thing I didnt like was the sink - it was a wash basin bowl and water spattered out of it. Everything else was great.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Imelda Greenfelder DDS","date":"2013-07-11 20:03:54 +0300"},{"content":"Wasn't anything great about this place. Out of all the NH hotels, this didn't attract me much. Location wise it was fine, however the services were not upto the mark as it was in other NH Hotels. The only good thing was that they could arrange for a taxi whenever I needed one. I would rate the overall experience as 'Average'","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Daisy Rodriguez","date":"2012-08-25 08:23:05 +0300"},{"content":"I had a car and heard stories about the lack of parking and cost of parking in the Amsterdam hotels. Luckily, this hotel had openings. My only experience with NH Hotels was the previous night's stay near the flower fields. This hotel is much different. First, the cost was over twice the cost of the previous hotel, however, very comparable to other hotels in Amsterdam. I chose this hotel because of its free parking and within walking distance to the tram. I got a room over twice the size of my previous night's room and very modern. The room was setup perfectly for a business customer. with a nice, long desk. The rooms are quiet. The hotel is in the pathway of the airport, and I could not hear the jets. It had a hot water pot, cups, glasses...and a towel warmer. The staff was very nice and offered me places to visit and eat. They even looked up the hours of certain museums that I wanted to visit with very little prompting. They had printouts and maps so that I didn't have to try to remember how to get from the hotel to the tram stop and what number/stop name it was. The walk to the tram was a nice walk, however, had the weather been miserable, it would have been a miserable walk. I was told that the area was safe to walk in, even after dark. I walked from the tram back to the hotel and the neighborhood was quite quiet. For anyone who has a car in Amsterdam and is willing to walk to take the tram into Amsterdam, I heartily recommend this hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Emmanuelle Swaniawski","date":"2014-05-12 00:53:38 +0300"},{"content":"I booked this as a 40th birthday present for myself and travelled solo. Its about a 15 minute walk to Zuid train station (1 stop from Schiphol) which also has a metro service which goes towards Centraal . If you turn to your left after leaving the hotel, then take the first right, tram number number 5 can be found slightly over 5 minutes walk away. This service goes through Museumplein,Leidseplein and onto Centraal. If you buy an advance ticket giving unlimited travel for between 1 to 3 days, the cost is very reasonable. The NH Musica is in Amsterdam's financial area and seems to be geared towards business travellers. The very large rooms have a crisp,modern feel and the bathroom is also immaculate with plenty of room. All the hotel's staff were very helpful without being intrusive. One of the previous reviews mentioned the cost of items in the minibar; everything is between 4 and 6 euros. This shouldn't be a concern as there is an Albert Heijn supermarket about a minute away. I got a very good deal on this hotel through Traveline (about £50 per night) and have nothing but good things to say about it. However, if you have never been to Amsterdam before and are travelling alone, do not venture into the red light district alone after dark as, even if you don't have any intention of indulging in any of the seedier things that go on, someone will approach you with an offer to sell substances illegal even there.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Seamus Paucek IV","date":"2012-04-21 18:02:46 +0300"}],"public_likes":["Anika Senger I","Mr. Unique Smith","Rudolph Pouros","Lilyan Stoltenberg PhD","Muriel Hettinger PhD","Russel Heaney"],"vacancy":true,"description":"Another major convention center hotel, with lots of amenities and very nice rooms.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}