{"title":"Beaumaris","name":"Hafod Lon Holiday Apartment","address":"2 Plas Hafod Lon, Lon Ganol, Llandegfan, Ynys Mon, LL595UD","directions":null,"phone":"+447802437898","tollfree":null,"email":"enquiries@hafodlon.co.uk","fax":null,"url":"http://www.hafodlon.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.242,"lon":-4.1414,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":2611,"country":"United Kingdom","city":"Llandegfan","state":null,"reviews":[{"content":"We stayed in the 3 brm unit for a week over Christmas. We were so grateful for the space of this unit after 14 hours in the theme parks during the day. Usually, we don't like for the family to be held up in their own rooms, but after a full day of together time, we were grateful for our private retreat with a whirlpool tub to unwind and relax. We will stay here again! Our only suggestion for improvement would be to have better fitting fitted sheets on the king beds; it was a struggle to keep them from pulling off at night. The kids didn't seem to have the same problem.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Delphia Leffler","date":"2013-07-14 03:04:14 +0300"},{"content":"I came here last year with my family for my husband's business trip and we had such a fabulous experience that when my business national meeting was in orlando this year,we jumped at the chance to return to the worldquest resort. We even requested the same condo and the resort was able to oblige our request. The property is beautiful. The pool is architecturally beautiful and the entire property is well maintained and upscale yet extremely affordable. I liked the peaceful setting, yet it is very close to Disney and other entertainment options. We enjoyed the complimentary continental breakfast each morning and used the full kitchen in our condo to prepare some simple meals and ate out a few times if we desired. We have small children and the resort was very family friendly and yet my senior citizen mom travelled with us and enjoyed the property too. My husband was travelling for business last year and I attended a work conference this year and all of us had a great time. We would all enthusiastically recommend it to all.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cheyanne Feest","date":"2012-11-29 22:52:03 +0300"},{"content":"Our three bedroom, fourth floor condo worked out very well for our two couples and one child. The unit was in very good shape and had a nice screened balcony suitable for dining and TVs in every bedroom and the living area. The pool and hot tub were very nice. Security is good. Housekeeping services are a la carte and we opted only for fresh towel exchange at $5/day. As we stayed only 3 nights we had to pay an end of stay cleaning fee of $39. The complementary continental breakfast was fine with four cereals, muffins, danish, bagels, toast, coffee. Seating was scarce at times. We found all the staff to be accommodating and cheerful throughout.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Ally Schimmel","date":"2015-08-24 06:45:15 +0300"},{"content":"There were 4 of us from my office that needed to attend a conference in Orlando and we work for a non-profit organization so price and qualitiy are at the top of our list when travelling. When we checked into this resort we were greeted warmly and everything was in perfect order. Our room, which was 3 bedrooms and 3 baths, was BEAUTIFUL! Clean and fresh. Everything met our expection and then some and I would absolutely stay here again!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Nathanael Wisozk","date":"2014-09-06 07:07:03 +0300"},{"content":"Great resort. Always a pleasure to stay at this resort when visiting Orlando. This time we had family members at World Quest and they enjoyed there stay as we did. Thank you ( staff and housekeeping ) for making our visit again so nice","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Jayson Sanford Sr.","date":"2012-09-21 13:11:44 +0300"},{"content":"We had a wonderful 3-week stay @ Worldquest for our vacation this July(2011). We ahd a 3-bed 3-bath condo for 3-adults, excellent. Block 7 where we were located was the only drawback. After the first couple of days going back & forward to the pool and main building where the excellent complementry breakfast was served daily wasn,t a problem. Pool area was great,plenty of loungers & parasols for all, in this large complex.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":4.0},"author":"Kaden Beatty","date":"2014-03-21 22:08:28 +0300"},{"content":"Spent two days at the WorldQuest with friend and we find a snake in are 3 room condo...","ratings":{"Cleanliness":2.0,"Sleep Quality":2.0,"Overall":2.0},"author":"Waylon King","date":"2013-01-11 11:09:23 +0300"},{"content":"Great location, very close to attractions yet still able to enjoy peace and quiet. Very large two bedroom with two bathroom and large screened patio gives the feeling of \"home\" rather than \"hotel\".","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Adrain Mayer","date":"2012-11-10 21:42:56 +0300"},{"content":"World Quest always exceeds our expectations! If you have a large family, you can't beat the price for the size suites available. I have stayed at World Quest twice. The 2 and 3 bedroom suites are huge! I will be staying at this hotel again in the future. The only aspect of the hotel that needs improvement is the lack of shade out at the pool. The umbrellas are small and not very many. MORE SHADE AND LARGER UMBRELLAS ARE REQUIRED!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Everardo Streich","date":"2012-11-14 12:03:13 +0300"}],"public_likes":["Valentina Fay","Colleen Kuhic"],"vacancy":true,"description":"Self-contained first-floor two bedroom apartment with its own private entrance. The apartment is situated in the village of Llandegfan between the town of Menai Bridge (1.5 miles) and the seaside town of Beaumaris (2 miles). The apartment occupies the top floor of a large private manor house, overlooking the Menai Strait towards the university town of Bangor and the Snowdonia Mountains beyond. The property is located in a private spot down a private lane and has of parking space if you need somewhere secure to park your trailer, boat, canoes, etc.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}