{"title":"San Francisco/Union Square-Financial District","name":"Marines' Memorial Club & Hotel","address":"609 Sutter St","directions":null,"phone":"+1 415 673-6672","tollfree":null,"email":null,"fax":"+1 415 441-3649","url":"http://www.marineclub.com#?chebs=wiki_mmc","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7886,"lon":-122.4105,"accuracy":"ROOFTOP"},"type":"hotel","id":26230,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I visit NYC about 2-3 times each year. This visit was just my niece and myself, so we decided to \"take a chance\" on The Jane. I was very nervous about this visit. However, I am absolutely THRILLED with this cute little hotel. YES, the room is small and it is somewhat difficult for two people to move around in the room. However, once you get the hang of it, its really no problem at all. It was very much like my college dorm, but cleaner and quieter. The bathroom was very clean and even though this was a busy time, I never waited for a toilet or shower. My only complaint is the male guests who think it is ok to go into the bathroom wearing their boxers or tighty whities. The hotel rooms comes with a nice bathroom guys, USE IT. No one wants to see you in your underwear. The staff was OUTSTANDING. I have stayed in some of NYC's finest hotels and have never experienced such professional, friendly service. I hope the management realizes how valuable their staff is and that they make the experience. Robert, Ashley and the other desk girl with big glasses (sorry, I can't remember her name) were awesome !! No, I did not experience bedbugs. However, this is an epidemic in NYC and even the finer hotels are having a tough time keeping the problem in check. This is the best value in NYC !!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Dedrick Dietrich","date":"2013-10-25 13:01:39 +0300"},{"content":"In addition to my previous two reviews of The Jane, ...this time round was pleasant, yet a reality check. Stayed in a single, in the back, 5th floor, ...quiet, lovely. Sunday morning, donned the hotel robe and slippers for a shower. After washing up, returned to the room, ...to find that my key did not work! Traipse downstairs to the front desk to be told that if the key gets 'wet,' it will be deactivated. Huh? ...I wasn't Swimming with the key, let alone having dripping wet hands. As a result, you leave the patron paranoid that, whilst I packed my bag and was ready to leave my cabin a little later, if I go to the bathroom first to brush my teeth before setting off, to return to my cabin to pick up my bag to check-out, I might find myself Locked Out of my cabin, having to Traipse downstairs, to return right back upstairs, just because the \"idea\" of having the key around the bathroom to brush my teeth, might get the key Wet. Suggestion to management: Please highlight this point about the key, and getting wet, to all at time of check-in, ...saves us the feeling of WTF?! during the moment of being locked out. Traipsing down to the front desk half naked was of no matter, ...momentarily having a spot of bother over something that appears to happen occasionally/often, was! You're still loved.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Ms. Domenick Homenick","date":"2013-04-16 00:19:22 +0300"},{"content":"I was really excited to stay at The Jane after looking at the website and seeing the vintage style and art deco decor. Me & my friend were on the second leg of a trip to Toronto and New York and had been travelling for 12 hours on a Greyhound and just wanted to dump our bags, get a shower and get back out to see the sights. When we got there the hotel staff were really friendly, helpful and speedy. We got up to our floor and got a bit lost with the layout. The number of the room was not on the key so it got a bit confusing when we got the room number wrong. We got to the room and could not believe how small it was! There was the two bunk beds and then about a foot of space in between the beds and the wall/mirror. Therefore we couldn't get dressed at the same time. Have to say though, this made the last day easier as we had to keep our suitcases packed the whole time! I was aware it would be shared bathrooms before going so that was not an issue. But I was glad that I never had to wait for a toilet or a shower which was really good. The beds are pretty comfy, the hotel is pretty quiet and there was a tv that each bed could see but ran by one remote. Beds are made every day and new towels provided daily. Also you are provided with a bathrobe and slippers. Showers are fitted with shampoo/conditioner/shower gel dispensers and the bathrooms have hairdryers fitted. On our last day the hotel staff were super friendly and kept our luggage for the day and booked us a taxi to the airport. All in all I wouldn't recommend this hotel as, even though you don't spend a lot of time in the hotel, you need the space to get ready and keep your stuff! Also, if you don't know New York (which I didn't) and you want to do tourist-y stuff (which I did) it is too far away really from anything and I found the Subway really confusing.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":2.0},"author":"Ashlee Champlin","date":"2013-10-18 00:09:41 +0300"}],"public_likes":["Dr. Rowan Wiegand","Tyrel Dietrich"],"vacancy":false,"description":"A historic hotel with some elegantly appointed rooms and suites. Fine dining at the Leatherneck Steakhouse & Lounge and performances at the historical Marines' Memorial Theatre on the premises.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}