{"title":"Knutsford","name":"The Swan","address":"Mereside Rd, Bucklow Hill, Knutsford WA16 6RD","directions":null,"phone":"+44 1565 830295","tollfree":null,"email":null,"fax":null,"url":"http://www.premierinn.com/en/hotel/KNUPTI/knutsford-bucklow-hill","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.34522,"lon":-2.4048,"accuracy":"ROOFTOP"},"type":"hotel","id":14225,"country":"United Kingdom","city":"Bucklow Hill","state":null,"reviews":[{"content":"We stayed at the W Hollywood again and were not disappointed. Our room was a Cool Corner suite this time around and it was impressive. The view of the Hollywood sign, the Capitol Records building and the Pantages theater just can't be beat. The room is very well layed out with a separate lounge area that includes a very cool circular couch and a wet bar. The bed was extremely comfortable and we both enjoyed a very relaxing night of sleep. One note, the hotel is right on Hollywood Blvd, and the noise from the street can be a bit loud. Just bring some ear plugs and realize you're in the middle of a vibrant city and you'll be just fine. As always, the valet parking was extremely convenient as we needed to get our car out several times and everytime it was waiting for us a few minutes after we called from the room. The service is always great. Joey, our bellman, gave us a full rundown of how to work everything in the suite and also gave us a description of the different types of rooms available at the hotel. He was extremely helpful. All of the staff was very helpful and accomodating. Our room wasn't quite ready when we arrived at noon, but we gave them our mobile phone number and they called as soon as it was available at 2pm. To sum it up, great hotel, great location, and great staff! We'll be coming back again soon!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Fae Mosciski","date":"2012-12-10 07:30:40 +0300"},{"content":"We were in town to see a show at the Pantages Theatre. This is the PERFECT hotel since they are literally right across the street from the theatre. We were booked at a cheaper hotel elsewhere, but by the time we assessed the cost of parking plus the hassle factor of LA traffic, the slightly more expensive nightly rate ended up being worth it. The room itself was nice. The view though, not so much. Just based on where we were, our view was of the wall of the rooms across the way. When we looked to the right, we were overlooking the main entrance and to the left was the back of the hotel. So, we were in a room that had a view of the \"alley\" between the buildings for the property. Not a big deal - jsut be aware you might not have much to look at. The bed itself was very comfortable. It was different though; very low to the ground. It looked somewhat like a futon but definately made up for it in comfort. The bathroom was nicely appointed and had all the amenities you would expect. The room was primarily a \"heavy white plastic\". While it looks very classy and eclectic now, it will start showing the wear and tear soon unless the hotel keeps up on it's maintenance.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Casimir Predovic","date":"2013-12-04 04:20:05 +0300"},{"content":"Stayed at the W. Got a killer deal on Hotwire. Not sure the room itself would be worth the rack rate, they are pretty small. Room was clean, but the white furniture needed to be clean. Check in was easy. Valet guys were friendly. It is definitely an 'adult' themed hotel. I would agree with the other reviews that the hotel is loud on the weekend. Great location across from Pantages. Would have liked a refrigerator in the room to keep leftovers.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Darian Schuppe","date":"2013-01-25 01:10:35 +0300"},{"content":"It's all good, bit too stylish in some ways, and you have to pay for everything (one dollar per page printing, plus have to pay for the time you use the computer - jokes)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Royce Sauer","date":"2015-06-18 08:07:56 +0300"},{"content":"I have to admit that my 1st experience with the W Hollywood was less than steller , but in their defense it was in the 1st few days of opening and as a club venue property i am sure it is easy to have things go haywire at the beginning....after voicing my frustration to a degree i spoke to Jim the GM at depth about my concerns and thoughts...I was suprised at how open minded he was about the criticism and his eagerness to change my views on the property and staff. I did revisit the property under my fiancee's name and SPG acct so that we wouldnt get any special consideration due to speaking with Jim....happy to say that we had a great time...were given a great upgraded room (my Fiancee is also a platinum SPG so upgrade was available)...staff was very friendly and room service was quik \"and' good....now remember this is a Niteclub venue as well...and you should know that when booking your resv...the hotel tries its best to accomodate its guests in regards to the venue and the pool but as in LV, the venue also has a greater degree of control on access etc so make nice to the venue mgrs via the hotel staff or the WW staff... Pool is a bit small but has a goood vibe and yes lots n lots of beautiful people....even some that were never invited to the party,,lol yes the curb and valet staff do need some work and some lessons on manners but remember most of them its their first job and with a property like the W they probably wont last long or wil be trained appropriately as time goes on...remember staff reflects mgmt and the Mgmt there definately wants to put its best foot forward so suffice to say that nothing is perfect but sometiems a willingness to be perfect is just as good... i will definately recommend W Hollywood to my friends....my only regret is that i didnt get to meet Jim McPartlin (GM) sooner as he is a great guy who has had to practically re learn his job to deal with all of the new age way of running a Niteclub Venue Hotel and i must say he has done a wonderful job...The good thing is that he will be going to the W NYC soon so since we are there often i am sure that we will still be able to enjoy another venue run by a Top Notch W Veteran such as Jim.... Thx Guys and see you again soon...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alexane Haley","date":"2012-06-12 00:39:09 +0300"}],"public_likes":["Maximillian Cormier","Miss Athena Johnston","Esta Yost","Frankie Parker","Kendrick Powlowski"],"vacancy":true,"description":"A Premier Inn","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}