{"title":"Stornoway","name":"The County Hotel","address":"12-14 Francis Street, HS1 2XB","directions":null,"phone":"+44 1851 703250","tollfree":null,"email":null,"fax":null,"url":"http://www.countyhotelstornoway.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":58.20871,"lon":-6.38676,"accuracy":"APPROXIMATE"},"type":"hotel","id":28658,"country":"United Kingdom","city":"Stornoway","state":null,"reviews":[{"content":"i had a bad experience over there. Just feel myself being cheated. I had booked a room for 2 for through internet, and even from the preference coloumn i had mentioned i wanna 2 beds in a room. Guess what? whenever we reach there (which is about 10pm), they bring us in a room, which a standard size single bed, and claim that it is double bed, and that is a room for 2! i suspected they had rented out the actual double room to the walk in customers. In fact, i had been go through some of the review, and understand that the room is small, but i just couldnt understand that why they treat me like idiot and keep mentioning that this is HK standard size double bed!! we have no choice as that was the peak season of HK and i believe i could not locate another hotel in the new year eve. However, it spoilt my new year mood, and my 2009 was started in a bad experience! U might find it is difficult to get the hotel as it is not reachable by MTR. However, you really enjoy the local life of Hong Kees. With the crowded wet and dry market, fruit stalls, and food stalls, we did enjoy ourselves throughout our stay. Further, the bus station is 2 minute walking distance from the hotel, easily reach causeway bay, central through the bus. what i want to mean is, it is not easy to find the hotel, but easy to go central those places from the hotel.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Marilyne Reichel","date":"2014-07-16 03:20:52 +0300"}],"public_likes":["Devan Halvorson","Alia Senger","Anastacio Miller"],"vacancy":true,"description":"The most central of all the hotels.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}