{"title":"Tiree","name":"Balinoe Campsite","address":null,"directions":null,"phone":"+44 1879 220399","tollfree":null,"email":null,"fax":null,"url":"http://www.wilddiamond.co.uk/category/camp/","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.4779,"lon":-6.9218,"accuracy":"APPROXIMATE"},"type":"hotel","id":30250,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"Location and views are very good, staff very helpful. However, a total lack of response to a personal request let's the place down, disappointing.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":4.0},"author":"Dejon Johnson","date":"2012-11-19 02:43:54 +0300"},{"content":"I've never asked to change rooms before but did so when shown our first room. It had an fireplace that was poorly ventilated. I knew the smell would probably keep me up all night, so I asked for a different room; had same issue. Finally settled for a room w/out fireplace which was ok. However room still outdated. Lastly it was difficult to locate key ice machine. Overall it was difficult to navigate the resort.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":2.0,"Rooms":2.0},"author":"Sydney Kohler","date":"2014-10-30 20:55:03 +0300"},{"content":"Everything at the resort was first class. Close to many wineries. A beautiful property with a great setting. Didn't play golf. The course has a great reputation. Enjoy a trip there.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Christa Hoppe","date":"2013-02-06 10:19:03 +0300"},{"content":"Excellent customer / guest service. Arrived for a four day stay for a conference looking forward to swimming every day in what had been described as an excellent 25 meter outdoor lap pool only to learn that there would be an extra daily fee to use that pool, per person, on top of the resort fee. I was unhappy about that and let the front desk know of my disappointment. Liz Accardo, the Front Desk Manager offered to waive that fee for us for the duration of the stay: no fuss or argument. Ms. Accordo made our stay! Besides that the one bedroom suite with kitchen, wood burning fireplace, was excellent (if a bit outdated), and clean. Housekeeping was great. We had a great stay. Went wine tasting at the many local winerys. I recommend this Resort and would stay again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Jaunita Krajcik","date":"2014-12-27 16:20:51 +0300"},{"content":"We spent our anniversary on this excellent property. Our suite was beautiful with an awesome view of the golf course. The staff was very friendly and the management gave us a bottle of champagne for our anniversary. What a wonderful surprise...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Joshuah Bogisich","date":"2013-09-05 08:32:38 +0300"},{"content":"Most important, I HIGHLY recommend getting a preferred room. I did and I still thought the walk to the bus stop and the main building was too long. I usually stay at one of the Deluxe hotels but this time I tried to save some money. Was it as nice as the Beach Club or grand floridian NO WAY! Was it 2 to 3 times cheap, YES! The room was clean but a little worn, it could use some updating. The food at the restaurant was pretty good but the food court was awful aside from the ice cream. Overall not great, not overly \"magical\", but reasonably priced for the location.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Tatyana Jacobi","date":"2012-06-07 12:12:28 +0300"},{"content":"Maybe we are spoiled - maybe we are jaded, but after staying at a variety of Disney on-site properties we have to declare this one to be the least interesting. It is a bit of a flop on a variety of levels. First, they appear to install their \"trainees\" at the front desk - at least this was our experience. Then the place was under construction. Then the room was a long distance away. The room was clean and functional - but nothing more than one would find at a budget motel. A Hampton Inn, typically charging $150 a night in most cities beats this hands down. So we checked in at midnight and thankfully our main reservation was at the Beach Club...so we checked out at 8 AM. We couldn't get out fast enough. The one saving grace - the doorman was a terrific character in a lovely outfit. Go over there and get a picture taken with him - but don't stay there!","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":3.0},"author":"Mrs. Mack Braun","date":"2014-07-01 01:53:00 +0300"}],"public_likes":[],"vacancy":true,"description":"Tents, caravans and campervans welcome. Facilities include toilets, showers, indoor kitchen and dining area, and wifi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}