{"title":"Paris/1st arrondissement","name":"Hôtel Britannique","address":"20, av Victoria","directions":"Métro: Chatêlet","phone":"+33 1 42 33 74 59","tollfree":null,"email":null,"fax":"+33 1 42 33 82 65","url":"http://www.hotel-britannique.fr","checkin":null,"checkout":null,"price":"Double from €157","geo":{"lat":48.8583295,"lon":2.3461341,"accuracy":"ROOFTOP"},"type":"hotel","id":21727,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We stayed at the Grand Wailea in early Jan/10. It really is a beautiful hotel on a beautiful stretch of beach. Room We had a few problems with our room during our stay - the toilet broke, the safe broke, and the TV broke...seems like alot of problems for a room during a 7 day stay. I will say, however, that they very promptly responded to the concerns and fixed the toilet and safe very promptly...although the safe malfunctioned again at the end of our stay, we didn't bother to raise the issue again. The TV never was fixed properly - every 15 min, we had to jiggle the coaxial wire when the TV signal was lost; this after 2 service calls. however, we didn't spend much time watching TV so it wasn't a big deal. In my opinion for a hotel of this class (and price), I think it is ridiculous to have 3 issues with a room during a single week. The bed was great - very comfortable, and the lanai was equally great. Bathroom was definitely 5-star. Beach Note, this resort is situated on a public beach. Not a swimming beach, at least at the time of the year we were there, but wonderful soft sand, and fun to jump into the waves...good for kids and adults. We rented a \"casabella\" for 4 of the days we were there and what a WASTE of money. True, you do get a guaranteed spot, and a nice view of the ocean, but of significant issue was the fact that about 2:30pm, we had non-paying \"visitors\" squatting in the adjacent casabellas. I raised this with the staff, and they explained that because they start removing the loungers and umbrellas at 3pm, this is a \"grey\" area and they don't really enforce the use of the casabellas for that reason from about 3pm onward. Well, there didn't seem to be any \"grey area\" with my $50/day bill for use of the casabellas! I think the resort should be pro-rating the charge for the \"free\" hours they are allowing non-paying patrons to use them. It really is absurd - so my advice, do not book a casabella...instead, wait until about 2:30pm and choose any free one and enjoy! Clearly the hotel has no problem with this. Food The food was excellent. Humu has an amazing filet mignon that is cooked to perfection. All the food was really quite good. Breakfast was quite good too - we ate at the buffet in the Grand Dining Room for breakfast. Like many similar places, you have to be prepared to wait a while to get a made-to-order omlette. The waiters at breakfast could also stand to get a refresher in good customer service...at least some of them. A couple of the waiters we had were great, others were terrible...no service at all. And, I personally saw one of the waiters go to the bathroom (beside the restaurant) and he didn't wash his hands. How disgusting is that? We had room service one evening and it was very good (albeit outrageously priced). Service Service was largely good...not great, but good. The wait staff at dinner was far better than breakfast or lunch. Despite the fact we paid $50/day for the casabellas, we only had a server approach us on 2 of the 4 days we rented the casabella. I thought the maid service was very good, and was impressed when I went to the room (on two occasions) while the maid was in the room, and she insisted I demonstrate it was my room by using the key card...this vs. my experience in Mexico where I strolled into the room when the maid was there and got a polite smile, despite I could have been anyone taking anything from the room. One other note is the cost of food / drinks during the day is really quite absurd. $13 for a cocktail (plus tip?). A hot dog will cost you $12 (each). I ordered some sushi and beers on the beach and rang up a $70 bill for a snack...gimme a break. Overall, a beautiful resort, on a beautiful beach. However, the $50/day casabella charge when others used it for free really iritated me. I wrote the hotel with the same complaint, and didn't hear back...I guess they don't care. So, my advice to all is feel free to use the casabellas, for free, from 2:30pm onward. And, if anyone asks, this is hotel practice and the \"grey area\". Would I go back? No.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":3.0},"author":"Beaulah Mertz","date":"2013-09-17 23:17:25 +0300"},{"content":"This is a stunningly pretty place to stay. The hotel is located right on one of Maui's nicest beaches(and that's saying something.) It's on the expensive side and so are all the restaurants and snack bars. But if you want to splurge.... . There is a great pool area complete with waterslide and a kiddie area. The beach is soft white sand and stunning. The grounds are lush and sculpted with artworks and statuary sprinkled liberally around. Our room was slightly smallish but very luxurious with marble tile everywhere etc etc... Staff and hotel service were top notch.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Rae Bahringer Sr.","date":"2014-04-07 13:56:23 +0300"}],"public_likes":[],"vacancy":true,"description":"Anglophiles in Paris could do worse than to stay at this most Anglophile of French hotels. The location is good, at the very east end of the 1st, within an easy walk of Notre Dame, Les Halles, and above the central hub ''Métro'' station.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}