{"title":"Chippenham","name":"Red Box Guest House (B&B)","address":"35 Buckingham Road, Pewsham, Chippenham, SN15 3TE","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi; At the roundabout, take the 1st exit continuing straight onto ''Malmesbury Road(B4158)'' for 1.2 mi; At the roundabout take the 3rd exit, turning around the ''The Bridge Brasserie'' onto the ''B4069'' for 282 ft. Continue onto the ''New Road(A420)'' (joining one way system) for 0.1 mi, get in the right hand lane. At lights, follow sign for ''Town Centre'' (under furthest railway arch) for 0.2 mi. At the roundabout, take the 3rd exit [follow sign to ''Calne A4''] onto ''Avenue La Fleche(A4)'' for 0.7 mi; At the roundabout, take the 2nd exit onto ''Pewsham Way(A4)'', go through 1 roundabout for 0.7 mi. At the roundabout, take the 1st exit onto ''Canal Road'' for 0.4 mi. At the roundabout, take the 1st exit onto ''Lodge Road'' for 0.2 mi. Turn left onto ''Buckingham Road'' for 0.1 mi; Turn left to stay on ''Buckingham Road''. Guest House will be on the right","phone":"+44 1249 444988 or +44 7796 616647","tollfree":null,"email":"julieann@redboxguesthouse.co.uk","fax":null,"url":"http://www.redboxguesthouse.co.uk/","checkin":"3pm - 9pm","checkout":"10.30am","price":"Rooms from £40 third night half price, for longer stays flexible arrangements are available, includes full English Breakfast, (Book Online)","geo":{"lat":51.4486765,"lon":-2.0968813,"accuracy":"ROOFTOP"},"type":"hotel","id":5841,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"I cannot decide if I liked the hotel or not. It definitely is clean and the service was what I expected. But here is a list of my issues. 1. Booked a room with two double beds and requested a rollaway which was printed on my confirmation. Upgraded for $25 to bayview. At check in was told that rollaways were not permitted due to fire codes. Impossible for me and two teen boys to fit in the room we were given. Even though it was an upgrade, the room was so small, you could not walk around the beds, there was no door to the bathroom that you could close, only a pocket door that did not close. Windows were covered up in places with yellow tape, as if they were broken. Upon seeing the size of the room and the unavailability of the rollaway, I had to book another room. Funny thing is - in booking the new room - I got the cheapest room available at the time and it was much larger and nicer than the original room I booked (so my issue with the hotel, is what is the point of an upgraded room, what exactly did my upgrade pay for)...! By the way the cheaper room also had a bayview. Another point of contention, my friends stayed in a lower rate room and not only had more space, a bayview and a real bathroom door, but also received bathrobes, which I did not get). My suggestion is do not get the upgrade!! Another point of contention is the location. I think it is convenient in the sense that you can walk to just about anywhere you need to go, but I would not feel comfortable at night in that area, definitely as a woman with kids felt like I had to be hyper aware. I am used to the homeless, living and working in Boston, but the hotel seems to be in a very active homeless area. There is a lot of people asking for money, so just know this if you are going to stay here. I did like the pool and hot tub, but other than that, I don't think I would stay here again.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":2.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":2.0},"author":"Mr. Dulce Cummerata","date":"2013-08-26 10:18:59 +0300"},{"content":"Westin took over this property about a year ago - building still needs a bit more upgrading but nothing serious and rooms are large, well appointed with great views. (ask for Bay View). We like the downtown location - short walk to bayfront park and restaurants as well as two blocks to trolley and transportation hub - just park the car. Have stayed in San Diego many times, including apartment rental - this was a short visit and we'd pick this Westin again (not the gaslamp one). Try the food in Little Italy and the Gaslamp - both areas are walking distance with lively atmosphere.","ratings":{"Overall":4.0},"author":"Collin Rowe","date":"2014-12-11 18:33:10 +0300"},{"content":"Stayed in the Westin 2 nights as part of our roadtrip honeymoon. Have family in San Diego, visited them, Coronado island and the zoo. Hotel is nice and large. The rooms are large, with a nice bathroom. We had a great view towards Coronado. The bed was the best we slept in during our 2 week stay, makes it worth it. Westin is in a good location, walk a couple of blocks and you reach the gas-lamp quarter. There are a lot of one-way streets in San Diego, beware of that to get to the hotel garage you need to do a detour when arriving at the front of the hotel. Plus the breakfast buffet was very expensive compared to anything else we ate for breakfast during 2 weeks (including breakfast in Vegas...)","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Linda Davis","date":"2014-09-28 05:13:20 +0300"},{"content":"We stayed at this hotel 2 nights and have nothing but good things to relate. The staff is extremely accomodating and upon request placed refrigerators in both of our rooms (we traveled with friends). The rooms were plently large enough, the a.c. system worked v. well and the breakfast (I had the yogourt) was excellent. You will not be disappointed if you book here.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Lacy Kulas","date":"2013-11-15 09:15:14 +0300"},{"content":"The hotel is a gem in the Miami dadeland area. Centrall located, it is easy access to restaurants and other points of interest. The beds are outstanding, the staff very friendly, and a starbucks walking distance. I highly recommend the Indigo for business or holiday travel","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Mercedes Luettgen","date":"2015-04-17 19:08:44 +0300"},{"content":"We stayed here to visit the University of Miami for about 5 days. Not only do they have a free shuttle within 3 miles, but they will also drop you off and pick you up the 4 or 5 miles to the university campus. It would have been nice if they had a shuttle to the airport as well as its about a 35 dollar cab ride each way. When we first arrived we were about 3 hours ahead of check-in time, and within minutes they had a room already prepared for us. We got a room with a king sized bed and sofa, and the bed was sooo comfortable. There was a moderately large flat screen TV in front of it which was pretty awesome too. We asked for the complimentary microwave and refrigerator and received them both within the next couple of hours. The staff members were very friendly and consistent, especially the waiters/bartenders and shuttle drivers. The restaurant/bar wasn't too spacious but was very convenient, attractive and never crowded- not to mention their french toast was awesome and they have a Starbucks. The only thing that was a little annoying was that our room keys kept demagnetizing. I'm not sure why this kept happening, but they always helped us out fixing them quickly. At the end of the day, it was a great hotel, especially for the price!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Mariela Heaney","date":"2013-10-28 16:47:57 +0300"}],"public_likes":["Madonna Schumm","Josh Cummings","Remington Kiehn","Mae Cormier"],"vacancy":false,"description":"A modern Bradstone home with a landscaped garden, patio and summer house, in a quiet cul-de-sac. Off road parking and a restored 1936 red telephone box on the drive. Centrally heated throughout, en-suite bedrooms, digital TV with Freeview, DVD player, clock radio/alarm, hospitality tray, Wi-Fi, iron and hairdryer","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}