{"title":"San Francisco/Civic Center-Tenderloin","name":"Hostelling International-City Center","address":"685 Ellis St","directions":"at Larkin St","phone":"+1 415 474-5721","tollfree":null,"email":null,"fax":"+1 415 776-0775","url":"http://www.sfhostels.com/city-center","checkin":"3PM","checkout":"11AM","price":"Dorms: $27-$42, Private Rooms: $89-$129","geo":{"lat":37.7841,"lon":-122.4174,"accuracy":"APPROXIMATE"},"type":"hotel","id":25588,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"On a two week fly drive package arranged by Trailfinders I’ll be reviewing all of the hotels on our vacation in California between SF and LA, so if anyone is interested they can follow the thread. Flying in from London Heathrow we arrived at San Francisco on the Monday afternoon of Labor Day right at the start of September. The weather was lovely and the road from the airport was very quiet, the cabbie said it’s not normally like this! Our first destination was three nights at the Chancellor Hotel, Powell Street, Union Square. Wow! What a lovely hotel in such a fantastic location, just a very short walk to the main Union Square and right on one of the cable car lines. Being from England I don’t fully understand the concept of ‘blocks’ we don’t use that term, but perhaps half a block to the square? Whatever it’s very close. The people on reception are very helpful and friendly and on our check out day they advised us on the best option for collecting our hire car. The office was only on O’Farrell but they got us a cab there because of our luggage. Ok our two rooms didn’t have a coffee maker but we always bring our travel kettle and tea bags, so we purchased some milk from a store just a few yards away. And there were flasks of complimentary coffee available on the ground floor near the bar area, with cookies and popcorn also. We had breakfast in Luques on two mornings and loved it there, and the other morning we ate pancakes in Sears which is right next door...delicious! The first evening we didn’t really eat much as it was around 3-4 am in the morning on our UK time, so we felt a bit spaced out. The next night we had takeout pizza and the last night we ate at the Cheesecake factory on top of Macy’s. This had great views over Union Square. All in all we loved this hotel and loved SF, what a fantastic place! On Thursday morning we picked up our hire car, got upgraded to a seven seater Chevy Uplander and started our journey to Yosemite View Lodge.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kali Deckow","date":"2014-04-16 05:34:36 +0300"},{"content":"We stayed for 4 nights in June 2010. They have no a/c, which is standard in this part of the country, so you sleep with the windows open. It was perfectly comfortable (we didn't see the FIRST insect, it was cool and breezy)...but it was noisy, because we had a room fronting Powell Street, directly off of Union Square. If you stay here, and you certainly should, just ask for a room on the back side of the building, away from the street. Aside from that, our only complaint was the size of the rooms - since its just two of us, and didn't spend a lot of time in the room, it was just fine. The bathrooms are VERY small though - the kind where you almost have to stand in the shower to shut the door, because the toilet is in the way. Again - just fine for us. And we're average sized people. But they're definitely smaller than average (its a historic property). Room was terribly comfortable though - and their pillow menu was really cool. We sampled two, and I may even buy myself a buckwheat pillow now. I slept like a baby. Very comfortable bed as well (including the standard pillows). They had lovely relaxing bath salts along with the standard shampoos, etc. SPECIAL TOUCHES: The front desk staff routinely gave us easy bus directions and great maps to help us out. We also arrived on our anniversary, and the hotel left a bottle of sparkling wine (Napa) and some truffles in our room. The cable cars stop DIRECTLY in front of the hotel, and the F-Tram line is a few blocks down the street. We used the city bus system mostly, and several lines stop within a block or two. Its location on Union Square makes it an easy crossroads for transportation and shopping is great. Several restaurants in the area as well. We didn't eat the hotel restaurant though, so can't include that in the review. Hint - there's a Borders a few doors down, and they have hot breakfast sandwiches and lovely pastries with their Seattle's Best coffee, for much less money than the local restaurants. In sum - ask for a room away from the street (and a high floor perhaps), and if you don't mind a smaller room, this makes a GREAT home base for exploring San Francisco. We would definitely go back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Ebba Kunde","date":"2013-01-17 16:11:24 +0300"},{"content":"My stay at The Chancellor was outstanding! It is a fantastic old historic building that holds it's charm and character well. Yes, the rooms are smaller. Yes, the floors creaky in spots. Yes, you can occasionally here the folks in the next room. IT IS AN OLD BUILDING! If you want new, shiny, fancy perfection, don't stay here. If you love old buildings and history, this is the perfect spot! The staff was excellent. My bed was excellent, as was the huge tub! I WILL stay here again when in San Francisco! Thank you Chancellor, you made my stay comfortable and complete!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Tara Romaguera","date":"2013-11-05 22:55:23 +0300"},{"content":"Service was outstanding. Examples include holding bags before and after checkin/checkout, delivering complimentary refrigerator to room, free coffee/cookies all day, and they allowed us to check in extremely early. Room wasn't huge, but it was big enough for a couple. We were worried about bathrooms based on previous reviews- they were small, but had a nice tub. The bed was extremely comfortable. They have new LCD TVs, but only 20 channels (HBO). Free wi-fi was adequate for web browsing, but don't expect to stream video. Location couldn't have been better. You're right in the heart of Union Square. You can walk out the front door and get on a cable car that takes you to Fisherman's Wharf. There's a major transportation hub about 4 blocks south of the hotel that can get you on a train to SF Giants, Oakland Athletics, Airport, and Stanford University (1 transfer). Definitely no need for a vehicle. You also have the option to travel one block to a pretty nice gym (complimentary). We booked our room as a package with a flight on Priceline.com and got an incredible deal. The employees here genuinely care about the customers. An incredible experience, I highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sadie Hegmann","date":"2012-04-09 19:08:06 +0300"},{"content":"The Chancellor Hotel is situated in a great location near Union Square, the train from the airport takes you to a station about a 10 minute walk away (10 minutes with suitcases as it's up a hill but 5 without!). It's more or less directly opposite Union Square and one of the cable cars stops right outside the hotel which is handy for China Town and getting up all those hills. The rooms were smaller than they look on the promotional material, difficult with two suitcases as there is only a small area to hang clothes up and not anywhere really to put folded clothes. There wasn't a fridge in the room and as I found out with all American hotels there aren't any drinks facilities in the room like tea / coffee. There is a TV in the room. The beds were very good and they pride themselves on being able to choose a multitude of pillows to suit your needs! There can be a bit of noise outside but then again you are on a main street... The reception staff were brilliant, very friendly and knowledgeable, the lady behind the shop / excursions counter is great. By the 3 day travel pass from her, you'd have probably made your money back within a day and a half, you need to use the cable car and trams quite a lot to get around - everyone says San Fran is small but we thought everything was really spaced out plus there are so many hills! You can use the internet for free in the lobby so don't use the one that's available in the room, as you have to pay for that and it's really slow. We tried and then went to reception who told us about the free one and refunded us the charge from the room. We got a reasonable deal on this hotel by booking direct and although you get what you pay for, it's definitely a worthwhile place to stay purely for its location.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Margaret Konopelski","date":"2014-04-14 05:51:43 +0300"},{"content":"Our initial stay was extended by over a week due to the volcano and we were very happy here. It is in a great position, if you like shops, cable cars, eateries and activities in Union Square and obviously comes with the buzz that these things bring. Easy to walk to Chinatown. Rooms attractive and beautifully kept; those at the back are quieter. Eat at Sears and browes books in Borders; great.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Evans Sporer","date":"2012-10-24 13:56:44 +0300"},{"content":"This hotel is a real gem - we booked the package including parking and dining credit (which covered great breakfast for two each day). The price was a real bargain compared to other hotels in area. Rooms were recently renovated, clean and tasteful. Bathroom is really tiny - similar to European hotel. Location is fantastic - staff was extremely helpful. They put us on the \"quiet\" side, unfortunately, there was a loud guest staying on our floor who was outside his room talking at all hours of the night, but not hotel's fault. Highly recommend hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Johnpaul Cassin","date":"2015-12-11 15:01:59 +0300"},{"content":"I hadn't stayed at the Chancellor or perhaps 20 years, but based on reviews decided to try. THIS IS A TERRIFIC VALUE! We used to BART from the airport and easily walked the 3 blocks on a slight uphill with our rolling bags. Our room was ready (early), was on the 12th floor, and very clean and perfectly quiet. The room as small ONLY if you are used to American oversized rooms. Very much on the order of a small European Hotel with small but perfectly adequate room with all that we needed. Firm Queen Sized Bed. Nice little bar off the lobby. We didn't try the restaurant but went next door for Sears pancakes! The \"business center\" is one wee computer right next to check in- again very European in feel. Great location from which to explore the city","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kiera Willms","date":"2012-11-13 20:51:49 +0300"},{"content":"I chose the Chancellor due to trip advisor reviews, and recommendations to stay near Union Square as we were only in SF for 24 hours and the price suited out budget. I have no complaints at all. Excellent location, clean, friendly hotel - we were given a suite on the top floor - maybe because it was for one night and it was vacant..... excellent if you were staying a few days - or had more than a couple staying. I concur with previous posts - close to everything - we didn't have a problem with noise from next door - although our room was at the end of the hall, and the other adjoining wall to the bedroom was our sitting room. Bathrooms (2) were extremely clean. The building is an older style, but everything has been done up very nicely. they had free wi-fi, which whilst travelling I found to be an excellent convenience (used it via my iphone), so much so that wherever I book in the future will have free wi-fi (in all the hotel, not just the lobby).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hadley Hilll","date":"2012-06-17 00:07:43 +0300"}],"public_likes":[],"vacancy":true,"description":"Clean, cheap, safe, fun. The hostel has 75 beds in total, some are 4 or 5 bed dorms and others private rooms. All rooms have their own private bathroom. They offer a free breakfast and free wi-fi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}