{"title":"Peak District","name":"Wheeldon Trees Farm","address":"Earl Sterndale","directions":"5 miles from Buxton","phone":"+44 1298 83219","tollfree":null,"email":null,"fax":null,"url":"http://www.wheeldontreesfarm.co.uk","checkin":"15:00","checkout":"10:00","price":"from £195","geo":{"lat":53.1929,"lon":-1.8476,"accuracy":"ROOFTOP"},"type":"hotel","id":21987,"country":"United Kingdom","city":"Derbyshire","state":null,"reviews":[{"content":"I can't wait to go back there! My wife and I had never been to Hawaii so we chose the Westin based on recommendations. I can see why. Beautiful grounds on the beach and a spectacular pool. Just next to Whaler's Village where there are plenty of shops and restuarants for happy hour and dinner. Just down the highway from Lahaina. Rooms were just fine, for what little time we spent there. I would recommend an ocean view though because the sunsets are unbelievable. The only negative was the parking situation if you get back in the evening with a rental car. We would stay there again, and we can't wait to. Since this trip in October of '06 we've stayed at The Ritz Carlton in Puerto Rico and the Westin Maui blows that away...not to mention that we enjoyed Hawaii over the Caribbean hands down.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Fernando Jacobi","date":"2012-09-25 02:19:53 +0300"},{"content":"We stayed at this hotel for only one night after receiving an offer from the Sheraton to move because they were overbooked. We wish we would have stayed here the entire time! This hotel is outstanding! The facilities are awesome, and the lobby is very impressive! If you're looking for a hotel with the \"wow\" factor, this is definitely it. Also, it's in close proximity to the beach @ the Sheraton, so we could have just walked down the shore to snorkel at Black Rock. We visited the spa, and it is truly \"heavenly\"! Everything about this hotel is tasteful and luxurious. I am amazed it is not ranked higher, and we are pretty picky. We will definitely return!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Cecile Daniel","date":"2012-11-11 18:05:16 +0300"},{"content":"We were \"invitied\" by Westin for the same 6day/5night deal others have mentioned; $150 a night for a piece of paradise? Okay! It was a very pleasant experience. We didn't want to pay for the upgrade; we knew we would spend in restaurants, etc. but did talk to the manager about our anniversary. He put us on the 10th floor, mtn view, recently renovated room, smaller than other Westins, but we knew that ahead of time from research. The armoire and all the drawers available were quite suffiicient, and there was actually room under the beds for our luggage, and with four of us, that was a big help. The heavenly beds, wireless internet, and small frig; what more could you ask for at this price? Oh, yeah, how about a bottle of wine and chocolate covered strawberries sent up to our room from the manager? We were greeted with leis at the door upon arrival, and no, the lobby is not as over the top as other hawaiian hotels, but very pretty with the koi pond and waterfalls and birds. Yes it was a busy hotel, it was the holidays (Jan 2-7); there are a lot of families there enjoying themselves; honestly, don't go to a resort if you want to be alone. We ate breakfast by the pool one rainy morning; the spinach benedict was yummy, and large enough to share for two. I used the work out room, but didn't have to wait for a machine like someone else did. We ate at the dinner at the lower Leilani Grill; great location, food not really memorable; lunch at the Hula Grill, goat cheese pizza was tasty and our teens said they made the best virgin pinas. In Lahaina, we had a wonderful dinner at the Lahaina Fish Company (get the scallops), and another night a delicious meal at the Lahaina Store and Grill, a new restaurant (the lamb lollies were to die for!) To end our trip, we rented a condo in Wailea, at the Ekolu Village for three nights. Found an ocean view unit from VRBO.com. We had a great experience overall.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Wilber Rodriguez","date":"2013-03-05 10:41:12 +0300"}],"public_likes":[],"vacancy":true,"description":"8 award winning 4* holiday cottages near Buxton, Bakewell in Derbyshire Peak District sleeping up to 28. Dog, pet, children, family, group friendly","alias":"Peak District Cottages","pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}