{"title":"Eragny","name":"Hotel Bleu France","address":"Rue des Pinsons","directions":null,"phone":"+33 130378600","tollfree":null,"email":null,"fax":null,"url":"http://hotel-bleu-france.com","checkin":"13:00","checkout":"12:00","price":"59€","geo":{"lat":49.019423,"lon":2.096865,"accuracy":"APPROXIMATE"},"type":"hotel","id":8966,"country":"France","city":"Éragny","state":"Île-de-France","reviews":[{"content":"I stayed at Paradise Point last weekend for the 2010 Bayfair Airguard Championship Unlimited Hydroplane Race. Because I was on an extremely tight time frame, I needed help leaving Sunday after the race. I called the concierge, Elizabeth Markling. She made certain that my airline boarding passes were printed accurately as there was some misinformation from Alaska Airlines. Elizabeth handled this, going the extra mile to double check the tickets. I needed a cab waiting for me at 4:45 and it rolled up right at 4:45! She also made sure that I knew which terminal the commuter airline used, so I wouldn't miss my flight. During the entire process, Elizabeth was courteous and was concerned that my Paradise Point experience would be great! Thanks to her dedication, the experience was wonderful. That's why I refer to her as the \"World's Best Employee!\"","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Jalyn Kub","date":"2015-04-28 11:01:13 +0300"},{"content":"My husband and I just returned home from an 8 night stay at Paradise Point. We live in San Diego and have stayed in many hotels/resorts on Mission Bay within the past 2 years. This was our favorite. The hotel staff was exceedingly helpful and friendly (every single one of them). The room (a bayside 1 bedroom bungalow) was clean, roomy, stylish and very comfortable - with a gorgeous view of the bay and bridge. The property is expansive with many beautiful paths and lagoons to enjoy. The public parks that border the resort are equally lovely and offer endless places to just sit and relax and gaze at the bay. For half our stay we were joined by our extended family. All were as pleased as we were with their rooms (basic lanai and not on the bay) and with their experience as whole - including our 2 young grandchildren. It is pricey but no more so than other San Diego resorts. We booked 4 nights for the price of 3 (still available at the time of this review) and felt we got our money's worth (we stayed 8 nights for the price of 6). The restaurant (the least expensive of the two) was actually very well-priced for a resort; although the menu seemed somewhat limited. Reading some of the other reviews, I'm truly mystified. I can't imagine what more anyone would want from a resort, or a vacation. It was a perfectly wonderful experience from the first through the last day. We will be returning soon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sylvan Shanahan","date":"2014-06-13 21:34:41 +0300"},{"content":"As much money as I paid for the paradise effect I didn't get what I paid for... I was disappointed...the view was great from my front door but that was all that was great about my stay... it could have been better. the room could have been bigger b/c I was with my whole family anb I would certainly not come back again....","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Dixie Hilpert","date":"2012-10-06 02:29:20 +0300"},{"content":"Stayed here for a conference and although initally driving in you think, wow this place looks nice, take a better look around. It's only the gardens that look nice. The bungalows look like little dumpy cubes. They really need to improve the external look if you want to match the landscaping & cost to stay here. This place is not a quiet romantic getaway type place. It is located within walking distance of Sea World, so you have a TON of family/kids, and if your prepared for that then you can go in knowing the noise level will be annoying. Having an adult only pool doesn't work, because you always have the losers that bring their kids here to get away from the other noisy kids elsewhere. No hotel staff around to let them know-adults only!! Many places like this are overrated. It is so frustrating to pay and arm and a leg to stay in a place like this, and then they turn around a charge you more for everything you want to do. $12.00 a day to use the workout room, parking fees, fees to use the tennis court. etc. etc. Are you serious? I don't call that a vacation when your raked over the coals everytime you want to do something \"extra\". Maybe for some this is \"fun\". For me I'd rather stay in a nice chain hotel that appreciates their guests. Spending more doesn't make it memorable, but if you don't mind opening up your wallet to be drained......this is the place for you.For me it was overrated, really don't have an interest in staying here again.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Chelsea Huel Jr.","date":"2014-05-12 14:41:38 +0300"},{"content":"I have stayed at this resort over the last few years and it keeps getting better and better. The new remodeled rooms are excellent and the staff does everything possible to make our stay enjoyable. The check in was quick and easy as was all the staff at the restaurants, poll and boat dock. The live fish of white sea bass and yellowtail at the Barefoot Bar and grill are always a treat and remind my son and I we need to get out on the water soon for fishing. The location is awsome in SD with great weather and right across the street from Sea World. We were also able to rent bikes, play tennis and rent a sale boat right from the resort. We cant wait to go back again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Guillermo Maggio","date":"2012-07-06 16:01:18 +0300"},{"content":"Check in was at 4pm did not get a room until after 5:15 pm and had to raise a fuss to get it then. Spoke to the manager he waived the parking fee for our trip. The next day or should I say nite 12:21 am a security person entered our room with a pass key without even knocking or announcing his arrival. Spoke to the manager again only to get a so sorry. A taco was 9.00. Rooms are clean but dont expect to see a maid before 3pm.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":3.0},"author":"Maybell O'Conner","date":"2013-04-13 09:38:20 +0300"},{"content":"Okay, let's start out with the good... beautiful grounds include a lagoon, bridges, tropical plants, nice pools, clean and updated rooms. They had campfires on the beach in the evening with tiki torches lighting the area. Very nice. However, even with all this good, my biggest complaint is thin walls. I don't want to hear the party next door, and I did, on both sides. Luckily, we got a decent crowd on both sides and they went to bed at decent hours and they were not partiers. I would predict however, some people would encounter these issues. They can fix cosmetic or other easier fixable items, but adding more insulation to their newly decorated rooms will not happen easily. There is a $25 parking fee to park your car, right outside your room and the bar and grill is pricey ($14) for order of nachos. We ate appetizers, two beers and one iced tea and our bill was $80. However the view was gorgeous, so your paying for the ambiance. It's very close to sea world and right next to Mission Bay Park, so location is wonderful. Beds were comfy. Rooms newly decorated and very clean. I would recommend, but warn friends of the thin walls.","ratings":{"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Stephan Lindgren","date":"2012-07-25 06:56:41 +0300"}],"public_likes":["Jacques Waelchi","Nelle Morissette","Russell Schuppe Jr.","Una Gislason","Colt Schulist","Micah Lind"],"vacancy":false,"description":"A very comfortable room with TV, sat, Free WIFI.","alias":"Hotel Bleu France","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}