{"title":"Malibu","name":"Malibu Beach Inn","address":"22876 Pacific Coast Highway","directions":null,"phone":"+1 310-456-6444","tollfree":null,"email":null,"fax":null,"url":"http://www.malibubeachinn.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.03852,"lon":-118.67395,"accuracy":"ROOFTOP"},"type":"hotel","id":17313,"country":"United States","city":"Malibu","state":"California","reviews":[{"content":"We were originally booked to go the Iberostar Costa Dorada in the Domican Republic but three weeks before we were advised to cancel due to beach renovation, we were of course gutted at the time but it came as a huge blessing in disguise as we chose this as our alternative holiday and it was the best place we could have ever gone! THE HOTEL AND GROUNDS From the minute we stepped into the lobby and could see the beginning of the grounds we were amazed. The gardens look beautiful and are well kept and maintained. The polynesian houses are brilliant, I would rather stay in one of these any day than a high rise hotel. The whole place just looked ideal, so much nicer than you're regular hotel. ROOMS We had a room as close to sea view as you can get without having a timeshare. It was really peaceful and it was as if the whole place was there just for you, you couldn't even hear anyone else. We had a ground floor room and it was lovely, can't fault it. Not sure what people have complained about the beds for, didn't find them hard or uncomfortable in the slightest. The bed was also huge, me and my partner seemed to end up sleeping a mile away from each other we had that much space! The shower was fine too, people complaining about the shower spraying obviously don't have any real problems, the floor got a little bit wet, I mean a little bit wet, and if it hadn't been mentioned before it wouldn't be anything I'd even mention as it was not an issue at all. It had a walk in wardrobe with plenty of room for mine and my boyfriends clothes etc. The downpoint to the room was that there was only one plug socket. For all you ladies, my hair straighteners heated up fine so no worry bout that. However our psp and ipod wouldn't charge I don't know if that is to do with the voltage? My camera battery charged fine as did our mobile phones. The maids cleaned every day and left fresh towels. Our maid was a little too eager and even if we left the do not disturb sign up he would come banging waking us up early in the morning and if we ignored him he would come back ten mins later doing it again until we answered the door....when my boyfriend opened the door and tried to tell him we were sleeping and could he come back tomorrow he just stood there smiling going \"Si si!\" and smiling waiting to come in and clean, in the end we had to get up and let him clean...this was a tad annoying but not a major issue. Also we only had one swan made out of a towel the whole holiday but we saw in someone elses room he had done two swans, rose petals etc etc. Tipping didn't seem to help in the swan matter either! Again not a big issue though lol......Also someone wrote in their review something like \"imagine my horror when there was no news channel in my bedroom, how could i possibly enjoy my holiday\" or words to that effect - um this wouldn't ruin my holiday at all HOWEVER there is news channels on the TV (just to put your minds at rest!)... POOLS There are two pools, the activity pool and the relaxation pool. The activity pool was fun to be around, it had music playing most of the day, everything from UB40 to Pussycat Dolls....there was water volleyball/polo/tequila darts/beer drinking competition/kayak racing etc etc....you can get as involved or as uninvolved as you like....This is also where the swim up bar was which was lovely. You can stay in the pool till 11pm if you like so you can stay in and drink all night if you wish. It doesn't get cool even at evening so you wouldn't be cold. This is the pool that goes right out to the sea and the view is spectacular. It's great having the sea right there when you're swimming or sunbathing. The other pool was quiet and a decent size, this was great for the days you just wanted to relax. BEACH Now I don't know where the rumours of no beach has come from, maybe at one point thats how it was but certainly not now. The beach is a great size and has enough sunbeds for all without it ever seeming over crowded. The sand is white and soft and the sea is turquoise. No seawead or grotty bits just clear blue water....It's paradise...There are sunbeds under thatched parasols and ones in the sun. Also inbetween the hotel and the beach is another layer of sunbeds on a raised level with sand flooring and hoods (think pram hoods) over them to give shade to your head and shoulders...we found these a godsend after getting burnt! There is also watersports available from the beach including Jet Skis. The Jet Skis are i think about £15 for 30 mins which is quite good value. We were told its impossible to fall off them unless you do something really extreme because of the way they're designed. We however managed to fall off :-S We were fine but lost our sunglasses! Make sure you wear the wrist strap however as this stops the jet ski if you fall off. THE DRINKS The cocktails were great, sometimes strong, sometimes not so. The beer they served was Corona on draft. My boyfriend liked this but was convinced it was watered down and he couldn't get drunk on it. They had a huge selection of spirits including some brands like Bacardi, Smirnoff etc. The big let down was the soft drinks...they were branded (Pepsi) but were all completlely flat and horrible throughout the hol....the pineapple and orange juice were nice though. THE FOOD The food in the buffet resteraunt was good. They had plenty of selection, most nights me and my boyfriend would end up with completely different things from each other as there was so much selection. One word of warning though - aviod the chicken - it's very pink and very bloody everytime it was there. I never ate the chicken but however I have been very ill since I got home, I can't say whether it's been food poisoning or a virus but just be careful you choose food that is well cooked. Everything other than the chicken seemed fine. There was a great selection of food and it was all gorgeous. The breakfasts were great too and the sausage and hash browns were very like Mc Donalds which I thinks great. There was also things like waffles/pancakes for breakfast and fruit or cereal. Also I think they had smoothies and omlettes. They also had some strange things like lasagne out at breakfast, and cauliflower and carrot. People seemed to be eating them too! The food at the pool bar was mainly poor but they did have a nice potatoe salad there one day and some nice meatballs. The potatoes were usually cooked well too which is something I'm very picky about. They also had a nachos thing with cheese sauce, gaucamole, salsa etc at the pool bar which was nice. The pizza place was fine, nothing special nothing bad. The Mexican resteraunt was lovely but we loved the food at the buffet so much that we only visited the resteraunt once. LOCATION Playacar is gorgeous, it feels very safe and posh and for the first few days it was hard to believe there was a world outside of it. It only costs about £2.50 maximum to get into Playa Del Carmen by taxi which are always about outside the hotel so this is very easy. Playa Del Carmen is nice, posher than most tourist places I've been but with all the usual touristy tat....Nothing much worth buying, we bought ourselves some photo frames. NIGHTLIFE The 'club' at the hotel had loud music playing but was dead at all times, however the one pool table was always occupied. In Playa Del Carmen the best place to go was The Blue Parrot. It had one dancefloor inside that consisted of sand this played proper dancy type music. You could also dance on the speakers here. The seats at the bar were swings which seems to be the local gimik. We still loved it though. Outside, on the beach was a wooden dance floor and here they played mainly RnB and Hip Hop which I loved and although my boyfriend isn't a fan of that sort of music we managed to have one of the best nights of our life here. The drinks are stronger than the hotel and the beer you can get is Corona or Sol. A round consisting of a beer and cocktail came to around $5. Brilliant place to go highly recommended. There is also a Senor Frogs which is fine but not lively like the one in Cancun. Deseo is the place with the beds on the rooftop and it was a great place to start off the evening, really classy and chilled out. For amazing nightlife head for Cancun, a taxi will cost about £25 each way but you can get transportation via trips like the Disco Rolling Tour, or the Coco Bongos tour etc. We visted Cancun twice, once on the Disco Rolling Tour and once on the Coco Bongos one. The disco rolling tour was well organized with a guide who is very friendly and fun who looks after you all night and gets all your drinks for you. He supplied us with plenty he was never far away. You visit Congos which is supposedly a bar but it's very crazy and a lot of fun, then Senor Frogs which is slightly madder and then Coco Bongos which is the peak of the night. You spend 1 hour in Congos and then 2 hours in each of the other two places. The trip to Coco Bongos on it's own was brilliant. We had someone pick only us up, no other people, take us into Coco Bongos and then return to pick just us up all for £30 each. This was with drinks included all night. Coco Bongos is the most amazing experience you should check out the website it's really a must do on your holiday. We loved Cancun night life so much we will return there next year for our whole holiday. It is very much a young crazy place though. EXCURSIONS We did the two trips menitoned above. We also did a pirate ship tour which was probably the worst trip we booked but was still ok. The show was very funny, the pirates are great and really had us laughing. The letdown being you had a pirate assigned to however many people to bring you your free drinks, other pirates got there people loads but we got two drinks and then didn't see our pirate again and it was impossible to get drunk. There was a bit too much forced interaction, trying to dance with absolutely no space and being forced to get up and pull people you didn't know up onto the floor and rub noses with them etc.....ok if you like that sort of thing but even if you don't you HAVE to join in. Bear in mind you may well be sober too! The thing that topped it off for my boyfriend was a forced game of someone coming round collecting everyones shoes, so they took our shoes and then we were forced to go and eat while the game was still going on and we had to walk around bare foot. My boyfriend finally got his brand new trainers back completely soaked in beer so the evening went downhill for us from here. Also you are on a boat so you are completely trapped there for the duration whether you enjoy it or not. Onto a good trip was the Dolphin Swim. We did this at Dolphin Discovery which is about 15 mins from the hotel. It's around £80 each for the Royal Swim which is the best package. You have around an hour in the pool with the dolphins, you get to do a dolphin kiss, touch the dolphins, hold the dolphin like a baby, swim out and put your arms out and the dolphins come behind you and you hold there fins and they pull you along. You then do another one where you lie flat and the dolphins come behind you and push there noses into your feet so you fly out of the water. It's very fast and exciting and brilliant experience. They take lots of photos which you can purchase for around £7 each. We purchased just the one. The DVD is a brilliant memory and is a bit steep at £25 for a 5 min or so dvd but its well worth it to capture that memory. Downside of trip you dont get picked up till about two hours after you've finished your swim, I presume to try to make you spend money at the bars/resteraunts... Another great trip we did was XelHa. I never thought I'd fancy it before we went but it turned out to be one of the best trips we did. It's a full day trip and I think it cost about £40 all inclusive each. You get to snorkel in a huge lagoon (its very cold so be warned!), free hire of snorkel, flippers, rubber rings (double or single) etc... You can jump from the cliff of courage (we did this) and I have to say its not really that high. It's about 4m. It hurt me a bit when I landed but only momentarily and I was glad I did it. If you do this trip I'd recomend buyin a waterproof camera to capture the day. We did this but have yet to have it developed. It was about £13 but you couldn't take your normal camera around with you as you're in and out of water so much. There is a cycling bit which we did just to get somewhere quicker but it was suprisingly fun. The bikes had no breaks which made it slightly more scary and fun they really went fast! There was also a hammock area for relaxing which was as close to paradise as you can get. We booked only one trip through our tour operator and the rest through Gray Line. If you turn out of your hotel and go left there is a small shopping area in Playacar, they had a stand outside here and were brilliant and 100% reliable. On a downside, we booked to go Coco Bongos through a tour place in Playa Del Carmen. We paid $14 deposit and the tour never turned up. We were not so much annoyed about the money it's only £7 but that it wasted a night we'd been looking forward too. This tour company was on the left hand side as you walk down and was a tiny little place, just near a tree with a seat around it. Avoid at all costs. When we went down to complain it was shut but if it's open again do not go here. I don't know if I've included everything! No doubt I've missed something but the top and bottom of it is go!! Ignore the bad reviews, some people must be impossible to please, this is the nicest place in the world! You will love every minute!! Any more information please contact me at lucynickson@gmail.com Having probs uploading photos, if anyone wants any sending just ask!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Trudie Legros IV","date":"2012-11-19 22:37:23 +0300"},{"content":"The stay at this resort was my least favorite out of 4 previous visits to the area. The rooms were falling apart and the repairs were very noticeable. The beds were so hard, my 8 and 10 year old were complaining. The food was average at the buffet and the service was poor due to understaffing. Same problem with the pool bar, always a line to get a drink. We did not get to eat at the Mexican restaurant because it was always booked and we were told by other guests that the Italian restaurant was not very good. The staff was very friendly and the activities kept my children entertained even though it was the same thing everyday. The grounds are beautiful and kept very well. The beach was clean but small. The picture on the web page is old and the beach looks totally different now. If you want shade, get to the pool or beach very very early. The evening entertainment was fair. The show was OK but it was only about 30 minutes long. I stayed at the Occidental Grand Excaret in June and it was much nicer all the way around. I would not recommend the Allegro unless it is your first time going to Playa.","ratings":{"Service":4.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":2.0,"Rooms":2.0,"Location":3.0},"author":"Edgar Zemlak III","date":"2013-08-22 07:57:43 +0300"},{"content":"terrible food.but the entertainment show rocks...after seeing the show for 6 days in a row, it gets predictable with the m.c. going on with the same material. food was terrible anyone with a tastebud will tell you. the dinner reservations was generic, i had order the enchiladas with the steak. steak was delicious but could only make 1 taco as for the enchilada they had made it with mole sauce. for those of you who never had mole sauce it tastes like dirt. my parents had stayed in the room downstairs. their room was always very cold, but had no smell. but all the bugs crawl into the room from under the door. my husband and i stayed upstairs it was always smelly when there was a short rainfall and the lizards would crawl in through the roof and croak in the middle of the night. the upstairs rooms had cathedral ceilings but did not keep the coldness to well from the a/c. you can also view the thatched roof from inside our room. my spouse was sleeping and the roof leaked on his head and there was always a strong smell of wet hay in the room after it rained. if you do not like the smell of wet hay ask for a room downstairs. we had problems with the front desk people trying to change our room. so we just decided to stick it out and if i fell from the wet staircase i would have gotten hurt. after reading all the reviews from other people about the beds. my parents bed was a softer mattress, while ours were very firm. but they both sat on concrete slabs. i would take naps on my parents bed to make up for the lost sleep due to the very hard mattress in our room. the toilets are another thing. the toilets would always back up when a new guest arrived into the building. one toilet gets back up they would all follow one right after another. we were not hounded by the timeshare people at the hotel, because we did not seem interested in why they set up tent just right outside the lobby. and they would greet everyone as you came and left from the hotel. the snack bar they provided after 11pm was a joke. it was a table with food (hotdogs, and nachos and lousy finger sandwhiches) set up on it. the hot food was always cold and the cold food was always warm. every person that worked there had the same catchphrase of 'tequila' , want more, or need more, it got pretty tiring after a while. the all-inclusive watersports was a joke in itself. you would have to walk down the beach to the neighboting hotel and get your boogie boards, kayaks, etc. after getting there they tell you have to have a card to use the things and get from the front desk people. then the front desk people would redirect you back there to take it up with the people in barracuda services. it was and endles circle that had ripped the fun and life from me. in all honesty if you are budget traveler this place is for you, if you enjoy vacations with no hassles do not stay here!!! my parents are the budget travelers they loved it , i was not my spouse and i were very dissatisfied with hotel.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Service":2.0,"Rooms":2.0},"author":"Bertram Green","date":"2015-07-04 09:32:17 +0300"},{"content":"My 9 year old daughter and I enjoyed the Occi Allegro Playacar as we'd not stayed at an 'all-inclusive' Mexico resort before. However, the hotel did leave a bit to be desired. First, the current aerial photos of the hotel's beach are deceptive as there isn't a lovely 40-50' beach at the end of the main pool. There is a very narrow 20-30' beach with many people crowded into the few beach chairs. As with the pool, people come early and lay 'claim' to a beach, or pool chair, for the day - even if they're not using the chair. This means that many people have to do without a chair or squeeze into the sand. The kids club is really for very young children as the kiddie pool is a wading pool and the activities are designed for toddlers and kids under 8. My daughter spent one day in the kiddie club but was bored. The two attendants were quite pleasant but didn't take the kids out of the single room except to toss toys in/out of the wading pool. The buffet is quite extensive and offers many choices. Most items were tasty but not 'gourment'. The Mexican theme restaurant was quite good with some local dishes. The need for reservations seemed a bit odd as the times we ate at the restaurant the tables were not fully occupied. The outside (by the second pool) Italian rest. was nice also, especially if the weather is pleasant as the tables are in the open. The main lobby/office staff is quite friendly but not particulary helpful. Ex, The Internet access room was rarely open and most of the tiem the PCs were not working. If you want to check email, send mail to family, check flight times, etc. you were better off going into town to find a Internet cafe. You also had to pay for the use of the PCs and with the PCs dropping connection it was costly. The nearest pay phones are in a small shopping plaza, about 5 min. walk. I'd suggest purchasing a phone card at the plaza pharmacy as the pharmacy sells cards that work in the plaza phones. The 'town' is a working town and is a nice break from the hotel scene. It's a 20-25 min. walk (depending on if you're older or have kids) and passes by some local Mayan ruins. Take the ruin walk as it goes near a beach with nice, small hotels, condos and leads into the town. The ATM/banks in town dispense in pesos and the exchange rate was 11.50 pesos/US dollar vs the 10.00 pesos/US dollar at the hotel. The brochure we had said that the non-motorized water sports were 'unlimited'... well, unlimited is 1 hour per day per sport (ex., 1 hour of wind surfer, 1 hour of kayak, etc.) even if the sport equipment sat their unused. I wanted to take the Hobie Wave out for a couple hours (I sail in Colorado) but was told that 1 hour/day was the limit. Keep in mind that the area around the Occi Allegro is filled with other large mega-resort hotels, vacation homes, condos, etc. There is also the never ending stream of timeshare sales reps. If you walk down the beach, in any direction, you'll find thousands of tourists. The only quiet beach is South, about 1 mile and past the resorts. It was full of trash so we did some clean-up but the area needs a bulldozer to keep the refuse from blowing back into the ocean. Looks like a local Boy Scout or Rotary project is needed. The local travel agent, MLT Vacations/WorryFree, rep. was unfriendly and useless when it came to selling us tours. We eventually purchased Xel-Ha/Tulum and Coba (EXCELLENT) tours through another travel company. You can get better tour deals in town through the tour operators. *We really enjoyed the Coba tour though it was a long day of driving/stopping at other resorts to pickup tourists/and HOT. Our tour company also stopped at a Mayan village to hand out school supplies and pick up trash collected by the kids, swim in a underground cave/cenote (refreshing), and lunch next to a lake with alligarors. A good tour but lots of walking on uneven ground - bring sturdy walking shoes/socks, as well as TEVAS for swimming the cenote and a swim suit/towel. Tips: bring at least SPF40 as the sun is intense, bring a large brimmed hat/visor, bring a 1/2 sleeve or long swim shirt (Speedo) for yourself and the kids, bring a mesh bag for wet clothes/towels and to get rid of sand from the beach, plastic beach toys, wind breaker for cool evenings, leave your jewelry at home, travel pouch/waist pouch for passports, money, credit cards, Gatorade powder for long days away from the hotel, small first aid kit/bandaids. If we take the Coba tour again we'll fill a suitcase with school supplies, small metal toys, etc. for the Mayan kids. Bring at least 2 cameras - my digital camera stopped working and I'm glad I had a disposable/water proof camera as a backup. It took decent photos and we didn't mind taking it to the beach, snorkeling, parasailing, etc.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Service":4.0,"Rooms":4.0},"author":"Shayne Effertz","date":"2014-09-21 04:03:57 +0300"},{"content":"Thank you Allegro for a wonderful, relaxing week. Allegro Playacar is low key, well maintained, fairly small and intimate with accommodations located in multiple buildings with 8 units each - 4 upper and 4 lower. We had a lower floor unit which overlooked the relaxation pool and a bit of a view of the ocean. The room had 2 double beds which was not large, but was adequate for 3 adults. The staff was pleasant and helpful and our room was always clean. A minor problem with our shower was repaired promptly. Food was good and plentiful for most of the day and served buffet style; however, later in the evening the menu was pretty limited. We made reservations at the beachside restaurant one night and although it was a bit windy right on the ocean the great food and service more than compensated. You had the option to relax quietly or there was always something to do such as pool volleyball, aerobics, bingo, etc. and nightly shows. We tried the kayaks - small sail boats and boogie boards were also available. The beach is small and kept very clean. The evening shows were very entertaining - great dancing, elaborate costumes and a good mix of different themes. The highlight of our week was our visit to Xcaret - don't miss it ! Playa del Carmen, Tulum and Xel-ha are also well worth visiting. We found the best deals for the sightseeing trips at Walmart. This resort is good value for the money. We would definitely stay here again.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":3.0,"Rooms":3.0},"author":"Roma Orn DVM","date":"2012-05-19 16:13:52 +0300"},{"content":"I have stayed in playacar 11 times over the last 3 years have always loved the beach,people,and hotels.was there 2/2-2/8 they had just opened after repairs the beach is gone-(just south the beach is great as usual)the resturant is closed you eat on the tennis court with a tent over it food was terrible .the workers where very nice magement was rude.my son had money stolen by an employee with a key and management covered for them.","ratings":{"Cleanliness":3.0,"Overall":1.0,"Value":3.0,"Service":3.0,"Rooms":2.0},"author":"Jayce Ruecker","date":"2012-08-09 15:08:36 +0300"}],"public_likes":["Matteo Schinner"],"vacancy":true,"description":"Has perhaps the most central location of Malibu hotels, on PCH in the heart of Malibu.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}