{"title":"Cardigan","name":"Piggery Poke 4 star hostel","address":"Ffrwdwenith Isaf, Felinwynt, Cardigan, SA43 1RW","directions":"On a loop off the coast path between Mwnt and Aberporth, near the village of Felinwynt","phone":"+44 1239 811777","tollfree":null,"email":"hostel@piggerypoke.co.uk","fax":null,"url":"http://www.piggerypoke.co.uk","checkin":null,"checkout":null,"price":"£21 per person per night","geo":{"lat":52.1313,"lon":-4.5899,"accuracy":"ROOFTOP"},"type":"hotel","id":5081,"country":"United Kingdom","city":"Ceredigion","state":null,"reviews":[{"content":"This is in the Hillcrest area - lots of incredible restaurants and shops, Whole Foods in walking distance (Washington St. and University Ave.), only a mile from Balboa Park and the Zoo. Best thing about it, the price and the fact that it has a kitchen, dining room table and living room with couch, separate from the bedroom. Because of that we were able to have our family members come to 'our place' to visit. Nice to have the option, nice to be able to \"eat in\", or save money by cooking/fixing our own drinks/snacks/meals. Only thing to consider is that it can be noisy at times, because several hospitals are nearby, there are sirens, so keep the windows closed and request an upper floor. Service is great, amenities like 'wine and cheese happy hour\" in the winter and BBQ in the summer are a treat. This was my second time to stay here, I love it, and I will be back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Laisha Ward Jr.","date":"2013-05-04 04:45:31 +0300"},{"content":"This is the second time we have stayed at the Sommerset Suites. This time we used it as a base for a photo tour we were leading. Jen worked with us while we were determining the number of rooms we needed and was very helpful. The hotel is extremely well located with easy freeway access, close proximity to Balboa Park, easy access to downtown and the airport, and within walking distance of a variety of good restaurants, CVS, and Whole Foods. We also wanted a hotel with cooking facilities for folks who prefer to eat in rather than going out for every meal. The kitchen is adequately furnished and the staff runs the dishwasher every day for you. The hotel is situated near a hospital and during the day you hear emergency vehicles but they are not a problem at night. Most rooms have had their windows treated to cut down on street noise since it is located on a busy road. Like any hotel you can get noisy neighbors but we only encountered that one night. (We have gotten where we always take a small sound machine with us that provides white noise and helps cover up most noise because it seems that noisy neighbors are found in many hotels.) We were driving mini vans and the parking spaces in the garage were a bit tight but then we found this to be true pretty much everywhere in San Diego where parking is at a premium. I felt the staff went the extra mile for us. They were painting the building while we were there and someone had taken the time to cover my car in a huge sheet of plastic so it wouldn't get paint on it. We're not talking a hotel that is ultra fancy but it's affordable, clean, comfortable (the beds are great), the rooms are large, the breakfast is comparable to most chain hotel breakfasts, it is very well located for exploring San Diego and we would definitely stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Billy Leffler","date":"2014-03-10 10:12:07 +0300"},{"content":"Very similar to the last review....booked based on reviews, ranking, and location. We arrived to wonderful friendly staff that offered advice, maps, and coupons. Upon walking to, and entering room, rating was falling... also noticed the old dirty carpet, and while technically a suite, it was very \" cozy \", but still acceptable. Where it lost more points was on the thin walls - from the noisy couple above us during the night, to the kids running down the halls in the morning, to the speaker right outside my window playing the lobby music all night ( which the clerk did turn off as soon as I mentioned it - after midnight ). A couple positives were the decent breakfast, again helped by the nice staff, and the central location - it was max 20 minutes ( usually 10 ) to where ever in the city we were going. The price was OK, and the overal cleanliness was OK, with the bad points mentioned plus little things, we would not stay there again, or recommend it to friends.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Lea Schaefer","date":"2012-06-22 23:27:16 +0300"},{"content":"I was in San Diego for a conference and we stayed here for 2 nights before moving to the conference hotel down by the harbor. We picked it based on the reviews here and I am so glad we did! This place is a gem. The staff were friendly and welcoming and the room was great-- very big and so comfortable (loved that bed!) Also clean and well stocked. As people have said, the free coffee and popcorn and chocolate are a great touch. The pool area was right outside my room but the noise wasn't bad, and it was a great place to relax and sunbathe, BBQ there too on Fridays. I saw someone wrote on here that it was in the shade-- yes it was, in the evening!! The breakfast included was also great--coffee, waffles, cereal, toast, bagels, juice. The breakfast area is quite small so we brought ours outside or to our rooms. Location is great, it's close enough to the airport and also to the downtown area. We walked straight down 5th avenue to the gaslamp district, through Balboa park, was great!! Also nearby are great food places, a 24 hour pharmacy, etc. The free wifi is also brilliant (and is not slow at all). The hospital thing wasn't a problem at all. I heard a few sirens but nothing I haven't heard before living in a city. Also the surrounding area felt safe I wasn't worried about walking around alone. I moved to the Sheraton Marina hotel-- a 4 star hotel-- and it is nowhere near as great as this place!! Here we are paying ridiculous prices just for a sea view and the breakfast and service is not as good. Definitely stay here you won't regret it, we didn't want to leave! Such a brilliant find!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Daphney Gislason","date":"2013-07-24 06:55:54 +0300"},{"content":"We have been coming here for 18 years because it is the nicest, friendliest, cleanest most well run place with a staff the excels and just works to make the guests happy. We find the manager, Aron, the dest help, especiallyBonita, the head of room services Norma and the wonderful Martha who greets us each morning to be superior. There is mnothing they won't do for us. i can't leave out the hourse staff like Romero, Jorge and Gustavo who are always there when we need help. I was delighted to asee the return of happy hour once a week. I truly believe that if it were 2 or 3 times a week it would enhance everyone's stay. It is not the quantity of food but the comraderie that makes it so great. Please consider this . We were delilghted to get newe sound proof windows and look forward to getting sound proof slider doors soon. We have already reserved our 6 week stay for next year and are saddened to have to leave now. This is just a wonderful place and has become our winter family. Even Kevin has come by to say hello and we appreciate his work in returning the happy hour to us. He is a delightful man.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Godfrey Mertz","date":"2015-12-30 10:09:45 +0300"},{"content":"Just a block off the 163, but quiet & serene, the Sommerset is superbly managed. Not only is it a great bargain for a suite with generous amenities, it is 1-2 blocks from some of San Diego's best restaurants. Rooms are immaculate, personnel know how to please and solve travel issues -- these are some of the reasons why my wife and I usually spend four nights every year at this premier establishment. If your interest is the SD zoo, I know of no other hotel that can get you there faster.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Brant Schamberger","date":"2015-05-23 01:33:08 +0300"}],"public_likes":["Rigoberto Weber","Mrs. Ozella Murphy","Jarred Auer I","Valentina Murazik","Fay Hackett","Dewitt Brakus","Baron Littel","Wanda Senger","Newton Kovacek"],"vacancy":false,"description":"4 star hostel with 16 beds arranged as a double bunk with a single over in one room, 5 beds in a second room and 8 bunks in the third room, all with en suites. Pick-up/drop-off service available from points along the coast path. Cycle lock up and transport available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}