{"title":"Los Angeles/Downtown","name":"Omni","address":"251 S Olive St","directions":"at California Plaza in Bunker Hill","phone":"+1 213 617-3300","tollfree":null,"email":null,"fax":null,"url":"http://www.omnihotels.com/FindAHotel/LosAngelesCaliforniaPlaza.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.052677,"lon":-118.250337,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16634,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"This hotel is a great place to stay with family or with friends. The hotel staff was excellent at all times. The hotel stayed clean the pool area was always clean and well kept. The best part of the hotel is the managers reception every night. I would highly recommend this hotel to anyone with a family or just traveling with a group of friend. The one person who stuck out to me wa Iris at the fron desk. She really made my day with how friendly she was! I am going back next year with my family!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Mrs. Tyrique Kohler","date":"2013-06-13 05:40:30 +0300"},{"content":"Every room is a suite, equipped with 2 plasmas, microwave, refrigerator, coffe maker, desk, free wifi. Extremely clean. They offer complimentary HOT breakfast with multiple choices like omelets, fried eggs, pancakes, fruits, oatmeal, cereals, juices, coffe, etc. Also, every evening, from 5:30 to 7:30 PM they have a Happy Hour with FREE beverages (including alcoholic) for all the guests. The pool is nice and the casino too. The hotel is located near to multiple soteres and restaurants in the middle of a touristic zone. The beach is across the street and the hotel has personnel at the beach, with towels and chairs, at no extra cost.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaleigh Kerluke IV","date":"2013-03-29 08:59:38 +0300"},{"content":"Stayed 2/26/11-3/3/11 for my 53rd birthday. Since my sis and I have never been to PR we had no \"real\" idea about location but this was the Best, especially if you are not renting a car. and wanting to do outdoor adventures and seeing Old San Juan. The bus ride was longer than a cab but only 75 cents is right up my alley! I booked through Expedia (air & hotel from Chicago) although we had a late check in of 11:30 pm the front desk staff was so accomodating in getting us checked in quickly and letting us know the lay of the land. We got our bags into the room on the 2nd floor and headed to the bar. It was a bit disappoinng for my sis that the bar keep did not have mint for mojito's or her type of vodka. He was courteous and efficient in setting us up with our 2nd choice cocktails. We did check out the casino but did not gamble. it was loud and yes you can hear it from your living room but as others have said, the bedroom was quiet. I must express that the beds were fantastic! having a bad back and sleeping on a theraputic mattress at home, I was worried without need. The bed and pillows were so comfortable that my sleep was never affected! The room was clean with plenty of towels. I do wish they would put regular blankets in the closet for covering up on the couch though. The complimentary breakfast was superb! The staff friendly and quick. I can not believe how many people do not tip. I know its included but come on, these folks work hard, have a great attitude and take fantastic care of their guests! The happy hour was appreciated after coming back from day long excursions! Again, Tip your bartender! The only negative I would have is the hot tub and parents who believe that is their childrens bath tub or swimming pool. I did read the rules of the tub and it says \"children under 18 must be accompanied by a parent\" Personally I do not want kids in my hot tub but I am not the proprieter. I would highly recommend this location to those who want to go to Fajardo or the rain forest as well as the other direction into OSJ. We will come back to PR and are looking at the Embassey Suites in Dorado. Thanks for a terrific birthday. One more point~ I think its excellent that management responds to negative reviews here. it shows that they do care!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Immanuel Bartell","date":"2013-06-11 04:46:03 +0300"},{"content":"I stayed here over New Years with my extended family over New Years. It was very close to the airport, so very convenient, but it was quite quiet. No plane noise. The hotel boasts a multistory atrium and is well appointed. There is a daily happy hour with free beer, wine, and chips which is very nice for a quick snack and a full included breakfast everyday with omelettes, eggs, bacon and much more! The rooms were spacious and as the title says are all suites, with both a bedroom, living room with foldout couch, microwave and refridge. The beds were very comfortable and the room updated and clean with good housekeeping. The pool area was quite nice and although very near an overpass was nicely screened by trees and vegitation. The pool was quite cold, and unfortunately the hot tub was broken for 3 of 5 days. I found the staff behind the desk not quite as welcoming as I'm used to. They were unhelpful in assisting with a printer which would not print in the business center, however the business center was free! $19 per day for parking is a bit high as well. The hotel is a block or two from a very nice beach and has included free towels and beach chairs for hotel guests! There are numerous nice restaurants and inexpensive options as well within walking distance. The hotel and airport are about 20 mins from the fort and the old town area, so a car, bus, or taxi will be necessary to visit these areas. Just for new years, we decided not to do the $89 per person buffet and partied in our room, but the open balconies and atrium allowed us to enjoy the confetti, live music and festivities from a commanding view of the 2nd floor open balcony and atrium. And much new years revelrie was occurring on all the hotel balconies, so was the best of both worlds! The rooms were remarkably well insulated, I think helped by the extra space of the living area, because even though we turned in before the festivies were over downstairs, I did not hear any extra noise! There is a casino inside as well which I did not visit.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Joaquin Kutch","date":"2012-03-08 12:30:39 +0300"},{"content":"Close the beaches, restaurants, clubs. Nice Hotel, but Puerto Rico was the real selling point. Had to walk about 2 blocks to get to the beach, but its is incredible. The hotel staff are just amazing and the hotel quality is good, clean and in good shape. No balcony and no exceptional view, but you don't need that. The pool was nice, happy hour was good, the breakfast was incredible. A little pricey, though. Great experience, never seen so many good looking women! A that includes the hotel staff.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Brant Conroy","date":"2015-07-31 12:53:28 +0300"},{"content":"The hotel is conveniently located minutes from the airport. We arrived early in the morning. Melvin at the front desk was wonderful. He directed us to the buffet breakfast with cooks also preparing made to order requests. The breakfast was hot with lots of variety to choose from. The staff was prompt in meeting guests needs while keeping supplies stocked. We then did some gambling in the on site casino and before we knew it our room was ready. When we arrived at the room it was fresh and clean with a big bathroom, coffee maker and mini-refrigerator. There was a nice grocery store and pharmacy within short walking distance. We enjoyed the bartenders at the complimentary happy hour. They were very friendly. The hotel is a brief walk to the beach, however, we enjoyed the pool so much that we never found the need to go to the beech. When I had a problem with my cell phone, Christina at the front desk was very helpful in locating a sprint store nearby. Nice hotel and staff. Would definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jeremy Baumbach","date":"2015-12-12 15:03:12 +0300"},{"content":"Stay was from May 15th thru the 19th. Arrived in SJU around 1:30; but didnt go directly to the hotel because I knew check in wasnt until 4pm. Rented a car from SJU and we went directly to Plaza Las Americas to check that out. Got to the Embassy Suites around 5pm. Check in was a breeze. I asked for a room overlooking the SJU runway and they quickly accomodated. The suite was very nice. There were 2 beds for the kids and I slept on the pull out couch. Although, when I woke up the next morning I began to itch from what I can only think were some type of bugs. The kids didnt complain of itching so I was okay and decided I could live with it. Anyway, back to check-in on the first day, we went directly to the pool and relaxed. The next morning, Sunday May 16th, my birthday, I woke up to a note under my door that there was a 5.8 tremblor in the zone of Mayaguex which is about 120 miles west of San Juan. It occured about 1am however I didnt feel it. It woke my son up. I didnt notice any items had shifted. But, what a bang to start a birthday. Anyway, back to the hotel. The breakfast buffet is everything other reviewers have said. They cook omlets to order. Plus, there is bacon, sausage, potatoes, corn beef hash, pancakes, french toast, fruits, cereal, juice, coffee, hot chocolate, et al. The atrium area on the weekend had vendors that were showing their wares(sp). There was even a man who was making pottery with a clay machine. It reminded me of Demi Moore in \"Ghost\". The nice part of that was that he would let the kids try their hand at pottery making. The only downside was Carolina experienced some torrential downpours that flooded the streets and consequently affected the roof and subsequently the pipes which caused some problems. Specifically, there was no water coming out of the shower. I called the front desk and they told me it would be rectified in \"10 minutes\" Maintenance came to my room twice. All told it took approximately 90 minutes. The maintenance man was so apologetic that there was no way I could hold onto my disgust. We did experience the opportunity to eat at the Outback Steakhouse on the property and the staff was great. To be honest, the food alright. The kids loved it though. Since it was my birthday, they sang happy birthday to me in both english and spanish. Another night I got pizza for the kids from the Atrium Cafe. They didnt have any complaints. Because there are so many fast food places nearby, like Church's Chicken, Ponderosa, Burger King, Chilis, et al, everyone should be able to dine on what they want and be happy. I came to Puerto Rico for my 50th birthday and a vacation. Lastly, to have a relaxing good time. And I did. Lastly, the Manager Reception was wonderful.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Willy Price","date":"2013-03-20 02:54:32 +0300"},{"content":"Things that I didn't see in other T.A. reviews: (1) There are two pools, an adult pool, and a very shallow kids pool, really more of a toddler pool. (2) The pools aren't heated, and can be quite cold on relatively chilly days. (3) We traveled with two little ones and a nanny, and the suite was adequate size for us. (4) Besides the Outback Steakhouse there is a Noble Romans with (yucky but edible) pizza, hot dogs, and coffee downstairs. (5) Room overlooking the atrium can be noisy, but not all rooms overlook the atrium, so ask for one that doesn't. You might still, however, have a lot of street noise. (6) The free booze at night attracts a rather white-trashy crowd. I'd much prefer if they had less alchohol and some real appetizers, instead of stale chips. (7) Among the restaurants in easy walking distance are Pizza Hut, Taco Bell, KFC, Church's, Subway, Burger King, a Chinese place, a Puerto Rican place (great food, crappy service), Wendy's, and more. The front desk won't tell you about any of these places unless you ask. (8) Don't rent a car to go to Old San Juan, parking is a huge hassle. But if you are going anywhere else, it's likely going to be cheaper to get a car on Hotwire than to take taxis. (9) The area by the kids pool is right by the highway, plus there was a lot of construction noise, not so pleasant. (10) Get to the buffet before 9 if you don't want a huge line. All in all, we had a nice but not fantastic stay. I give the hotel slightly more than 3.5 stars based on value, but I'm sure there are much nicer hotels in San Juan, on the beach, with heated pools, less noisy, and so forth. But traveling with 3 adults, this hotel saved us from having to get two rooms, and we all got a nice free breakfast, so the tradeoff was worth it.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Danial Schiller","date":"2014-06-03 17:33:38 +0300"}],"public_likes":["Santino Schneider","Amber Fritsch","Sadie Crona","Rafael Mertz","Tyree Jast","Jordane Rath Sr.","Myrna McDermott","Maryjane Rohan","Megane Boehm"],"vacancy":true,"description":"The OJ jury was sequestered here. Convenient to MOCA, Disney Concert Hall, upscale Noe Restaurant and Bar is onsite.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}