{"title":"Yosemite National Park","name":"Housekeeping Camp","address":null,"directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_HousekeepingCamp.aspx","checkin":null,"checkout":null,"price":"$94 per night","geo":{"lat":37.740809,"lon":-119.579471,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33885,"country":"United States","city":"Yosemite Valley","state":"California","reviews":[{"content":"Unfortunately, I had the misfortune to stay at this hotel during a business trip to Dubai. Unfortunately, the hotel was booked at the last minute and I did not get a chance to check Trip Advisor to get reports. It is simply the worst hotel I have ever stayed in. I arrived at the hotel after 12 a.m. after a long trip. The reception was o.k. and the receptionist whilst not the friendliest was efficient. The minute I opened my room the stench of smoke hit me. The room was dark, smelly, dirty, dusty and very dated and dreary. The bathroom had a dated plastic bath, a shower that was a joke and towels that were almost threadbare. I was so tired I decided not to complain and decided to go to bed. The bed was the hardest most uncomfortable bed and I would more than likely have been more comfortable sleeping on the floor. The carpet was simply filthy, stains all over it and it looked as if it hadn't been hoovered in ages. The noise though the night in the hotel was unbearable and the bell from the lift could be heard all down the corridor. After a sleepless night I asked at reception if I could be moved and was told there was no available rooms. The next two nights were the same, and if the hotel hadn't been paid for I would have moved. After reading the previous reviews I will agree with the writer who said there was a question mark over prostitutes. There is definitely an air of seediness about the hotel and the nightclub that is attached to it. A lot of guys seems to turn up and meet up with Filipino women who are employed by the hotel. On the last day I went up to have a look at the pool and it was a tiny bit bigger than my bath - what a joke!!!! I would definitely not recommend this hotel - it is not a 4 star, nor a 3 star nor in fact any star. It is a disgrace and I can't think of one good thing in its favour. Avoid this hotel at all costs.","ratings":{"Overall":1.0},"author":"Esperanza Denesik","date":"2015-11-22 16:52:03 +0300"},{"content":"My husband and I stayed at Ca'Pagan for two nights on our first trip to Venice. Staff were friendly and knowledgeable and Lorna gave us some great restaurant recommendations and interesting suggestions of places to visit. The room was clean and comfortable and even more beautiful than the pictures suggest. The location was in a quiet but elegant street, but close to major sights. Would thoroughly recommend this hotel and would love to go back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Sid Nicolas","date":"2013-08-31 18:27:04 +0300"},{"content":"Good location in a residential area 15 minutes from St Marks Square. Room was recently renovated, but quite dark. The black gold gilded wall paper and dark furnishings were too heavy for the small room that had little natural light. All rooms were different and I think that other rooms may have had brighter decor.  Staff were very friendly and helpful and really made this place very special.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Misael Muller MD","date":"2012-12-02 11:51:37 +0300"},{"content":"I can't say enough about this wonderful hotel. The location was easy to get to - just a few steps from the San Samuele water taxi stop off the Grand Canal. The area in which the hotel is located is quiet and away from the strange odors that sometimes eminate from the canal. It was in close proximity to everything including the charming Campo Santo Stefano where several terrific restaurants are located. The room was on the small side, however, it was clean and beautifully decorated. Lorna was amazing! She provided invaluable advice on where to eat, shop for souvenirs and places that shouldn't be missed while in Venice. I couldn't be happier with this hidden gem that we were fortunate enough to find!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Jasper Smith","date":"2013-10-20 08:13:12 +0300"},{"content":"All i have are great things to say about this hotel and i could go on forever, but i won't. Instead ill just list a few: *Lorna - the perfect hostess - this hotel would not be the same without her. Nothing is too much trouble and she goes out of her way, consistently, with every guest. *We stayed in the Cassanova room - beautiful and romantic. Good size for Venice and the most gorgeous double shower with lots of hot water!!! *Location is perfect - 2 min walk to the water taxiis and we walk everywhere in Venice. Nothing more than a 15min walk away. And Lorna maps it all out for you, very easy to follow. *My now finance actually booked this hotel as he proposed to me in the middle of San Marco square on sunset, He had arranged for a bottle of champagne to be in our room when we return from dinner. And there is was on ice waiting for us when we got back, *My final words.... the most quiet hotel room i have EVER stayed in. I was a flight attendant for 10 years and have stayed in my fair share of hotels around the world but this room bets them all..... i literally couldn't hear anyone the entire time i was in the room, not even in the hallway! Ca' Pagan thank you so much for making our stay unforgettable! We will return i promise you that!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sammie Hegmann","date":"2014-05-18 18:20:12 +0300"},{"content":"We just spent a couple nights here and loved it. Mr. Pagan did an elegant restoration of an apartment building to create a boutique hotel with 6 rooms, all on the 2nd floor (1st floor in European terminology.) The ground level floor contains the reception desk, a beautiful lobby and the breakfast area. Each room and the common areas are decorated in a lavish but tasteful \"Venetian\" style. You really feel like you are in a palace. Lorna at the front desk is British and gives very helpful walking and dining suggestions. Definitely enjoy a meal at the Trattoria da Fiore just down the block. Not cheap, but a special experience. This hotel is only a 10 minute walk from St. Mark's, but its neighborhood is quiet and not overrun with tourists like other parts of Venice. It is also just a few yards away from the San Samuele vaporetto stop and doesn't require crossing any bridges which is nice with luggage.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Orval Donnelly","date":"2013-08-04 04:28:37 +0300"},{"content":"Barcelo Punta Cana among the best       Shop, stroll, sun and sand ... what are you waiting for?","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Aimee Emard","date":"2013-03-23 16:49:48 +0300"},{"content":"Frustrating Vacation Our vacation started with great disappointment when we received our welcome pamphlet it indicated that we were booked at the Catalonia, we thought this was a mistake.. when we pointed this out to our rep he simply told us to go into the bus and the lady will explain everything to us. When we got on the bus and we started talking to a few people it appeared that everyone in the bus had the same issue.. Sure enough the lady came on the bus, she was a Barcelo rep, she explained to everyone on the bus that Barcelo overbooked and they were sending us to another hotel which is was an upgrade to the Barcelo and to compensate us Barcelo was giving us free 7 nights accommendations, we would have to find our own airfare. Well, this did not work for us because the only reason we took this last minute vacation was because we wanted to spend time with our family who were staying at the Barcelo Palace. Soooo, we explained this to the lady and she said that the best she can do is pay a couple days of transportation for us so that we can spend some time with our family. After spending a couple of hours on the bus at the airport , the bus finally left. We got to Catalonia which by the way I didn't like this hotel. To make this long story short we decided to take a taxi to Barcelo Palace so that we notify our family, we knew that they would be worried about us because we were 5 hours late. Sure enough with some hassel from security they let us in, we met up with our family who notified us that we have a room registered waiting for us and the hotel is waiting for us........Three cab fares later, late at night we finally were in our hotel room which we originally booked. WE are now fighting with Barcelo because they will not honor the 7 free nights because we had our room. Meanwhile, alot of the other guests arrived the next day and are still getting the free accommodation's. Between sand flees and mosquitoes bites, I would not recommend this resort to anyone. For the same price we payed here we could have got a much, much better resort with no problems. P.S. some people on the plane coming back said that they refused to go to the Catalonia, so they were sent to the Excellence and Grand Oasis which are top of the line. I am an experienced traveller ( over 20 years) and have never encountered such a mix up, if you read up on the Barcelo reviews you will find out that this is standard for them....Never again.","ratings":{"Service":1.0,"Business service":2.0,"Cleanliness":2.0,"Check in / front desk":2.0,"Overall":2.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Brant Wuckert","date":"2014-11-03 13:36:58 +0300"},{"content":"Value for money but with some hiccups Vacationed at Barcelo Beach for a week starting on Jan 6th.Beach:Good beach but it contained some seaweed along the stretch that belonged to Barcelo. Take a long sleeve garment since it is a touch cool at this time of the year especially in the shade and evenings. Lots of chairs, plenty of towels, relaxing to walk along the beach in the afternoon. Beware or welcome the topless females on the beach.Pool:Not kid friendly - we used the pool at the Casino since it was quiet and had a fairly large area in the pool for kids / infants. Pool a the Beach resort is very busy on the weekends when the locals arrive and it could get messy at times.Food:Was above average. The buffet at the Beach resort provided the largest selection of items. Good selection of fruits. Try out the grouper filets at the cooking station. The fruit smoothies were good .. use a cup of yoghurt. Italian was not very good same goes for La Uva which was opened for lunch in the Caribe section of the resort. Mexican was good. Did not try the steakhouse.Room:Was clean and maid service was good. When we arrived in the room the toilet was not cleaned properly but was rectified quite quickly. Average room and not many english channels .. not a problem since most of the time was spent out of the room.Golf:Good value for money. Greens was slow but acceptable. Fairways were okay but was damp due to rain. Tee boxes were acceptable. Good practice and chipping greens. Driving range was okay.Fitness center:Okay. Seats on the bikes were hard so use a towel on the seats. Limited weights but was enough to work up a sweat.Service:Overall was good and staff fairly responsive to our requests. Trolley drivers (free transportation to all sections of the resort) were not attentive ... I observed four incidents where accidents occured due to an inattentive driver. We complained and found an improvement in the driver attitudes. Tipping:Tipped the maid $2 per day and left $1 to $2 per meal depending on service.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Mercedes Nikolaus","date":"2015-05-19 03:30:19 +0300"}],"public_likes":["Derick DuBuque","Buddy Balistreri","Lenore Lynch","Lorenza Brakus"],"vacancy":false,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Despite its name, Housekeeping Camp (located near Curry Village) offers 266 sturdy tents for visitor lodging.  The &quot;tents&quot; have a concrete floor, three concrete walls, canvas tops, and sleep six in bunk beds and double beds.  Linen is not provided but may be rented for $2.50 per night. Open during the summer season only.  Housekeeping Camp is the only lodging in the Valley that allows for a fire and cooking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}