{"title":"Cardiff","name":"St. David's Hotel and Spa","address":"Havannah Street","directions":null,"phone":"+44 29 2045-4045","tollfree":null,"email":"stdavids.reservations@principal-hayley.com","fax":null,"url":"http://www.thestdavidshotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.461663,"lon":-3.168237,"accuracy":"APPROXIMATE"},"type":"hotel","id":5078,"country":"United Kingdom","city":"Cardiff","state":null,"reviews":[{"content":"We stayed at the Pacific Terrace Hotel for 5 nights October 11-15. We traveled with our 2 1/2 year old and all had a wonderful time. The best part of this hotel is the location right on the beach. The location is also great for visiting other attractions - we were a half hour from Legoland in Carlsbad (a must do if you have kids) and only a 15 minute drive downtown, to the zoo and Coronado. La Jolla was only 10 minutes away. Second best are the rooms - just gorgeous and very comfortable. The plasma TV was a nice luxury. The neighborhood around the hotel (Pacific Beach) caters to 20 somethings with lots of surf shops, bars, restaurants and boutiques. It wasn't our scene but we felt safe to walk around and enjoyed eating at the various restaurants. The Broken Yolk for breakfast was great. The hotel's continental breakfast is nice, but simple. The staff was friendly and very accommodating. All in all, this is a great hotel and we will definitely be back again. To whomever gave me the referral for Amanda Prince photography - thank you! Our family pictures on the beach turned out beautifully. My only disappointment was the weather. It was cloudy, cold, windy and rainy for 3 out of the 5 days we were there.","ratings":{"Overall":5.0},"author":"Ebba Kemmer","date":"2012-03-08 05:00:04 +0300"},{"content":"The staff in this hotel go out of their way to meet the customer's needs. If ever there was a hotel which really looks after you then it's this one. We very brought free soft drinks round the pool, breakfast is included in the price as are cookies at 4pm and wine which is served between 4-5pm. If you are too relaxed to get off your poolside lounger then the wine is brought to you! It wasn't the cheapest of the 5 hotels we stayed in during our tour of California and Las Vegas but it was the most relaxing and worth every penny! I was a bit worried about the location having read previous reviews but saw less homeless people hanging aroung this hotel than we did in the others we stayed in. The cost of parking our hire car in the secure underground garage was comparable or less than other hotels. Our teenagers also felt welcome and relaxed here. We couldn't fault this hotel in any way and will always remember our time here.","ratings":{"Overall":5.0},"author":"Ignacio Torp","date":"2013-04-12 17:41:59 +0300"},{"content":"This place is the best hotel ever! My family & I stayed here in Feb. of 05 and had a completely excellent time. From the moment we stepped into the foyer, there were nothing but smiles and helpful staff. Even though there was some renovation going on, they were courteous and very dilligent regarding warning us about areas that were unsafe. We were upgraded to a beautiful room on the 3rd floor, great breakfast, gorgeous views of the morning sunrise, surfers, and dolphins frolicking. The pool was very clean and large enough for everyone to enjoy, especially with the complimentary wine service! How can you put a price on someone bringing you free wine while you watch the kids play in the pool , it's fun to watch all people walking by on the boardwalk....it's so easy to stay here that it's not fair to have a vacation like that and hold all others to it's standard. We rented a car, went to SeaWorld and the Zoo, spent the rest of the days by the pool & the beach. I can't wait to stay here again!","ratings":{"Overall":5.0},"author":"Ms. Adrian Zieme","date":"2012-08-20 12:20:44 +0300"},{"content":"Blooms. Essex. UK. Visited April 2007 We booked this hotel based on trip advisor reviews and some travel books. To say we were disappointed is an understatement. Our ocean view room was hugely expensive at $400 but because of the price and reviews we were expecting something luxurious. It certainly wasn't. The view was great but the room and the hotel was very tired and needs updating. Our room was musty and the bathroom was tiny with the shower being something from the 70's. We had previously stayed in Las Vegas at $100 per night in a room bigger and better. The breakfast was fine but what a small and dingy room. The fitness centre was a joke. Not big enough to swing a cat in. Outside of the hotel is a toilet block so don't have a room on the left of the hotel as you will look out over it and the surrounding area is full of wooden shacks with quite a few homeless and young people partying. The staff were very pleasant but our stay was ruined as we felt the room was only worth max. $200. If you go here do not spend any more. I can't stress enough how it didn't meet our expectations. In fact we left early as we were so disappointed.","ratings":{"Service":3.0,"Cleanliness":2.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":2.0,"Location":1.0},"author":"Janessa Fadel","date":"2013-10-13 09:37:10 +0300"},{"content":"This is a wonderful small hotel perfectly situated at Pacific Beach. Location-wise you are close to everything - in particular, the beach. We stayed in a premium ocean view room - and, it was worth it. The Hotel itself is very nice, rooms are clean and very tasteful. Staff is friendly and helpful. I was in town for a business meeting, and my wife came along for a mini-vacation. Rather than stay at the big box hotel where the conference was held, we stayed at PT and it definitely made the whole trip that much more enjoyable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Logan McGlynn","date":"2014-02-07 21:29:23 +0300"},{"content":"You will not be disappointed in this hotel. This was our first visit to California and will not be our last. We were overwelmed with how beautiful our room was and the view was fantastic. The beds were fantastic and the turn down service was nice. I usually have trouble sleeping in hotel beds but not here. The staff was so friendly and helpful. The breakfast was okay but nothing fantastic. We were able to use the free parking every night. Sometimes we would have to park by the boardwalk and then wait until about 9 or 10pm and then park in the free spots. The boardwalk parking is free but you will be towed or ticketed after midnight because of the street cleaners. The beach is right outside the gate of the hotel. We enjoyed watching the surfers early in the morning and staying up late and watching the waves crash the beach. The gift shop is reasonable and has many gifts available to take home to remember your trip. Again, you will not be disappointed in your visit to the Pacific Terrace Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Itzel Frami","date":"2012-02-05 09:21:03 +0300"},{"content":"I was quite impressed with the beauty of the hotel and it's setting. The rooms were so tastefully decorated and the amenities were plentiful. It rivals any boutique hotel I've stayed in anywhere. The staff were very friendly, helpful, and courtious, making sure any need was attended to. In particular Rick, the valet, was very knowlegable about the area and the concierge was impeccable. I have no negative comments at all. I'd recommend this hotel to any discriminating traveler.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Domenico Strosin","date":"2014-10-11 08:18:43 +0300"}],"public_likes":["Veronica Gerlach","Sally Nolan","Rosamond Spencer","Rosamond Beatty","Maximo O'Conner","Mrs. Lue Pacocha","Syble Abbott","William Ullrich"],"vacancy":true,"description":"Havannah S. A really great stay for those who want that little bit extra. Fronting the bay it offers spectacular scenery and is little more than 5 minutes away from the cosmopolitan bay area. Built and originally operated by the Rocco Forte Group, it was sold in 2006 to the Principal Hayley Group.","alias":"The St. David's Hotel & Spa","pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}