{"title":"Windermere","name":"Kingfisher Lodge","address":"Limefitt Park, Troutbeck, Cumbria LA23 1PA","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://windermerecabin.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.420288,"lon":-2.9033,"accuracy":"ROOFTOP"},"type":"hotel","id":33426,"country":"United Kingdom","city":"Troutbeck","state":null,"reviews":[{"content":"This is a beautiful hotel in a great location, just blocks from the Barri Gotíc, with easy access to Metro and RENFE train stops. The private terrace is a great, usually quiet place to enjoy your goodies from La Boquería. Our balcony room was nice, but the balcony wasn't large enough to sit out on (though we could see chairs on the larger balconies for other rooms). Triple shutters helped to keep most of the street noise out. On the downside, the Wi-Fi was very flaky, especially in the room, less so on the terrace. The bathroom had a bit of a mildewy odor and the staff, though polite and professional, wasn't as warm and helpful as you might hope. Also, as others have observed, there are no in-room fridges or mini-bars. Overall, a nice place to stay, but if you're looking for more personal service or more amenities, you may want to look elsewhere.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Vidal Altenwerth","date":"2015-09-21 01:49:57 +0300"},{"content":"The hotel is a 3 star hotel on a lovely street which is not too busy but has all the bars, restaurants etc you want, and is 2 mins from the Plaza Catalunya (with metro, local train connections, etc). It is in a lovely converted house with a beautiful stairwell, but the view from mine and I guess most rooms is very limited. The room is also small but very well fitted out, and modern. Despite the internet being down for my 1st evening it is probably my favourite (of 4) hotels in Barcelona - but if you want to shower without washing your hair, go elsewhere. For some reason the shower head is directly above the (well fitted out) cubicle and maybe 2.75 metres up (old building = high ceilings) so showering is like being in hot rain.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Roberto Ortiz","date":"2015-05-29 08:05:57 +0300"},{"content":"We booked the Praktik Rambla because of all the great reviews here, and were really looking forward to staying here. I thought this was a decent hotel, but I don’t think it lives up to all the raving reviews. The location of the hotel was quite perfect. It is just north of the most touristy area of Barcelona, which makes it very convenient but also not as chaotic/messy as the area south of it. It is also a block away from a metro interchange station (with multiple lines) and three blocks form a Rodalies station on the R2 line (i.e. frequent and direct trains to airport and Sitges, two of our destinations). One of our key criteria was to be close to the gay bars/clubs (so we can drag our tired a**es home in the middle of the night/early in the morning without too much hassle) and this hotel was perfect for that. Being close to the gay area also means that there are tons of nice/trendy restaurants nearby that less touristy. The front desk staff were friendly, knowledgeable and helpful. Though since it is a small boutique hotel it usually only has one staff member at the front desk. This means if there is a chatty client (or someone who did not do their travel research) in front of you, you might be waiting for a long while. The housekeeping staff can be a bit more attentive (the bathroom counter was dusty when we got there; we ran out of shower gel and were not given more for two days), but nothing too major to complain about. We stayed in standard double rooms. There were two legs to our trip so we stayed in two different rooms that were very similar. While I appreciate that the hotel boosts that “less is luxe”, the rooms are too minimalistic in my view (and I am someone who usually appreciate chic and simple). There are certain basic functional features that are missing, such as a desk, a chair, an alarm clock, a small fridge, a closet, an ice bucket, etc. The rooms were trendy and well decorated, but they were really small (even without the aforementioned furniture).","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Jeff Dietrich","date":"2014-03-21 00:36:00 +0300"}],"public_likes":["Mable Oberbrunner DVM","Jon Gibson","Brooklyn Maggio"],"vacancy":true,"description":"Is a traditional riverside log cabin in the heart of tranquil Troutbeck.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}