{"title":"Los Angeles/Downtown","name":"Miyako Hotel","address":"328 E 1st St","directions":null,"phone":"+1 213 617-2000","tollfree":null,"email":null,"fax":null,"url":"http://www.miyakoinn.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.049693,"lon":-118.240191,"accuracy":"ROOFTOP"},"type":"hotel","id":16638,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"I have come back to this property everytime I go to Puerto RICO. Once you learn where this property is at It is easy to get to.The property is always kept clean, if you want to relax one day of your trip this is where you want to be, It is so relaxing beside the pool. If you want to book do it in advance because families from all around the island stay here on weekend getaways. the prices are reasonable. the staff is very helpful especialy one guy by the name of Waldemar he makes your stay there as comfortable as he can. The supervisor is Annie she is also very helpful she speaks English for those that do not speak spanish. She will give you the sightseeing spots in the area and where to dine.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Norwood Strosin","date":"2012-07-07 09:09:59 +0300"},{"content":"Parking! Can you believe guest reserved parking is more than 200 meters away? Hotel employees have bad humor and bad service!","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Mr. Clifton Kohler","date":"2014-02-19 06:45:01 +0300"},{"content":"This week was my second stay in three months. The rooms were clean and the rooster in the parking lot outside my window was a nice touch. As a city boy, I thought the whole \"cock-a-doodle doo\" thing was a myth -- now I know it's not. The service staff was very nice...the desk staff will provide bottled water at no charge upon request. The restaurant is nothing special but there is an Applebee's about one mile north. And you can't be the $3 blackjack table. Not sure there would be any reason to stay here for vacation but it was fine for business.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Evelyn Stiedemann","date":"2014-12-15 18:06:22 +0300"},{"content":"The rooms were okay, but not for the price you pay. The pool and restaurants were nice. The view of mountain tops was a plus. The club closes at 2am, and nothing but 40+ dancing salsa. Casino was okay but thought it was too small. Never order a long island ice tea there. Stick with one liquor drinks. It is a relaxing place to stay but want to wait for a special.","ratings":{"Overall":3.0},"author":"Mr. Tiffany Collins","date":"2012-11-10 11:08:25 +0300"}],"public_likes":["Tamia Koch"],"vacancy":true,"description":"A downtown Japanese hotel offering classic comfort accommodations, meeting rooms, and a health spa with Shiatsu massage, close to attractions.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}