{"title":"New Quay","name":"Y Stabl","address":"10 Picton Terrace, New Quay, SA45 9QA","directions":null,"phone":"+44 788 565 4957","tollfree":null,"email":"enquiries@writebythecoast.co.uk","fax":null,"url":"http://[http://www.writebythecoast.co.uk/index.php/studio/]","checkin":null,"checkout":null,"price":"£40 to £90 per night","geo":{"lat":52.2139,"lon":-4.3602,"accuracy":"APPROXIMATE"},"type":"hotel","id":37248,"country":"United Kingdom","city":"New Quay","state":null,"reviews":[{"content":"My husband and I just returned from a wonderful 7 nights at the Riu Yucatan and cannot say enough about it. The food was very good, although, I was a little disappointed that there was not a bigger selection of Mexican food, other than that, the Fish the steak....excellante! The bartenders and service were absolutely wonderful. We did tip the gentlemen who stocked our room fridge and he made sure it was full of Corona, Pepsi and Water everyday. The staff is very extremely helpful and made sure you were taken care of. The bartenders work their tails off and are a lot of fun. Make sure you ask for an extra shot of liquor and they will make sure you will have it everytime. Israel and Gaspar at the front bar in the lobby are great to mess with. The entertainment staff by the pool were very friendly and do a great job. Miaka left Germany after vacationing with her family to the Riu and is now working at the hotel for 6 months with the entertainment staff. There is a show everynight at the hotel, don't expect Broadway, but it's something to do and something to look at when you're drinking at the bar. We met a lot of people, but not many people from the States. A lot of people from the UK, Holland and Australia. For those of you that are not used to topless beaches and men wearing speedos....prepare yourself....there is a lot of it!!!!!! My husband was in heaven. Don't forget your cups and your huggies and your collapsable cooler. The cooler is nice if you're sitting on the beach, you can bring the beer, water and soda from your room along. The beach is absolutely gorgeous!!!! The white sand and crystal blue water....breathtaking and big. We never had a problem finding chairs on the beach...the pool was a different story. If you want to sit by the pool, get there early and put your towels down....like 7:00am, otherwise, you're not going to get a good seat. The pool was a little small, but who cares when you have that beautiful beach. We went to Cozumel for a day and did a snorkeling trip...it was okay...me and do something else. Cozumel has some nice shopping, plus Hard Rock and Senor Frogs...that's about it. We went horseback riding and you ride the horses on the beach and then they let you gallop them and then take turns riding them in the water. That was cool, but there were way to many people and it was very nerve racking. We had a trip booked to Coba, but we had to much Tequila the night before and we missed that one...oops! Do yourself a favor and take at least one day/night to go to town on Playa Del Carmen and go to dinner. We went to the Blue Lobster, which was fabo, but there were tons of cute nice restaurants that I really would have loved to try. It is really fun down there...fun bars, cute shops....it's worth it! Yes, we did see monkeys in the trees and I saw a huge aguana over at the Riu Tequila, so they are there!!!!! I took so many pictures of the monkeys, my husband thought I was nuts!!!! To wrap it all up...it was a wonderful vacation and we hated to leave, but we will definitley go back.","ratings":{"Overall":4.0},"author":"Yoshiko Hintz","date":"2012-08-19 16:34:07 +0300"},{"content":"I picked this hotel because it was reasonably close to the U-bahn line my husband needed to be on for work, it got good reviews on tripadvisor, and it was cheap. Internet: When we checked in we asked the woman at the desk if the room came with free wifi. She said only if you paid for breakfast (7.50 per day), but she couldn't tell if we had paid for breakfast. One of her colleagues came to her rescue and showed her that we had not paid for breakfast. So then the wireless internet cost 5 euros a day. What she didn't tell us was because of the password system only one computer/device could be logged on at a time, unless you pay 10 euros a day to get two passwords. And the login screen was deathly slow to appear, and sometime didn't show up at all. The wireless occasionally stopped working entirely, or kicked us off and made us login again. It was quite annoying. There is also free wifi in the lobby, but you need a password to use that as well. ROOM and BED: The apartment was very clean and modern looking. The bed was two twin beds in one frame, with the annoying crack down the middle, and separate twin comforters for each person. The mattress was firm, and we found it comfortable. The room was small with no drawers--just a few hangers to hang shirts up, and open shelves on only one side of the bed. I would have preferred shelves on both sides of the bed, but it was acceptable. Note there is no telephone in the room so if you need to talk to the front desk you have to go down. There is a public telephone in the lobby. NOISE and TEMPERATURE: The room was pretty quiet. We heard only muffled sounds from the neighboring room. The room was quite warm even without the heat on, but we just opened a window and the temperature was fine. The hallways were very warm. BATHROOM: The bathroom had a very nice modern shower with plenty of hot water and good pressure (but no bath). But the shower could not hold a constant temperature. The water switched between cool and boiling hot. I almost got burned several times. This was an issue at all times of the day. The bathroom also had a hair dryer. FOOD: We never tried the breakfast. FITNESS CENTER: None. COST: 74 euros a night. Pretty cheap. (Plus 5 euros per day wireless costs per computer.) LOCATION: The location was okay, not great. It's pretty close to the Wittenbergplatz U-bahn, but at night when it was cold I personally wished it was just a tad closer. (I'm a wimp when it comes to the cold.) The street it's on is pretty busy and the area in general is not at all charming, and there's not a lot in the immediate vicinity in terms of restaurants and cafes. There are more charming areas closer to Savignyplatz or Nollendorfplatz. OVERALL: If you're planning to stay in this area, the Motel One Berlin-Tiergarten hotel is an acceptable choice (except for the constantly changing temperature of the shower and the annoying issues with the wifi). But next time we will probably try a different hotel.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Joshua Lesch","date":"2015-03-30 20:10:15 +0300"},{"content":"I had four nights in Berlin and booked a familiar up scale chain, Hilton, for safety the first night. Got a good rate, but found the usual Hilton \"sock it to 'em\" nonsense unacceptable and booked this unknown hotel for the remaining three nights. This was a great move because my three nights at Motel One came to less than one night at the Hilton!!!! As the other reviews do point out, you must be willing to give up some perks: (1) there are no phones in the rooms. For me no big deal except that you cannot phone the desk and ask for help with internet or whatever. (2) Rooms are compact, but I have slept in smaller ones for this price and more. (3) Not exactly in the mainstream although a short walk takes you to U-bahn, trains or buses, plenty of restaurants and shopping. (4) City tour buses stop nearby, but not at front door.(5) no restaurant but a lobby bar that is well suited for evening drinks or coffee. The lobby here is huge and breakfast (Add 7.50 Euro) is great. What isn't in the rooms (such as an iron and board), you can get with a small deposit at the desk. Free WiFi in lobby and included if you buy breakfast. Internet in the room was excellent. Hotel is well insulated and the room was quiet. Bottom line: A fine place to hang your hat in Berlin and you will save enough to dine out fashionably in th evenings.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":3.0},"author":"Christop Zieme","date":"2014-10-12 07:03:26 +0300"},{"content":"The hotel has been famous since 1984 for it's beach parties, and the hotel suites are located a block away. The first thing we noticed was how our nights sleep were so peaceful, and that the suite complex were very clean. Our suite in particular was very spacious although some of the decor was probably dated back to 1984! The hotel is well located within minutes of 5th Avenue, the many restaurants, bars and clubs, and the only noise was from guests on New Day at about 10am who decided to play their house music as if they were still at the party! This happened again a couple of days later but the problem is reception is located a block away from the suite complex so trying to explain the exact source of the noise was a bit difficult especially on the occasion when we were woken up, but they managed to get it the music turned down, and on the second occasion they asked security to intervene and peace was restored to the complex. On New Year Eve guests were advised that breakfast would be available at 11am but in fact the party was still going on when we duly arrived, and we were advised to come back at noon! the same situation happened a couple of days later when we arrived at 7.30am and the party was still happening, but there was no reception to advise us! A concern was reception was available from xxx until 11pm and I often wondered what guests were supposed to do if they needed emergency assistance after 11pm!! The setting for breakfast was fantastic it was a restaurant on the beach but one morning at breakfast one of the waiters was very aggressive in trying to solicit a tip telling us that the tips he received was his sole wages, also on the same day the Dj decided to test the equipment for the party - the music was so loud, and we were not impressed! At the beginning of our booking on at least three mornings we had no hot water, which was quickly resolved! Also for a couple of days the pool was being used for scuba diving lessons and as guests we weren't given advance notice or whether the pool could be shared on these occasions. On New Years Eve we dined at the hotel's restaurant on 5th Avenue we paid in advance because we were arriving on 28 December and didn't want to find ourselves without somewhere to dine on New Years Eve. The restaurant was set in beautiful surroundings however, the meal was a real disappointment, the soup was salty, the salad was swimming in salad dressing, the prawns were over cooked, the rice and vegetables under cooked needless to say with our 10% discount we didn't return to sample the food at the restaurant based on that experience. The management and staff were very helpful in dealing with our concerns although I didn't quiet believe that the reason for the constant parties at the Blue Parrot and surrounding area was due to a music festival, which I explained that if this were the case then guests making a reservation during this period should have been advised so they could research the type of music festival and make a decision whether or not to use the hotel. Having returned home and looked on the internet it seems it was the BPM Festival from 31 December - 9 January 2011, which explains why the atmosphere surrounding the Blue Parrot felt like Ibiza constant partying, which is good if that is what your holidays are about! It would further would have explained why at about 1am on New Years Day the area leading down from 5th Avenue to the Blue Parrot was like carnival really really crowded!! With a fairly high police presence! I think the Blue Parrot needs to determine whether during this period they try and target clientele who are seeking to attend the festival by promoting it's location as a selling point! However on this occasion in our opinion they didn't get it quiet right in managing both the club and suites with the latter losing out!!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":2.0},"author":"Bella Breitenberg","date":"2014-04-10 18:02:32 +0300"},{"content":"Some friends and I stayed at the Blue Parrot Suites in February, 2008 and had a fabulous time. We thought the location was unbeatable - less than one block to the beach and close to all the restaurants/bars/shops on 5th Avenue. The room had a contemporary feel with a small sitting area and the bed was very comfortable (a must for me!). Our room was on the 2nd floor and our friends had a room on the 3rd floor with a palapa and the ocean views from their palapa were such a treat! We also really appreciated having a coffee maker, small refridgerator and DVD in the rooms since we were staying for a week (the super market was a short walk away). There are so many hotels in Playa to chose from it was challenging to make a decision, but based on the rooms, location and the value pricing we went with the Blue Parrot Suites and will definately return.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Dedric Hickle","date":"2013-06-27 10:47:04 +0300"},{"content":"We were in Playa for 8 days, on 3 occassions, we went to the BP to party. On our last night there, we were not brought our drinks for over 45 mins. When we asked to speak with a mgr, we were told NONE were there. We told the head waiter we were waiting over 45 mins for our order . After a few mins a waiter brought us 3 bottles of water and 1 drink, After 5-7 mins another waiter brought a duplicate order. We explained that we only placed the original order. we did tip the waiter as we had the past several visits. We were ignored the rest of the time there so we decided to leave. We asked for our bill and was presented a bill of $50.00USD. For 6 bottles of water and 2 mixed drinks. Half of what we actually ordered. when we protested, we were threatened that they were going to call the police. Being 4 university students from TEXAS, we wanted no trouble, so we did pay it and got the heck out of there. The next day we spoke with an American bussinessman with an internet cafe there in PDC who told us the same thing happened to his son last year... BEWARE! We will not return to the BP.","ratings":{"Overall":1.0},"author":"Evan Homenick","date":"2013-01-17 04:15:18 +0300"},{"content":"This hotel has bought a license from the city to play techno music at earsplitting decibles from midnight until 4 am. They play at maximum volume, leaving the surrounding small hotels largely uninhabitable. Ecological reports show that they are also driving marine and wildlife from the area. If you are brain dead or profoundly deaf or insensitive to sound pollution or voracious capitalism, by all means visit the Blue Parrot","ratings":{"Overall":1.0},"author":"Ettie Langosh Sr.","date":"2014-10-01 02:26:18 +0300"},{"content":"February 24, 2012 HELLO IBEROSTAR TUCAN QUETZAL, I am writing to let you know i was at your hotel from January 31, 2012 to February 14,2012,I had the greatest vacations of my life, and it was not my first time in Riviera Maya, but this hotel is the best . First thing that i want to talk about is, the star friends team who is the best specially one who is name is Yohel , he is the assistant of the manager of the star friends team, he is a very special person who have a nice personality, he talk with all the guests in a different language, French, English and Spanish. Every time that he meets peoples he is always available and talked with them. He is always smiling , he always invite the guess to participate in the different activities during the day and even the night at Showtime he is always there inviting guests for dancing before and after the show or even just talk with them`. He is always in a good mood. That star friends Yohel who came from Iberostar Varadero Cuba and working to your resort in Riviera Maya deserves to be recognized for his good work. We see it, he is very dedicated to his work and he loves it, and we the guests we appreciate,it very much. I have never seen a person so dedicated as him in all my years of travel that i have done. He is the best of the best star friends,,,Yohel keep your nice smile and good work, thank you and hope you will pass the message to him personally. The Iberostar Tucan Quetzal is a very nice resort, with all the forest, the animals, the great staff who are they are so nice, doing their jobs with always the smile and their kindness. I will come back there for sure and I will recommend your resort you can count on it. Francine Gravel I was in building 25, room number 2505..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaia McClure","date":"2013-07-27 03:42:06 +0300"}],"public_likes":[],"vacancy":false,"description":"A self-catering cottage down a quiet lane in the heart of New Quay, a ten minute walk from the beach. Sleeping 2-3, this property has extensive views over Cardigan Bay and is 100 meters from the Wales Coastal Path. Free Wi-Fi and off road parking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}