{"title":"Nice","name":"Negresco","address":"Promenade des Anglais 37","directions":null,"phone":"+33 4 93 16 64 00","tollfree":null,"email":null,"fax":null,"url":"http://www.hotel-negresco-nice.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":43.69466,"lon":7.25839,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20425,"country":"France","city":"Nice","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"November 2010 stayed in a 3 bedroom, Dec. 2011 stayed in a 2 bedroom. Both were very clean, everything worked, nice touch with bathrobes:-) Excellent location for both Disney and Universal-restaurants close by but nice and quiet in resort. Would stay here any time i am in Orlando. Cost for what you get compared to a hotel is excellent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Noah Casper Jr.","date":"2014-07-30 20:34:39 +0300"},{"content":"I have been going to WorldQuest Resort in Orlando for 3 years already. With all the family. We stay in a 3 suite apartment and it's lovely. One mile from Disney. Very near the 4 highway. With a complete kitchen and large spaces. The master suite has a big bathroom with a really bathtub. You can park the car at your apartment front and its very convenient. The price is fantastic. For my next vacation in january 2012 I paid less than 150 US a day for the 20 days I will be staying there. Don't miss it. You will love this Hotel.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Robert Romaguera","date":"2015-12-15 15:02:26 +0300"},{"content":"I found out about this place from a friend. The rooms are clean with essential items for traveling with small children (kitchen and laundry). I was disapointed that I had requested rooms together for a family reunion several weeks in advance and they said they would be able to accommodate us but did not. However I was happy that they moved us to the same building the next day when a room opened up.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Marisa Boehm","date":"2014-01-25 23:05:02 +0300"},{"content":"very good fecilities and very nice staff. I have recommended my friends to stay this hotel when they visit Disney Land in Orlando.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nathanael Torp","date":"2012-09-25 11:40:11 +0300"},{"content":"We stayed in the 3 bedroom, 2 bath unit. When I booked my reservation over a month before my travel date, I requested a room in building 2 on a high floor so we could be near the pool and clubhouse. When I arrived, I had been assigned a room in building 7 on the 2nd floor, at the end of the property next to the swamp lake area. Although you are only about 3 minutes away from Disney, this place is very isolated. There was a lake in the back of the building 7 with warning signs about alligators. Although everything was clean and the unit was modern, well-equipped and only minutes away from disney, I would think twice before I would book it again because of the isolated swamp area it is located in.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Kenneth Thompson","date":"2015-07-02 15:36:07 +0300"},{"content":"My stay was last year, but I am writiting now because I realize that I only post for bad stays at hotels. I traveled and stayed in 2 condos because I had a family of 12 (3 bedroom and 2 bedroom condo). We had an amazing time. We are Disney fanatics but it is difficult for my mother to walk from our hotel room to the transportantion when staying on Disney property. THis is why I thought to try something new. I can say we were extremely impressed. We walked a short walk to the elevator. The room was beautiful and up to date. It was a 10 minute drive to the parks. The three bedroom suite was so beautiful. I loved having 3 bathrooms. I was able to purchase my park tickets there so another convience!!! THe only thing I did not like was that there wasn't a kiddie pool at the time, especially because we had 3 under 6 but oh well. We are leaving for Disney soon and I have to break it to the family that we are not staying there. They are not going to be happy. Hopefully hubby and I can make a trip and stay at Worldquest this November.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Leann Champlin","date":"2013-03-20 19:14:49 +0300"},{"content":"We loved our stay at WorldQuest! Our 2 bedroom accommodations were spacious, clean, well-appointed, and a welcome respite after busy days at local amusement parks. Our boys (ages 3 and 1) loved the jacuzzi tub the most. The resort was beautiful, the pool was refreshing, and the continental breakfast was a nice way to start each day. We were impressed with how friendly and helpful the front desk staff members were, greeting us each day and taking the time to talk to our boys. The daily housekeeping service was delightful - loved not having to do dishes while we were on vacation! The location was perfect - close and convenient to Disney, as well as area eateries, yet once we drove through the gates, we felt like we left everything behind us. The only downside we could find was the free resort shuttle to Disney, as it offered limited pick up and drop off times that did not coincide with our boys' nap schedule. While we ended up driving to Disney each day, it was a very easy drive and truly wasn't a big problem for us. Driving allowed us to come and go as we pleased, which in the end worked out better. Overall we were very impressed with WorldQuest, and highly recommend it! We will be back!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Oliver Hansen","date":"2014-05-21 03:07:14 +0300"},{"content":"We booked this resort 2 months in advance for our Disney Vacation and stayed 8 days. I read many of the reviews on trip advisor and some of them made me nervous before the trip. I am happy to say that all my fear was gone 15min after arrival! Absolutletly outstanding!! We stayed in building 1 in a 3 bedroom suite, and let me tell you it has all the room you need. We have stayed in Disney before and this was our first experience outside the park...Completely worth it, especially when you have a larger group so you don't have to be sitting on top of each other like in the disney resort....and for half the cost. The staff was very friendly and happy to help us anytime we needed anything. We opted to decline the daily room service...we were perfectly capable of washing our own towels and keeping it tidy. The pool was beautiful and never overcrowded..great music playing all day long. We stayed on the ground level and you would think there would be some noise...nope! very quiet. Something you definetly want to have is a car. Super Walmart is a couple of miles away and you can stock up on food (there is no restaurant at the resort) and supplies. All the Disney hot spots are literally only 5-10min drives from the resort (the resort does have shuttles but we loved the flexibility of coming and going as we pleased). The complimentary breakfast was nice so you could get up and get a quick bite and be on your way. I would also suggest you stay in building 1,2,or 3 just because they are closest to the pool. I have nothing but good things to say about this resort and while everyone is entitled to their own opinion I found some of the negative and pretentious ones on trip advisor to be unfounded. Bottom line is we loved it and would stay there again!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Emiliano Walsh","date":"2014-01-13 23:00:27 +0300"},{"content":"I definitely will be back soon. !!! Simply <3 it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jevon Lang","date":"2014-06-18 18:22:39 +0300"}],"public_likes":["Mara Greenholt","Ozella Robel","Broderick Lockman","Luz Gorczany","Dr. Jeremy Macejkovic","Ezra Bogisich","Golda Bogisich MD","Rebecca Gleichner"],"vacancy":false,"description":"Famous landmark hotel in Nice. Houses Le Chantecler, a bar and a brasserie. Worth a look even if you are not staying there.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}