{"title":"London/South Kensington-Chelsea","name":"No. 11 Cadogan","address":"11 Cadogan Gdns, SW3 2RJ","directions":"tube: Sloane Square","phone":"+44 20 7730-7000","tollfree":null,"email":"info@no11cadogangardens.com","fax":"+44 20 7730-5217","url":"http://www.no11london.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4935,"lon":-0.1594,"accuracy":"ROOFTOP"},"type":"hotel","id":16460,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Having travelled to many hotels across the globe,I conclude as many this is a fantastic hotel and experience. The service is outstanding in all operations of the hotel warm welcoming yet not pushy.The room was comfortable clean warm .I had breakfast several days and the choice although limited was freshly prepared and very tasty,the spa and gym is very speacil and should not be missed outstanding facilities and one of the best massages I have had. I can not say enough positives about the Elysian...Guys you are doing a great job if you go I am certain there will be no disappointments.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Jacklyn Rohan DDS","date":"2015-10-07 07:37:41 +0300"},{"content":"Absolutely every last detail was oustanding. What more is there to say?","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lindsay Walsh","date":"2012-05-05 00:47:18 +0300"},{"content":"Having read a few positive reviews on the Elysian, I decided to make reservations during a business trip to Chicago. To say I was pleasantly surprised, would do no justice to this hotel. My whole experience was an absolute pleasure. From the time I checked in I was aware of a professional but warm and friendly disposition of the staff, the very well appointed rooms, the location. I cannot fault this hotel in any way. For me this hotel offered very good value for money too; I have stayed in establishments that would charge double and still not leave me with the level of satisfaction as the Elysian has.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Sarai Lehner","date":"2012-12-19 12:01:45 +0300"},{"content":"I just stayed at the Elysian for 4 fabulous days. We were indulged in every way. The staff are warm, friendly and wonderfully accommodating. The room - we were in a gorgeous suite - was very luxurious. The windows actually open so you have fresh air as opposed to the continuous din of a fan. The Balsan restaurant was really good. Very close to everything and there isn't anything more you could ask for in a luxury hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Marc Schmeler","date":"2013-07-13 02:42:08 +0300"},{"content":"I surprised my husband with a trip to Chicago for his 30th birthday. I noted this when I made the hotel reservation. We arrived at The Elysian at about 9am Friday morning. Upon checking in, several members of the staff actually made it a point to say Happy Birthday to my husband. Our room was ready right away and we were told we'd been upgraded to a Deluxe Suite! One of the staff members met us at our room to show us around. All I can about the room is WOW! So gorgeous. Everything about the hotel exudes a classy, timeless quality. Our room had a huge terrace with a fantastic view of the city. The bathroom is beyond words. The bed and bedding......heaven! After being in our room about an hour, a member of the staff delivered a handwritten note and a chocolate bar from the General Manager wishing my husband a Happy Birthday. They really do think of everything here! Every member of the staff is so polite and respectful. They have a way of making you feel like you're the only guest. The location is perfect.....just a couple blocks from Michigan Ave., etc. If you're traveling within a 2 mile radius of the hotel, the hotel offers use of a complimentary Lexus.....so convenient! Overall, we had such a wonderful experience. Thank you to The Elysian for making my husband's birthday weekend so special! We can't wait to return!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Earnestine Braun","date":"2013-11-10 22:29:55 +0300"},{"content":"My son and I travelled to Chicago at the end of August for the first time and booked this hotel on the basis of the reviews we had read on tripadvisor. We were not disappointed! We arrived at the hotel to find that there had been a mix up about our reservation; however, the hotel immediately apologized and upgraded us to a beautiful lake-view suite. The service at this hotel is second-to-none. From the moment you arrive in the courtyard and are greeted by the doormen to the friendly front-desk staff, to the maids who service the room, you are made to feel like a special guest. We made use of the courtesy hotel restaurant shuttle, and were assisted in making reservations for attractions and dinner reservations by the concierge. The hotel is only a couple of blocks (and within very easy walking distance) from the Water Tower Center and the other stores on Madison Avenue. Great location! The rooms are decorated in a classic modern style. The bathroom was huge, with a large shower and separate tub. The amenities were very luxurious and there was a lovely balcony overlooking the lake. If you are looking for a first-class hotel with fantastic service and great food...look no further.","ratings":{"Location":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Piper McLaughlin","date":"2012-09-17 04:25:19 +0300"},{"content":"I'm completely blown away by my experience at the Elysian this weekend. My husband and I enjoyed our 5 year anniversary with our 11 month old twins, another couple and their 18 month old, as well as our babysitter and her boyfriend. The families split the Elysian Suite and I got my babysitter a standard king room. We were all so impressed with the hotel's elegance and charm, and especially by the kindness of the staff. They were always smiling and came to introduce themselves to our kids. The rooms were so comfortable and beautifully decorated. The bathrooms were expansive and modern, and my husband couldn't get over the TV in the mirror. One of the highlights of the trip was the spa. It is one of the nicest hotel spa experiences I can remember, and quite possibly the best massage I've ever had. A few above and beyond things to note. I had asked if we could get high chairs in our suite to feed the kids. Not only were there three high chairs, but it was almost as if they went out and bought brand new ones that day. They obviously had never been used, and they went out of their way to suit our needs. They also brought all of the kids stuffed animals and juice. My babysitter's boyfriend had textbooks in his room and housekeeping accidentally dropped one of his books and tore a page. They called him to apologize profusely, and he wasn't worried about it. He did proceed to ask about a place nearby where he could find a cubs hat. Later that afternoon, they delivered one to his room as an apology for the minor incident. I am ready to go back!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Jane Schmitt","date":"2013-12-31 04:23:48 +0300"},{"content":"When traveling to Chicago this is a perfect hotel for location, amenities and information. It is a hotel that fits well with the city and celebrates the urban American landscape. We flew into O'hare airport and spend over a week here. The staff had plenty of good recommendations and there were many rests as well. The beds and the view were great and the room very spacious and quiet. Will stop here next time visiting Chicago U.S.A :)","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":3.0,"Value":3.0,"Service":4.0},"author":"Obie Emard","date":"2013-12-29 04:52:20 +0300"}],"public_likes":["Miguel Fahey","Alia Kuhn MD","Abraham Watsica","Archibald Waelchi","Haylee Hammes","Gaston Wisozk"],"vacancy":true,"description":"This designer hotel and private club is arguably London's finest couture space with its beautiful facilities and impeccable service.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}