{"title":"San Francisco/Golden Gate","name":"Travelodge at the Presidio","address":"2755 Lombard St","directions":"between Baker St and Lyon St","phone":"+1 415 931-8581","tollfree":null,"email":"tlsfpresidio@whg.com","fax":"+1 415 776-0904","url":"http://www.travelodgepresidio.com","checkin":"3PM","checkout":"11AM","price":"$60-$140","geo":{"lat":37.7983,"lon":-122.4467,"accuracy":"APPROXIMATE"},"type":"hotel","id":25809,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The room is small but have everything you want, clean and good design to manage small area. Have pantry in room. Not far from MTR station near big shopping mall and many restaurant around that. It's good location a heart of TSim SHa Tsui. This hotel is cheap. Good to stay here. I visit HK many time but I impress this hotel most!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Felipa Botsford","date":"2012-02-14 01:34:17 +0300"},{"content":"We have used Citadines in London & Paris and were not dissapointed with this hotel. Rooms are small, as is expected in densley populated cities but it was located in a place within easy walking distance of Star Ferries, Subway (one block), Kowloon waterfront, shopping (Nathan Rd) and Kowloon Park.Staff members were helpful and had many suggestions for using our time. By HK standards rates were very reasonable","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Candelario King","date":"2013-11-19 16:10:16 +0300"},{"content":"The Citadines is rather basic, but you get what you pay for it. The staff are nice and helpful, but if you check in late at night, they do not always have someone who speaks English. The rooms are comfortable, clean, and quiet. The restaurant, bar, and beauty salon are open Monday through Friday only. The location is great. It's close to the metro, shops, and other services.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Miss Henriette Conn","date":"2015-06-06 22:41:26 +0300"},{"content":"As we only had 4 days to plan our spur of the moment trip to Hong Kong I was in a bit of a panic as to where to stay... had no idea about the different areas of Hong Kong and we were on a tight budget... Well Citadines were the PERFECT place to stay! We arrived early in the morning (7.30am) and although our room wasnt ready we were able to use the bathroom and freshen up while they stored our luggage. We were upgraded from a Studio Apartment to an Executive Studio which was a great start to our holiday. The Executive Studio was very spacious (Room 1101) - Queen size bed which was seperated from the lounge/kitchen by a partion sliding door. It had a flat screen tv & DVD player which could slide between the bedroom & lounge and a full kitchen. Bathroom was also very spacious as it was wheelchair accessible. For our last 3 nights were were in a Studio Apartment (Room 901) which was still spacious but all in the one room. For our last night we were upgraded to an Executive Apartment (Room 1902) - this was my favourite as it was on a high level and had views across to Hong Kong Island. The hotel was in a great location - 2 minute walk to Nathan Road, 2 minute walk to TST MTR Station, 5 minute walk to the Star Ferry and around 10 minutes to the China Ferry Terminal (Macau). There is no restaurant on site, but there is a bar on level 1 - numerous eating places right outside including a great sushi place and a 7/11 around the corner.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Christy Lakin","date":"2012-10-09 05:28:56 +0300"},{"content":"It has everything I need, all in perfect condition. I was given a free upgrade which was possibly why I was quite impressed with the room. Check-in/check-out was fast and nice, the location can't be better unless you prefer to be on Hong Kong Island on the other side. A variety of restaurants/eateries were readily available on the same street. Only negative part was the renovation in progress. Made it a little stuffy in the public areas like lobby and corridors, and I had to share the elevator once with a workman and his ladder. The fire alarm was also triggered twice in the same day but they turned out to be false alarms (I figured that one out coz I was in the shower and didn't run out, and it turned out fine both times). Conclusion, unless you are really fussy, you'll like Ashley. I did.","ratings":{"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Eloisa Cartwright","date":"2013-06-25 06:35:00 +0300"},{"content":"I thought overall this was a very nice getaway. We have 5 and 3 year old boys and they loved it all. There were several good things and several not-so-good things I will list below. Good: -Our room (3333) was in the Tower and was a very nice room that was clean and spacious. It was a handicapped room so they might be why it was large, I am not certain. The bathroom was huge and we had a mini-fridge and a table. There was a sink in the bathroom and a vanity outside the bathroom with a large mirror, hair dryer, etc. The kids loved the bunk beds and we loved the king bed. I would not want to stay in the other building as it is quite a distance, especially in the winter. -They have a restaurant on-site with decent, reasonably priced food. This allowed us to not have to leave the park. It also has room service, though we did not use it. -The water park was lots of fun for my kids and we had fun, too. They have stuff inside and outside, and there were plenty of towels, life jackets, seats/tables. It was clean, too. There were three shallow kid pools and 2 deeper adult pools, a lazy river, and 2 slides. -They allow you to stay and play until close on the day you check out (10pm), and there is a shower in the restroom by the pools so you can clean up and head straight to your next destination (Dixie Stampede for us). -It's quite a bit cheaper than Great Wolf Lodge (but still expensive). -The A/C unit had a remote control. Very nice. Bad: -The wireless internet did not work in our room. -The lady at the desk was snippy with me when I told her the rate she was going to charge was not what was quoted to us on the phone just a few hours earlier (we booked the same day we stayed the night) but fixed it. -They charge you quite a bit of money for breakfast that is the same quality as the free ones at other places. Take doughnuts. -They were short on lifeguards so they could only have one slide open at a time on Saturday. This not only cut out on play time, but also made the other areas very crowded with people who would have been sliding. This also caused a shortage of tubes required for the one slide. -They were also short on help in the restaurant and it took a very very long time to get our food, even when we were the ONLY people in there. -It is really loud when they are cleaning the water park in the mornings when your room is right above it. -There was only one umbrella at one table outside. There were several tables but no umbrellas. -The palm tree \"rain shower\" was not working outside. I think we will go back. Overall we had a good time, especially for booking last minute. It would have been nice for others in our family to be able to get a day pass but they were over booked that weekend so they weren't able to. There is a spa I'd like to have tried but we didn't have the time. I can't say much about service because we didn't really require any. I do not know about the fitness center, either.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Beth Gutkowski","date":"2015-10-14 03:09:43 +0300"},{"content":"We stayed at Castle Rock because my sister wanted the waterpark. The room were clean enough. The staff was efficient and pleasant. My niece and nephew are 5 and 3 so the water park was fine for them. If your kids are over 12, they will get bored. The two waterslides are fun for a while. The lazy river is small and not very lazy. The current was stronger than I've ever experienced and may intimidate weak swimmers. The toddler area is good with several slides and waterfalls to play in. Sorry grown-ups, no hot tub for you. My sister stayed in the family suite which is really just one big room with a mini-fridge, microwave and sink. It had the bunkbeds in a oversized closet with a tv. I got one the atruim rooms. Not realizing they are actually next door to the waterpark. They bought a \"Days Inn\" type motel. So nothing fancy, just a basic hotel room with exterior doors. To upgrade to the tower room was another $50/night. Not worth it to us. Luckily the weather was warm enough so this wasn't a problem walking across the parking lot. During the summer months, I can't see any reason to pay the extra money for the waterpark. Just spend the day at White Water. And even in the winter, just stay one night that will give you two days in the waterpark and then move to another hotel.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Mathew Kuphal","date":"2012-08-23 10:21:38 +0300"},{"content":"We are on a holiday vacation with our grandchildren in Branson. I wanted to write a review about Castle Rock resort. We stayed yesterday on Christmas eve and the kids really enjoyed themselves. The resort is small enough yet just the right size for a day of water fun. The kids are 13,9 and 6 and it was just what the doctor ordered after 2 days of travel. We found the room to be clean and the waterpark maintained well. Lifeguards were very actively involved and were very conscious of the kids, which I really appreciated. All in all , a nice stay...staff were very friendly and always willing to help you.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Greg Gibson III","date":"2015-06-19 01:27:16 +0300"},{"content":"Over priced for the value. The beds in the tower were of poor quality and the pillows were flat. The front desk person told us our check in time was at 2:00 and our room was not ready until 4:00 pm. We chose to stay at Castle Rock for the water park. Unfortunately, our three children were unable to enjoy the park due to the intense burning of the eyes from the chlorine in the air. This was highly disappointing. To top off the dissatisfaction, the cleaning lady used inappropriate language in Spanish as she passed us in the hallway. I would never recommend this so called resort to anyone. There is far better value and quality in Branson.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Location":3.0,"Rooms":3.0},"author":"Jorge Balistreri","date":"2014-11-10 19:01:56 +0300"}],"public_likes":["Madilyn Monahan","Giovanny Stehr","Issac Blick"],"vacancy":false,"description":"Standard  Travelodge, but set in an excellent location right on the cusp of the Presidio.  If you like having the natural world close to your doorstep, then this is the place for you.  With its proximity to the Palace of Fine Arts and the historic buildings of the Presidio, it's also a good place to come if you are a fan of architecture.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}