{"title":"Bonifacio","name":"Santateresa","address":"Quartier Saint François","directions":null,"phone":"+33 (0)4 95731132","tollfree":null,"email":"info@hotel-santateresa.com","fax":null,"url":"http://www.hotel-santateresa.com/","checkin":null,"checkout":null,"price":"€ 130","geo":{"lat":41.38677,"lon":9.152,"accuracy":"ROOFTOP"},"type":"hotel","id":3852,"country":"France","city":"Bonifacio","state":"Corse","reviews":[{"content":"everything was fine and met my normal Marriott expectations except the breakfast area... we came down to eat around 9AM and there was a line about 20 deep waiting to be seated, while half the restaurant was empty. Obviously, someone screwed up and had only 1 person working the entire place. We left and went down the street to McDonalds instead as we left town.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Rodrick Renner","date":"2014-03-06 15:39:45 +0300"},{"content":"Had a one night stay here, as I was at a conference for a week, and conference rates at my other hotel were silly high. Got a great rate, and a pleasant stay. Good wifi speed. This is an all-suites hotel. (I think it had previously been branded as a Marriott Suites.) Very large rooms and baths, could easily get Mrs. Gardiner and Kiddo in here comfortably. Walking distance to Convention Center, although that might be unpleasant in July and August… Nice employees, very helpful. Food in restaurant was well prepared, and prices weren’t gouging. Getting a taxi to get out of there took a bit of work by the bellman, so take that into account with your check-out time…","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Hazle Boyer","date":"2015-03-30 20:12:39 +0300"},{"content":"Best Complimentary breakfast i've ever had that consisted of a very good variety of fresh, gourmet style food. Very nice and friendly helpful staff.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ms. Clara Koepp","date":"2015-11-29 14:52:55 +0300"},{"content":"Stayed here w/ daughter fro soccer tournament. Quiet except for drunk knuckleheads Saturday night - almost got to the point of calling downstairs Banged around a little bit at 6:30 am as we had to go early haha. Big, nice rooms, clean, tv is very dated, frig. Step off elevator right into nice little bar. Close to convention center but not much else. Hilton nearby is a real dump but that's another story. Right next door to best restaurant in Vegas.","ratings":{"Overall":3.0},"author":"Fanny Graham","date":"2013-03-30 21:17:14 +0300"},{"content":"This hotel is a great choice for any kind of convention center business. The rooms are enormous and quiet; there's no casino, bar or really restaurant; and you can walk to the convention center. All of the rooms are quite large, many with door separating the bed room and the living area. I found the bed very, very comfortable, with a good selection of pillows. The bathrooms are also spacious and quite nice. The internet is only $12/day (Though I think it should be an included utility like water or A/C, this is not as much of a rip off as many other hotels). Parking is free. The downside is that there's no real restaurant, casino or bar and it's way off strip, so it's a terrible choice for a wild time or even mild mannered tourists. The showers are also midget height, which a small annoyance that feels magnified when you are trying to get yourself going for a full day of work after a full night of Vegas.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Emerald Beier","date":"2012-11-19 10:50:59 +0300"}],"public_likes":["Kraig Carroll","Emelie Reichel","Mrs. Amelia Lindgren","Zoe Hirthe","Mrs. Elinor Roberts","Nina Schimmel"],"vacancy":true,"description":"Friendly hotel on spectacular location on the highest ground in Bonifacio upper city on the southwestern pinnacle. Only the marine cemetery is between the hotel and the limestone cliffs overhanging the sea 70 meters below.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}