{"title":"Derry","name":"Tower Hotel","address":"Butcher Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":54.99598,"lon":-7.32266,"accuracy":"ROOFTOP"},"type":"hotel","id":7781,"country":"United Kingdom","city":"Londonderry","state":null,"reviews":[{"content":"We stayed for three nights in mid Oct. I booked this hotel due to the good reviews here but I was skeptical because it's quite cheap, so I didn't expect much. It turned out to be such a good experience! Room is small especially the bathroom, but it has everything we needed. The staff were very friendly and helpful. And we love the location best! It's so convenient: we walked to shops and if we wanted to go further, cable car and bus stops were just meters away. we had breakfast every morning in the hotel. It's really good value and excellent service and food. The omelettes were the best (we didn't realise that at the time, but after trying a few more in other cities, we knew). My husband asked me to rave about the omelettes if I wrote a review. :)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ramona Will","date":"2013-05-30 07:37:27 +0300"},{"content":"My husband and I came from Israel for a 3 day stay in San Francisco before a wedding. The hotel is clean, the staff is excellent-helpful with every detail needed. There is free coffee, cookies and apples 24/7-just a small friendly part of the general friendly hospitality. The location is perfect- we really loved this hotel and the price was perfect.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jean VonRueden","date":"2014-04-01 05:28:52 +0300"},{"content":"Stayed here for 4 nights and had a wonderful time, the staff could not be more helpful and really made my stay there. The location right on Union Sq is perfect as it's very close to the shops and restaurants and has great transport links. My room was on 13th floor and was lovely, I've seen complaints on here about the room size, but I do not know why the room was the perfect size and the bathroom was lovely and not too small either. This hotel is fabulous and I would stay here again / recommend it to anyone","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Susie Harris","date":"2012-05-15 12:53:02 +0300"},{"content":"We loved our stay at the Chancellor last year. Very quirky and reminded me of an English B&B! Very nice family-like atmosphere. Free computers to check emails very useful and free coffee and cookies a nice touch. Good location - the windows were quite old fashioned which meant we could hear the cable car ding all day - we didnt mind this though! The food court down the road in the shopping centre was handy for coffee, cake and quick dinners from bristol farms (like whole foods supermarket)","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Alden Emmerich","date":"2014-11-03 23:01:10 +0300"},{"content":"I stayed 3 nights at teh Chancellor. It has a great position near Union Square, it feels very safe area. The staff were very helpful and friendly, the room was clean and quite spacious. The hotel does not have AC but you can open in the windows and SF does not get too hot. There were several personal items such as lollies in the room, lemon juice in the foyer and a small library of books on the 1st floor. The free internet and the use of the computer in the lobby were much appreciated. Enjoyable stay","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dallas Schowalter","date":"2015-02-09 21:15:38 +0300"},{"content":"If your are looking for a hotel in the hear of the action- this is the place for you! It is write in the middle of Union Square - so much so I left my partner in thhotel room whilst nipping into H and M, Maceys etc just a minute walk away. Staff on front desk are great and helpful and complimenatry 24 tea and cofee and cookies are great! The food in the restaurnat is amazing with exceptional service. However the concierge was very forceful and made us purchase a 3 day tram pass for $20 each. The problem was we couldnt and didnt use it because it was so so so busy. Over 1 hour queues! The room was clean and comfortable and the pillow menu a real treat! We personally didnt like San Francisco, it was freezing cold 54F in Summer, lot of homeless begging you for money (not nice at night), very busy and waiting times for restaurants, toilets(about 30 min) the tram made it least pleasurable! We have visiited many mancy cities and this sadly at the bottom of the list. We certainly have not left our hearts there!!!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Marcia Gulgowski","date":"2014-05-26 13:33:24 +0300"},{"content":"Staff was great. the hotel is a good enough size so you see the same staff daily and they remember your faces & greet you with a smile. Had delicious breakfast in the hotel's restaurant every morning. there's a small kiosk that helps you with local excursions, directions, and general recommendations that we found helpful. The hotel was centrally located amongst shopping, public transportation, restaurants, etc. The hotel is very compact though. The elevators, hallways, rooms & bathrooms are all very tight, not much room to pass others -especially with luggage - but it did not bother me a bit as the hotel is clean & decorated in good taste. We only rented a car for 1 day to explore Muir Woods - totally worth it. In a city like SF there is no need for a car otherwise.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Bernardo Casper","date":"2015-06-22 18:43:17 +0300"}],"public_likes":["Dylan Donnelly","Karolann O'Connell","Josiah Okuneva Jr.","Dr. Cordia Pfannerstill","Jude Runolfsson","Buck Kuhlman","Casey Osinski V"],"vacancy":true,"description":"Modern Four star hotel, centrally located inside the city walls, 200 metres from Guildhall. Underground parking provided.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}