{"title":"Semur-en-Auxois","name":"Hotel Des Cymaises","address":"7 rue du Renaudot","directions":null,"phone":"+33 3 80 97 21 44","tollfree":null,"email":"hotel.cymaises@wanadoo.fr","fax":"+33 3 80 97 18 23","url":"http://www.hotelcymaises.com/accueil_en.html","checkin":null,"checkout":null,"price":"€63 - €116 a night","geo":{"lat":47.4917962,"lon":4.332332,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26993,"country":"France","city":"Semur-en-Auxois","state":"Bourgogne","reviews":[{"content":"We stayed for a week. The location is great to get to the airport and many different sites that San Diego offers. The staff including the owners were friendly and helpful. Everyday we got clean towels and the maid without asking us changed our sheets twice! The room is small and it sits on the corner of a quiet street and a main street- at times it was noisy at night. The walls are thin and two nights we had people next to us that listened to TV till the wee hours of the morning. Finally, I convinced my husband to wear earplugs like I do. The bed, pillows and blankets were comfortable. Overall, great location and reasonable rates!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Aron Bogan","date":"2012-10-04 19:01:10 +0300"},{"content":"This is an incredibly friendly and welcoming family run motel in a great location. The staff were very attentive and went out of their way to be helpful. We would have no qualms about staying here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Makenzie Zulauf I","date":"2015-07-06 08:55:41 +0300"},{"content":"I discovered Dolphin Motel last year while taking a walk on Scott street during my annual trip to San Diego. This year I decided to try it and I realized that I should have tried it before. My first impression while checking in is the nice welcome from Tom at the front desk. All the staff here are very polite and always do their best to accommodate the guests. Mr Murdock, the owner, asked me if all was correct with my room and kindly gave me advices and tips to make my trip to San Diego more pleasant. The rooms are small but very clean and well kept with a big flat-screen TV, a fridge and air-conditioned. The beds and pillows are comfortable. This motel is also well located, close to the airport and easily accessible by public transport buses. The free breakfast served from 6 to 10 AM includes fresh coffee, tea, muffins, bananas, yogurt and orange juice. Stayed from Sept. 26 to Oct. 1, 2011 and I will certainly return next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Alexandre Streich","date":"2015-10-21 21:03:50 +0300"}],"public_likes":["Claudine Balistreri III","Jailyn Rogahn","Reid Considine","Cordie Block","Clare Kautzer","Katherine Douglas"],"vacancy":false,"description":"Beautiful two star hotel down a quiet road right off the tourist area within the old medieval city. It is close to the tourist office, main bus stop, and many restaurants. Comfortable and clean rooms renovated in an 19th century mansion with a lovely private patio area in the rear, breakfast is offered for €9.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}