{"title":"Llandysul","name":"Typoeth Cottage","address":"Typoeth Cottage Llandysul SA44 4RS","directions":null,"phone":"+44 1559 384483","tollfree":null,"email":"tourism@typoethcottage.co.uk","fax":null,"url":"http://www.typoethcottage.co.uk","checkin":null,"checkout":null,"price":"From £250 per week","geo":{"lat":52.026183,"lon":-4.302073,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":38019,"country":"United Kingdom","city":"Carmarthenshire","state":null,"reviews":[{"content":"Great location; easy walking to shopping and restaurants. The staff was extremely friendly and the nightly wine/social hour was a lot of fun. It was a great way to meet other guests. Being an InTouch member with Kimpton allowed $10 worth of mini-bar items for free; nice surprise. Animal print bathrobes were provided; nice not having to bring one along. Not enough drawer space would be my only complaint and the bathroom was a bit small for the King Premium room. Great rate for the room; would definitely recommend this hotel and would be my first choice to return the next time I'm in Seattle.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Marty Jacobi III","date":"2015-02-15 22:53:26 +0300"},{"content":"The Hotel Vintage Park in Seattle WA is one of the best hotels in the entire city. My husband and I are extremely fond of Dogs and Wine which are two things that the hotel is does very well. Even if you are not particularly fond of dogs or wine, this would still be a fantastic place to stay because the staff takes care of each and every guest just the way YOU want to be treated. The decore gives you a feeling of elegance and the comforts of home.We have stayed here numerous times over the years and it never dissapoints. Walk to Pikes Place Market, Seattle Art Museum and many other great downtown venues and events.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jeramy Swift","date":"2013-05-22 10:46:13 +0300"},{"content":"My partner and I stayed from December 31st until January 2nd. Best downtown Seattle hotel ever! the staff were consistently and genuinely friendly, the room was lovely. Room service was prompt and efficient, and the restaurant! Tulio had a fabulous menu as well as great food. I would go back in a heartbeat! Although the bed was comfortable, it was noisy and squeaky for two, and we needed an extra blanket. Otherwise a perfect stay!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Katherine Witting","date":"2014-09-10 18:07:20 +0300"}],"public_likes":["Kim Walker II","Audie Sipes","Gerardo Fahey"],"vacancy":false,"description":"Self catering holiday cottage in secluded valley, less than 10 minutes from Llandysul. Twin beds, with option for a third bed. Wood burning fire. Enclosed rear garden. Dogs are welcome. Dog training sessions are available.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}