{"title":"Orange (France)","name":"Park Inn by Radisson Orange","address":"227 route de Caderousse","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.parkinn.com/hotel-orange","checkin":null,"checkout":null,"price":"from 94 to 190€.","geo":{"lat":44.136530912779726,"lon":4.788177003720193,"accuracy":"APPROXIMATE"},"type":"hotel","id":21244,"country":"France","city":"Orange","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"Old, but nice hotel. Very clean comfortable rooms. I loved thier shamoo/soap with honey/ginger flavor. We were staying with 2 kids for 2 nights in a room with included 2 continental breakfasts. They gave us 4 breakfast vouchers for duration of our stay during check-in. We asked if they coudl give two more vouchers for kids, they said no. Well, fair enough, we knew about it when booked the hotel, but gave it a shot and though it woudl be nice for them to add vouchers for entire family. Next morning, we went to have breakfast and waiter actually let us have 4 full breakfasts using only use 2 contintneal vauchers , very nice. Second morning we were not that luckey, another waiter didi everything by the book and charged us two additional breakfasts. Other thatn that, hotel is in fantastic location, has nice indoor pool, sauna and gym. I woudl stay in this hotel in a future,","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Mrs. Erik Osinski","date":"2013-08-26 13:40:40 +0300"},{"content":"I spent 4 nights at the Hyatt Downtown and thought it was great. The doorman was right there to carry my luggage all the way from the street to the lobby and asked if I would need it brought to my room. Great start! The reason for the two sets of elevators is for security purposes. The hotel wants to see who is coming and going to the rooms. One night I had to show my key to get on the second set of elevators to the rooms. This is a good thing. Check in was very pleasant and professional. I got the room through Priceline so I was expecting a view of the alley but what a pleasant surprise when I got a room on the 20th floor with a tremendous view of the financial district and the inner harbor islands. It was very nice and I was really happy to have it. The bed was super comfortable, the bathroom was fully stocked with products (even toothpaste). The best part of the hotel though is the gym. While not everyone looks for this when they travel, if you like to work out this gym had everything! This hotel was very nice. I would definitely go back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Maya Hills","date":"2014-06-10 12:54:26 +0300"}],"public_likes":["Alize Cole PhD","Deven Windler","Alexzander Fahey","Kadin Homenick","Josianne Keebler","Frederik Upton","Dovie Terry","Teagan Balistreri"],"vacancy":true,"description":"Three-star hotel.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}