{"title":"San Francisco/Civic Center-Tenderloin","name":"Taylor Hotel","address":"615 Taylor St","directions":"at Post St","phone":"+1 415-775-0780","tollfree":"+1 877-734-6835","email":"info@sanfrancisco-budgethotel.com","fax":null,"url":"http://www.sanfrancisco-budgethotel.com/","checkin":"3PM","checkout":"10AM","price":"$66-$90","geo":{"lat":37.7881,"lon":-122.412,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25591,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"This was our first trip to to the US and we had a great start at the Chancellor. The room was clean and well equipped and the staff very friendly and helpful. We tended to eat breakfast there rather than trying to go out and find anywhere and the specials that they offer tend to be quite reasonably priced. Really happy at this hotel and would definately go back. For info, came accross a fantastic chinese restaurant in Chinatown, the Broadway Restaurant on Broadway Street. Completely full of localls but not surprised as the food was amazing and CHEAP!! $23.00 all in for 4 plates of food as mains. Recommend particularly the peking ribs. WOW!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Pansy Bayer","date":"2012-05-07 04:10:11 +0300"},{"content":"I could not fault our stay at the Chancellor. We were there for four nights, during which we had our wedding anniversary. Our travel agent had made the hotel aware of this and in our room there was a bottle of bubbly, chocolates, a present and free tram tickets which was a lovely surprise. The staff at the desk were very helpful with any questions we had and the little bar had the most devine cocktails ever! We didn't eat there so couldn't comment on that. The room itself was very spacious for a city hotel and certainly for the price. The bed was extremely comfortable, the decor very nice and the place was always spotless. The hotel was in a fantastic location and an ideal base for most sites in the city. If we were coming back to San Fransisco, which I really hope we will, I would definitely stay there again. A fantastic experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Tavares Pouros III","date":"2012-07-10 08:08:56 +0300"},{"content":"We loved this little hotel in the middle of everything. The cable cars run right outside the front door and we loved leaving our window open and hearing the bells as they went by. Wonderful location in the shopping district with lots of nearby restaurants that we loved (especially Kuleto's). I loved the decor of the rooms- modern, clean, serene. We'd definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Ocie Kassulke","date":"2012-09-03 02:30:10 +0300"},{"content":"Stayed 1 night. Got inclusive rate with parking and $25 for meals/drinks at hotel for $116. Thought it was great value. While rooms won't appeal to those who need luxury as they are a bit small and a bit 50ish in style -- (including the old fashioned glass doorknobs and pipe runnning along upper valence). They are well soundproofed, decently decorated and very clean. In addition the Chancellor is doing all the extra service right. Coupon for 2 drinks at 1/2 price in room at bar where quiet jazz played. Unexpectedly good breakfast oft an omelette, toast and juice for 2 for only a bit over $25. (even provided salsa when requested) Location can't be beat. I'd suggest staying here instead of a more expensive place and spend your money on a great dinner out.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ernie Kub III","date":"2013-05-25 15:55:45 +0300"},{"content":"I booked this hotel based on Trip Adviser reviews and wasn't disappointed. I was prepared for the small room and bathroom, and I even knew about the raised floor in the bathroom because another reviewer had mentioned it. Of course that didn't stop me from tripping myself : ) I travelled with my partner and it was a cozy room that was fine for a short stay. If we had stayed longer, I would probably spend more and stay at Hotel Rex again for a bit more room -- paid $105 for Chancellor and $145 for Rex. This would be the perfect place if I was traveling alone -- plenty of room for one person and a great location. Staff were great and we enjoyed those tasty cookies everyone mentions. We asked for a quiet room when we booked and that's exactly what we got. We took the BART to and from the airport -- this cost $10.70 for two people each direction and only took 40 minutes. If you're going to take the cable car, get a one-day pass for $11 rather than $5 for two trips, and make sure you take the California line too!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Chyna Nitzsche","date":"2014-11-28 03:22:15 +0300"},{"content":"I'm a runner, not a shopper. Chancellor Hotel is fabulous for both based on its location. If you wish to run on your trip, this is an excellent location. SF running club actually offers 3 routes based on being in Union Square. I did one of them and then made my own. Want to see the Wharf--challenge yourself up Powell and then it is all downhill to the wharf-- then take a right(all flat) and run the piers to return via Market--about 5 miles. Early morning is best, you have the city to yourself! As for the Chancellor--quiet, clean and terribly friendly. I requested late check out and was surprised by the generous time allotted. My room was cleaned one day by Lina--oh my, she is a tidy one--so thorough! The room was more than manageable--the bathroom brought back memories of an apartment I used to occupy built during the same time --very quaint! The complimentary cookies, coffee and tea was so lovely--they even offered soy milk, what a treat for this non milk drinker! I'm very pleased to have stayed at the Chancellor and will frequent it again since I fell in love with the city and must return. A couple of side notes: **if trying to find a gourmet snack or quick lunch--one street up and over (right above the tunnel) there is a liquor/market and it is wonderful. Stocked with great vegan wraps and quick dishes, as well as fresh produce and high end snacks. **want to explore a new church on Sunday--go to Glide which is a few blocks southwest of the hotel. Didn't know going into it, but it is the whose who of San Francisco churches. Glide is Methodist, but it is progressive with almost a full service of various gospel and praise songs. Not for the faint of heart--stand up and clap your hands! The members make you feel very much at home. **take the BART, so easy and cheap at 5.35 a ride from airport to Powell station. **check out the farmer's market on Saturday--great artisans and fresh food. **City Lights bookstore-- a must for any fans of poetry or bookstores of quality!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Jason Shanahan","date":"2015-05-22 04:43:09 +0300"},{"content":"Stayed there for 10days, the location is excellent, right on union square (ask a room on the back if you don't want to hear the cable car). Very professional staff. It's a good alternative to the very expensive hotels. One small critic: there were no refrigirators in the rooms.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ebba Rowe","date":"2014-05-17 11:35:12 +0300"},{"content":"Mr. Tyler, the Chancellor's GM, went above and beyond to accomodate us during our visit to San Francisco. The level of customer service provided by Chancellor Hotel is exemplary and is surpassed only by their kindness. Much appreciation! Jane Zionsville, IN","ratings":{"Overall":5.0,"Service":5.0},"author":"Ms. Myles Shanahan","date":"2014-09-28 21:58:54 +0300"}],"public_likes":["Lottie Ruecker Sr.","Jameson Dickens","Mariela Howell","Nya Dooley"],"vacancy":true,"description":"This is an older building and the rooms are in need of paint, but it's relatively clean. There is a nice Indian couple who runs the place, they have wireless internet and a community computer in the lobby and a continental breakfast each morning. It's in a great location, just 2 blocks from [[San Francisco/Union Square-Financial District|Union Square]].","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}