{"title":"Death Valley National Park","name":"Sunset","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$12 per night","geo":{"lat":36.45885,"lon":-116.8638,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7393,"country":"United States","city":"Furnace Creek","state":"California","reviews":[{"content":"Clean, modern but still comfortable, 2 bedroom suite....Enjoyed the location as so many places in town stay where there is noise all night from those celebrating the nightlife. This is still an easy walk to all of the tourist options and a short cab ride to anywhere. Not full of amenities in the Lobby--but it had all that we needed and there was still 24 hour availability if something came up--albeit you actually walk outside to the door to the lobby (only 15 feet). There were good locks and CCTV for our building entrance and we felt very secure and enjoyed a nice place for a good price. It felt like a good find and value...","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Devin Borer DDS","date":"2012-04-24 13:50:26 +0300"},{"content":"We stayed here for 2 nights; it´s a wonderful apartment but maybe a little bit off if Plaza Catalunya and Ramblas is the center of your visit in Barcelona. Very clean, great staff, quiet, bright. Perfect choise for two couples!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Schuyler Eichmann","date":"2013-04-18 15:19:35 +0300"},{"content":"Had a short stop over at madrid airport and decided to try this hotel - mistake!! Arrived in Madrid at 10pm and had to wait 50 mins for the shuttle bus. Rang the hotel only to be told it was nearly there - but it wasn't. Arrived at hotel eventually and queued to check in. The surly receptionist asked to see my daughters passport and told us that as she was 13 (it was her bithday the day before) we would have to pay for her to be in our room. When we booked we were not told this so refused to pay. After much messing around she reluctantly agreed to waiver the charge but was obviously not happy. By this time there was a large queue behind us so it was all a bit embarissing to say the least. Eventually got to the 'suite' and it was horrid. Basic with paper thin walls, it just looked awful. The kitchen didnt have a single plate, cup, or glass - whats the point in having a kitchen ! Bedroom was small with a teeny window and the most vile bed I have slept on in a while. Limp and lumply pillow which didnt smell very clean and the bedding consisted of a sheet and a horrid manky looking blanket with a thin and unattractive cover on top. My daughters bed was shoved up a corner in the lounge and was equally horrrid. Would have complained but by this time we only had about 5 hours to get some sleep so decided to get on with it. However next doors TV could be heard through the walls and ny husband and I were constanly itching - maybe the blankets?? Ended up hardly sleeping. I am not a constant complainer, if you look at my other reviews you will see that but I would say only go to this hotel if there are no other options, we hated it and it spoilt the end of our holiday. Only paid 60 euro but dont think it was even worth that. Stay away, much nicer options nearby","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Maia Veum","date":"2015-03-17 13:33:02 +0300"},{"content":"Good hotel, modern rather than impersonal. The rooms are large (one room with beds, one room with sofas and TV plus bathroom) and fully equipped. The location is quiet, robably too quiet: there is absolutely nothing around you, apart from a big shopping mall 5 minutes walk away. If you want a beer or a tapa, the only choice the hotel's bar. The bus shuttle service advertised by the hotel is a fake: you won't be able to locate it when you arrive at the airport, and you're very likely to miss it on the way to the airport since the bus is in reality a mini van and can load only few persons. The alternative is a Ero 20 ride to the airport.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":3.0,"Value":5.0,"Rooms":5.0,"Location":2.0},"author":"Yasmeen Nicolas","date":"2014-06-05 03:16:06 +0300"},{"content":"The hotel was comfortable, clean, well decorated and with a good service. Located in a residential neighborhood, quiet and safe. The subway station was located 300 meters from the hotel and took about 30 minutes to reach the center of Madrid, but this was something he already knew. Would reccomend.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Brendon Tromp","date":"2014-05-22 04:02:24 +0300"}],"public_likes":["Bethany Daniel","Jewel Heidenreich","Mr. Anderson Reinger","Stanton Crist","Jerad Labadie","Dr. Newton Murazik"],"vacancy":false,"description":"(Closed in summer). Located at 190 feet below sea level, Sunset has 270 sites with water, flush toilets, and dump station. NO Fires Allowed.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}