{"title":"Forres","name":"The Old Kirk bed and breakfast","address":"The Old Kirk, Dyke, by Forres","directions":"Leaving Forres heading towards Inverness, follow the signs for Dyke or Brodie Castle. The Old Kirk is opposite the farm at the Forres end of the village.","phone":"+44 1309 641414","tollfree":null,"email":null,"fax":null,"url":"http://www.oldkirk.co.uk","checkin":"5pm","checkout":"10am","price":"from £32 ppn per night","geo":{"lat":57.6103,"lon":-3.6892,"accuracy":"ROOFTOP"},"type":"hotel","id":9343,"country":"United Kingdom","city":"Moray","state":null,"reviews":[{"content":"The property was beautiful, the suite was huge and very clean, it had a kitchen and there were free laundry rooms. It would be a great place to spend a week. There was lake with a beach, 2 pools, golf, mini-golf, and all that space. Not as fancy as the Grand Cypress, but in my opinion a better value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Moshe Grimes","date":"2015-12-27 14:55:33 +0300"},{"content":"We just returned from a 4-night stay at the Orange Lake Resort in Orlando. We had a 2 bedroom unit in the west village, which was extremely clean and spacious. Two adults and 3 children (2 teens and a 'tween) comfortably shared the space, though one child chose to sleep on the sofa in the living room. The kitchen was very well-equipped with all the implements you could want for basic cooking, and had granite counters. The washer-dryer was useful and worked well. Bathrooms were spacious and clean, including the jacuzzi-style tub in the master bath. The complex seems to be in good repair. We were in Orlando for a soccer tournament, so we wanted space to relax between games, and got that. If I were there for a vacation, though, I would be disappointed with the amenities. Swimming pools seemed small, and even in December the miniature golf courses were crowded. Restaurants and the Marketplace mini-mart were expensive for what they offered. The River complex pool looked fun but too small for the vast size of the resort overall. Security at the gate was rather over-zealous, but it's easy to get in if you tell them you are checking in. The architecture is extremely monotonous, but not hideous. Friends who were also staying said the golf was pleasant but not memorable. As a place to stay, a larger-than-average hotel, it was fine. If I went there with the idea that it would provide entertainment for several days, I'd be disappointed. One nice touch was the array of starter goodies provided in the unit: dish soap, paper towels, laundry detergent, coffee. It was pricey but I'm sure a better deal could be had if you could be more flexible with your dates. Beware - they will try to get you into a sales session for the timeshare. And when you say no,they will call your unit to invite you yet again (to be fair, they offered $100 to come to the session). We were honest and said the only reason we were there was for a soccer tournament, and wouldn't want to vacation in Orlando otherwise, and they respected that and left us alone. Maybe those are the magic words? (Never a mention of a charge not to attend the sales pitch, btw.) Service was friendly and prompt - we were missing a couple small items from our unit and they delivered them promptly, and phone inquiries to various departments were answered quickly and accurately. The people working here are very friendly and helpful, and the housekeeping is excellent. The 7:05 AM shuttle to Disney cost about $20 each and was well worth the money.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"America Schultz I","date":"2013-04-24 09:02:56 +0300"},{"content":"We stayed at Orange Lake the week of December 4-11, 2011. I booked the rooms through world resorts international’s Buy with Me deal, and got 7 nights for a great price. After reading the reviews, I didn’t know what to expect when we checked in, however, we were pleasantly surprised! Recommend this place for families looking for vacation rental amenities and not hotel amenities. Check-in/Check-Out No wait and courteous staff. The only criticism is the time-share tactics. The receptionist gave me the room key and $20 voucher. My family was waiting in the car, so I walked out to meet them. On my way out, the timeshare rep pounced! And when I told her that I had to meet my family, she said that I had to give her the $20 voucher back. It was the strangest thing. I knew that the voucher was a timeshare ploy, but if I knew they would demand it back if not used immediately, I would have declined to take it in the first place. But that was not a big deal because overall the staff was very courteous. After getting to our room, my husband called the front desk and asked if we could be moved off of ground level. They gave us several options and were very accommodating so overall I would rate the reception staff as excellent and the timeshare group as rough around the edges (we had to unplug our phones because they literally called us non-stop even after we picked up and said we weren’t interested.). Property We stayed on the 5th floor of the East Village. It looked like this was a recently renovated/built section because the rooms were clean with modern décor. The receptionist said that all rooms in the East Village are similar. The entire property is huge! It took about 5 minutes to drive from the reception to the East Village because of the winding roads, golf carts, pedestrians, etc. Driving through, it looks like the West Village and possibly North Village as well, are the older, one level rooms. They actually look like little houses. I’m not sure how they look on the inside, but I don’t think I would want to stay there. I like the more modern look and feel of the East village. I loved that there was a pool in the East Village and a restaurant as well. There are like 8-10 places to eat on the resort and at least 4-5 deliver until 10pm. We ate at The Legends once and the food was OK. We did not really use the amenities on the resort. We went to the pool once in the East Village. It was very quiet and cold during our stay. There is a lazy river in River Island, but we never checked it out. The property has a great location, with a Publix, Walgreens, Target right next door. Very convenient! Also, this place so close to Disney. We went to Magic Kingdom and after the hustle and bustle of getting into and out of the park, it was nice that our ride home was less than 10-15 minutes. Room We had a 2 bedroom condo. It was clean, spacious and very comfortable. The kitchen was equipped with cooking essentials, although a few pots and pans needed replacing and one burner was broken. The TVs are dated, but the living room has a DVD player which was nice. The bedroom TVs had bad reception. They have extra sheets and blankets for the sofa bed. We found one blanket had food stains on it, but thankfully the place was equipped with a washer/dryer and detergent. Overall the imperfections did not stress me because of the deal I received, but it would bother me more if I would have paid full price. I would stay here again, and would recommend this place to family and friends.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jessyca Wuckert MD","date":"2012-08-29 14:58:17 +0300"},{"content":"I recently went on a trip with my partner to orlando and got a great deal Via Bootit.com on this hotel. I figured we would not be spending to much time in the hotel and this was close to disney and other parks. It also had free parking which was great. I did not like the fact that my room was facing the indoors after requesting a pool view but for my rate thats the best they can give me. I tried to stay out of the room it became depressing. They hound you about this vacation club thing from the beginning to redeem cash. DO NOT FALL FOR IT. yes you save maybe 40 bucks but you will lose a whole day to a annoying sales guy. Ive had this experience before. Pros: great for families with kids ( tons of pools and things to do) Huge if you have a car you can travel to the different pools and such rooms are modern and clean pools are huge and nice Cons: if you do not have an upgraded room they will put you in a room facing the indoor courtyard - they hound you in the beginning for this vacation club ( tip just tell them you want to unpack you are tired and you have all your tickets) -Resort fee ( not much but annoying) - taxes ( I thought were in the bookit price) - No daily cleaning ( but hey if it keeps cost down I'm fine with that)","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Frederique Williamson Jr.","date":"2014-05-18 07:27:57 +0300"},{"content":"I just came back from a 3 nights stay at this resort and I was pleased with my stay. We had reserved the 2 bedrooms villa in West Village. I would definately come back and have a longer stay. The resort is a few miles away from Disney. Close to many restaurants and shopping. We very much enjoyed the different pools and spas. Eventhought there is a shuttle going around the resort, a car is a must. The resort is huge and if you want to see all there is to do, a car is helpfull.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Yesenia Ruecker","date":"2013-02-08 12:10:37 +0300"},{"content":"We have been here 3 times now each time it just gets better, stayed in villa this time on springer circle enjoyed it more than apartments was nervous of new cashless resort syestem but worked ok resort spotless villa spotless ,just book it you won\"t regret it .well done orange lake hope to see u again soon","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. May Gaylord","date":"2013-09-12 01:00:54 +0300"},{"content":"We have only been here a few hours and love it already. After reviewing other reviews, I almost cancelled our reservations due to negative comments. The shuttle is great and restaurant prices are moderate. We are staying in West Village-fourth floor condo and love it. They supply you with detergent, dish soap, dish washer soap and even salt and pepper. The condo is recently decorated and CLEAN. Walgreen and Target nearby.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Ethel Lowe","date":"2014-08-16 21:26:57 +0300"}],"public_likes":["Kraig Dicki","Breana Yundt","Eldred Lakin","Dennis O'Hara","Celine Balistreri","Fae Dietrich"],"vacancy":false,"description":"This traditional Scottish Kirk was built in 1856. The conversion into a 3 room bed and breakfast is an imaginative blend of traditional materials and modern touches retaining the character without creating a gothic atmosphere.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}