{"title":"Blythe","name":"Best Western Sahara","address":"825 W Hobsonway","directions":null,"phone":"+1 760-922-7105","tollfree":null,"email":null,"fax":"+1 760-922-5836","url":"http://www.bestwesternblythe.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.610701,"lon":-114.606147,"accuracy":"APPROXIMATE"},"type":"hotel","id":3785,"country":"United States","city":"Blythe","state":"California","reviews":[{"content":"Stayed at this location for one night with a co-worker, two weeks before the Superbowl in Indianapolis. This hotel was easy to get to, centrally located, and reasonably priced. Valet parking at $17.00 was fair for this location, while I found the service fast and friendly. Hotel staff were very friendly and accomodating, while my room was clean, with a spacious bathroom. The bed was comfortable and the room quiet with an ice machine on each floor. I enjoyed the small, but adequate fitness center, which consisted of three treadmills, a bike and a cross trainer, along with some weights. The hot breakfast in the morning was certainly better then most, including everything from fresh fruit to prepared omlettes and sausage paddies. The breakfast room was spacious, updated and comfortable. Overall, this hotel has a lot going for it with it's great central location, friendly staff, clean rooms, great breakfast and even breakfast on the run for those in a hurry. I will definately stay here again, and would recommend it to anyone.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Gabrielle Doyle","date":"2012-09-13 08:41:38 +0300"},{"content":"My fiancee stayed here for his bachelor party. He used his card to hold the room and in the morning his groomsmen gave him cash to pay. He paid, thinking nothing about it. Later he discovered they had charged his debit card also. So he called the hotel and talked to Simon the manager. The manager said he would ask the clerk if he remembered the transaction. Of course the clerk didn't remember and Simon said there was nothing else to do he would just be out that money. REALLY??? Could he not check the books and see if they were over $122????? Our wedding is coming up in 9 days and we could have used that money. Now we are just out $122 because of his laziness of not getting to the bottom of it. I'm very disappointed!!! Keep your receipt if you stay here because they will steal your money if they can!!!!","ratings":{"Overall":1.0},"author":"Mrs. Brett Koch","date":"2012-05-08 15:42:08 +0300"},{"content":"My family and I stayed recently at the Hampton Inn Downtown Indianapolis. I did my research and looked for a place that had received good reviews from previous customers. Out of all the hotels in downtown Indy, Hampton Inn seemed to garner the most positive reviews from people. Well I have to say that our experience at this hotel was absolutely fantastic. The staff, especially the front desk clerks, were friendly and helpful; the rooms were clean and nice, and the free hot breakfast provided every morning was top notch. The women who worked in the hot breakfast area were so nice, it was always a pleasure to talk with them in the morning. The Hampton provides Valet parking at $15 a day, which is cheaper than most other places nearby. I know that this is the place we will stay for any future trips to Indianapolis.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sarina Vandervort","date":"2015-10-09 05:54:22 +0300"},{"content":"I love this place. The parking has gotten expensive but it is rare to find a place right in the heart of a major city under $100. The breakfast of buscuits and gravy, bacon/egg bagels, coffee, fruit, cereal, etc is free and terrific. The front desk gals are fun and friendly at all times of day and night. This is just the best place on a budget. The rooms were very nice and the bed extremely comfortable. Everybody seems to love their jobs, including the sparkling lady who is in charge of the breakfast. They make you feel at home.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Merl Paucek","date":"2015-10-25 15:03:48 +0300"},{"content":"Spent two nights here. Staff was wonderful, very helpful, very accomodating. The room was absolutely, perfectly clean, especially the bathroom. Comfortable beds. Breakfast in the morning was very good, plenty of selection and plenty of seating. Valet parking was efficient. Walking distance to everything downtown. Great stay, no complaints at all.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Sallie Little","date":"2013-06-12 23:40:41 +0300"},{"content":"Stayed here for 3 nights, March 2012. It's clean, quiet (despite the airport) with a very good breakfast buffet. If you're not looking for the excitement of being on the Strip, it's a good choice. The staff that we dealt with were friendly and helpful. This was our second stay here, the first being spring 2011.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Braulio Kunde","date":"2012-06-01 01:25:26 +0300"},{"content":"Clean, up to date with a superior staff. Made to feel welcome the minute you walk through the door!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Skye Dooley","date":"2015-11-15 06:56:54 +0300"},{"content":"From check-in to check-out, everything went smooth. The front desk person was very cheerful (10:30 pm) and made me feel welcome. The room was immaculate and the bed was one of the best I ever slept in. Breakfast had multiple choices and the coffee was tasty. I highly recommend it.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Sharon Stroman","date":"2014-11-05 21:58:27 +0300"},{"content":"I loved your hotel it was very clean and very nice however we were very tired when we checked in at 11:21 pm which would have been 1:21AM our home time. When I reserved the room through my travel agent he requested that we have a crib for my grandson. When we arrived and checked in I asked if there was a crib in our room the lady said no but she would get me one as soon as her driver of the shuttle come back which would be about 15-20 minutes I told her that would be fine we would give my grandson a bath then he would use the crib. 30 minutes went by and I had looked out the window and seen the shuttle was back I called down to the front desk she again said no the shuttle hadn't been back yet and she would get it soon. 20 minutes later I walked out to my car and seen that the shuttle was there when I was going back into the hotel the shuttle was leaving so I had thought the crib was in the room when I got back to the room still no crib. I counted the shuttlle being back at the hotel 4 diffrernt times and still no crib. 1:30am I called to the front desk and asked I am going to get a crib she said yes mam as soon as the shuttle comes back I told her it had been back 4 times and my grandson is tired and so are we could I please get the crib. My son in law looked out the window and the shuttle was in front of the hotel I called down again she said I am sorry mam but I can't find one by then it was almost 2am I said thank you so much for getting me this crib in 20minutes I was very upset my grandson ended up sleeping on the floor what a nice start to a wonderful vacation. If she didn't have one she could of told me right away.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Don Lind","date":"2013-09-26 05:59:22 +0300"}],"public_likes":["Rachelle Brown"],"vacancy":false,"description":"Free breakfast and Wi-Fi, outdoor pool.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}