{"title":"Berneray","name":"Burnside Croft","address":null,"directions":null,"phone":"+44 1876 540235","tollfree":null,"email":null,"fax":null,"url":"http://www.burnsidecroft.com","checkin":null,"checkout":null,"price":"£29 per person (discounts for 5-night stays)","geo":{"lat":57.71378,"lon":-7.18837,"accuracy":"APPROXIMATE"},"type":"hotel","id":3367,"country":"United Kingdom","city":"Na h-Eileanan an Iar","state":null,"reviews":[{"content":"The Hilton Back Bay is in a great location, close to Newbury St with great restaurants and shopping. There is a small gourmet market (Delucas) just a few blocks away. The hotel is very close to the OLD convention center, but don't confuse it with the NEW convention center, which is not at all close. The hotel itself has a small lobby, with a small on-site restaurant and no gift shop or executive/concierge floor. They do have a small rack of convenience-store type stuff behind the front desk for sale. As a Hilton Gold, I received an upgraded room (w couch) and free water each day. My room (417) was great, wonderful furnishings and bed, couch, and small, strangely shaped balcony. This room faced the Sheraton, and the street between is where many of the large tour buses idle during the day, so I would ask for a room a few floors higher if you plan to be in the room during the day. This wasn't an issue in the evening. I found all of the staff to be extremely helpful and friendly, from the front-desk to housekeeping.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Laurianne Nolan","date":"2015-03-01 12:34:23 +0300"},{"content":"SPOTLESS... Beautiful... great location! Highly recommend! Don't hesitate at ALL!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Erwin Turcotte","date":"2014-05-18 20:38:12 +0300"},{"content":"I stayed here for one night when I couldn't extend my stay at the Westin Copley Place. I thought it would be nice to try a hotel in a different part of the city. The service was adequate but the hotel itself is dark and old and in desperate need of a renovation. The decor is outdated and the furniture needed replacing. On the upside the room was clean and had a comfortable bed. There are better 4-star properties in Boston. Maybe I would consider staying here if the hotel is updated.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Arthur Hegmann","date":"2015-03-12 01:01:15 +0300"},{"content":"When we got to the hotel, we were thoroughly disappointed to find the pool was out of service. The rudely clerk responded it was posted on the Hyatt website; I then told her I had booked through Expedia, and she said it was posted on their site also. It was not. The clerk then said we could swim at another hotel--a car ride away! We went to the other hotel to swim, only to find the pool heater there broken. I had asked if there would be any compensation at the Hyatt, like free breakfast, but they said no, that the ability to swim at the other hotel was the compensation. The bathroom was also in great need of repair. The walls are paper thin; we heard every sound from the very active couple next door. If you use the refrigerator, you must pay a $25 cleaning charge.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":3.0},"author":"Julian Schroeder","date":"2015-09-04 18:05:23 +0300"}],"public_likes":["Trace Kiehn","Callie Sauer","Glennie McLaughlin","Cale Christiansen"],"vacancy":false,"description":"Offers 1 family room (with private bath), 1 double, 1 twin.  Lunch baskets available. Also has a small cottage (The Smiddy) to let.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}