{"title":"Berneray","name":"The Youth Hostel","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.gatliff.org.uk/index.php?option=com_content&view=article&id=3&Itemid=3","checkin":null,"checkout":null,"price":"£12 for a bed, or £7 if you're under 18. It is also possible to camp here for £8/person/night","geo":{"lat":57.71728,"lon":-7.15398,"accuracy":"APPROXIMATE"},"type":"hotel","id":3369,"country":"United Kingdom","city":"Rushgarry","state":null,"reviews":[{"content":"The hotel was right off of the highway and very easy to get to. We requested a high floor room and they gave us the 20th floor, right under the suites. The floor was very quiet and the view was fantastic. As we were leaving to make our 8:15 dinner reservations we heard a knock at the door and when we opened it room service was there. The server asked what the last name was and when i told him he brought in gourmet chocolates and champagne on ice. The note said \"Happy Anniversary! thanks for staying with us - Jennifer at the front desk\". Fabulous hotel staff need I say more? We will be staying there again soon.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Manuel Herzog","date":"2012-02-23 19:06:40 +0300"},{"content":"When we booked this hotel we were worried because we saw more negative reviews than good at that time. I have no complainst...the staff was very helpful, the in house restaurant was excellent, the rooms were very clean. Very close to Macy's, TJ Maxx and Marshall's. . .walking distance to all other sites that we wanted to see. . . The only thing I can say negatively is paying for WIFI but that is a problem with all hotels.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ricky Schoen","date":"2014-02-13 01:01:04 +0300"},{"content":"My girlfriend and I stayed at this hotel on November 19, 2011. The hotel was right off the highway and easy to navigate to. Plenty of signage indicating where to park. Parking was $32 - which some may think is expensive (it is) but we payed $41 at the Hilton Back Bay in the summer so.....yea... Check-in was very quick - you have to take an elevator to get to the lobby if you're coming from outside or from the parking lot, which is an interesting design. We were put on the 18th floor - a previous recommendation to get a higher floor for less noise is definitely worthwhile. The room itself was pretty typical. King-size bed, flat screen TV, desk, chair with leg rest. The washroom was okay - the shower has this ledge that goes along the inside which is great for putting all of our shampoo and soap from home. We could quite clearly hear conversations between people in the hallways that were passing through - there were a few signs in the room asking guests to be quiet after 9pm. They must have had noise issues in the past. Bed was very comfortable and had tons of pillows. Check-out was quick but the elevator area to get to the parking lot/main exit got a little congested. The location is probably the best factor about this place. So close to Faneuil Hall, the harbour, lots of stores along Washington Road.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mr. Meaghan Okuneva","date":"2012-06-03 01:25:49 +0300"},{"content":"We arrived mid afternoon with a very tired 4 year old to find that our room was not ready! We went to wait in the bar (very nice staff) and were eventually told we had a room. The room itself lacks any personality but is perfect if you just want somewhere to sleep. Be warned though you have to pay hefty prices to watch any of the tv programmes/ play the games! Do not stay here if you are likely to want some fresh air or a cigarette as you have to go down in one set of elevators then walk through the large lobby to some other elevators then walk through another lobby to get outside! The staff in general were all very nice and helpful. The fitness facilities are great for adults and kids (though probably best to go with kids to the pool when its empty). The hotel is in a great location but we were led to believe it was above Macy's- it's not. You have to go to yet another set of elevators down 2 floors then its a short walk from there. We tried not to spend too much time here but on the second night we had to order room service as our son had fallen asleep and the Clam Chowder and fries were excellent!!! All in all its not a terrible hotel but I wouldn't stay here again. The price was also very steep with it being half term week (the Marriot on the waterfront would have been $200 dollars a night cheaper but it was full). Also the maid service is terrible. The beds were made and towels were tidied but the room itself was not tidied (as you would expect it to be","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Novella Kunze DVM","date":"2013-07-26 13:05:50 +0300"},{"content":"Nicely located near the T...steps away from Tufts Hospital and china town. We had a hard time finding restaurants near the hotel. Reception area does not have wifi; not convenient for a business traveler in need of internet while waiting for room availability. Rooms were in need of an upgrade, old bathroom fixtures, old furniture- very run down and depressing. Luckily we were only there for one night.","ratings":{"Location":4.0,"Overall":3.0,"Value":3.0,"Service":3.0,"Rooms":2.0},"author":"Mrs. Kale Heller","date":"2013-05-24 15:26:41 +0300"},{"content":"Lovely hotel. Great service from the front door man, the receptionist, the restaurant and from the person getting a taxi. I will definitely come back here again. Plus, it is so close to the freedom trail. And, the downtown shopping area, Quincy market, shed aquarium. A big negative is that there is no wi-Fi!!!!!! Why can't this hotel just give it for free when I paid $400 a night.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Jensen Carroll","date":"2014-07-27 05:18:15 +0300"},{"content":"This hotel has to be hands down the nicest chain hotel I have stayed in. The room was very clean and modern. The staff was incredibley nice and everytime we walked by the lobby they asked how we were doing and how are stay was. The pool was fantastic it was olympic size and had great dressing rooms. I love this hotel and recommend that anyone going to Boston should stay there","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Domingo Murray","date":"2013-09-25 00:21:39 +0300"},{"content":"This is a wonderful hotel---everything that makes you love a hotel!! The location is great--about a block from The Commons, the Freedom Trail and the subway. Shopping is all around here too. The hotel itself is lovely and the staff is very helpful and pleasant. The concierge was especially helpful and great to talk to. The rooms are large with large bathrooms. They are very clean and well-decorated. There is a very nice cafe with a nice buffet for breakfast. It might have the buffet for lunch too but we were always out sightseeing at that time. And the price was right!! And-----one of the greatest and unexpected features about staying here is that there is a parking lot right across the street that is MUCH more reasonably priced than parking at the hotel. We rented a car for 4 days to do out of town sightseeing and this parking lot was wonderful---a great price for overnight if you are just out by 8am. The only negative is that my sister and I had specified separate beds and when we arrived very late, as they had been informed would be the case, they had only a room with a king bed. We got that straightened out the next day. YES, WE WOULD ABSOLUTELY STAY HERE AGAIN !!!!! WE COULDN'T ASK FOR ANYTHING MORE.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Chloe Collier II","date":"2012-03-15 07:14:58 +0300"},{"content":"Today is July 1st 2011. I had to download the app to my iPhone and write this review, because I was so upset that I was lied to by the front desk lady, as well as the manger. When I confronted them with their lies, they had the IQs to create more blatant lies. I stayed at the corner room on the 16th floor, it was. Good size room with 2 beds. I asked for another rollaway bed, I had done this at the Marriott Copley square hotel where the room was much smaller. The front desk lady ( extremely unpleasant) said 'no , it's a fire harzard'. I knew it was a lie, because Boston rules And regulations should applied go both hotels. I asked for proof of of the rules, she could not provide. Her manager called , he said it was not Boston reggulation, but hyatt's policy, however, this is a policy he can not show me ( a customer), when asked why a hotel has some secret policy which is not open to customer, he again changed to another story, saying something like the maid does not want to have a rollaway bed because it is too crowded. How strange? I told him this room is 30% larger than the one I stayed at the marriot Boston, if it was not crowded at the Marriott ( they always brought the rollaway when asked) , why it should be crowded at the Haytt? Here's his answer: ' you can go back to the Marriott' So for those of you who've traveled around, here's your taste of the professionalism at the Hyatt Boston. I am extreme upset, but this is the July 4th , leaving is not an easy option, my only choice is get on here to write my review.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Location":4.0,"Rooms":3.0},"author":"Vicky Koss","date":"2015-06-23 20:54:25 +0300"}],"public_likes":["Keira Kirlin Sr.","Shyanne Beatty","Leonor Mills","Adolfo Blick","Kay Klein","Jarod Raynor III","Jazmin Kunze","Bobby Boyer","Marlene Tillman"],"vacancy":true,"description":"Operated by the Gatliff Trust on behalf of the SYHA. Has 20 beds, and is world-famous for being in a most spectacular location. Perched on the north east side of the island, the hostel is at the end of the east beach, and has views over the Sound of Harris to Harris, mountains on the mainland, and Skye.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}