{"title":"San Francisco/Union Square-Financial District","name":"Hyatt Regency San Francisco","address":"5 Embarcadero Center","directions":"at the Embarcadero Center, next to the California and Market cable car turnaround","phone":"+1 415 788-1234","tollfree":null,"email":null,"fax":"+1 415 398-2567","url":"http://sanfranciscoregency.hyatt.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7943,"lon":-122.3958,"accuracy":"APPROXIMATE"},"type":"hotel","id":26226,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I come to NYC very often for business and am pretty loyal to my normal hotel; but when they weren't able accept my reservation I decided to give the GEM a try. Not only did I try it but 4 of my colleagues also were there. The lobby was beautiful and being an art fan, I noticed they sold local peices from artists in the neighborhood. I thought that was a great way to incorporate a true New York hotel experience. All of us absolutely loved our rooms; the beds are so comfortable! The whole hotel was beautifully decorated and in a charming neighborhood. It felt like my new apartment in Manhattan! We will be back again and cannot wait for our next trip!! Thank you everyone at the hotel for the great experience and all your help!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Anjali Satterfield","date":"2012-03-26 00:03:45 +0300"},{"content":"Have enjoyed my time in the hotel very much, even if I was in charge with organziang an event. Very helpful staff, always polite and smiling - didn't feel like work, they've made my job so enjoyable. Nice food, good internet connection and the rooms, a real oasis, newly refurbished. The meeting room with natural light. Excellent prices considering the location - smack down town. I just wish the tv would have been more exciting - with the exception of CNN and BBC, couldn't really watch anything else, everything else was translated in Italian.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Cassandra Turcotte","date":"2013-03-11 00:07:30 +0300"},{"content":"The Giustiniano is a top rate hotel located near the Vatican. The area around the hotel is known for housing offices (lawyers and the like) so it is busy during the day, but very quiet at night. One bonus is that finding parking in the evening is not very difficult. The Vatican and Castel Sant'Angelo are mere minutes by foot, and most other major sights can be reached within 15 minutes on foot. The hotel is very modern and the rooms are large and comfortable. I was upgraded to a suite, which was even nicer. The bed was large and very comfortable with many pillows of various sizes. The room had a large desk with wired internet, a sofa and a minibar. It is very easy and comfortable to work in the room. The bathroom was of impeccable quality and adequate size. It has a bidet for all those who use them. The ladies at the front desk were very helpful and spoke good English. One disappointment was the breakfast. Whereas the selection of food was large and varied (eggs, bacon, sausage, cold cuts, cheeses, croissants, etc.) the coffee (espresso & cappucino) was not good. I expect better in an Italian hotel. As you can tell from by sole, relatively insignificant complaint, this is a first rate hotel and I'd return in a heartbeat. However, at its price range it will probably not be my first choice.","ratings":{"Location":5.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":5.0},"author":"Mrs. Savannah Gibson","date":"2015-07-24 23:27:05 +0300"},{"content":"it was a nice hotel with new and clean room... we were given a room with a small living room area and balcony.. the hotel is near to the vatican and within walking distance of the other places of interests like castel sant angelo (5 mins), spanish steps (15 mins), trevi fountain (15 mins), colessum (20 mins)... only thing is that we had no free wifi...","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Otis O'Hara","date":"2012-03-08 18:31:45 +0300"},{"content":"The room is spacious with 2 flat screen TVs, one in the bedroom and another in the sitting area. The room and bathroom are clean and the bed is really comfortable. The hotel also offers great breakfast. The hotel itself is within walking distance to the metro station, which is the cheapest way to travel to and from the airport.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vanessa Gottlieb Jr.","date":"2012-01-02 14:08:45 +0300"}],"public_likes":["Mrs. Guy West","Henderson Mann","Sharon Harris","Maybelle Pagac","Loren Reynolds","Antoinette Spinka","Reagan Cronin","Devin Kris","Kaleb Gutkowski"],"vacancy":true,"description":"A very prominent hotel near the waterfront, with many rooms having lovely views of the Bay. Typically of Hyatts, there are plenty of amenities and very nice rooms.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}