{"title":"Venice (California)","name":"The Inn at Venice Beach","address":"327 Washington Blvd","directions":null,"phone":null,"tollfree":"+1-800-828-0688","email":null,"fax":"+1 310-827-0289","url":"http://www.innatvenicebeach.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98081,"lon":-118.46405,"accuracy":"APPROXIMATE"},"type":"hotel","id":32173,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"Roman Spa is funky and comfortable; the spa and pool are warm and inviting. Love the fact that the Oasis is right across the parking lot. A great place to veg with your girlfriends!!!","ratings":{"Overall":4.0},"author":"Delphine Batz","date":"2012-03-01 08:07:28 +0300"},{"content":"The Roman spa in Calistoga, is a paradise of flowers, humming birds, fountains, and mineral pools. We return here year after year anticipating the relaxed and rejuvinated sensations that overcome us during our visits. The pools have varing degrees of temperatures, you can find your bliss in anyone or all of them. The service is superb, with easy acess to extra towels, and friendly desk service. The location is perfect, just steps away from main street, and its great eateries. The tranquil atmospher is really pleasing with the beatiful grounds, flowers, fountains, and Palm trees, I think the hummingbirds are slow to migrate because they refuse to leave this oasis. We love the Roman Spa and plan our return when ever we can.","ratings":{"Overall":5.0},"author":"Ms. Katherine Nader","date":"2014-06-10 03:12:00 +0300"},{"content":"Paid 300.00 a night for a tired \"family suite\", only to find it was a one bedroom room with a wallbed in the main living room. Kitchen is small, and the room is older in look and furnishings. Pool and spas are stained but ok, but get this - we took our two year old into the pool area only to be reprimanded and told that it was a \"law\" that we couldn't have him in the pool. Funny - we've stayed in other hotels in Calistoga and NEVER had that problem. I believe it was most likely an insurance issue. Stay away...We enjoy our stays in another very nice Calistoga property as we go up there frequently, and the only reason we took a chance on this place was that it was booked. In the future, we'll make sure it's available..!!! (If I could give ZERO stars as a review, I would)","ratings":{"Service":1.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Deonte Cole","date":"2013-07-22 03:32:32 +0300"},{"content":"My huband and I just recently returned from a peaceful and relaxing extended weekend at the Roman Spa Hot Springs in Calistoga. We return to this heavenly resort every year in February or March to have a weekend to rest and enjoy the beautiful surrounding of the Roman Spa. Not only is the heated pool and indoor Jacuzzi used, but the peaceful and beautiful grounds at the Roman Spa are something we look forward to visiting. The flowers are beautiful. We have some friends who join us on this wonderful weekend and on the grounds they have available picnic tables, along with BBQ's to use. This year they have added a gas BBQ and it was great! We met our friends, who were also staying at the Roman Spa, for dinner out at the picnic tables and really enjoyed ourselves. We also love the friendly visitors and staff at the Roman Spa and we have made this a tradition for years to come.","ratings":{"Overall":5.0},"author":"Selina Wilkinson","date":"2014-10-08 09:03:36 +0300"},{"content":"Do you remember the \"Calgon, take me away,\" commercials? This is like - Roman Spa take me away! So nice to dip into the hot mineral pool and let go of the cares of this world. Relaxing atmosphere, always friendly and helpful staff. This was our 5th time here in the last 13 years and we will be back sooner than later. Walking distance to excellent food. The rooms are basic, but clean, the grounds are well kept. Enjoyed a massage at the Oasis as well. Good times!","ratings":{"Overall":5.0},"author":"Misael Miller","date":"2014-06-06 12:57:40 +0300"},{"content":"Roman Spa is tucked away one from down town Calistoga. Quietly located across from a historical building, it is conveniently located to shops, restaurants, a market, art galleries, and book stores. At night it is quiet. The gardens at the Spa are beautifully tended. Many waterfalls or fountains created a peaceful and serene atmosphere. The soaking and swimming pools are small but I never felt crowded. Three pools offer temperatures from warm to hot with the jacuzzi being the hottest of the three. It is wonderful to sit outside in the sun. Deck chairs and recliners are located throughout the Spa grounds for relaxing. A picnic and Bar-B-Que area is equipped with Weber stoves and the items necessary to have a fun outdoor dinner. At night the pools are softly lit and the night sky, midnight blue when we visited, is filled with stars. Coffee is organic Thanksgiving coffee sustainably grown. Instead of those tedius little pots in each room, you can walk to the office and enjoy as much coffee as you like. Our room did not have a kitchenette but did have a refrigerator. We enjoyed lunch and breakfast (fruits and salads) during the day time at the Spa but ate dinner in town. The staff is friendly and our maid spoke both English and Spanish. She was very helpful when we asked her to make up a couch into a day bed. We love the Roman Spa. This is our 15th year of visiting the Spa. I would recommend the Roman Spa to my friends.","ratings":{"Overall":5.0},"author":"Icie Willms","date":"2013-05-05 17:56:25 +0300"},{"content":"We were greeted warmly and had an early check in. The rooms are super clean and comfortable. The pool is small but nicely landscaped to feel like an \"oasis\". The water temperture was perfect. The best feature is how close the hotel is to the center of town- just a few steps away to our favorite restaurant, Wappo Grill, and the wonderful coffee shop, museum and park. Makes it a super pleasant and easy get-away for a night in Calistoga.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":5.0},"author":"Allie Leuschke","date":"2012-07-29 23:38:23 +0300"}],"public_likes":["Yvonne Johnston IV","Gerson Reilly"],"vacancy":true,"description":"Located one block from the Venice Beach Boardwalk, adjacent to the world's largest man-made yacht marina. Has direct online reservations and special packages.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}