{"title":"Paris/9th arrondissement","name":"Hotel Best Western Opéra d'Antin","address":"75, rue de Provence","directions":"Metro Chaussée d'Antin–La Fayette / Havre Caumartin / Auber","phone":"+33 1 48 74 12 99","tollfree":null,"email":"reservation@operadantin.com","fax":"+33","url":"http://www.parishoteloperadantin.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.8743,"lon":2.33197,"accuracy":"ROOFTOP"},"type":"hotel","id":21859,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"My family and I decided to have breakfast at the SeaHouse restaraunt at Napili kai. As we finished parking we were greeted from a man who was basically screaming at us from acroos the way.shocked and not knowing if he was referrring to us the man got closer to us and started cussing and yelling..not to mention we had our infant twins and 2 toddlers with us. He was yelling at us saying that this parking was for people dining at the SeaHouse or hotel guests! NOT BEACH PARKING! HIs actions were so un-called for! he wouldnt even listen to what we had to say.. we were so shaken up and scared because obviously this man had no limit of control AT ALL!!! We left immedietly and called the hotel to talk to a manger.. they said no manager was available until 2pm. they apologized and said they would let the manager know. we felt very uneasy and will NEVER COME BACK to this hotel!","ratings":{"Overall":1.0},"author":"Donavon Schimmel","date":"2015-04-02 18:33:09 +0300"},{"content":"Have been staying at this property for many years and have also been recommending it for as long. A great place right on the beach at I think the best beach in the Hawaiian Islands. Very traditional, not fancy but clean and nice. Have a great Children's Luai , serves the best mai Tai's...overall a perfect place to stay:)","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Marianna Metz","date":"2013-06-27 21:00:05 +0300"}],"public_likes":[],"vacancy":false,"description":"When you exit Hotel Best Western Opéra d’Antin and leave the large department stores behind you (Galeries Lafayette & Le Printemps), just cross boulevard Haussmann and you will find yourself before the Opera Garnier.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}