{"title":"Paris/15th arrondissement","name":"Mercure Paris Centre Tour Eiffel","address":"20, rue Jean Rey","directions":"Station Tour Eiffel (RER C) / Bir-Hakeim (Metro 6)","phone":"+33 825 80 17 17","tollfree":null,"email":"H2175@accor.com","fax":null,"url":"http://www.mercure.com/gb/hotel-2175-mercure-paris-centre-tour-eiffel/index.shtml","checkin":null,"checkout":null,"price":"€145+","geo":{"lat":48.8548,"lon":2.29233,"accuracy":"APPROXIMATE"},"type":"hotel","id":21652,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We have stayed here many times. I am a third generation guest. My husband and I always come to Daytona for our anniversary every year and stay at tropical manor. This is one of the cleanest places we have ever stayed at. They have everything you need in a room plus more. this place is small but it's perfect if you want to stay somewhere quiet. This trip, we were threatened with possibly not making it to Daytona due to an illness. Last Minute, we decided to go. Although I was terribly ill for the first 5 days of our trip and didn't get to enjoy one minute out in the sun, we still made it out every evening to see the ocean, walk in the sand, and pick up shells. On our last day, Audrey, the owner was gracious enough to let us stay the entire day in our room and on the sundeck until the evening hours. there were hardly any guests left so we had the place practically to ourselves. Audrey even came down and joined us by the pool! We appreciated this time, since I was unable to thoroughly enjoy myself at first. I felt great the last day and my husband and I left feeling very happy. This is what true hospitality is all about! Thank you again Audrey and tropical manor. We will be back again next year!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Javonte Friesen","date":"2014-06-19 14:56:42 +0300"},{"content":"My sister and I stayed here, Perfect getaway spot for families or a place to relax. Clean, no bugs, great staff, great view, heated pool. Quiet. Cozy. Bring coffee. Enjoyed the visit VERY MUCH! A short few feet to the beach. Barbeque grill. No bugs. Kiddie pool. Would definately visit again!!! DO NOT HESITATE TO STAY HERE! Cozy rooms..great maid service. On top of it groundskeeper. Friendly staff. Perfect place to relax. NO LOUD guests. Very homey and relaxing experiance. Stay there, you won't be disapointed!!!!!! A*****!!!!!!!!! Will visit again!!!!!!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Tony Nitzsche","date":"2013-10-11 07:40:06 +0300"},{"content":"My family and I have been going to Daytona for about 20 years now. For the past 15 years Tropical Manor has been our Tropical Paradise one week out of the year. The people who run Tropical Manor are extremely polite, willing to help if there is a need. The rooms are kept cleaner than most peoples homes. Just be careful if you have trouble climbing stairs because some of the rooms don't have elevators that go to them and the steps are a little steep. Over all we have always been pleased with the Tropical Manor and will stay there for years to come.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":4.0,"Rooms":5.0},"author":"Cheyanne Nader","date":"2015-11-26 12:43:03 +0300"},{"content":"I recently stayed in this hotel and found the experience very pleasant. Paying more than reasonable price, you will find rooms clean and comfortable, and staff friendly and helpful. Not to mention that hotel is located close to the shopping area. Next time I will visit Montreal, I am definitely coming back.","ratings":{"Overall":4.0},"author":"Roger Auer","date":"2015-03-20 10:01:37 +0300"},{"content":"What a pleasure to arrive for breakfast each day to a smiling face that was truly happy to see you and help. Lassandra kept the line moving and made sure each person was treated special. She is truly an asset to your organization!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lorena Collier DVM","date":"2015-02-08 20:37:46 +0300"},{"content":"I recently stayed at this hotel for business and was very impressed with the customer service that I received. The front desk staff were very friendly and courteous. The room I stayed in was spacious, clean, quiet and comfortable. The location was perfect and very close to my office. The best part of my stay were the delicious pancakes and egg white omelets whipped up by Lassandra. A great way to start your day!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Randi Mills","date":"2015-11-25 13:10:29 +0300"}],"public_likes":[],"vacancy":false,"description":"A relatively large mid-range hotel very close to the Eiffel Tower, in a nice, quiet and green area of Grenelle. Despite the closeness, only about a quarter of the rooms, designated as such and commanding higher rates, feature a view of the tower itself. All of the rooms and common spaces have been renovated and feature modern decor inspired by the tower and the metro. The rooms are very functional and feature operable windows, but the amounts of plastic and the violet theme may not provide for a romantic Parisian experience.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}