{"title":"Mull","name":"Beach House Self Catering","address":"Lower Ardtun, near Bunessan, Isle of Mull","directions":null,"phone":"+44 131 669 3082","tollfree":null,"email":null,"fax":null,"url":"http://mull-escape.co.uk","checkin":"4pm","checkout":"11am","price":null,"geo":{"lat":56.338992,"lon":-6.106306,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":19324,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"We stayed for two days in August. The location of the hotel is really good - about two minutes from the Liceu metro station and five from the Plaza Catalunya. The buffet breakfast is good and the staff are friendly and helpful. If you go into some of the back streets in front of the hotel you can find some nice little bars and escape the Ramblas.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Tina Kautzer","date":"2012-03-07 18:18:23 +0300"},{"content":"I stayed in Hotel Curious for 3 days during my 'tourist' visit to Barcelona. Overall I am very satisfied with the hotel. Location is excellent for sightseeing - next to La Rambla, La Boqueria Market and Liceu subway station, few steps to Catalunia (where the airport bus stops). Though being so centrally located, it is surprisingly quiet (and I'm a light sleeper). Hotel offers complimentary breakfast (simple but tasty) and high-speed WiFi. And the best thing about the place is its staff - both reception and kitchen people are extremely friendly and helpful. The best hotel staff I've experienced so far. On the downside - the room is so small, that there's literally no room for proper wardrobe and storage. All I had in my single room was two little drop tables with a shelf (unreachable high) and some hangers above them (which means all the long things you hang will have their bottoms lying on the tables) and a tiny bedside table. That was totally OK for my short visit, but if you're in Barcelona for longer than, let's say/ a week, you might need a bit more room to arrange your clothes/shoes and other staff. Besides that, room and bathroom were very nice, new and clean. Oh, and there also was a little balcony facing the backyard - I suppose, for the smokers.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Hanna Jenkins","date":"2014-03-02 16:55:05 +0300"},{"content":"Boys (we were boys, but we are now nearly 40) trip to Barcelona. Hotel is just off las ramblas, walking distance from place de la catalynua where the airport tube / bus drops off. It's a small hotel, and although relatively basic its very clean, well run, has everything groups or couples need, was quiet (we weren't noisy), had free breakfast which was OK and i would recommend it for any groups / couples / singles on a budget - it's the best you are gonig to get for your money.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Eleazar Rau","date":"2015-02-24 18:12:26 +0300"},{"content":"Renovated Nice rooms A little bit noisy Nice breakfast not great variety Free wi-fi","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":4.0,"Value":3.0,"Service":3.0},"author":"Velva Dickinson II","date":"2015-09-15 12:40:50 +0300"},{"content":"Excellent reception staff - helpful & friendly. Hotel feels very safe & central location for Las Ramblas. Liked the modern decor & beds were very comfortable! Free internet access in the lobby.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Otho Lockman","date":"2015-03-05 20:37:32 +0300"},{"content":"This hotel is as good as it gets for a reasonable price. The location could not be much better, the price I paid was very reasonable, the staff was extremely helpful and friendly and the breakfast was very good. If you are traveling to Barcelona on a budget, this is the place to be.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Buford Gulgowski","date":"2012-08-29 09:28:44 +0300"},{"content":"Everything was just perfect, not only rooms but also receptionists...STRONGLY RECOMMEND.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mrs. Calista Rogahn","date":"2015-06-18 09:08:46 +0300"}],"public_likes":["Ashlee Cremin","Mike Emard","Rogelio Green","Berenice Hettinger"],"vacancy":false,"description":"Beach House is a restored farmhouse looking over Loch Scridain, half way between Bunessan and Pennyghael. The holiday home can sleep up to eight.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}