{"title":"Llanfairpwllgwyngyllgogerychwyrndrobwyllllantysiliogogogoch","name":"The Outbuildings","address":"Bodowyr Farm, Llangaffo, Anglesey LL60 6NH","directions":null,"phone":"+44 1248 430132","tollfree":null,"email":"info@theoutbuildings.co.uk","fax":null,"url":"http://theoutbuildings.co.uk","checkin":null,"checkout":null,"price":"£90","geo":{"lat":53.1899,"lon":-4.3048,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15955,"country":"United Kingdom","city":"Isle of Anglesey","state":null,"reviews":[{"content":"I recently stayed at the Sheraton Old San Juan Hotel & Casino. I must say, the location is spectacular, if you are looking to really experience old San Juan. It's situated near the ocean and some of the historic sites. I was there on business, but because of its location, I was able to see some of the sites at the same time as taking my meetings. It's near the main highways to get around in the city. That said, the hotel is in some serious need of renovation. I found my room to be depressing. My bed was extremely comfortable, heaven actually, but the furniture in the room bothered me. It felt cheap. Uninspired decor left me less than impressed. There was also a very strange smell in the room, like shower curtain that has remained wet for days and never dried kind of smell. A muggy, mildewey smell is the best way to describe it. The front desk staff was ok. I didn't find them to go above and beyond the call of duty to make me feel welcome. I also felt like they were under staffed at front desk and not very knowledgeable of procedure. My checkout lasted almost 30 mins due to some printing issue. Room service gal was awesome. All in all, the location is AMAZING and highly recommend it for that alone. You can walk to the beautiful old town (and Starbucks). As for the guestrooms, the bed was amazing, but I was very unhappy with the rest of the decor and bulky furniture.","ratings":{"Cleanliness":3.0,"Sleep Quality":5.0,"Overall":3.0,"Value":2.0,"Service":3.0},"author":"Haleigh Kunze","date":"2012-10-20 12:47:51 +0300"},{"content":"We arrived early (our cruise shipped docked at the FAR port, a $12 cab ride away). We were able to check our bags with the consierge, and were given maps and information--so we were able to make the most of our day and see the city- the free Trolleys were helpful. What a beautiful city--- and the people were kind and friendly. Can't wait to go back!!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Nicolas Graham","date":"2012-01-29 05:49:21 +0300"},{"content":"The hotel is in a great location. We stayed here post cruise. Check-in was easy. We arrived around 11am and did our pre check-in. They stored our luggage and took my cell number to call us when the room was ready. We had a room by 1pm and were upgraded to a Jr. Suite. Rooms are OK. No fridge or mini-bar which I would expect in a higher level hotel. Biggest complaint was that the gym was closed for renovation, which meant the pool was also closed. It was obsecenely hot in Puerto Rico and a pool would have been nice. Did not eat in the fancy restaurant but did eat at Chicago Burger Co., which is attached to the hotel. Good burger but pricey. My biggest praise was for the staff at the hotel. Everyone we dealt with was extremely friendly and professional.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":3.0,"Value":4.0,"Service":5.0},"author":"Ms. Jana Herman","date":"2012-12-21 06:46:37 +0300"}],"public_likes":["Jaida Cassin","Abigail Sawayn","Antoinette Schaefer","Bridget Rohan","Trudie Hoppe","Laron Hilll","Lonnie Howe","Dangelo Wehner"],"vacancy":false,"description":"Restaurant with rooms. Five luxurious en-suite bedrooms, restaurant and events venue with wedding licence.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}