{"title":"South Lake Tahoe","name":"Heavenly Valley Lodge Bed & Breakfast","address":"1261 Ski Run Blvd","directions":"1/2 mile up from the Lake, off the 50, or Lake Tahoe Blvd","phone":"+1 530 564-1500","tollfree":null,"email":null,"fax":null,"url":"http://HeavenlyValleyLodge.com","checkin":"3PM","checkout":"Noon","price":"$89-$275","geo":{"lat":38.94667,"lon":-119.97222,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":28159,"country":"United States","city":"South Lake Tahoe","state":"California","reviews":[{"content":"We understand New Orleans hotels are held to a lower standard than hotels in other cities, but if you are going to expose your brand by building a hotel, you should at least strive to meet minimum service standards. Unfortunately, the Ritz Carlton New Orleans did not do that. On our first day, we phoned the front desk to request an ipod player. Four hours later, we stopped by the front desk to repeat our request. Finally, seven hours after our first request, the ipod player arrived. On our second day, we realized we did not have a room service menu in our room. Fifty minutes and multiple calls later, we were told that there was a room service menu in our room (if we'd just look on the desk). Sorry folks, no menu! Our next call was to the manager, and he personally delivered the menu. Nice touch, but honestly too little too late. These might sound like small complaints, but they our anecdotal of larger service issue we experienced with the hotel (e.g. poor bar service, no turndown service). We will be selecting another hotel in Nola next time, striving for the closest approximation to luxury we can find. This is not a bad hotel, but it is no Ritz Carlton.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":3.0,"Value":1.0,"Location":2.0,"Rooms":3.0},"author":"Francesco Kulas","date":"2012-12-07 02:24:59 +0300"}],"public_likes":["Walker Littel","Ms. Burley Hoeger"],"vacancy":true,"description":"Newly renovated, new beds, linens, furniture, decorations and amenities. In-room fireplaces, ceiling fans, flatscreen TV, with DVD player and library of 400+ complimentary movies, iPod docking stations, kitchenette with refrigerator, microwave, toaster, coffee maker, private bathroom, free Wi-Fi, complimentary breakfast. We also have 4 outdoor patios, with a large open park with outdoor games, and the property is off the beaten track, set back amongst tall Pines. Close to great restaurants, the lake, Casinos, shopping, golf etc. Dogs welcome. The Heavenly shuttle bus stops right outside the property offering Ski-In/Ski-Out convenience for skiiers and snowboarders.","alias":"previously Inn at Heavenly","pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}