{"title":"Red Wharf Bay","name":"St Davids Holiday Park","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.stdavidspark.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.306685,"lon":-4.211501,"accuracy":"APPROXIMATE"},"type":"hotel","id":41239,"country":"United Kingdom","city":"Red Wharf Bay","state":null,"reviews":[{"content":"We stayed at Ramada for cowboys game even though it is far from stadium. Excellent brekfast and clean room...very friendly staff.Alsoused their transportation to near by bar. Great experience.","ratings":{"Overall":5.0},"author":"Miss Norris Lakin","date":"2014-10-19 13:18:16 +0300"},{"content":"we stayed at this place for wedding. we made reservation just 24 hours before arrival.staff is very friendly and everyone in hotel helped us to get around and made our event successful.very clean rooms,great breakfast items.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":3.0},"author":"Eliseo Lind","date":"2014-04-14 20:32:08 +0300"},{"content":"Per una vacanza spensierata e allegra!!   showReview(17563416, 'full');","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Isabelle Funk","date":"2014-04-26 00:16:09 +0300"},{"content":"Our family an I will definately be back. The front desk personal went out of their way for us. We had a great summer vacation and can't wait to return.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Margarett Beahan","date":"2015-09-20 22:06:31 +0300"},{"content":"I stayed at the hotel for one night during business trip. The room is small but has good ammenities. Internet connection is decent, expect 1-2Mbps. One thing I did found was the long lines to check in and check out. Took me 20 minutes waiting to be checked in. I also saw a couple of guests complaining on some charges. I did not had any problems. Bed was too soft for me, no pillow options. Is a good hotel for business right in Reforma, but the location can also be a problem. All manifestants usually use Reforma street. Rooms in the right side of the building do not have a view at all, they face towards a building onlu about 60 ft from you.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Mr. Samanta Mueller","date":"2013-11-29 19:04:11 +0300"},{"content":"I stayed at the Marriott Reforma in Mexico City, June 23-27 2011. I am a Gold Rewards Member, and I was ushered to the Executive level to check in as soon as I gave my name. The room was comfortable. Beds nice and soft, slept well. The showers were wonderful, plenty of pressure and hot water. I was given two free bottles of water daily which is standard with the room. They provide food if you have Executive Lounge access from 6AM-10PM. Breakfast had a nice selection of cereals, fruits, breads...the only thing I didn't care for was the room temperature juice...They served mini sandwiches throughout the day which were great. They provided dinner later in the day, usually some local Mexican fare which was pretty good. The servers took the time to learn your name and what drinks you normally drink. I tried the buffet they had downstairs on Sunday. It was excellent. I tried the corn quesadilla and all it had in it was peppers and cheese, it was delish. They had pulled pork and shredded beef which was tender, juicy, and seasoned...No sauce was required. My only issue was when I had a friend come up to the room late one evening with me before heading to the clubs, security stopped us when getting on the elevator..and addressed my guest in Spanish like I wasn't standing there. I don't speak fluent Spanish and that was rude. I advised the front desk that is unacceptable. If you have an issue with my guest, you address me and not my guest. She was like for security issues, they needed the ID. Which is no big deal, I get that..but told her it's all about their presentation. But other than that little scene, the stay was great.","ratings":{"Location":5.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Kay Jacobs","date":"2013-06-13 00:15:41 +0300"},{"content":"A review of the hotel will follow this WARNING: This hotel inflates the exchange rate on bookings made in USD which increases the cost of the nightly rate you will pay. This exchange rate inflation is not disclosed on Marriott.com and the estimated cost provided by Marriott.com understates the amount you will pay. Even more disgracefully, this practice is not disclosed on check-in. And what a shame since the hotel itself is rather nice. The front desk clerk told me Mexican hotels are legally able to inflate their exchange rates by up to 8%. Be sure to take this into account when comparing the Marriott Reforma against other options. Apart from the above, this hotel is rather lovely. It’s well located near the Independence Angel which means it’s roughly halfway between the downtown Zocalo area and the Bosque de Chapultapec / Polanco area. The room is standard Marriott fare; comfortable and well appointed. Maid service was spotless and prompt. I did find the wireless signal to be very weak in the room, but there’s a strong signal in the lobby and the executive lounge. The standout feature is the executive lounge which has a spectacular outdoor balcony overlooking Paseo de la Reforma. The staff annoyingly require a signature even on a zero dollar invoice which smacks of fishing for tips, but apart from that the staff are very helpful and friendly and the food and drink options are very good. Overall a lovely hotel, but the experience was marred by the hotel’s distasteful practice of inflating the exchange rate which is really a cash grab designed to make you pay more than anticipated for the room. What a shame.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Claudine Klocko","date":"2014-12-12 19:51:12 +0300"}],"public_likes":[],"vacancy":false,"description":"is set in an idyllic location of outstanding beauty with its own private beach with stunning views of the coastline and Red Wharf Bay.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}