{"title":"San Francisco/SoMa","name":"Hotel Griffon","address":"155 Steuart St","directions":"between Mission and Howard","phone":"+1 415 495-2100","tollfree":null,"email":"reservations@hotelgriffon.com","fax":"+1 415 495-3522","url":"http://www.hotelgriffon.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7929,"lon":-122.3923,"accuracy":"APPROXIMATE"},"type":"hotel","id":26025,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We very much enjoyed our two night stay at the Homewood Suites. We had a suite on the top floor which was so much larger than we expected. It was like an apartment with full kitchen , living room and large bedroom.The decor was very pretty and modern, two large flat screen TVs, very comfy beds with lots of pillows, hardwood floors and a large bathroom. It was too bad we could not stay in the room more it was so comfortable but we were off sightseeing and found the hotel to be conveniently located to the downtown area. I think they used to have a free shuttle but it was discontinued. The hotel serves a free breakfast daily and also a light dinner with wine and beer from 5:00 to 7:00 on weekdays which was really nice .The room was pricey at $239 but we were able to use the Seattle Tour Saver coupon for a free night which made it a good value for us. The staff is very friendly and eager to help you in any way they can.l We were disappointed we were not able to get reservations for \"Sky City\" at the Space Needle but when we mentioned at the front desk it was done along with a special dessert sent to our table making the evening perfect. I would definitely stay here again and recommend it others!","ratings":{"Location":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Maybelle Fisher","date":"2014-11-02 04:07:13 +0300"},{"content":"We were here for one night and the perfect location makes it very easy to go around the city. Room is very spacious with a nice view. The staff is also very helpful. Overall we find it a pleasant stay in this hotel. The only thing I would bring to your attention is the noise coming from the street. We stayed on the top floor and still heard the traffic. So it's better to ask for rooms on the top if you are a light sleeper. The hotel provides ear plugs on the bed side so that might be helpful.","ratings":{"Cleanliness":5.0,"Sleep Quality":3.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Merritt McDermott","date":"2013-08-05 10:00:04 +0300"},{"content":"Never saw a staff person in 3 days without a smile and a warm welcome. Spotless, large room with balcony--fresh air 24/7. Well stocked kitchen, clean furniture and linen. Easy on/off freeway. Never waited more than 5 mins for our SUV from the parking garage. No noise from our inside courtyard room. Great water pressure for showers--extra hot water!! Super fast elevators. Had guests on both sides of our room but never heard them. The king bed was a tad soft for us--but can't take our sleep number mattress on trips!! We will be making this hotel our place to stay in future trips to the big city!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Elliot Schulist","date":"2014-02-27 09:18:19 +0300"},{"content":"The room was clean and updated. There was plenty of space for me, my wife and 2 daughters. The problem is that it is right off of a very busy road and it was nearly impossible to sleep. Also the breakfast buffet was horribly inefficient even with three breakfast attendants. Most Homewoood suites I've stayed at only have one and do a much better job. Trash was overflowing, they were constantly out of hot items, and finding a clean table was impossible. These are all the things that kept me from giving the hotel a higher rating. As I mentioned before the room itself was great.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":4.0},"author":"Bernardo Schoen","date":"2015-06-16 04:27:55 +0300"}],"public_likes":["Mrs. Brisa Rippin","Queen Jerde"],"vacancy":true,"description":"A comparatively smaller hotel with small but very comfy rooms and good service.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}