{"title":"Gardenstown","name":"Harbour Cottage Gardenstown","address":"Harbour Rd","directions":"Gardenstown, Banff","phone":"+44 1261 851914","tollfree":null,"email":null,"fax":null,"url":"http://www.gardenstown.com","checkin":"4PM","checkout":"10.30pm","price":"from £250 - £295","geo":{"lat":57.673317,"lon":-2.337127,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":9723,"country":"United Kingdom","city":"Gardenstown","state":null,"reviews":[{"content":"No parking, no pool, no shampoo, no rinse, 2 towels in a room that fits 4, no microwave, fridge has so much ice in it that nothing fits, dirty dirty dirty, bathroom is dirty falling apart, this hotels needs to be shut down it is unsanitary oh and they charge you 100.00 deposit in case you damage something, really not much that isn't damaged already can be damaged, this is a waste of money, I was afraid to turn off the lights bugs bugs bugs, rooms stink really bad and on top of that they charge you 2.00 daily for a safe deposit box wether you use it or not, never again!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Paula Hamill","date":"2015-09-22 11:47:32 +0300"},{"content":"Stay one night and leave your car up to 21 days for free. Free shuttle to and from the airport. Excellent room with king bed, microwave etc. Great rates and discounts with fast service.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Orie Mante","date":"2014-01-26 20:32:10 +0300"},{"content":"The rooms were good, breakfast was good and we enjoyed the pool. Great stay at a good price. Do recomend this hotel. It was the week of July 4th, 2011. Nice and hot.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Twila Wolff","date":"2015-10-19 09:14:37 +0300"},{"content":"Not a very good stay at this property! The downsides for me were many. The location of the property is very difficult to find and when you do find it, it is difficult to get to it. The location is costly because there are tolls associated with getting to it, if you don't know the none toll road way to get to it. I was fortunate that I lived in Miami for three years and knew the roadways very well. The fact that this property does not include any continental breakfast shocked me. There is a deli and coffee shop inside with plenty of seating. But the prices for food and drinks were a little high for my liking. One would think that since the property was far off the beaten path the management would offer some form of discount or reduce costs for patrons. As far as other issues with this property, the jacuzzi was not hot at all. It was mostly luke warm at best. The elevator was broken 2 of the 4 days I stayed. The maintenance of the building is lacking. The bright spot of the stay was the people at the front desk. They were very responsive to all issues but was unable to get them fixed. I guess the maintenance department needs new help. I probably will not stay at this property again or recommended it to anyone.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":1.0},"author":"Julian Berge","date":"2013-09-27 00:04:59 +0300"},{"content":"You get what you pay for: - Poor lit, smelly corridors. - Stained walls and carpets. - Noisy rooms. - Slow internet connection in room, not wireless (43.37 kbps - measured) - Rude customer service at front desk. - No security. - Unreliable airport shuttle. The only Marriot with a shuttle you have to call first if you want to be picked up at the airport. - A big flat screen HD TV in your room to distract you from all the above. Do you watch TV? Should you ever decide to stay at this place I would highly recommend renting a car. Cabs in Miami can make your visit a nightmare.","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":2.0,"Service":1.0,"Location":1.0},"author":"Alene Kunze","date":"2013-08-23 21:40:18 +0300"},{"content":"The setting is convenient for the airport and there is a regular shuttle service. On the downside its miles from anywhere so you definately need a car. The staff are friendly enough and the public areas are good. The rooms are big, clean and the beds are fantastic, free internet access too. The 'restaurant' only opens for breakfast and theres no bar so evening meals will be walking or driving - or you can get something from the 'Market' which is a small fridge next to reception with a couple of sandwiches in it. Would I stay again? As a tourist no, as a one nighter before going to the airport the next day, yes. Note this is a 100% no smoking hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":2.0},"author":"Jenifer Thiel","date":"2013-03-09 10:19:07 +0300"},{"content":"I was pleasantly surprised by Lake Eve! I drove straight throughout to Florida and called ahead to see if I could stay a night early, as I was only staying one night! The staff was eager to help. I got in and loved the suite! A full kitchen, living room area, bar seating and a dining table. There was a small balcony, but it was sufficient. The gym was very small and had few machines and noe weights. I was thankful I was the only one there. I loved the sun deck on the lake and the pool was large enough not to be crowded. The restaurant is small, but the bar tender was spot on when reccomending my dinner and he was helpful, friendly and very nice to a solo traveler.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Yasmine Kilback","date":"2015-09-24 18:05:33 +0300"},{"content":"Our family--parents in their early 50's, grown children in their 20's--stayed at Lake Eve for one night during a long weekend in December 2011. We had a 2-bedroom unit on the 7th floor and were extremely happy with all the extra space. Lots of closets, plenty of towels, a large kitchen with major appliances, an in-room safe--all the extras were there. The beds and furniture seem newish. The master bath has a tub and a separate shower, two sinks, and two huge closets. The location is at the far southern end of International Drive, next door to the Premium Outlets Mall. There is a Publix grocery store within strolling distance (although it might be a bit much to stroll back with groceries) so it's easy to stock up on food and beverages instead of spending a fortune at area restaurants. The guests are a mix of US, Canadian, German and Brazilian citizens and it seems to appeal to families attending sports tournaments at Disney's Wide World of Sports complex. The desk staff was congenial --although if this was my hotel, I'd ask them to dress with a bit more professional polish. And that's the only thing lacking at Lake Eve. It's got top-notch condos, great amenities and a perfect location to enjoy the Disney parks--it only needs to step up its image and service to make it one of the more desireable stays in the Orlando area.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Gillian Kassulke","date":"2012-01-08 04:49:52 +0300"},{"content":"We are a family of six-- my husband & I with 3 teenage girls & a 10 year old son. We always look for a hotel suite or multiple rooms when we vacation. Lake Eve was perfect! We searched through Booking.com for a good deal & this was the best we found. A 3 bedroom suite for $149! I questioned whether it was in a good area & whether it was a nice place. We looked at the reviews & the worst reviews were that it didn't have free wi-fi in the rooms so we did a little research on the hotel website and found out that's not even true. When we arrived there was free valet parking, which was a plus. When we got to our room, we were VERY happy. The kitchen was very spacious. The dining table was large enough for all of us. The living area was ample. The balcony was huge! We had a view of the beautiful pool & lake. The bedrooms were a good size and warm & cozy. Bathrooms were pretty & clean. Everything seemed new & updated, We did have free wi-fi in our room. We ALL got a good night sleep, also, as the beds were very comfortable. We have nothing negative to say about our room. We were in Orlando to go to Universal. I almost didn't book Lake Eve because I wanted something close to Universal. But since we were so close to I-4 it didn't take long to get there and it was very EASY to get there. We loved that Lake Eve was situated on a quiet area of International Drive and yet so close to I-4. The only downer to our stay was in the morning when we all wanted breakfast. There was a breakfast buffet for $8 or you could order a la carte items. The buffet reminded us of nicer continental breakfast bars we've had at other hotels for free-- not worth $8. Some of the a la carte items on the menu looked good & reasonably priced but we opted to go out to breakfast where there was more variety. We went to the Denny's down the street. We ARE NOT Denny's fans-- we never go at home. But we were starving! This Denny's was actually not bad--we were pleasantly surprised! We are very happy that we ended up at Lake Eve. It was perfect for our family. We'd definitely go back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Elbert Pouros IV","date":"2012-11-01 17:34:08 +0300"}],"public_likes":["Dorcas Kautzer I","Ferne Stokes","Sylvester Reilly","Fanny Ziemann II","Godfrey Hyatt","Carlie Kihn","Tressa Fadel","Dr. Deontae Nader"],"vacancy":false,"description":"Harbour Cottage offers the best of Scotland's coast and country. Lovely detached cottage with en-suite & WIFI in Gardenstown Scotland on Moray Firth – close to harbour and beach where you can see the dolphins and other wildlife in their natural habitat. Affordable accommodation - ideal for couples...and their dog!","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}