{"title":"Swansea","name":"Gower Edge Self Catering","address":"Killan Road, Dunvant, Swansea. SA2 7TH","directions":"Leave at Junction 48 M4","phone":"+44 1608 674467","tollfree":null,"email":"enquiries-gower-edge@live.co.uk","fax":null,"url":"http://www.gower-edge-holidays.co.uk","checkin":null,"checkout":null,"price":"£399-899","geo":{"lat":51.62644,"lon":-4.04034,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":28955,"country":"United Kingdom","city":"Dunvant","state":null,"reviews":[{"content":"Stayed at the Comfort Inn from 18 - 21 Feb 2005. The advantages of this hotel are it's excellent location, it's a stone throw from Macy's and the Empire State was right next to our bedroom window. It is also only a 10 minute walk to Times Square. It has a nice bar next door called Brendan's where you can get the british footie results. However, on the negative, our room reaked of cigarette smoke, and even though we are both smokers it was unbearable. The hotel couldn't give us another room and despite them promising to elimate the odour and us purchasing air freshener, it did not go away. Also the receptionist Alex was abrupt to the point of being rude on some occasions, and the heating was roasting hot and very noisy. The breakfast was ok, just cereal, bagels, toast & doughnuts etc. But it's worth going to a diner for the real american breakfast experience. Try the Empire in Chelsea it's fab. I would recommend this hotel if you are on a budget but request a non-smoking room and hope that you get one as some people checked in when we were checking out and had requested this but ended up with our old room - poor them!","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":5.0,"Service":2.0,"Rooms":2.0},"author":"Kareem Schamberger","date":"2015-03-11 21:39:02 +0300"},{"content":"We stayed for five nights in June 2004, encouraged by all the positive reviews the hotel had previously received. We were delighted to find those reviews were very accurate in respect of the excellent value for money, helpfulness of the staff and the close proximity to a lot of the main attractions. As a base for a sightseeing trip, we are sure it will be very hard to beat. Our room was clean and tidy, good sized and, being at the rear of the hotel, very quiet. The buffet breakfast was adequate enough, but we didn't choose it for the cuisine. As a budget hotel we would certainly recommend it to anyone visiting the city for a few days.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":3.0},"author":"Neil Berge","date":"2014-01-24 10:33:09 +0300"},{"content":"We had a one bedroom suite, spacious and modern. Nice view, nice interior and nice staff. Location ok, several restaurants and diners nearby, short distance to bus and subway.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Hilda Prohaska","date":"2013-08-25 09:31:22 +0300"},{"content":"The staff is very helpful and nice. Always a smile and do you need anything if you approached the desk. You will not feel like you are staying in a hotel but like you live in NYC and this is your residence. We had a 3 bedroom 3 bath for X-mas week. The place was awesome with so much space because the bedrooms were big and the bathrooms. The best, you had a full kitchen and could make a breakfast before heading out which saves you money. The subway was a quick walk and its nice to get lost the best part and when you learn the routes you definitely feel like you live there. The Taxi rides were never over 20 (was holiday so a lot of traffic) and if you take the subway just take a Taxi back. Overall, if you want to experience NYC you don't need a fancy place because the time you spend in a room is only for sleep. However, this place is a clean, spacious, and attentive place that's inexpensive place to stay. Now, I would recommend a little TLC because it does show a little use the rooms like paint and new decor. Yet, for the time we were in the room it was nothing that bothered. Stay here if you want to experience living there, have a big group, and like space not the little hotel room.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Evie Kovacek","date":"2014-06-06 16:22:57 +0300"},{"content":"If you are looking for a comfortable serviced apartment in a quieter area of Manhattan, this may be for you. The suites are large with well-equipped kitchens and a small balcony. For the size of the rooms, the price is pretty reasonable. The decor was a little faded, but the concierge is helpful and when you're in New York, you don't have to spend a lot of time indoors!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"Laverna McKenzie","date":"2014-03-29 08:03:44 +0300"},{"content":"The brief to find accommodation suitable for 6 women for a week was proving difficult until we stumpbled across Marmara. 3 large bedrooms - we were willing to share with 2 king size beds and 2 singles - 3 bathrooms a great living area and fantastic 27th floor views. There was also a washer and dryer in the apartment which really made us feel at home. Some habits die hard! The location was fine with a good subway line close and with grocery and grog shops nearby we were set. The staff at reception were extremely helpful to us. They were happy to suggest places to shop, sightsee and eat. They also printed out some travel instructions to help us get to Brooklyn which made it easy and in general were accommodating of any request we made - thanks to all the staff who looked after us. It was great to have free WiFi although the connection was a little tempremental while we were there - not sure if this is usual. Would recommend Marmara to anyone who wanted to feel more at home than a hotel room can provide. Would also recommend Nicks Italian across the road - great food, great friendly service.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Arnaldo Blanda PhD","date":"2015-09-03 12:37:45 +0300"}],"public_likes":["Kevon Kulas","Marcos Kassulke","Fermin Bode","Estel Effertz","Audra Nikolaus"],"vacancy":false,"description":"Spacious detached property which sleeps 8 in comfort. Wales Tourist Board 3*. Children and pets are most welcome. Short breaks and longer stays available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}