{"title":"Santa Monica","name":"Loews Santa Monica Beach Hotel","address":"1700 Ocean Ave","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.santamonicaloewshotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.00964,"lon":-118.49291,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26497,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"I just stayed at this location for a week while in LAX on business. The hotel is new and very clean. I really enjoyed my stay. The bed is amazing. If you don't want to rent a car and would like to get out and about, the trolley is a great option. It is $5 round trip and will take you to the Manhattan Beach Pier where there is a bunch of shops and ton's of places to eat. I will stay here again next time I am in LA.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Liana Klocko","date":"2012-01-28 12:44:52 +0300"},{"content":"We stayed at this hotel after return from a cruise in the far east. We are Starwood Preferred Guest Gold - Elite level 3. I would compare this hotel to a cheap two star property. We were supposedly upgraded to a \"deluxe\" room - if this was \"deluxe\" I wonder what the regular rooms are. Despite our status as SPG, no amenities were offered - no internet, no concierge. The room was small. A localized heater - no thermostat on the wall. The bathroom was equipped with typical soap, and shampoo, but the towels were small, and certainly not up to typical Westin standard (although they were Westin label). No glassware in the room - only plastic cups as are found in much cheaper motels. The \"mini-bar\" consisted of a small tray on the dresser and about 6 or 8 snack items. Other than the heavenly bed that is offered in Westin brand, I would compare this to a low end two star. We picked this hotel based on the Westin reputation, and were greatly disappointed. When we checked out we expressed our disappointment and noted that the Starwood points were not included (this was corrected). Anyone considering this hotel should look at the other choices in the area.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":4.0,"Rooms":1.0,"Location":4.0},"author":"Vena Hagenes","date":"2012-07-09 17:54:46 +0300"},{"content":"Stayed here for one night prior to cruise. Room was a little dated and the couches in the suite were well worn and a little scary to sit in. Bathroom was cleanish.....there were a couple stray hairs on the sink which was a little gross but overall was clean. Bed was great, clean bedding and even being located facing the runway you could not hear the airplanes at all. Conceraige was very helpful. Food at the Daily Grill was great and very resonable for pricing, which is a breath of fresh air for a hotel. The shuttle from the terminal was a long wait and very frustrating as we stopped every single possible stop to pick up other passengers on their way to ours and other hotels. We waited an hour for the shuttle and then had to suffer through 6-7 other stops at the airport before getting to the hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ubaldo Hermann","date":"2015-05-09 07:02:40 +0300"},{"content":"We stayed at the Westin LAX for one night prior to leaving on a cruise. We flew into LAX a day before our cruise departure to mitigate any delays that might have occurred. Staying on a combination of cash & points, the room was an excellent value for us (myself, my wife and our two children). The rooms were very clean and modern-looking. The beds were extremely comfortably -- we really enjoy the Heavenly Beds. So much so that we have one of our own at home. It was a cool evening when we checked in, but we tried out the pool and whirlpool nonetheless. Both were a little on the small side, but they were fine. We didn't eat on the property, but there was a Subway a very short walk away where we had a meal. Thrifty Car Rental was an even shorter walk away (across the street), where we rented a vehicle for the day to see some of the sights in L.A.. I made use of the fitness facility on the morning and there were no issues at all to speak of. It wasn't large, but had everything I needed. The concierge was very helpful in arranging transportation for us to the port. He called a towncar service for us and negotiated a good price on our behalf. This was the second time we've stayed at this hotel and have really enjoyed both experiences.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kevin Runolfsson","date":"2013-04-17 15:55:44 +0300"},{"content":"Great hotel. Nice staff and very comfortable. Restaurant was also good","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Demetrius Medhurst","date":"2013-02-08 03:39:05 +0300"},{"content":"Friendly Bell Hop, Excellent front desk help, Great Room, Delicious food An overall clean & fun place to stay","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Estevan Reinger","date":"2014-08-04 12:18:37 +0300"}],"public_likes":["Lukas Friesen","Libbie Weber","Cayla Mante"],"vacancy":false,"description":"A beachfront resort overlooking the Pacific Ocean. Around the corner from Santa Monica's Third Street Promenade.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}