{"title":"London/Westminster","name":"St Ermin's Hotel","address":"2 Caxton St, SW1H 0QW","directions":"tube: St James's Park","phone":"+44 20 7222-7888","tollfree":null,"email":"Reservations@sterminshotel.co.uk","fax":null,"url":"http://www.sterminshotel.co.uk/","checkin":null,"checkout":null,"price":"From 115","geo":{"lat":51.4988,"lon":-0.1342,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16525,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Stayed 4 nights at the Crows Nest, really enjoyed the location and the great staff!! Hotel is very nice and well taken care of just a minutes drive from Isabell. Pool area and landscaping very well done with excellent view of ocean nice to just sit by and enjoy coffee or a cocktail in the evening. They offer free check out of beach chairs, umbrellas and coolers- very nice considering most of your time on the island will be spent on the beaches. Continental Breakfast in the morning - Juices/Coffee/Breads/Cereal. Rooms well taken care of and not dated like some hotel rooms you get stuck with- A/C units very nice also. Hotel Staff very accomadating they set up Taxis service for us on both sides of the ferry - We rented a car from Island rental which is within walking distance of Hotel and made for easy return given we got on the 6:00am ferry when we left. Overall very nice place - very reasonable and great location.. I was a little worried at first because I wanted to stay closer to Esperanza, but very happy with Choice...and would recommend to friend and family...","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Cara Rice","date":"2013-03-01 19:50:17 +0300"},{"content":"um...we're not into cold showers We walked in and the room looked nice. The deck was awesome - about the size of the room. However, we tried to shower 3X here and had cold showers 2 of 3 times. Not only that, but we got the jacuzzi room - and had warm water only 1 of 4 times we tried to use it!! We tried to run the jacuzzi at 10 PM - no warm water. We tried to run it again the next morning - again, no warm water. We must have hit the jackpot running it when we first arrived. We're not sure why you'd put a jacuzzi tub in if you have problems supplying warm water. So, forget any romantic showering or jacuzzi together. Not what I was looking for, and I wouldn't stay again - unless I don't plan to shower. To note, I was raised in a rural area with limited hot water and plumbing, and we had better facilitiies than this - and we only had 4 people in the household, not 4+ rooms.","ratings":{"Service":2.0,"Business service":3.0,"Cleanliness":2.0,"Check in / front desk":3.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":3.0},"author":"Dixie Schumm","date":"2014-07-26 01:36:11 +0300"},{"content":"LOVED every minute of our stay I found this review site as I was looking to stay at the lemon Tree again this year. We had an absolutely wonderful time there. A very private stay which we enjoyed immensly. Very simple accomodations, but perfect for what we were looking for. We stayed in one of the top rooms  the view was breathtaking, with a perfect sunrise  perfect sunset each day from the deck. We saw a whale as we had breakfast on the deck  many sea pelicans. Owners could not have been more pleasant  accomodating. The only noise was the crashing of the ocean under our deck. We enjoyed grilling on the deck each night  looked for a local lunch as we explored the area each day. The local people were very friendly. (make sure that you go watch the surfers from the deck of a great bar near town)  We wished that our stay of 4 nights could have been longer. We moved from there to an expensive beach resort, but as it was on the water, it was far from the water. (business trip)  did not enjoy it nearly as much. We loved that the deck actually hung out over the water at the Lemon Tree. This is like renting a beach house not a fancy resort. We Highly recommend the Lemon Tree  will definitly go back.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Kiel Littel","date":"2013-03-21 05:16:09 +0300"}],"public_likes":["Lori Franecki PhD","Keenan Roberts"],"vacancy":false,"description":"Small but well appointed rooms in a convenient location near Westminster Abbey.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}