{"title":"Birmingham (England)","name":"Malmaison Birmingham","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47684,"lon":-1.90371,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3646,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"A lot of people told me that the hotel has seen better days...that the lobby is still greqwt but the rooms will be old, maybe stuffy. i got treated incredibly well at check-in. Even though there were ten people in line, the had 5 or 6 agents on it and I was done in 10 minutes. I got the King bed i had asked for, on a high floor with a sweet view...and i don't have status there. Forgot my too brush...got one to me in 10 minutes. Great service to get cab, etc. And just friendly, service oriented people. It's no W, but i find the uber-hip hotels aren't functional for work...I'd rather have a hotel with all of the luxuries i like--good Crabtree and Evelyn shampoo, etc. I have to say that i was just pleasantly surprised at how pleasantly surprised my experience there was. Highly recommend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Ludwig Windler","date":"2015-04-24 12:03:54 +0300"},{"content":"Love this hotel, have been for the past 5 years and I am booked again for December. You can walk Chicago from this hotel, Macys is a stones throw along with the many shops State street has to offer. Love that you can drop bags back and go off again after a lovely Baileys on ice in the lobby. Can't recommend this hotel enough, family and friends and they all loved it too....","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Danny Schoen","date":"2015-06-06 05:06:26 +0300"},{"content":"Fast check-in. Gorgeous lobby - one of the most beautiful ever seen. Everything was perfect. We were on the 21st floor with two double beds and TWO bathrooms (loved that option!). Room was clean and tastefully decorated. The concierge was so helpful with anything needed. Loved that you could walk to many places for shopping, leisure (esp. Millennium and Grant Parks nearby), and good places to eat that were reasonable. Will definitely stay there on future visits to Chicago. You MUST try Bertha's famous brownie at the hotel for dessert - to die for!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brandi Ward","date":"2013-03-16 14:55:46 +0300"},{"content":"I attended a conference and was required to stay at this property. I was very disappointed with the accomodations for the price of the room and the location. The property has been updated but the quality of the bedding and the taste of the decor is odd. Many of the rooms have no views at all facing air conditioning units or office buildings. The location is an unusual neighborhood with no nice restaurants, bars or shopping nearby. The property also charged me $5 to RECEIVE a fedex package in addition the the outrageous $51 for valet parking. On a positive note the gym-spa is really nice with great equipment in a large space. For $219 per night there are much nicer hotels in much nicer neighborhoods in Chicago.","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":1.0},"author":"Mr. Keyon O'Conner","date":"2013-07-08 09:21:56 +0300"}],"public_likes":["Trever Raynor","Danika Hintz","Providenci Miller","Stephania Schiller","Larissa Lesch","Dave Hudson","Ms. Eloisa Price","Sean Lemke"],"vacancy":true,"description":"The Malmaison is an upscale property with an on-site spa, brasserie and wine cellar. It is located within the Mailbox multi-purpose centre.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}