{"title":"Paris/17th arrondissement","name":"Hotel Prince Albert Monceau","address":"9, rue Tarbe","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.princealbertmonceau.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.88678,"lon":2.31378,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21670,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"This hotel is spotless, roomy, a great value and conveniently located to the monorail so you can access the strip. Also, cabs are $5 to the top of the strip if you prefer that. Free breakfast is nice. Free popcorn in the room is GREAT after a night on the town! Stayed here with my husband for two days and would definitely recommend.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Raphael Watsica","date":"2014-11-17 18:54:29 +0300"},{"content":"Had to extend our stay unexpectedly and went to the yellowpages to see places with a kitchen Only the Residence Inn Convention Centre had an ad (unfortunately for us); so, based on past experiences with the brand, I figure it cant be that bad Now, Residence Inn is not a 5 star resort -- i know that; but this RI is definitely showing its age OUTDATED We got a studio room with a queen bed. The kitchen cabinets & stove looked like it hasnt been updated since the 80s. Bathroom was the same (had a wood sliding door for the shower/bathtub area) LOUD - it's underneath the flightpath for LAS airport = frequent buzz/noise; we stayed at Mandalay Bay (beside the airport) and didnt hear planes taking off/landing - ventilation system; we had to shutoff the HVAC since it was just too loud - fridge (probably another sign of age...), quite noisy as well when it starts up every so often \"Positives\" The breakfast is standard Residence Inn; business centre has 2 computers with internet access There's a pool (didnt use; but was open even in early dec) & on-site laundry Monorail & convention centre is directly next door, so it's convenient in that sense; the roads around the hotel have center dividers, so you have to be travelling in a certain direction to enter the hotel (either southbound on Paradise, or westbound on Dessert Inn) Clean room & linen Staff friendly (didnt really have much interaction)","ratings":{"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":1.0},"author":"Lemuel O'Hara","date":"2013-07-31 07:39:12 +0300"},{"content":"Stayed here because of a flight change. The hotel was clean, staff was great, extremely helpful and courteous. Great value for money Right next door is a casino, restaurant and bar. it was an easy walk to the strip. A 15 minute walk to the corner of Ballys/Caesars","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Johan Marvin","date":"2015-12-17 16:59:22 +0300"},{"content":"I found the room to be noisy and carpet dirty. The window drape would not close fully. The bed and bathroom was average for an older motel. The ice maker in the hall did not work, had to walk a considerable distance to near the loby for ice. I was disappointed to find this Super 8 offers no continental breakfast. Only a coffee machine. I understood all Super 8's offered continental breakfast. My mistake. It upset me that the person behind the counter was annoyed with a couple of questions I asked, re: directions. Cheap motel. I guess you get what you pay for. This one does not stand up to other Super 8 motels I have stayed in.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Jettie O'Keefe","date":"2013-06-02 08:27:44 +0300"},{"content":"Stayed there 3 days. The air condtioner did not work at all. They missed cleaning my room 1 day. When the maid came to clean after I complained, she complained to me that I was making her job difficult like she was the victim. You know just friken clean my room and provide your customers with service!!!!! Maybe she would rather unemployed instead!!!! Also the table was in need of maint. was wobbleing. And...... the lobby COFEE WAS POOR!!!!!! I was not too impressed with the casino next door either. The location is great walking distance to the strip.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Wilson Schumm","date":"2015-03-21 05:16:04 +0300"},{"content":"The place is still OK but from our stay last year, you can tell it is being neglected. It wasn't as clean, someone had smoked in the non smoking room. It needed repairs and just is looking run down. On a positive side the help is very friendly and helpful and it is close to the strip. Didn't seem to be as many homeless people hanging around this year either. Still OK for a one night stay I guess and I would still recommend it, at least for now, but it does need some work.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Shanie Batz","date":"2014-04-29 18:17:49 +0300"},{"content":"I stayed here mid December 2009. The tall front desk gentleman was lovely; very personable, and he seemed to enjoy his job. Were it not for him, I I would've rated this place lower. The room was clean, but old and drab, as was the bathroom. It might've been a bit depressing, but I wasn't in the room much so it was okay. More importantly, the sheets were clean and it good condition, as were the towels. The bed and pillows were comfortable. I did experience a few irritations while I was there. The alarm clock in the room was not working. The friendly gentleman at the front desk said someone would be by shortly with a replacement. Also, the chain in the toilet broke, so it wouldn't flush. Luckily one of us is very handy and fixed it. We waited about 30 minutes for the clock, but then had to get something to eat. The clock never arrived, but in the end it wasn't needed because the maid was vacuuming the hallway at 7:30am Saturday morning! Ridiculous. Koval Lane is very close to the strip, but it has a lot of VERY seedy looking apartments and derelict buildings which made me feel a little uneasy as we approached the motel. Our cards wouldn't unlock the door to the hotel which was closest to the casino and restaurant, so we had to walk all the way around it was pretty cold, so that was annoying. Ellis Island is a great restaurant-- you can tell by the line-ups and people's willingness to wait up to an hour for food. The portion size, quality and price are one of the best in Las Vegas. Skip Super 8, but have a meal at Ellis Island.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Karina Romaguera","date":"2015-04-19 06:06:22 +0300"},{"content":"We stayed at this hotel twice during our USA vacation, on the day of our arrival to the USA and again on the night before our departure. We chose it because it had an airport courtesy shuttle, was within walking distance of the Strip and had a restaurant next door. We weren’t disappointed with our choice although for some people it could be too far to conveniently walk to the Strip. The rooms were well maintained, clean and large and the air conditioning was effective without being too noisy at night. On our second visit we did have a similar problem to another reviewer in that our room key malfunctioned twice and we had to call for the maintenance man to unlock the door. Whilst the rooms were clean the corridors we poorly maintained and could do with new carpets and some fresh paint and brighter lighting. The reception staff were efficient but not as friendly as many other USA reception staff. Remember, this is a budget hotel and therefore don’t expect the luxury of the larger hotels on the Strip. If you just need a room for a night then it’s OK but if you are looking for several nights luxury accommodation in Las Vegas then I’d choose elsewhere. The Ellis Island restaurant/casino next door did a good evening meal and breakfast although be prepared to wait 40-45 mins (at 7.30pm) for an evening meal. The night we went there it was packed but they had an efficient system for turning the tables around and getting people seated. There is also a 7-11 store nearby which makes it easy to stock up with provisions.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":3.0,"Value":5.0,"Rooms":3.0,"Location":4.0},"author":"Mrs. Alexanne Rau","date":"2012-10-07 15:04:10 +0300"}],"public_likes":["Samara Anderson","Elmore Larson","Kaylah Doyle Jr.","Janice Treutel DVM"],"vacancy":true,"description":"Free Wi-Fi.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}