{"title":"London/Hammersmith and Fulham","name":"Hotel Sergul","address":"87 Shepherds Bush Rd, W6 7LR","directions":"tube: Hammersmith","phone":"+44 20 7603-5400","tollfree":null,"email":"info@hotelsergul.co.uk","fax":null,"url":"http://www.hotelsergul.co.uk","checkin":null,"checkout":null,"price":"£40","geo":{"lat":51.4986,"lon":-0.222,"accuracy":"ROOFTOP"},"type":"hotel","id":16170,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"5 Star, More like 3 Star!! Booked through apple and would like to shoot them. MY experiences at these type of resorts are usually good. My wife and I are easy to please, just decent room and beach with food and drink and were good. But this cant be a 5 star, mold in rooms, tiny compared to others, no fitted sheets, thin blankets like scratchy wool and no ocean view and barely any pool view rooms. We compared the rooms at the taino and naiboa and they are the same, small block with bare essentials. I have stayed in punta cana and resorts like the Palladium are a true 5 star. The reason they call this a 5 star is the people staying here are giving this place better reviews than it deserves. Stay somewhere else and compare, or stay here and stay ignorant.... Next time I am booking direct with another resort rated by funjet or other travel booker. Apple Vacations you lost our twice yearly business, enough said.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":1.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":4.0},"author":"Halle Bahringer","date":"2015-08-15 06:02:26 +0300"},{"content":"Fantastic Holiday Fantastic resort - could not fault the hotel at all. The room:The room was always clean and the cleaners cleaned the rooms daily and left fresh towels on the bed positioned like swans etc. The fridge was refilled every other day, but by request the will restock the fridge with specified drinks. Optics in the room, maintained. The Hotel public areas: Standard of cleanliness through out the hotel was good except American refused to use the hand cleaning product the hotel provided as you enter the restaurants.Food: The Buffet restaurant offered a wide selection of foods catering for the different nationalities, plenty of salads etc, so americans not happy that there is no burgers and chips every day - I think most other guests liked the wide selection and non Stodge food that I have found in USA.Drink: Wide selection of hot, cold and alcoholic drinks, but brand names are not readily available, but what do you expect when it is all included in the price? Variety of cocktails available - with a daily special.Beach:The beach is private so no hassle from people selling you things, there are a couple of drinks huts on the beach. The sports beach which is at the far end of the resort has motorised and non motorised sports, (only non motorised are included in the all inclusive offer) Entertainment:There is as much as you want to join in with - personally I am not in to that sort of thing, but there seemed to be plenty on offer","ratings":{"Service":5.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Maryse Ondricka","date":"2014-05-15 16:29:49 +0300"},{"content":"lovely holiday We stayed here for 2wks mid sept '07. We emailed ahead and asked for a high floor quiet room ( fear of 8 legged creepy crawlies  light sleeper) So well done Bambu, block 33 best sleep ever on all hols in last 8yrs!! Flight was very good Thomson new roomier planes food was ok films etc good. A little tight with the baggage allowance worth paying for the extra 5 kilos. Transfer was quick efficient and the roads have improved since my last visit in March 07. Arrival and check-in smooth and only a 20min wait for the bags so on the beach in less than 90 mins from landing must be a record for me!! Mark the rep was simply the best knowledgeable, interesting, knew what he was doing, great personality and 100% dedicated to the job nothing was to much trouble for him.The room was filled with towel swans and flowers everyday by a sweet 18yr old who earned $200 per month for a 10 hour day so I suggest if you are going to tip the the girls deserve it, The bar staff make a packet from the Americans who think its fine to give $1 everytime they get a round in and leave the rest of us to fight to get their attention!! The tourists, when we arrived from Manchester (Mondays, Gatwick Thursdays) there were about 200 of us Brits. Ok I know what you are all going to say but Please, Please, Please! Is there anywhere on the Planet that the GERMANS don't go on holiday so the rest of us can be free of their bad mannered, chain smoking arrogance. The problem with this hotel is it's Hamburg with tropical beach. We found out why, on carribean street situated between the Riu Maccao and the Taino is a TUI office which serves the Europeans in the resort now they do speak English and on asking the if they could book us a holiday direct with them this is what we were told, they only book holidays for Main land Europe and if we chose to go say to Paris and book there that was fine. So she kindly gave us a brochure and price list, some of the travellers were there for 10 weeks all inc. Now our Thomson agents don't do that as it's an arm and a leg but if you did want to go for that length of time it will cost you 5500 Euro for a junior suite at the Punta Cana Princess next door which is much more luxurious, so somewhere along the line us Brits are getting done! The weather was faultless, the food good no dellie belly named brands of alcohol if you want them. Do buy earplugs for the shower as quite a few people with ear infections. Overall a really good holiday. Only suggestion for the Hotel are newer pillows for the beds as old ones are wafer thin and tv's need updating . A new manager has arrived and is keeping all staff on their toes. I'd give this hotel 10/10 for location to a wide clean beach, 8/10 for staff and 9/10 for value for money. Would I go again? Yes.Enjoy your stay.","ratings":{"Service":5.0,"Business service":2.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Janelle Eichmann","date":"2013-10-20 20:29:25 +0300"}],"public_likes":["Miss Lurline Dooley","Coleman Cartwright","Nathen Hane","Wilbert Lebsack","Eugenia Green I","Sigmund Robel","Ms. Baron Shields","Vella Macejkovic"],"vacancy":false,"description":"Affordable smart hotel with excellent links to West End and close to Olympia and Earls Court exhibition centre.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}