{"title":"Vence","name":"Hotel Cantemerle","address":"258, Chemin Cantemerle","directions":"800m from Vence centre)","phone":"+33 4 93 58 08 18","tollfree":null,"email":null,"fax":null,"url":"http://www.cantemerle-hotel-vence.com/chambres/","checkin":"14pm","checkout":"11am","price":"200","geo":{"lat":43.7158566,"lon":7.1206814,"accuracy":"APPROXIMATE"},"type":"hotel","id":32143,"country":"France","city":"Vence","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"I went there with my husand, sister & brother in law, who had flown in from Chicago. We were staying in San Francisco and going for several hours of pampering. First impression driving in: This CAN'T be it! It's a motel and looks like something you would find in the middle of nowwhere on a road trip. We were led into a dressing room of sorts and told to disrobe, put our personal belongs into a mesh hanging bag and put on a robe. The robes were a joke and did not appear to have been washed. We then had to drag our stuff in the hanging bag into the mud room. While the mud bath felt good, it was hard not to think about how many others I was bathing with if you know what I mean. We were then ushered into another room with our hanging bag for a blanket wrap where an old wool type blanket was thrown over us. When that was over, rather than just keeping us in the same where we've been relaxing, we are then led to another room, still dragging our stuff around, into the massage room. Apparently 2 out of 2 us got good massages while the other two recieved the worst massage we've ever had. Both of us were asked what our trouble spots were by the masseuse, who then completely disregarded what we said. I told my masseuse to feel free to \"dig in\" and I was told that was not the kind of massage she was giving me, that what I was getting is for people who are paralyzed, stroke victims, etc. What???!! The place was dark & dingy, appeared unclean and the $388 per couple + tips could have been better spent at a real spa and resort. I would NEVER recommend this place to anyone.","ratings":{"Service":2.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Location":2.0},"author":"Dr. Zita Rogahn","date":"2013-02-25 01:22:11 +0300"},{"content":"Hubby and I went for a couples spa package last weekend for my 40th bday last weekend. What fun! My husband was really worried about the mud bath (he's a clean freak), but even he found it relaxing, comfortable, and fun. I would do the mud bath again - I think he is fine having done it ONCE in his life. I wasn't sure what to expect, having heard tales from others of attendants shoveling hot mud over you while you lay in the mud, and then being sprayed w/power hoses to get the mud off. Nothing could be further from the truth! The attendant tells you what to do, and then leaves you to get in/out of the mud while she's out of the room. She puts cool towels on your forehead, applies a soothing face mask, and explains what the mud is all about and answers questions. After around 15 min in the mud, she returns to tell you to get out, rinse off (there's a curtained-off area, with 2 showers - one for each of you, with a stone bench to sit on if you like) and then you hop in to the jacuzzi, where you relax while drinking cool lemon water. From there, go to the cool-down room, where you're swaddled like a baby in a room with candles, a gurgling water feature, and new age music (which I would normally hate, but didn't mind becuase I was so relaxed). We had 30 minute massages, which were fabulous! I recommend Marcia - who massaged my husband. I think he got a better treatment than I did... though I was happy w/my masseuse (forgot name). We were given a mesh bag to keep our clothes/shoes clean/dry, and $@!#%-flops to walk around in. This seems contrary to what a previous poster mentioned. Golden Haven isn't the top of the line place, but for $108 each (check out online coupons), the 90 minute experience was a great value and a completely fun, relaxing experience. I want to return w/a friend or two. NOTE - don't go winetasting first - we were so glad we hadn't done so! All the heat of the mud and jacuzzi is dehydrating and would be uncomfortable if you had been drinking.","ratings":{"Check in / front desk":5.0,"Overall":4.0,"Location":4.0,"Value":5.0},"author":"Marcel Bernhard","date":"2012-10-13 07:15:10 +0300"},{"content":"We travelled to Golden Haven filled with trepidation, having read unfair reports in the trip advisor. I fell off my bicycle and broke my hip and was craving healing waters and mineral mud,so we decided to take a jacuzzi room and enjoy the waters come what may. We were delighted to find a pleasant room, spotlessly clean and equipped with small fridge, bottled water, tea, coffee and candy and plentiful fluffy towels and wash cloths. The room was remarkably quiet, tucked away from the main drag, with leafy trees. The staff were very pleasant and the spa facilities excellent. Yes, it's a motel, but you're not paying \"Four seasons\" prices. Especially in the off season, I think we had excellent value for money and the person who mentioned the smell must be unaccustomed to natural sulphur smells from all mineral springs. In fact, I was hardly aware of it, maybe because we took a perfumed candle. So, if you want a reasonably priced, clean, quiet spa experience and you're not a snob, go for Golden Haven. J.C.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":3.0},"author":"Josefina Friesen","date":"2014-06-13 05:05:14 +0300"},{"content":"The Golden Haven Hot Springs Spa was a delightful getaway from the rat race. We had a romantic evening in our room which had a huge jacuzzi tub filled with mineral water and fragrant bath salts. We enjoyed breakfast and shopping in the quaint town of Calistoga the next day and then were treated to a fabulously relaxing massage and facial. The staff was wonderful and attentive and I ended the weekend with a totally rejuvenated body and renewed spirit and soul. It is a lovely way to get away from it all...there is an outdoor pool and spa, sunbathing, areas for quiet picnics or group gatherings. I highly recommend a visit.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Fay Wolff","date":"2012-03-09 03:11:03 +0300"},{"content":"My husband and I found Golden Haven on the Internet and didn't know anyone who had been to this spa so we had our fingers crossed that our 10th anniversary trip to the Napa Valley would pair well with our stay at Golden Haven. It's a little off the main street and we thought we'd taken wrong turn at first, but from the moment of check-in until we left, it was a completely relaxing, self-indulgent experience that we hope to repeat this summer. We stayed in the jacuzzi room and it was wonderful to soak right before going to bed and first thing in the morning. We had signed up for the couples mud bath and giggled like kids when we were left alone to wriggle down into the mud. It was heaven! We both dozed off (easy after a day of visiting wineries) but the hot spring fed mud bath was extremely relaxing and hot enough for my \"make me sweat\" husband who figured out how to move around to increase the temperature around him. I like a little cooler than he does so I simply didn't move and found the temperature of the mud to be perfect. We washed off, soaked in the jacuzzi and headed for our heated blanked wrap (nap time again) and then an hour long-massage. We had plans of going out for dinner afterwards, but felt so great that we went back to our room and stayed there for the rest of the night. The facilities were clean, the people were friendly and we saw several relaxed, happy people walking around the spa. We highly recommend Golden Haven for your next visit to the area.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Maybell Miller","date":"2013-06-27 07:06:15 +0300"},{"content":"We had a TERRIBLE experience at this spa. Admittedly we were 10 minutes late for our appointment for a couples mud bath and massage, but we did not feel the treatment we received was called for. The reception staff were unfriendly and unprofessional. They acted as if they were exasperated and seem inconvenienced at having to wait on us. We felt exteremly unwelcome. We had signed up for an hour mud bath and an hour massage at a promotional rate. Because we were 10 minutes late, our massage time had to be cut in half. Thankfully, we were charged a pro-rated promotional rate. However, the relatively inexpensive price was no consolation for very poor service. In fact, after the entire experience we still felt as though we had been \"ripped off.\" We did not know what to expect with the mud bath, as it was our first experience. This part of our spa treatment seemed very rushed. Our attendant seemed somewhat friendly, but seemed to push us through each of the stages of the mud bath, mineral soak and blanket wrap as though we were in a race. The actual soak time in the mud was about 10 minutes, which we heard, after some research, is probably the shortest soak time alloted amongst all the other spas in Calistoga. During the blanket wrap, we were supposed to retire or even nap in relaxing silence. And despite a sign posted right outside the room requesting quiet, we heard loud laughing and talking the whole time, which made it extremely difficult to fall asleep let alone relax. Our half hour massage was probably the best part of our experience, although that is not saying much. The massage therapists greeted us and bid us farewell very hastily. However, the massage was fairly good, but definitely not near the best we've had. (Perahps we are a bit biased in this opinion because we were already pretty upset by this point.) Overall, we had a very disappointing experience, especially since we had been looking forward to it for a while. We both felt a lot LESS relaxed coming out of the spa than we did going in! We kept joking that what we needed now was a massage since we felt a bit stressed! We would definitely not recommend this spa to anyone. It is much more worth your while to pay a little extra to get much better service. After our very disheartening experience, we went shopping around at several other spas in Calistoga. It seemed like common knowledge among the locals that Golden Haven has a reputation for providing rushed, unfriendly service and for \"herding\" their large numbers of customers through their spa experiences. In some cases, all we had to mention was that we had an extremely poor spa experience and people guessed exactly where we were talking about. That is pretty bad! If friendly, welcoming, accomodating service is essential to you to have a good experience, please do not waste your time here! In spite of the many positive reviews this spa has received, we definitely encourage you to shop around and get a feel for what the locals' opinions are. We think that you will find that every spa will recommend itself, but the good spas will also have some recommendations for other good spas in the area and will have a strong opinion as to where NOT to go, which will be.......take a guess!!! We hope you have a better experience than ours wherever you decide to go!","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Ellie Altenwerth","date":"2012-04-04 23:49:44 +0300"}],"public_likes":["Antoinette Bashirian","Maye Smith","Christine Bednar I","Wilson Bode","Emilio Welch","Arturo Flatley"],"vacancy":false,"description":"Charming 3* hotel in a park with duplex or standard rooms all with private terraces. The facilities include a very good Provençal restaurant (c. 25€ to 50€/person), a large outdoor heated pool and a spa with a big indoor pool with water jets, a steam room and fitness equipment. This hotel is very quiet.","alias":"www.hotelcantemerle.com","pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}