{"title":"Hayfield","name":"Sportsman Inn","address":"Kinder Road","directions":"SK22 2LE","phone":"+44  1663 741565","tollfree":null,"email":"info@enjoythesportsman.com","fax":null,"url":"http://www.enjoythesportsman.com/accommodation.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.3774,"lon":-1.9349,"accuracy":"APPROXIMATE"},"type":"hotel","id":11331,"country":"United Kingdom","city":"Hayfield","state":null,"reviews":[{"content":"Excellent hotel with friendly staff. Great location, close to the Bugis Street Markets. The breakfast buffet is huge. The room has usb chargers in the wall!! The only downsize is the room was a tad small once a baby crib was put it, and the elevators were a little slow. But other than that, a great hotel!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Shawna Pouros","date":"2012-03-06 06:52:26 +0300"},{"content":"We went again in Singapore last Oct. 22-26 and stayed again at our favorite hotel- Ibis at Bencoolen. Really nice, clean & comfortable budget hotel that is like a 4 star hotel. Tried using their self service laundrinette at the 3rd flr, it was a nice add-on service of the hotel, affordable at S$4/ washing or drying. Rymds","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Mack Collins","date":"2015-01-07 11:28:14 +0300"},{"content":"This hotel has a good location not far away from central parts of Singapore with good service and friendly staff. We used the hotel as overnight stay on our trip from Europe to Australia and back again with full satisfaction.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Cayla Sporer","date":"2012-09-30 08:15:28 +0300"},{"content":"This hotel is well situated in the centre of town. It is close to public transport and many eateries. The hotel decor is clean and new and it is excellent value for money. The morning breakfast is a buffet of all sorts sure to please many tastebuds from different cultures. We will be sure to stay here again provided the cost does not soar!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Bernie Zulauf","date":"2012-06-21 04:37:31 +0300"},{"content":"I would definatelly recommend this hotel to everybody. The only little issue that rooms seem to be small but it's not a big issue for Singapore, at least not for this sort of money. Every destination like shopping malls, sentosa, universal studio, merlion can be reached easily. Staff is polite and friendly which is always nice. So when I go to the Singapore again I will stay there. Spent a whole week there and I don't regret the choice of the hotel. Few little cares and seven eleven stores are just around the corner. So you will find everything you need in this hotel if you don't have some extra expectations for luxury.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Ike Borer","date":"2015-10-05 12:36:42 +0300"},{"content":"at $200 a night its up there but youre not going to get much cheaper if you want a nice, clean, central hotel. i like ibis, the mcdonalds of hotels, the rooms are all the same which is great as you know what to expect. the bar (had 2 for 1 specials) and restaurant was good and well priced. i would definitely stay again if only for the $19 for 40 min foot massage place next door and the truly awesome Wing Seong Fatty's (Albert) Restaurant across the road and past burger king (they did a mind blowing egg foo yong and bbq pork). taxis are always parked at the back and are cheap enough to get you anywhere central for under $10-15.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Brionna Breitenberg V","date":"2013-10-17 08:34:37 +0300"}],"public_likes":["Fabian Grimes","Ayla Ankunding","Nikolas Mertz","Mariela Jerde"],"vacancy":true,"description":"10-minute walk from village.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}