{"title":"Lochmaddy","name":"Uist Outdoor Centre","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.uistoutdoorcentre.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60694,"lon":-7.15833,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15974,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"My stay at the Sheraton Old San Juan was very comfortable. The cleanliness, quality of the linens and furnishings, spaciousness of the rooms, were all that I would expect of a Sheraton. It was well-air conditioned and I slept very well here. Since this is not a resort hotel and not near the beach most vacationers would probably choose it only if they wanted to experience old San Juan, visiting the forts and walking the old cobble stoned streets. I would rate it as excellent for business travelers except for the trouble that I had with their high speed Internet connection. I had to be moved once because the Internet wasn't working in my original room. Then when it was working I couldn't access our Exchange e-mail server. The help desk said this was normal because the hotel did not have a mail relay setup. Not being able to access my e-mail made my business travel more stressful than it needed to be. Dinner from room service was excellent. Try the restaurant Baru if you stay here. It is within easy walking distance if you are wearing comfortable shoes (those cobblestones).","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":3.0,"Rooms":4.0},"author":"Celia Hahn","date":"2015-02-05 18:03:27 +0300"},{"content":"Booked this hotel using Hilton points, so no complaints on the price! About 2 miles from the Downtown Disney area. Not sure if they offer a shuttle service to the parks, as I live in FL and drove my car to Orlando. Called in the morning to advise I would be arriving late so not to be surprised to find my room given away when I arrived around 10pm. All was in order, easy check in, and a nice quiet room awaited me. The rooms are very well kept, stylishly decorated, and had a microwave and coffee maker. No problems with the wifi internet service, good shower pressure, plenty of towels. Would recommend this hotel to others.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ms. Abe Adams","date":"2012-02-28 18:12:13 +0300"},{"content":"I had the opportunity to stay at the Hilton Garden Inn Resort for business less than a week ago. This hotel has a lot more to offer to a business traveler or leisure guest. The staff is courteous and efficient. Although the kitchen that evening was experiencing issues they kindly offered to find me a suitable dinner from a local restaurant. The rooms are spacious and come equip with beds that you can adjust. The view from the room I was in had a panoramic view of the Walt Disney World Fireworks. Although a stone's throw away from Disney it is set in a quiet area of Lake Buena Vista away from the tourist traffic. I would recommend this hotel to anyone with Hilton Honors or someone who wants a luxury stay without the luxury price. Well done Garden Inn at Lake Buena Vista you have outdone yourself.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Marjolaine Ward","date":"2013-05-06 05:27:19 +0300"},{"content":"Room was excellent, super comfy beds. Great location and excellent choices of restaurants nearby.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Emilia Jenkins","date":"2014-01-28 01:10:44 +0300"},{"content":"We spent 4 nights in this hotel to visit Disney World and Universal, and we were more than satisfied with this hotel. The rooms was amazing in size and comfortness; the location is really good being only 5 minute drive to Disney, Universal and also to the little shopping centers in the area. My only complaint is that it would have been nice to receive some help with our luggage....but I guess that's the policy for Hilton Garden Inns.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Edna Hegmann","date":"2014-12-29 00:21:51 +0300"},{"content":"Friendly ,clean and pleasant hotel with good amenities. fridge, microwave and excellent free internet very useful. rooms serviced nicely everyday. nice swimming pool plenty of sunbeds and towels available. Didnt use restaurant but seemed to have reasonable variety with a special cheap meal each day. Only negative was a little farther out than thought so def need a car but this also made it a nice quiet location. Thought good value for money.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Karolann McKenzie","date":"2012-11-07 14:32:58 +0300"},{"content":"Stayed for 3 nights initially, but extended our stay another 2 as it was so good. Room was clean, well appointed, quiet. The maid was great with everything being replaced promptly. The only point is that you will need a car to get to all of the attractions and places to eat, but that's the same with everywhere in the US so a minor point at that. Really good value for money, would stay again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Britney Schuster","date":"2015-03-09 21:32:01 +0300"},{"content":"I love to stay here nevertheless the rooms and the washrooms are small. Reason is it is close to the location for what I go to Hongkong. The hotel is nice. Clean and Tidy. The staff is pretty friendly too. The hotel provides free shuttle to Tsim Sha Tsui. This place is good for business travelers. Do Ask for upgrade. you may get it if the rooms are available.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Velma Crona","date":"2014-09-09 02:40:51 +0300"}],"public_likes":[],"vacancy":false,"description":"self catering - 20 beds in 4 person rooms.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}