{"title":"Yosemite National Park","name":"Tuolumne Meadows","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.875329,"lon":-119.35567,"accuracy":"ROOFTOP"},"type":"hotel","id":33900,"country":"United States","city":"Tuolumne County","state":"California","reviews":[{"content":"Best Vacation Ever We just got back from our trip at the Paradisus Punta Cana in the Dominican Republic. Let me just say, this was by far the best trip my husband and I have ever had. We went to the Sandals Resort in Montego Bay, Jamacia for our honeymoon and it was awful. I don't recommend going there. The Paradisus defintely didn't compare to a Sandals Resort. Every single thing we did there from the activities to the restaurants even to room service was absolutely wonderful. We had no problems with anything. Our room was absolutely breathtaking, with a view of the sea. Every single person on the staff at the resort that we encountered was very, very friendly and helpful. We couldn't believe it. We had gotten the Royal Service and defintely thought it was worth the money. We were going on vacation to relax and be pampered and that's exactly what we got. The weather was perfect, the food was wonderful, the beach was spectacular and very clean. I would say overall the whole property was clean and very, very well taken care of. The property was absolutely gorgeous all the way around. I can't actually think of one thing to complain about. As with anyone that probably read all the reviews on this website that were negative, we were very scared to go here, but all of our worries were quickly laid to rest once we stepped foot on the property. If anyone has any questions or would like any advice, feel free to contact me and I'll help in any way that I can at mistywang@yahoo.com. One more thing, we did tip quite a bit here and there, because we wanted to, we certainly didn't need to, the service was by far the best without tipping.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Anna Green","date":"2015-10-03 21:15:09 +0300"},{"content":"Blissful week - beautiful wedding at the Paradisus I've been meaning to write this review since we got back from the Paradisus in mid-October (2004). It took me a while, but here I am.My husband and I got married at the Paradisus in October. We had 70 guests attend the wedding - 66 of them stayed at the Paradisus. Everyone had a wonderful time. The grounds are beautiful. The staff is helpful and friendly. The beach is absolutely stunning. And the food was very very good. And if you are looking to have a wedding on site, their wedding Coordinators are extremely capable and sweet. Not a single thing went wrong on our wedding day - or the entire week for that matter.We visited 8 different resorts in Punta Cana before choosing the Paradisus. The only other place I considered was the Melia Caribe. The Melia is bigger and had a nice fub vibe to it but the wedding coordinator there was very rude and bored, and so we chose the Paradisus. So the week we arrived at the Paradisus was one week after all of those hurricanes hit so we were really worried about what kind of state the resort would be in. To our relief the resort was in great condition. None of the rooms were affected. They had had some flooding and some of the grounds were disturbed, but just one week later - you would have never known. We were lucky because many other resorts suffered structural damage and a couple even had to shut down for a few weeks. OUR ROOM was one of the Royal Suites right on the beach. We had a beautiful room with a king bed, a separate living room, an adjoining dining room with balcony and a great bathroom with jacuzzi tub and separate shower and another balcony. You do pay extra for the service royal but it was totally worth it for us. The service was great. We had our own butler in the morning and evening, and a private concierge that helped me immensely in tracking down my guests and helping me send them notes and gifts to their rooms etc. :) The butlers worked their butts off because every night was party night in our suite - after spending all day on the beach or at the pool - with swim-up bar (the crowd favorite) we would have dinner - and then invite a few friends and family up to our suite to play cards and listen to music - so the concierge would run up extra rum and softdrinks, cigars, chairs - whatever we needed. They were happy to accommodate - and we were happy to tip - even though you don't have to!MEALS: We usually slept in and missed breakfast so I would normally just head straight out the door to the beach. On the mornings we managed to make it to breakfast we had it at the buffet and ordered omelettes. We usually had lunch at the italian restaurant - during the day it's not Italian, it's another buffet but it's really well done and they serve spanish, american and italian food. The also have a huge grill where they served burgers, hot dogs, grilled chicken and fries - that's the only thing my little brother ate and he seemed perfectly happy with it. Their seafood paella was excellent, as well at the rice and beans and fish. You won't go hungry! Dinner is a little bit more formal and a nice experience. We would get dressed every night, and then go to the French restaurant, Steakhouse or Mexican restaurant - all of them really really good (and I'm definitely a foodie). My favorite was the Mexican. It was absolutely delicious. The french restaurant had the best wine and desserts (and a great lobster dish). We had a private rehearsal dinner at La Marina (seafood) restaurant, and the hotel did a beautiful job. It was a beautiful intimate setting, candlelit, with blue and white table cloths and covered chairs. Flowers on every table along with the menu cards that they printed out - I chose the menu of a caribbean avocado salad, a choice between filet in green pepper sauce or the coconut red snapper and a coconut flan for dessert. Some people had seconds! Everyone loved it! The morning of the wedding, my sisters and mom and I spent at the spa for manicures/pedicures. And then went back to my suite where the hairdresser did our hair. I just showed her a picture of what I wanted and she gave it to me. I have very long, curly hair and it was an extremely humid day, but she straightened it and curled it again, and not one hair was out of place the entire night. At the end of the night, my hair was the only thing that still looked perfect! :) Anyway, while I was busy getting ready, my future husband was at the pool with his best man and some of the rest of our wedding party - just hanging out!The wedding was everything I ever imagined and more. The trio that we hired played the most beautiful music and followed me down the aisle. My flowers were perfect (all roses in every shade of pink and coral and ivory). And the ceremony was performed by my sister and involved a couple of readings and prayers from friends and family. It was magical. We met with the judge while everyone was at the cocktail hour and made it official (it took about 3 minutes). The photographer at the resort is one of the best I've ever seen. Our pictures are magnificent. I don't think he took one bad picture. I was really nervous about that aspect but it ended up being the best surprise of all. If you marry there - or even if you're just visiting, you MUST take pictures on the beach around 5pm. Just perfect. AND to make it even better - we left the resort 4 days later, with all of our pictures. No 8 month wait, like here in NYC!Our reception was held at La Albufera steakhouse. Again everything was gorgeous. And the food was outstanding. Even better was the service, the waiters were on top of everything. We never had an empty glass. They had cleared a great space for a dance floor and the deejay played music that I had put together along with merengue and bachata and other music from the Caribbean - and let me tell you, that dance floor was never empty! We had a 6 hour reception, nobody left early! :) Not even my grandmother who was up there dancing with all of us. After the reception, my husband and I went back to our suite and found the stairs lit with candles and rose petals, and a path of candles and rose petals that led into the bedroom and bathroom where the jacuzzi tub was surrounded with candles and had a huge bubblebath already going. Along with a bottle of champagne and a platter of fresh fruit, and leftover slices of our cake. All thanks to our wedding coordinators! It was a wonderful surprise, I was very touched. What a nice way to kick off the wedding night! :)We slept in again - spent all day on the beach and then met our guests for dinner to thank them and wish them a great trip home. (We stayed 4 extra days ALONE and it was heavenly) We've received so many notes since coming back, and have met up with many of the people that attended our wedding, all of them along with BOTH of our families agreed it was one of the best vacations anyone ever had. We will be returning to the Paradisus again for a long weekend for our anniversary. And my mother-in-law has asked that we send her there for her 70th birthday next year. :) Happy travels. (If you'd like to see pictures of the wedding - or have questions that I was unable to address here, please feel free to email me at clarissa_cana@yahoo.com and put 'Paradisus Wedding Info' in the subject line. Thanks!)","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":4.0,"Rooms":4.0,"Location":-1.0},"author":"Ms. Mylene Cartwright","date":"2014-10-03 00:59:46 +0300"},{"content":"Hey, I was thinking it's 6 apples Resort We (two couples with 2 year olds) just got back from Paradisus...stayed there from 11/21/04-11/28/04. The check-in personnel was surprisingly helpful. The rooms were ok in size, but the mattresses and pillows are so old...not comfortable at all. There were no doors into the bathrooms, I guess it's ok when you are staying with your spouse only, but when you have a kid in the room that is not a great feature. Shower curtains were so ancient...it was impossible to use them.The first two days was raining, but then it got nice and warm. We went to the pool, but unfortunately they were out of beach towels at 10am...they told us to come back in an hour, they still didn't have the towels until afternoon. The same thing was happening every day. I was thinking that 6 apples resort would have no trouble supplying beach towels to it's customers. I guess I was wrong.The food was ok...big variety, but not the greatest quality. If you have small kids you might have a problem with food. The only things are the cereal and yogurt, but how many days your kid can eat that. If you want to get reservation to French or Japanese restaurant you must do it right away when you arrive. We tried to do it next day, there was nothing available for the whole week. At last, the day we were leaving, the bellboy service didn't pick us up at the right time, we called the service three times, but they screwed up and our bus to airport left without us. When we asked at the front desk how we are going to get to the airport, they said we have to take taxi and pay for it ourselves. Of course, we had to fight for that since it was totally their fault. Finally, they agreed and gave us a ride to the airport for free. At last, we were tired and aggravated. I wouldn't go there again.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ms. Derek Steuber","date":"2015-02-20 02:20:58 +0300"},{"content":"awesome We just returned from Paradisus in Punta Cana and had to write this review to tell you how awesome it was! The grounds are beautiful, the food was quite good, the rooms were big and clean and the staff were happy and friendly!! There were 9 or 10 restaurants so we had a lot of choice for each meal. men did need to wear pants at night to the restaurants so just make sure you pack properly. Only 2 of the restaurants required reservations in advance which we booked the first day we got there. The activites staff were so upbeat and it was contagious and they seemed to work non-stop from sun up to sun down! The beach and pool were beautiful as well. Unfortunately, we did get hit pretty hard by the hurricane and lost the last 3 days of our vacation but we felt well taken care of, especaily after speaking to other vacationers at the airport on Saturday. There were many horror stories about other Resorts. The entire staff seemed to come together to get through the crisis caused by the storm. If you are planning a vacation there this week check with your travel agent to ensure that things are getting back to normal.Enjoy your vacation there - If it was anything like our vacation, you'll love it!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ivory Littel","date":"2012-06-22 19:08:52 +0300"},{"content":"$@!#% on Earth I wish i would've read these reviews before I booked this vacation. I agree with every single bad review on this site. I arrived in Santo Domingo on July 7th. I made a reservation at Paradisus for July 17th. I had my husband fly into Punta Cana on that day and I drove 4 hours to meet him.Originally I booked one room for my husband, myself and my 7 year old son. But after I thought about it i figured that i should bring my sister so that she could babysit so my husband and I could have alone time. Well we thought we were headed to paradise until we went to check in. We arrived at 2pm, we were told that Check in was at 3pm. Well we didnt get our room til 7pm. I also requested another room which they didn't have because they were booked until the next day. We payed for 2 rooms on Saturday and received our second room on Sunday at 6pm. When we finally got our room the ceiling fan was making a lot of noise, the bootleg minibar didn't work,our AC was leaking and there was no toilet paper holder. We ordered room service since we got our room so late. the food never got to us. The restuarants are horrible. The food gave us diarrhea and made us nauseus.You could tell them to please make your food well done and sure enough they would give it back to you raw. Then all the restuarants are outside so you get dressed up and sweat throughout your dinner. And during the day the flies are all over you. They don't have most of the water sports that they say they have. They tell you to go down the beach to the next hotel to do things. The horse back riding is full even before you make your reservations. The most fun we had was outside of the hotel. We went on a helicopter ride, we drove speed boats and got on 4 wheelers. The staff at those establishments were very friendly. Unlike all of the staff in Paradisus. Especially the people at the front desk. Even the general manager didn't help us. He made believe that he was going to do something but everything remained the same. Lets not for get their mini club for our 7 year old. My son walked home by himself and the staff failed to notice this. When I arrived to pick him up the club house it was closed. Noone could tell me where my son was. Lucky my son knew his way back to the room.This was in no way Paradise and i will never go to an all inclusive. This is a * star hotel. The service is horrible. Its better to go to a 5 star hotel and come out of your pocket. I do not recommend this place.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Nikko Krajcik","date":"2014-06-23 00:27:13 +0300"},{"content":"Nice Vacation My wife  I  2 other couples just returned from the Paradisus yesterday. I was excited about the trip and had been reading the reviews on this website for a few months now. Some people seem the saying conflicting things about the resort, so I read it mostly to get some tips. We all agreed that the resort was beautiful. The pool was beautiful, the water was warm, but when it's 90 degrees outside, that's what happens. The beach was also beautiful. At no time did we have a problem finding chairs,  there were six of us. If you go down early, we went about 8:30, you have your choice of chairs at the pool  the beach. I feel that if I'm awayon vacation I don't want to sleep all morning anyway, I can stay home and do that and save a lot of money. If you go to the pool or beach later, there's still pleanty of chairs. The staff was great. Not one person had an attitude, and every staff member we met went out of the way for us. We did leave $2 for the maid every day  we got extra towels  great service. The rooms were beautiful, and spotless. We saw them cleaning one day and they do a great job of cleaning. In fact everything at the resort was spotless. They do a great job. They room has a hair dryer, Iron, Ironing board, microwave, refrigerator with water  sodas, soap, bath gel, shampoo, conditioner, etc. The restaraunts varied. We ate at the Steak House, Japanese, El Romantico, Barzillian, Buffet. We usually had breakfast at theHibiscus buffet. They had scrambleds eggs,bacon, omeletts, fried eggs, hard boiled, pancakes, french toast  lots of other stuff. After a big breakfast we usually had a snack for lunch, but there was pleanty to choose from.  Now my complaint: In all the reviews I read I didn't see much about the thing that bothered us the most. Lack of Air Conditioning. Only a few of the restaraunts are air conditioned. In a country where it's about 90 degrees with high humidity, I would think air conditioning would be a priority in the eating areas. None of us enjoyed our dinner in the steak house, not because of the food, but because it's hard to eat when sweat is dripping down your face. After that we only ate in air conditioned restaraunts with one exception, the seafood rest., because it was on the beach  we got the breeze. One couple we were with ate at the chineese rest. but sat outside. The lobby is beautiful, but also not air conditioned. The shows are in a theatre in the lobby, which is also not air conditioned. We went to the show one night  were so uncomfortable we had to leave halfway through. We wanted to see the disco show one night, but we were sitting there sweating  went back to our rooms instad. My other objection, and this might just be me, is that they require long pants for men in a lot of the restaraunts. When I'm on a relaxing, laid back vacation  it's very hot I'd like to be comfortable. I had several pairs of Docker shorts, which I thought should have been acceptable. After all this IS a beach resort. When their not providing A/C in the restaraunt, they should go out of their way to make you comfortable. Of course this is NOT the United States, so we couldn't make an issue of the fact that they allow women to wear shorts, but that's another issue. Would I go back? No. But that's only because there's so many places that I haven't been, I would rather go someplace new. If I was going back to Punta Cana, I would stay at Paradisus again. The last thing-Of the six of us, no one got sick,  we ate almost everything. We drank bottled water, which they give you pleanty of, but we all had drinks with ice, salads, fruits, etc, and go for the massage at the spa. I went for the first time  had to go back again. Tip nicely, they makew very little money If you're considering the Paradisus, don't let the negitive reviews scare you away. Enjoy.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ebba Moen","date":"2015-07-31 10:24:59 +0300"},{"content":"Security is bad , and they are not responsible management . Here it is I went to Paridisus and I booked a week with my whole family, checked in on Friday afternoon, everything was good the show and everything, but on Wednesday night, they broked in to my room trough the balcony, stole my Laptop whsich was my job laptop unfortunatly , the key for the saved I had it inside the laptop bag , they took my passport, money, watch who would of though 5 ***** hotel , paid 155 a person, the same nigth on Wednesday May 26 2004, they broked in to 3 rooms, A person from Chile and the third from US, well I askd the Management and they said they couldn't helped me out, waste 1 day on National Police of DR and then next day to USA Consul paid 225 for passports, wow just please please maked sure your balcony doors are close and please do not take laptops is really a bad experinece ,","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Quinn Mraz","date":"2013-06-24 00:24:05 +0300"}],"public_likes":[],"vacancy":false,"description":"The Tuolumne Meadows campground is open from July through September and offers 50% of its sites as reservation only, while 50% are first-come, first-served.  304 sites are available for both tents and RVs up to 35' in length.  Be prepared for chilly night-time temperatures.  Water and flush toilets are available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}