{"title":"Joshua Tree National Park","name":"Ryan Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$10 per night","geo":{"lat":33.9829,"lon":-116.1545,"accuracy":"ROOFTOP"},"type":"hotel","id":12928,"country":"United States","city":"Riverside County","state":"California","reviews":[{"content":"I am a very demanding traveller and the AVIA exceeded my expectations with the delivery of a 5 star hotel experience at a 3 star rate. Beautiful new hotel with outstanding room amenities (double sided fireplace, huge flatscreen TV's, tasteful and modern decoration, comfy beds etc.). Concierge was very helpful, connected and knowledgeable and it became readily apparent that she truly cares about the guests' experience in Napa. Restaurant recommendations were \"spot on\" and she booked us on a truly memorable, first class tour of the Napa Valley (at a fraction of the price and hassle of what we could have arranged ourselves). An all round excellent experience here.","ratings":{"Overall":5.0},"author":"Joshua Rogahn","date":"2013-12-22 18:40:29 +0300"},{"content":"What a wonderful find! Nestled in the heart of downtown is this \"urban oasis\" that delivers a warm and hospitable lodging experience. A definite departure from some of the \"teddy bear and lace\" experiences from previous trips, the AVIA Napa starts and ends with you feeling as if you were a long-lost member of the family, home for a short visit. The rooms are comfortable and inviting. Appointed with luxurious linens that covered one of the most comfortable beds that we have ever slept in. The bathrooms are bright and spacious with plenty of room for two. Our room had a lovely soaking tub and a large flat screen television. The restaurant only serves breakfast and lunch, which works out fine since most people are out wine tasting or shopping during the day. Breakfast was a feast for the eyes and the stomach, offering everything from steel cut oatmeal to perfect omelets. The dinner menu features a variety of delectable \"small plates\" with something for every palate. Everything was very good!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Madisyn Greenholt","date":"2013-11-10 19:53:53 +0300"},{"content":"stayed here during my last trip. the rooms are clean. bathroom is big but not that functional. free wifi and bottled water. location is quite a walk from nathan road, so if you intent to go back and forth your hotel room you might find it a task. there is noise that you can hear inside the room on weekend nights because there are clubs near the hotel. overall it is still good value!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Griffin Barton","date":"2014-05-05 23:33:30 +0300"},{"content":"Good location! Worth it to spend a little more on the deluxe room. Although for some weird reason the lift always smelled of cigarettes! Don't know why?!? Non smoking rooms no smell.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Marguerite Crist","date":"2013-10-21 19:04:09 +0300"}],"public_likes":["Stefan Greenfelder","Rosemary Doyle","Abdullah Lindgren","Gregorio Emard"],"vacancy":false,"description":"Easily accessible from West Entrance Station, a primitive campground with 31 sites, no water available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}