{"title":"Newport (Pembrokeshire)","name":"Bury Bach","address":null,"directions":"1 mile outside Newport","phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.burybach.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.02644,"lon":-4.81704,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20356,"country":"United Kingdom","city":"Pembrokeshire","state":null,"reviews":[{"content":"I recently stayed here on a 36hr stopover and could not find one single fault with the place . I arrived at 8am having asked if i could have an early check in to be told my room was ready and waiting . the staff were all excellent and most helpful , solving any queries or questions very quickly and with a smile at all times . I would reccommend this hotel to anyone who wants to treat themselves to a slice of luxury .","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Maxie Goldner","date":"2013-09-01 17:38:09 +0300"},{"content":"The rooms are quiet and large and well presented. The staff are exceptionally accomodating.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Lolita Hills","date":"2015-12-09 02:41:10 +0300"},{"content":"Planned to spend 1 night here en route to Sydney but would have wished to stay much longer. A magnificent property with a huge bedroom and even larger bathroom to suit every taste. Additional amenities were provided & suitable for transit passengers or those on business. I elected to take an a la carte dinner as opposed to a huge smorgasbord on offer. This was served efficiently and with condiments. Breakfast was also a delight with a more than adequate selection. I was disappointed in having to leave.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Allan Stracke","date":"2014-02-16 19:13:13 +0300"},{"content":"Charged $30 per day for Internet. This is really outrageous for business travelers. After paying this fee, they wanted another $15 to simply print out a boarding pass. Nice gym but no towels. This hotel is in a good location at the airport, and you would expect to pay a monopoly premium, but this hotel is taking advantage of its customers. If you are a business traveler, look for someplace else, or be prepared to pay through the nose.","ratings":{"Cleanliness":2.0,"Sleep Quality":2.0,"Overall":1.0,"Value":1.0},"author":"Carmel Wiza","date":"2012-04-29 03:54:59 +0300"},{"content":"We stayed at this hotel because were stopping over from Cambodia & it suited our needs to just stay a day & go into the centre ,I am a Priority member & get an upgrade & my room over looked part of the run way but there was no noise. The décor is very Jazzy! and when you arrive at night a bit confusing after a long flight but the staff are on hand to help you, you feel like you are very special. We had the Best Breakfast you could ever have! it represented all Nations you were spoilt for choice. The location was fantastic to get into town by the underground, you must go for a ride, it is so clean & very reliable a bit like our Hotel would stay here again, just loved it. The room was decorated with very large flower blind & was a divider between the bathroom & bedroom, which was very cool! I think the internet should be free for the charge per night as this is not a cheap stay hotel.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":3.0,"Service":5.0},"author":"Kaitlin Nikolaus","date":"2012-09-08 22:27:02 +0300"},{"content":"Having stayed at many airport hotels I am used to having fairly low expectations and was really surprised at how nice this hotel is. It is very modern and our room was great with a decent bathroom. The breakfast in the morning in the lounge was lovely and looking out onto the lovely pool area my only regret was that we weren't staying long enough to use it. I also find it frustrating when there is no clock in an airport hotel because my watch could be on any time zone and usually people stay in hotels at the airport because they need to be on time for a flight the next day. Other than that I found this hotel perfect and would definitely book there next time we are in Singapore.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Geovanny Pollich","date":"2015-09-20 10:14:03 +0300"},{"content":"I have now made it a habit to check-in to this hotel when I am transiting Singapore. The hotel is still new and has a very chic decor. The staff are very keen to assist you and extremely courteous. Overall a satisfied customer.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Keara Anderson","date":"2013-06-08 06:15:03 +0300"}],"public_likes":["Blaze Halvorson","Judd Crist"],"vacancy":true,"description":"Five star self catering holiday cottage, sleeping four.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}