{"title":"Carmel (California)","name":"Carmel Country Inn","address":"Dolores Street at Third Avenue","directions":null,"phone":"+1 831 625-3263","tollfree":"+1-800-215-6343","email":"info@carmelcountryinn.com","fax":null,"url":"http://www.carmelcountryinn.com","checkin":"3PM","checkout":"12PM","price":"$195-425","geo":{"lat":36.559215,"lon":-121.922514,"accuracy":"ROOFTOP"},"type":"hotel","id":5112,"country":"United States","city":"Carmel-by-the-Sea","state":"California","reviews":[{"content":"After a long day of travel from richmond va my husband and I were looking forward to a relaxing great honeymoon on the beach We checked into the room at the surferbeach The place was A DUMP with 2 box fans for airconditioning and it smelled like mold!!! Lucky for us we got a great room across the street at the Best Western but had it been summer we wouldn't have been so lucky. I CAN'T BELIEVE THIS SITE IS SO MISREPRESENTED . If it was updated I hate to see what it looked like before. The sign in the office should have had said we accept payment by the hour!!!!!","ratings":{"Service":3.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":5.0},"author":"Brant Paucek","date":"2015-05-21 18:08:27 +0300"},{"content":"This was the second time weve stayed at this hotel, dissapointed with the room this time. We stayed in room 206, you could hear EVERY movement the people in room 306 above made, even all their bathroom visits!! When they used the water it was practially impossible to hear anything in our room for the noise. Our shower head was 4 feet off the floor, we had to sit down in the show stall to shower! the sink was in the bedroom not the bathroom! very poor water pressure aswell. Patio door wouldnt open, kept jamming. Poor TV reception. The only saving grace is the Location, however there are others we will use next time in just as good a Location for very little more money. The restraunt underneath the hotel however is FANTASTIC, World Famous offers fantastic food and views while dining. Even the Cafe\" Be Curious\" on the boardwalk next to the hotel is excellent value for money, both of these are highly recomended, however the hotel isnt.","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":5.0},"author":"Dixie Fahey","date":"2014-09-30 10:27:06 +0300"},{"content":"My sister-in-law and I went to visit my niece who attends San Diego State for a few days. On our first night we were talking on our balcony in a regular tone of voice. The phone rang and we were told that our voices were carrying and that we needed to go inside! The office staff had the screen door open 24/7 and were listening to everything (almost looking for something to happen) while at the same time we had a security guard starring up at us every night we were there. At one point a lady from the office came outside and screamed up, \"If I hear one more peep out of one of those two rooms...\" I wasn't sure if she was addressing us but we weren't doing anything. It seemed as though she was looking directly at us though. We were confused! No guests complained about us it was just the staff listening in and waiting for something to happen. The first morning we were there we went down to the lobby (if you can even call it that!) to get coffee and over heard the woman at the desk saying something about our room and how pissed we were, we were totally confused. When the lady had called the night before we were very apologetic and told her we didn't realize we were even being loud. We decided not to confront the staff while overhearing them talk about our room because we were already hip to their rude character!!! Furthermore, the cable TV was a joke, you couldn't watch anything as their satelite was all screwed up! The maid service was terrible! The coffee machine was broken for the last two mornings we were there. We would go into the lobby and say good morning and the woman they had in there in the mornings just glared at you and didn't even greet you!!! DON'T STAY HERE!!!","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Service":1.0,"Rooms":2.0},"author":"Chet Harber","date":"2014-04-07 19:25:25 +0300"},{"content":"My family and I stayed here after reading the reviews on this site. We needed someplace clean, close to the beach and a good value. We weren't disappointed. Although, I don't ideally want to have a direct view of the pool, which all the nearby hotels had, the ocean was a few feet behind it and we were fully able to enjoy it from the balcony--which is an enclosed, shared space for the entire floor. For what we spent per night we felt that we hit the lottery with this hotel. Our room was clean and the bathroom was recently updated and for the little amount of time we actually spent in the room vs. our time on the beach, it was a great find. The restaurant located in the same building, World's Famous, had great food and plenty of fans, which was another huge bonus...make sure to get reservations first!","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":3.0,"Rooms":4.0},"author":"Troy O'Kon","date":"2013-01-10 02:22:01 +0300"},{"content":"My wife & I were thoroughly happy with our Beach Cottages experience during the week including Christmas 2010. Booked an oceanfront cabin (5 months prior). The view from our windows? Well, I would have to say it ranks in the top five - ever. Gorgeous Pacific Ocean sunsets. Magnificent swells curling through the Crystal Pier to the North. Early morning walks on the beautiful beach. Breakfast at \"Konos\" (outstanding value + fun spot). No stuffy \"upscale\" hotel atmospherics. Jus' friendly folks. I can understand why the rates more than double in the Summer. Even though the December chill prevented swimming (water and air both around 55), the gentle sounds of ocean waves was a definite plus to we desert dwellers. Highly recommend for people and families who appreciate simple, clean accomodations in a nearly perfect setting.","ratings":{"Overall":5.0},"author":"Leora Kihn","date":"2013-11-11 17:13:08 +0300"},{"content":"This is a pretty good place to stay for the price if you want to be close to the beach....and the bars! Me and my friends stayed in one of the apartment suites which was perfect for us, large room with plenty of space and included 2 queen size beds, a sofa bed and a kitchen. Although the apartments arent advertised as a sea view, we had a pretty decent view of the beach from our balcony, beach itself was beautiful and literally about 30 seconds walk away! Bathroom was fine, very clean and towels were changed every day, shower was great really powerful and hot! The beach cottages also provide free Wireless broadband which worked great. My only complaint about the place was the lack of air conditioning, we stayed in september which is one of the warmest months of the year and the room was very warm if you didnt have the doors wide open(which obviously you cant do at night!). In terms of nightlife this place is great, loads of bars/restaurants just minutes walk away and if you want to take a trip to downtown its only 10 mins or so in a cab.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Kayla Lindgren","date":"2015-01-13 13:14:58 +0300"},{"content":"Stayed at the Beach Cottages for 4 nights on our honeymoon. Location was great, RIGHT on the beach. Very convienient to just sit on the beach and relax, drink a few beers and be able to run up to the room to use the washroom/etc. Great staff, didn't have any problems during the stay. A little surprised there was no air conditioning but it wasn't a problem (big ceiling fan and small fan in the room worked fine). Prime location, walking distance to everything around Pacific Beaches main strip. Lots of restaurants/bars/etc. Very affordable food close by if you like simple pub food. Other options for higher class food as well. Overall, really enjoyed our stay and couldn't have chosen a better hotel for the money (or even more money!) Tim","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Roberto Morar","date":"2012-09-10 16:23:22 +0300"}],"public_likes":["Cristina Russel","Sydni Hane","Jayson Labadie","Leatha Bode","Larissa Carter","Gwendolyn Beer","Ardella Hammes","Emery Simonis","Kayley Quitzon"],"vacancy":false,"description":"Pet friendly bed and breakfast offering suites and studios with fireplaces, beautiful gardens, and bountiful breakfasts.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}