{"title":"London/South Kensington-Chelsea","name":"K+K Hotel George","address":"1-15 Templeton Pl, SW5 9NB","directions":"tube: Earls Court","phone":"+44 20 7598-8700","tollfree":null,"email":"hotelgeorge@kkhotels.co.uk","fax":"+44 20 7370-2285","url":"http://www.kkhotels.com/en/hotels/london/k-k-hotel-george/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.492291,"lon":-0.195346,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16458,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"The Upper House is simply superb in every way. A warm greeting by name on arrival, and we were taken up to our room for an easy I-pad check in. Not only was the room incredible, but also the staff seemed to anticipate our every need in advance. Hats off to the Upper House staff- you are all excellent. The room was impeccable with a large and outrageously comfortable bed, and a large and outrageously impressive bathroom, three huge sofas, an I-pod loaded with music linked to the AV system, and a well-chosen selection of coffee table books- design, fashion and the history of Hong Kong. Forget the minibar- here we had a maxi bar, a fridge full of complimentary drinks (loved the Firefly), an Illy Espresso machine, and jars of cookies, m&m’s, almonds and more. We were also delighted to find full sized “Ren” products in the bathroom. A few drops of the Ren rose oil in the bathtub whilst looking down on Hong Kong twinkling below me- pure heaven. The Upper House is well located within Pacific Place- good shopping and transport, but because we were so comfortable, we deferred and deferred leaving our room reading and playing backgammon instead… We did make it upstairs to Café Gray Deluxe; we had excellent food and wine, and then a drink at the long bar- great views, a great evening! I would not hesitate for a moment to recommend the Upper House to everyone; I am looking back on a stay at an exceptional and wonderful hotel. I really hope to return.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ova Huels","date":"2012-07-06 13:39:49 +0300"},{"content":"Excelent hotel, beautiful rooms, all there. Might miss a proper swimmingpool for some. Stayed there again this month twice and was a but surprised on the service during my 2nd stay in the same month. Usually concierge contacts you prior to arrival, this time not. So no fresh juice etc like I usually get. Next also it seemed nobody was really keen to bring the luggage to my room, so I took it myself. This hotel is known to me for their personal service but last stay it was not there. Too bad!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jean Ruecker","date":"2015-10-02 01:18:37 +0300"},{"content":"Having read many reviews we selected the Upper House for a 4 night stay to celebrate our silver wedding anniversary and we were certainly not disapointed. Excellent location some 50 metres from the entrance to the Pacific Place shopping mall and a short walk through the park to the Peak tram. The entrance is understated and at first glance it could be mistaken as the garage to the adjoining Marriott. Spacious modern rooms with every possible amienety. Large bath / shower area with R E N toiletries supplied. The Michelin 1 star restaurant is located on the 49th floor and has views over the harbour which when enjoying dinner includes the daily 8pm light show. Good selection of well presented delicious food. All the staff were very polite and friendly with those at breakfast in particular going out of their way to make us feel at home and we felt they regarded us as friends rather than customers. A nice touch was the unexpected delivery of champagne and strawberries to our room on our anniversary. If you are looking for a modern hotel in a convenient location providing lovely rooms and quality dining then this is the hotel for you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Caden Pacocha","date":"2015-08-03 12:47:05 +0300"},{"content":"Outstanding Hotel of the upper class, amenities, brilliant, bed, soft comfy and fantastic view, bathroom so dramatic, want to take it home. all that can be thought of, has been, for me a 99 pointer","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Clifford Metz","date":"2015-11-07 03:06:04 +0300"},{"content":"I admit to being nervous about staying at Upper House. A self-confessed Four Seasons Hong Kong junkie, I thought that no hotel could ever match its impeccable service, stunning location, unbelievable facilities and F&B. Boy, was I wrong. Upper House just blew me away - exceeded all expectations and then some. I had more OMG moments in this smallish, stunning boutique hotel in the very convenient Pacific Place than I care to remember. Let’s start with reception: nice and discrete ground floor welcome, warm and enthusiastic without being gushy from an impeccably groomed and professional team. It also smelled gorgeous. We were terribly early (7:30am) and not expecting our rooms to be ready. No problem at all, and a suite upgrade to boot! Immediately whisked away for a comfortable in-room check-in, we had our first OMG moment – the jaw-dropping views of HKG harbour. Then we focussed on the room, HUGE barely describes it. Sprawling more like it, and oh so comfortable. More OMG moments followed – the fit-out and interior detailing all extraordinary. Beautiful timbers, impeccable craftsmanship, easy to operate touch-button controls for everything; brilliant lighting, TV and in-built sound system wiring the iPod to all rooms, including bathroom. A minibar with complimentary beer, soft drinks and juices – there is a God! And oh, what a bathroom – two rooms actually, one with twin vanities and TWO inbuilt dressing tables and stools, separate loo and more space than you’ll every use; then into a corridor, up some broad, flat, LED under-lit stairs to the pièce de résistance, the ‘bath’ room. A free-standing, centre-of-room bath surrounded by picture windows with HKG and its harbour spread beneath you. Covetous REN products complemented this spectacular offering. Tucked behind, a large cubicle with rain-shower seemed almost superfluous but equally inviting. It was then off to Café Gray Deluxe for breakfast and service that was so sharp and on-the-ball it almost made you weep with joy. Highly attentive, knowledgeable and thoroughly accommodating, staff could not do enough. You knew they really cared. Needless to say the food was beyond delicious and the coffee, without doubt, the best in town. We returned later for afternoon tea (book through a Virtuoso travel agent and it's complimentary, as was the room upgrade) and the best I’ve ever had – so contemporary, flavoursome and original it puts all the others to shame. Sorry Peninsular, your high-tea is well and truly trumped here. The adjacent bar proved a knock-out venue for cocktails that evening – very pricey but with the level 49 views and supremely comfortable all-window nooks it was incomparable. The interior design and comfort here and in the café brings more OMG moments. No, there is neither pool nor spa at Upper House, only a small but useful gym. No big deal though - I popped 20m across the road to the Shangri-la to do all that. Great facilities and not the least bit inconvenient. And a pool that almost rivals the Four Seasons’. Upper House was one hotel I never wanted to leave. A flask of warm milk and cookies on turndown was a nice touch but the take-away espresso waiting at 5:45am on checkout really sold me. I’ll return to the Four Seasons when I feel like a resort-type stay, but every other time I’ll be back to Upper House. It was like being in the home you might create in your dreams.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Isadore Adams","date":"2014-02-08 04:32:16 +0300"},{"content":"In the heart of Pacific Place, lies the Upper House Hotel, being the inaugural Hong Kong Hotel for the Swire group. Just getting to the restaurant is an experience in itself; certainly in the evening the ambiance sets the tone for what’s in store. While modern minimalism is a feature of the Hotel, making ones way up the long sleek escalator with warm teak wood hues gives way to a lift lobby that then takes you to the top floor of the Hotel wherein lies on the 49th Floor Café Gray Deluxe. A short candle lit hall leads to the interior. With the bar and cosy semi private booths on the right and the main dining area straight ahead, the inimitable style and refined aesthetics are both soothing and sophisticated. Service It’s not that hard to build and create a great looking restaurant, however, while one can build and create the most amazing places on earth it takes people to make them a reality. This is where Café Gray Deluxe exceeds expectations. Quality service should always be unobtrusive yet professional and efficient. Café Gray Deluxe is both. More than that, it’s carried out in a genuinely caring manner. Making this a place where casual meets sheik with attention to service. On our visit our service was superb and again proves that in Hong Kong, it is indeed the five star hotels that can attract and retain quality people. Food While there has been “mixed” reports in the media on the food, on our visit we ordered a variety of dishes, all of which were both enticing and delicious. Mixed Oysters with Crab legs (the latter already carefully slice open for easy access) being tastefully presented on a bed of ice, both the Oysters and the Crab were of the freshest and finest. Other dishes to follow where: Pork Chops tenderly cooked with a nice selection of vegetables, a whole Lemon Sole cooked to perfection with a tangy light lemon sauce, and Beef Cheeks, being tender and gelatinous accompanied by a light sauce and medley of vegetables. Now this is were some other reviews had differing thoughts, but my point is this. Good food done well, prepared fresh and with attention to detail is the key to success. It is a simple as that, and while some diners may have different conceptions or follow other fads in reality there is no need for food to be convoluted or complicated. This is where Café Gray Deluxe excels, with quality produce and a traditional approach, neither will never go out of style. Overall it further elevates the dining status for which Hong Kong is famous. Dining at Café Gray Deluxe can be like dining anywhere else in the world and certainly comparable to, Tokyo, London, Paris and New York. No doubt the fact the Chef Gray Kunz, spent sometime at a very successful establishment in New York, evokes a major influence in this dining venue. Personally I can’t wait to go back there!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Darian Buckridge","date":"2014-09-02 09:35:37 +0300"},{"content":"Stayed here for 4 days last week and it was best hotel we have stayed in to date - better than the Wynn, Bellagio, Gansevoort etc. It is easily the best bathroom we have had.... Huge bath, shower and lighting and styling in it are testament to Andre Fus vision. Every part of the hotel works together and has been thought out so that it all flows. The Cafe Gray deluxe is superb and the special at lunch was a great price. I can only recommend this hotel to all.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Emile Hermiston","date":"2013-08-09 23:41:45 +0300"}],"public_likes":["Devin Durgan","Leo Morissette Jr.","Daisy Ankunding","Emmalee Stanton","Pietro Hettinger"],"vacancy":false,"description":"154 rooms and free wireless (and wired) internet access. The hotel is also right next door to Earl's Court exhibition center.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}