{"title":"London/Westminster","name":"The Grosvenor","address":"101 Buckingham Palace Rd, SW1W 0SJ","directions":"tube: Victoria","phone":"+44 871 376-9038","tollfree":null,"email":"grosvenor@guoman.co.uk","fax":"+44 871 376-9138","url":"http://www.guoman.com/hotels/united_kingdom/london/the_grosvenor_hotel/index.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4957,"lon":-0.1453,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16529,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"SIMPLE the BEST in Ponce and South area of Puerto Rico. I go on monthly basis to work and I just love their pampering. I don't get ocean view all the time but when I do It just GREAT!!!! LOVE ITTTTT. Why stay in my mom's house :-)!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Miss Polly Langworth","date":"2013-11-18 14:45:15 +0300"},{"content":"Let me start by saying that this is my first bad review ever on trip advisor (so everyone knows I'm not just a complainer). This was not the worste stay ever at a hotel, but not my favorite! Here's the goods and bads: Goods: Location is amazingly beautiful, but pretty far from San Juan airport. The pool deck looks just like the pictures online. The view from our room (the cheap room) was outstanding. There was one waiter (Izac) who was friendly and one manager (Angel Hernandez) that was helpful when we were having a particularly hard time getting some lunch. Downtown Ponce has a trolley tour that only costs $2 (and for 2 dollars is was pretty good). Our trolley driver was very funny! It was easy to park at the Hilton and the beach towels were pretty big and soft. The lounge chairs at the beach were greatly appreciated and used daily! The breakfast buffet looked pretty good. I ordered eggs Benedict one day (as I don't eat enough buffet for the cost) and it took 1/2 an hour and my eggs were almost hard boiled they sat around so long. The strawberry daiquiri is very delicious at any time of day, however. The tuna wrap was pretty good and we ordered it a few times (although it was supposed to come with guacamole and it never did. I assume they were out, but a waiter should have said that when we ordered). Bads: There was not once when the food service was good! Over done food that took half an hour or more to bring out (even if we were the only ones waiting) was the norm. If there are spanish speakers around we found they ALWAYS got served first, even if your order was taken first. Waiting 15-20 minutes for a waiter to even acknowledge you was the norm. Several times I was at the bar and the bar tender would go around to all the spanish speakers before me, even if I came first. It often seemed as if the staff didn't really want to be working and they were taking it out on the patrons. My husband and I have been to jamaica several times and we understand island time, but taking an hour for a fruit salad and then not understanding why I get upset when it doesn't come is a little ridiculous! (By the way when the bar tender asked the waitress, who was talking, where the fruit salad was she gave him some attitude, rolled her eyes and walked away to talk with her friend a few feet away). At one point the credit card machines were down and my husband (and the rest of the army boys, we were there with the army) had to get to a meeting. Instead of telling us the machine was down the restaurant took the credit card and just held onto it for twenty minutes. When someone asked if they could get their card back because they had to get to a meeting, the waiter said no. He was going to hold onto the credit card for hours. This might have been an ok option if they had asked but just taking the card and not telling us what was going on was deceitful! We asked them the put the charge on our room and give back the card but they acted like we were asking them to move heaven and earth (I guess it's a lot of work to put something on the room). I try to be polite, but I feel like it was fairly one ended. We went to the casino one night and along with comp. drinks there was grilled cheese. We saw a bunch of spanish speakers going up to the waitress and grabbed sandwiches that were stacked up. (They people had just walked in so I don't think they pre-ordered). When my husband and I walked up and asked for one, the waitress turned away from us and walked the other way without saying a word. Also, bring your own sun screen! A 3 oz container of SPF 35 cost 13 dollars!! And don't ask the ladies in the gift shop for any help, they will only give you attitude and big sighs. The concierge was helpful in the sense that he gave us a map to get to downtown, but suggested nothing to do/ see/ or eat while down there. I often felt like I wanted to apologize for asking the staff to answer basic questions or bring out food. I understand it was hot and they didn't want to move fast, but I always say please and thank you and I don't think I deserved all the sighs and eye rolling that I got. It was exactly like telling my teenager to clean her room. The beach did not have the Caribbean clear water that we are used to and it was really rocky for the first five feet, but the waves were safe to play in for the kids. You did have to watch for big rocky wholes in the sand under the water that could cut up your feet but we soon learned where they were and were able to avoid them! I was fairly on my own with a teenage daughter because my husband was in P.R. with the army and although the army told me that everyone in P.R. speaks some english I did not find that to be true. We were very glad when we moved on to San Juan for the next portion of the trip!!","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"Kenyatta Romaguera","date":"2015-06-25 16:43:18 +0300"},{"content":"After staying in a scrappy hotel in Aguadilla \"La Cima\", this is heaven. Nice, clean and comfortable environment. Now here’s a place one would return too.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":5.0},"author":"Pasquale Jacobi","date":"2015-12-24 23:24:35 +0300"},{"content":"I loved my two-week stay here! Great breakfasts, lunches and dinners. Everything is open, and walking around the hotel at midnight is commonplace. It is an open community, with an excellent swimming pool, comfortable rooms, and a great location! The price could be hefty, but if you are on vacation, splurging (moderately) is not a big big issue! Enjoy your stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Kiera Rolfson","date":"2014-07-15 04:50:23 +0300"},{"content":"Beware. This hotel pretends to be considered 5 stars, but at best they are a 3 star with ocean view. The service ranges from OK to mediocre, and the food is very expensive. The rooms are nothing to die for, and the main lobby is way too dark considering the extremely elevated crime rate of the area. If you are driving to the property you'll have to pay a parking fee. The interesting fact is that they have no personnel at the gate because a bunch of crooks assaulted them with shotguns and took all the money from their petty cash (a hotel employee actually told me this fact). So yes, crime will be at your doorstep, so be extremely careful and on the lookout. Some of the hotel staff are nice, but in general they don't make you feel welcome to the place.","ratings":{"Service":2.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":3.0,"Location":3.0},"author":"Cordelia Stroman","date":"2015-09-30 10:57:27 +0300"},{"content":"We stayed at the Hilton in Ponce, Puerto Rico, which I am about to review. However, first I think it would be helpful to say a few words about Puerto Rico in general and Ponce in particular. We visited Puerto Rico many years ago. In those days, Puerto Rico was very poor and frankly depressing. We chanced a trip back to San Juan about a year ago. I couldn't believe the difference. We have traveled extensively in Latin America – our most recent trip being to Punta Cana in the Dominican Republic, where they definitely don't have their act together. Puerto Rico is a clean, prosperous and safe place to visit. It is heads and shoulders above anywhere else in Latin America we have ever visited. In Puerto Rico everything works – click, click, click. It is the only place in Latin America I know about where you can drink the tap water and eat the vegetables wihtout wishing you hadn't. You can trust the police. Bribes are not the tradition there. They use American money. Very good English is widely spoken. There were many times I could not hear a trace of an accent. It seems like nearly everyone drives a late model car. Both times we visited there, the weather was perfect – low eighties in the middle of the winter. I saw no beggars on the street. American stores and restaurants are everywhere. You don't need a passport to get there. Our Sprint cell phones had free roaming there – I can't tell you what a convenience that was. We could call each other when separated and our teenager when she wandered off. We could call businesses and have them tell us how to get there. Our teenager sat out on the balcony and talked to her friends back in the United States for hours. We liked our stay in San Juan a lot during our last visit. We stayed in the Hilton there as well, which we also liked a lot. We decided to go to Ponce and stay there for four days just to see something different. There were three of us – two adults and a teenager. The only hitch we ran into is that we had booked a connecting flight from San Juan to Ponce on Cape Air with CheepoAir.com. We had an itinerary from CheepoAir that said we were booked on that flight. Cape Air stated that CheepoAir had canceled our flights – something never mentioned to us and something we certainaly never ordered or agreed to. However, Cape Air said they could get us on that flight, but it would cost a lot, lot more than the advance purchase fare we had booked. I don't know who made the mistake, but I do tend to get little a suspicious of profitable errors. Anyway, it worked out just great. We declined and walked right down to Hertz. The rental for the car for four days, including tax, was $148, which was much less than the original air fare for the connecting flight for one person, let alone three. Except for a short stretch in San Juan, it was all turnpike (about $6 in tolls each way) and a lovely drive through rolling hills. It took less than an hour and a half. We arrived before our scheduled three hour layover in San Juan was over and we had the use of the car while we were in Ponce. The total gas cost was $28 for the round trip and our running around in Ponce. The hotel charged something like $5 a day to park there. Now to the Hilton Ponce. The bottom line is that we liked it. We stayed in a part of the hotel called the Executive Tower. You get a substantial discount on the room rate if you pay in full in advance, which we did. The room was spacious and clean. There were two double beds in the room. I wouldn't call the beds roomy, but they were adequate. We had a balcony that looked out on the ocean. There was a desk in the room. They wanted nearly ten dollars a day for a high speed internet connection. They had an Executive Center where you could get a free wireless connection. Swiping my room card at the door to get in would not work there, but the people on duty always quickly buzzed me in with a smile. The last evening I was there, however, the lady on duty told me that I had to be a Hilton VIP member to use that room. There was nothing on the door to that effect and I saw no mention of that in the guest guide in the room. While that rubbed me more than a little wrong, I have to say the lady was very apologetic and nice about it. The grounds were beautifully landscaped. However, Ponce is not a beach destination. The hotel did have a narrow beach, which did not have a life guard and suffered from some liter. The pool is very nice. The food, while a bit pricy, was outstanding. You can figure on about $35 a person for supper, after taxes, but before tip and about $25 a person for lunch. I don't think Ponce is famous for its restaurants. We ate at several guide book recommended restaurants in Ponce. They were okay, but the food at the Hilton had us spoiled. Most service personnel spoke English very well and they were very polite. Twice the maid forgot to leave coffee for the coffee maker in our room, but both times I called the front desk and a clerk showed up at our door almost at once with the coffee packs. Once the toilet stopped up. I called the front desk and a guy showed up in a flash to fix it. Everyone went out of their way to be friendly. Plenty of security. There are uniformed security guards wandering around all the time. Ponce has a nice little square downtown, surrounded by nice shops. It's hard to find a place to park there. I had to park the car a couple of blocks away and walk, but that wasn't much of a problem. They have some sort of a shuttle bus there to get around the downtown area, but we didn't use it. There is also a nice boardwalk along a harbor with several local restaurants close to the hotel. It's a nice place to go for a stroll, especially at night. We ate at one of the restaurants on the boardwalk, but it did not impress us. Ponce is a nice. well kept little town, but you run out of things to see pretty fast. It's worth a few trips into town, but we spent most of our time at the Hilton, where there is plenty to do. We arrived back to San Juan in our rental car hours before our mid-afternoon flight. We drove out to a part of San Juan called Condado for a leisurely lunch, which we enjoyed immensely. Condado is a tourist area in San Juan close to Old Town that has quite few really nice restaurants. It sure beats air port food, if you have the time and a car to get there. In short, I highly recommend Puerto Rico, Ponce, the Ponce Hilton and Condado in San Juan. I also recommend that you rent a car to drive to Ponce rather than taking a connecting flight.","ratings":{"Overall":4.0},"author":"Kelvin Williamson","date":"2015-04-26 16:16:28 +0300"}],"public_likes":["Elise Yundt","Cleta Feil Sr.","Laurie Wiegand","Lexi Schowalter","Maurice Medhurst"],"vacancy":false,"description":"Handily located next door to Victoria railway and tube station.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}