{"title":"San Luis Obispo","name":"Sunbeam Motel","address":"1656 Monterey St","directions":null,"phone":"+1 805-543-8141","tollfree":"+1-877-338-8717","email":"sunbeammotel@gmail.com","fax":null,"url":"http://www.sunbeammotel.com","checkin":"3-10 PM (call if you can't make it before 10 PM)","checkout":"11 AM (though if you need more time, they're unlikely to rush you)","price":"$49-69 plus tax/night for 1-2 people","geo":{"lat":35.287678,"lon":-120.652881,"accuracy":"ROOFTOP"},"type":"hotel","id":26284,"country":"United States","city":"San Luis Obispo","state":"California","reviews":[{"content":"have heard about the royal villa resort over the years. surprised that it had moved from turney to 12th st n.! what a surprise. couldn't ask for a more central, clean, comfortable and friendly location. was in town for a convention so divided my first two days at the royal villa and the last two days at a chain resort in the north end of the city -- wish i could have gotten out of the second, prepaid booking. i felt so at home at the royal villa resort! so convenient to my favourite pauncho's buffet on indian school road, rosco's sport bar andf grill and their great food and for the chute for playingl. doug - kenny -- many thanks for making me so welcome. for your recommendations and supplying local information. just wish that i had stayed there previously -- have been to phoenix about 20 times and realize i have missed out on this \"gem\"! --gary","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0},"author":"Neoma Metz","date":"2014-09-04 23:20:22 +0300"},{"content":"Uppity rule-oriented staff. Rooms need a bad updating. Pool was nice, but that's about it. If you're 70+ and are in bed by 8 (the way the owners prefer you are) then you'll fit right in. Otherwise avoid this place!!","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":1.0,"Location":3.0},"author":"Kaela Williamson","date":"2012-03-03 02:36:32 +0300"},{"content":"We have stayed at the Villa many times, and I have always found it to be very clean and the owner and employees are down to earth and pleasant and concerned that their guests are having a good time. The grounds are immaculate and tastefully decorated and we always notice upgrades and improvements whenever we go there. The Villa is close to some of Phoenix's hot spots, and it is even possible to walk to some of the clubs. There are lots of very attractive guests staying there from all age groups and each and every person there is made to feel at home. I'll try to go there as often as possible!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Jedidiah Schuster","date":"2012-03-20 18:18:14 +0300"},{"content":"Good place if you want to make a quick overnight trip to Phoenix. Business trips only pls. Average room quality. But was at a convenient location w.r.t my place of work. Close to the airport, so you can afford skipping the rental car.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":3.0},"author":"Hettie Maggio","date":"2013-08-28 07:38:09 +0300"},{"content":"This is the worst hotel stay I ever had. I was late checking in and was thus given a smoking room. Only after I said that I wanted to go to another hotel did she gave me a non smoking room next to the elevator shaft. When I entered the room I was met with a continuous hum and thought it was due to the elevator. Later at 2 am I figure that I cannot stand the noise anymore, which I figured out was due to a bad A/C, and I approached the front desk for another room. To my surprise I was given another non smoking which was as quiet as a graveyard. I was wondering why the first front desk girl first said that there are no more non smoking rooms and then gave me the room next to the elevator when there is a quiet non smoking room available. And I had put in a preference for a non smoking room when I made the reservation, and it was still on record","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Nasir Shields","date":"2015-10-25 20:57:57 +0300"},{"content":"This is one of the older Homewood Suites where I’ve stayed, but it has been maintained well and very clean. Décor is reminiscent of a western theme with knotty pine furniture and kitchen flooring. Very comfortable bed and pillows. Conveniently located with shopping nearby including a Fry’s grocery (part of the Kroger family). I’m used to Kroger in Atlanta, and was pleasantly surprised that when I punched in my phone number it recognized my Kroger/Fry’s member card and saved me several dollars on my purchases. The in-suite full kitchen is a must for hotels these days IMHO, and I usually select Homewood Suites or Residence Inns for that reason. Nice light suppers provided at their “Welcome Home Reception” Monday through Thursday. Chicken fajitas with rice, refried beans and green salad were on the menu for Monday night. I was a bit surprised that beer and wine were not offered as at other locations I have been to in Las Vegas, Dallas, and Orlando, but I ended up eating there the rest of my Monday thru Friday stay for the convenience after working long days, even though I could have expensed meals elsewhere to my company. Menu items the rest of the week included meat loaf and mashed potatoes, marinara sauce and meatballs, and always included a salad bar. The evening suppers at Homewood are certainly several notches above the snack-type evening offerings at any Residence Inn where I’ve stayed. Wonderful daily breakfasts are also a plus, with rotating menu items including bacon, scrambled eggs, sausage, biscuits and gravy, waffles, cold and hot cereal, fruits, yogurt, and a variety of beverages. I purposely chose a suite opposite the sports bar that another reviewer mentioned as being rather noisy using the online advance check-in system through the Hilton web site. I heard absolutely no noise from it, but I was only there Monday thru Friday, so they probably only really crank it up on weekends. Very friendly staff…every staff member said hello when passing them in the halls. Will definitely plan to stay here again the next time I’m in Phoenix.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Ivy O'Connell","date":"2014-09-14 15:03:22 +0300"},{"content":"I stayed at this location thru part of February and most of March. The location is great. Lots of restaurants, shopping and groceries within walking distance. The area felt safe and was relatively quiet. Only a few minutes from downtown and the airport, and easy access to most major thru ways (51, I-10, 101, 202, I-17). On my first stay they told me they only had one room left, a queen smoking. I asked to be moved at the first available opening, don't think they even tried. The coworker whom I was commuting with, who already had a room here had checked in a week earlier and they told him all they had was smoking then too. Those beds were not queen but double and the smell of smoke was almost intollerable. I had to keep my windows open constantly and even used a whole bottle of odor nutralizing spray. On my next stay (4 days between stays) I was given a king non-smoking, MUCH BETTER. [I do have to say that the suite with 2 dbls was more spacious than the king] I really enjoyed the evening receptions 4 days a week. However they would only put out a few things at a time and it would run out quickly and they were not being replaced quickly enough. The food area did not have good flow and would quickly get cluttered with people. The access to the Business center was difficult as people would \"camp-out\" on the computers for long periods of time. Wireless in the rooms was pretty hit and miss too. Overall I would stay here again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Tara Moen","date":"2014-01-29 05:40:11 +0300"}],"public_likes":["Lue Ondricka","Morgan Kirlin"],"vacancy":true,"description":"A comfortable 15-unit motel close to the Monterey St. exit from the 101 Freeway and about a 15-minute walk from downtown. You may find your bed just a tad lumpy, but the rooms are big and everything is quite acceptable, especially for the price. Very nice, helpful managers, and you may be allowed to leave your car in the lot for the afternoon after you check out, if you ask nicely.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}