{"title":"Snowdonia National Park","name":"Cae Gwyn Farm","address":"Trawsfynydd, Gwynedd. LL41 4YE","directions":null,"phone":"+44 1766 540245","tollfree":null,"email":"enquiries@caegwynfarm.co.uk","fax":null,"url":"http://http//:www.caegwynfarm.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.85,"lon":-3.9108,"accuracy":"ROOFTOP"},"type":"hotel","id":27626,"country":"United Kingdom","city":"Gwynedd","state":null,"reviews":[{"content":"This is a huge, beautiful resort but definitely not worth the money if you don't have time to take advantage of the amenities. For $343.00 per night (and that is a discounted rate) we had a rather small room with two queen size beds. The room smelled of cologne. Presumably from the previous guests. Hopefully not from the housekeeping staff. Our room was 62 degrees when we got there and we never could figure out how to raise the temperature. We had just come from the Renaissance Resort near Seaworld where we spent $111.00 a night for a room that was twice as large, with a sofa and chairs, dining area, wet bar and office area. Plus, everything in the Renassance is right there - restaurants, bars, pool. No long walks required.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Location":5.0,"Rooms":1.0},"author":"Leonard Altenwerth","date":"2012-11-08 13:23:18 +0300"},{"content":"It was easy access to Magic Kingdon but longride back at night. The boat sevice was not good after the park closed and going to other hotels not great either. Lots of fun for Princess that we had with us but very expensive to do all the extras (like tea with sleeping beauty) Not worth the price $250.00 for 2, but you did get a doll. Concierge service was great. Housekeeping was great. Food is OK but room service was fast with warm milk in the mornings and at late night. Would probably not go back but try Hotel in Orlando Ritz or Marriott and rental car next time.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":1.0,"Location":5.0,"Rooms":3.0},"author":"Gladyce Wuckert","date":"2015-09-10 07:47:48 +0300"},{"content":"This resort is beautiful but I didn’t like it as much as the Animal Kingdom or Polynesian. This may be because I was traveling with a 5 and 1 year old. Enjoyed the character breakfast and the staff were pretty friendly. Had the meal plan so we didn’t spend a lot on food. I've stayed at the several Disney properties and this would be the one I would least likely return to. But again, it may be because of the smaller kids. I do, however, love the spa there and each time I go made sure I get a treatment. They have a kid's pedicure that my 5 year old loves, she has had it twice and it put her to sleep each time.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Ella Schmitt","date":"2014-01-23 14:20:59 +0300"},{"content":"I had stayed at the Grand Floridian before, as at the Polynesian and Contemporary. This time I went with my family, including two children, for New Year´s Eve; As everyone knows, the place is very handsome, but surprise! as soon as we got there we were warned that we could not get a meal inside the hotel unless previously reserved. eVEN BREAKFAST! With two children, we decided not to submit them to long lines and had room service every day. For other meals, we had to go to another hotel or one of the parks.That seems to me absolutely ridiculous. The hotel was clearly overbooked andnot worried over their guests´well-being. For the sort of price you pay there, I felt definitely cheated. They should not fill to overflowing, making it imposible for their own guests to have a meal inside the hotel. And more: I asked once to use an internet, which I imagined I would have to pay at some business center. Front desk told me where to go - it was closed and I was told to use the one at the Contemporary, where we had had dinner three nights. Well, I will stay elsewhere next time...","ratings":{"Overall":2.0},"author":"Kiara Morissette","date":"2014-04-15 04:49:53 +0300"},{"content":"We just returned from our 1 week stay at the Grand Floridian and already miss it! We've stayed at other Disney properties before, and this one is by far the best yet. The rooms were large & comfortable for our family of 4. The in room fridge allowed us to have a quick in room breakfast every morning. The bathroom was large and the robes and coffee maker provided a sense of luxury. The heated pool was inviting, although we never had time to take a dip. There were plenty of people indulging, and even though the pool is open 24 hours and our room faced the pool, it was never loud. We were in the Boca Chica building, which was at the back of the property, overlooking the beach and the pool. Our daughter looked forward to the chocolates provided with the turn down service. The location was convenient. It was fastest to take the Monorail to the Magic Kingdom (no stops) and the boat back (no stops). The monorail from the MK back to the GF had 4 stops before the hotel. We ate at the cafe for breakfast twice, and it was tasty and had the wonderful friendly Disney Service.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Brando Boehm","date":"2013-02-10 19:19:55 +0300"},{"content":"We just returned from a three night Disney Wonder Cruise followed by three nights at the Grand Floridian. The hotel is very lovely and takes one back to the elegance of the turn of the century. Staff was exceptional to Disney standards. Multiple restaurants on the \"pricey\" side. This was a trip for our Grandson and although the hotel very nice, probably not overall the best selection of a Disney luxury property on the Monorail for a seven year old. The lobby is gorgeous complete with high tea and a full orchestra in the afternoon and evening. The grounds are gorgeous with multiple pools; one with a sandy beach. Great access to the Magic Kingdom; the first stop going on the Monorail and first stop returning on the boat. One evening we ate in the casual Grand Floridian Cafe where they have display drawings done by youngsters while waiting for dinner. My husband inquired if they would display our Grandson's for just a short time giving him the opportunity of being the \"Artist of the Day\". It was a highpoint in his trip. We were in the Conch Key Building on the fifth floor in a gabled room with balcony. The room was generous in size with a king bed and sofa making into a single bed, flat screen TV, clock radio/alarm with IPod feature and large desk and work table. The bath has first class amenity shampoos and lotions with double sinks and separated from the toilet and tub/shower combination. Each building also had a small laundry room with two washers and two dryers. I learned in Florida, since we shared our visit with Tropical Storm Fay, it is better to have a property mainly contained in one building rather than one with multiple buildings. One could get pretty drenched walking from the main building and the Monorail stop to the Conch Key building where our accommodations were located. Overall, we would return but probably not with a small child and would look at either the Polynesian or Animal Kingdom.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Santa Rippin","date":"2014-06-19 08:16:51 +0300"},{"content":"We approached our booking at the Grand Floridian with a hint of trepidation. We had read mixed reviews about the hotel and were slightly nervous as Disney virgins. However the experience was wonderful. We were upgraded to a concierge room which was tremendous. The facilities were first class as were the staff. The location is tremendous for the Magic Kingdom and the bus service to the Animal Kingdom was swift and frequent. The top tip though is to take the boat to the Magic Kingdom. It is pleasantly cool in the humid conditions and not well used. On some journeys we were the only passengers. All in all, a great hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Christelle Douglas","date":"2013-02-14 01:50:58 +0300"},{"content":"The hotel rooms are not thoroughly cleaned. The room fittings/furnishings are worn/show excessive age. The electronic door keys have known problems (extraordinarily inconveniencing after a day at park) - It defeats convenience of a quick return from the park to your room. No sound proofing between rooms. Only basic channel options for the television, the internet is slow, costs extra and isn't wireless. Food is standard Disney fare but at higher prices and even expensive meals have no table cloth. Finally, it seems to get higher ratings than deserved. The Gaylord Palm near Celebration could never have these issues and get its high rating. I think there were a lot of times when the desk/GF management/WDW management just didn't feel it was necessary to fix blatant problems. I strongly suggest visitors snap pictures of exactly what you find wrong and uncorrected and post them here upon return home. Unfortunately I didn't think to do that at the time, I kept thinking each thing would be the last and I should just focus on enjoying the trip as a whole. Finally, read through the recent 3 and 4 star review texts, the content is more accurate of the hotel and I don't see how people gave it 3 or 4 except maybe some categories brought the average higher than reality.","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Xzavier Funk","date":"2013-02-03 13:51:41 +0300"}],"public_likes":["Theo Kutch","Eulah Reilly","Michale Franecki"],"vacancy":false,"description":"A reasonably priced B&B near Coed-y-Brenin with four ensuite rooms which can be either double or twin rooms. Beautiful Farm 2008, Regional Winner.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}