{"title":"London/East","name":"Devonshire Hotel","address":"94 Station Lane, Hornchurch, Essex, RM12 6LX","directions":"tube: Hornchurch","phone":"+44 1708 440088","tollfree":null,"email":"info@devonshirehotelhornchurch.co.uk","fax":null,"url":"http://www.devonshirehotelhornchurch.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.5578,"lon":0.2203,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16114,"country":"United Kingdom","city":"Hornchurch","state":null,"reviews":[{"content":"Iberostar Dominicana Resort is Great! This 8-day stay was superb as a relaxing yet adventurous vacation. It was picture perfect in that it looked just like the photos in the brochures I'd seen - white sandy beaches with the thatched-roof cabanas, plenty of lounge chairs beach-side and pool-side and comfortable enough for frequent napping. It doesn't get much better than that! A siesta by the water with a nice tropical breeze...wow! The room was clean, the air-conditioning worked well - so much so that we usually turned it off at night as to not awaken to frigid temps in the morning. Plenty of bottled water was provided for in room consumption. The shower/bath was nice and big with a nice added touch of a hand held wand to help rinse sand off. We had perfect weather up until the second to last day when it rained all day but that didn't stop us or many others from strolling out around the resort or beach and it was a perfect day for catching up on some sleep from the earlier excursions we had taken. The Outback Safari is very enlightening for those who need to experience the countryside culture and the trip into Santo Domingo is also a good excursion to experience the city culture. This was a once in a life-time experience for me and I would recommend it to those who are looking for a great vacation in the Dominican Republic.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Casandra Hansen","date":"2014-02-23 21:06:47 +0300"},{"content":"Worth Every Penny - Naysayers beware OUR TRIP - Two weeks, March 2 - 16, 2004. AIRLINE - AirTransat, we flew Club Class and it was worth the money!!! (FYI: it was an additional $150/person each way from Edmonton) I can only imagine how much longer the flight must feel in Cattle class. Spend the money! THE HOTEL - It was great!!! I love that it is in conjunction with the Iberostar Punta Cana. Make sure you go over to the Punta Cana Lobby/Lounge. It is really beautiful. That's where we spent alot of nights drinking wine. They have a band there every night too. Check out some of the shows at the Dominicana. They have a different theme everynight. They are also big on audience participation, so if your not into that make sure you sit in the back! There is a Rooster named George that sits in the 2nd last row every night. He is absolutely adorable. He loves to be petted! Depending on where your room is, he will probably be getting you up in the morning too. By the way - if you have previously requested anything specific about your room ie: view, bed size etc. you probably won't have it when you check in the first night. This seems to be the norm, judging by all the reviews that I have read on various web sites. Don't sweat it. Simply let the front desk know. They couldn't change us the first night we were there, but by noon the next day we were exactly where we wanted to be! (We have had to change our rooms in Vegas practically every time we go there too! Nothing that can't be fixed!) FOOD - It was GREAT. The buffets had huge varieties to choose from every night. Different themes too ie: italian, seafood, mexican etc. Their pizza is awesome!!! My husband who is a very picky eater ate pizza everyday and never got sick of it. He is also close friends with the guy who works at the Ice Cream bar by the beach. I'm pretty sure he consumed most of the chocolate ice cream on the island! As for me, I ate everything! Seafood, Chicken, Beef, Pork, Fruit, Veggies. You name it, and not one gastronomical problem! PLEASE REMEMBER THAT EVERY DISH IS NOT COOKED EXACTLY THE WAY IT IS IN NORTH AMERICA!!! So when you go to the Mexican Ala Carte restaurant, don't expect it to be just like Chi Chi's. DO TRY the Ala Carte restaurants. It does break up the buffets. The American Restaurant does not require reservations, but be there right around 7pm when it opens, because there are not alot of tables and you could end up waiting awhile. Again there food it not just like home, but try it all anyway. We ate there alot. POOL - Yes, you have to get up early and claim a chair/palapa. It is an unwritten rule and if you want to lay by the pool, it's what you've got to do. Don't fight it, just do it. If you are a joiner, then pick a chair on the Domincana side of the pool. (That's where all the activities occur) Otherwise, if you just like to read and soak up the sun (like us) hang out on the Punta Cana side. Very nice pool by the way. BEACH - We had the niciest beach by far. My husband walked an hour in either direction of our beach, so we know this to be a fact! If you can't get up early to put out your towels, you can always find chairs out on the beach. THE LOCALS - I can't say enough great things about them! They are so friendly, always have a smile on their face, helpful, kind, just wonderful people period. The Iberostar Star Friends are a real hoot! SUMMARY - Take everything in stride! Be prepared for alot of topless(ness) and speedos. YOU ARE NOT AT HOME, so please keep an open mind in regards to everything. It's called WHEN IN ROME people. Only you can ruin your vacation by being narrow minded. The few negative reviews I had read befor I went, just made me more determined to have a good time.Please feel free to ask me any questions. I would be happy to help!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Ellis Roberts","date":"2012-01-24 07:46:46 +0300"},{"content":"Beautiful hotel, average food I am a native Dominican that just went back after 5 years of being away from home. I spend 2 days at the Iberostar Dominicana. The hotel itself is beautiful. The rooms are very spacious and clean and very comfortable. The people of the Dominican Republic will be one of the friendliest and nicest people that you will ever come across in your travels, I guarantee that. The staff at the hotel was no exception. They learn a little of all languages just so that they can ask you how are doing and how you like your stay. The beach at Dominicana was just gorgeous and the pool at the facilities are also very inviting.My only complaint with this hotel is the food. Although there was a lot of variety I must say that the food was pretty bland. I was shocked to see that there were no dominican foods at the buffet. This hotel would get much better reviews if it wasn't for the food. I can't understand why there was no authentic dominican food. It's one of the more delicious cuisines in the world!!While I was there there was also a power outage that lasted for a at least an hour. I had never seen that happen at a hotel. But I think that was a very rare thing to happen.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Enid Lubowitz","date":"2015-04-24 14:57:15 +0300"},{"content":"great fun just got back from a two week hol. 4th sept - 17th sept. The place was just as we expected! great value for money. the beaches were fab. the pool had plenty of space and getting sun loungers were no problem. the weather was extremely hot and we ended up using factor 25 for the first few days. got cracking tans. there was plenty of chioce for the food - main restaurant was buffet style with something for everyone, the menus changed everynight. the other restaurants were good on the whole especially the steak house, although we werent too impressed with the mexican. plenty of chioce availabale for alcohol too with many branded products such as smirnoff - just ask!the rooms were good, our freinds got a free upgrade to a suite. ours smelt a bit musty at first but hey, what can you expect your in a hot humid place! the maid service was spot on. just leave a few dollars in the first week and some in second. there is also no need to tip bar staff for stronger drinks, they were strong enough and tips were not expected. the staff were lively, freindly and wanted to make sure you had a good time.went on two trips - one to saona beach - recomended - catamaran, beach, lunch, dancing, speed boat and swimming with star fish. the other was a jeep safari to take it the dominican in its natural state. theres no piont going to a country if you not gonna bother exploring it! the dominican tour guides were good fun too.most upset tummys were due to the coconut oil that food is cooked in, not under cooking and the fact that most people drank pina coladas all day and night doesnt help. i didnt have any problems. my partner and freinds had few occasions but nothing severe. just a case of adjusting to different eating habits.the entertainment was good too. im glad to say there wasnt many children there either. and you could always get snacks at the end of the night, chips, pitza, hot dogs etc. although i would recomend the beach paella and bbq as they were delicious and try out the local dishes- no piont being in another country if you wanna eat like you do at home.all in all a great trip. would suit couples especially.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Katherine VonRueden","date":"2013-03-20 18:04:32 +0300"},{"content":"Not what I expected Just came back from D.R. and boy was I disapointed. This is one island that I will never go back to. Don't get me wrong, I have nothing against the hotel. It was the weather and travel aspects, that were a nightmare. When you arrive at the airport, in Punta Cana, it's like stepping back in time. All the money that this country makes off of tourisim and this is the best they can do? The people that live there should be embarrassed. It is not only extremely hot and humid, but dirty and decrepited. Then comes the ride to the resorts. Not only are the roads in terrible condition, there is NOTHING to look at. It's like landing in the middle of the jungle. As far as the Iberostar property, I would give it a 2 to 3 star rating. They people there do try there best and the landscape and beach is nice. We were unfortunate to have rain EVERY DAY that we were there, so there really wasn't anything to do. One major problem we encountered though, was communicating with the staff. English was not spoken or understood very well, throughout the resort. My final opinion, is that I will leave the D.R. to the Europeans. The locals seem to treat them better, so they can have it.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Laurine Dare","date":"2013-03-02 15:40:52 +0300"},{"content":"Un voyage de noces inoubliable   showReview(15401236, 'full');","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Bernardo Smith II","date":"2012-03-06 23:05:28 +0300"}],"public_likes":["Mikayla Dickens","Samara Schinner","Mr. Lacy Kunde","Newton Oga","Nichole McGlynn","Ms. Odessa Eichmann","Bradley Heidenreich Sr."],"vacancy":true,"description":"Opened in 2011, it is a family-run boutique hotel with free wi-fi and secure parking. Some rooms have been adapted to allow for easier access. Breakfast & homemade snacks available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}