{"title":"San Francisco/Castro-Noe Valley","name":"Parker House","address":"520 Church St","directions":"at 17th","phone":"+1 415 621-3222","tollfree":null,"email":"info@parkerguesthouse.com","fax":"+1 415 621-4139","url":"http://www.parkerguesthouse.com/","checkin":null,"checkout":null,"price":"$139–$249","geo":{"lat":37.7625,"lon":-122.4287,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25391,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"A good hotel too devoted to cash extraction The Mark Hopkins, at the top of Nob Hill in San Francisco, is a good hotel with spectacular views. They're even better at the Top of the Mark bar, though we didn't go there. We might have gone, but the champagne brunch was $59--that's right five nine--dollars per person. That price reflects an unseemly emphasis on cash extraction at the Mark Hopkins--$60 to use the club room, $51 to park (not that you need a car there--we didn't have one). Unlike many historic hotels, there's almost no free public space. They even have set out bottles of water in our room, marked $5.95, pretty tacky for a hotel where a cheap room costs over $200. It all leaves a bad taste and detracts from the experience. Our room was pleasant enough (though nether historic nor artistically designed, though there were some nice photos on the wall), with a great view out to the Golden Gate Bridge. Most central San Francisco locations have another building adjacent, but the Mark Hopkins doesn't, maximizing the view.The king bed was big and acceptably firm, darkness (and lighting) was adequate. W eclearly heard the cable car outside 15 floors below, but it wasn't too bothersome. The bathroom was modest size but well-equipped, though the tub didn't look too great for taking a bath.Somebody raised an issue about the hotel's having only 3 elevators and causing waits, but that wasn't a problem for us. The location is good for getting to North Beach, Chinatown, Russian Hill restaurants, and Union Square. Many of these locations are only a few blocks away, but people should be aware that they're down steep hills from the hotel. The flatter Union Square, with hotels like the Nikko, might be more convenient and plesant.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Emma Ankunding","date":"2013-07-15 17:17:21 +0300"},{"content":"Great hotel, great location!!! My 81 year old Mom visted. We are seasoned travelers. We loved The Mark Hopkins. Sort of older style hotel... but very classy, comfortable, clean etc. Rooms are great, beds are great. Staff is short handed when check check out is crowded, but they are very attentive. The best prices believe it or not are on their own website. Same price we got on Priceline. The $169 rooms are almost the same as the $189 rooms. The $169 room have a lower floor view. Both are great.If you go to The Top of The Mark Rest.... do it for drinks and the view. The food is very expensive. Breakfast while ok was too much money. Take the cable car down to Union Square or walk and go to smeoplace like Sears or The Diner.dcr, Middletown, Ca","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Adam Hilpert","date":"2013-10-24 11:22:13 +0300"},{"content":"Overpriced! We recently stayed at the Mark Hopkins for a much needed vacation. I travel to San Fran frequently for business and we decided to treat ourselves by staying at a 4 star hotel - unfortunately we were disappointed. For the same cost you can stay at the Fairmont across the street which looked like a much nicer place to stay.The Intercontinental was equivalent to a Hilton in my opinion but the food quality was worse. We paid extra to be on a club level floor and the room was nothing special, nor were the amenities. We dined at the hotel restaurant for dinner and the food quality was one star at best. The waiter noticed a $17 appetizer left uneaten and asked what the issue was as we were the 2nd guest to not eat it, we explained the issue and were still charged for it. So on Sunday we decided to try brunch at the Top of the Mark and it missed the mark, $128 for a nice view with very bland, unimaginative cuisine. You can do better for this level of cash outlay.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":1.0,"Rooms":3.0,"Location":-1.0},"author":"Miss Johnny Langworth","date":"2015-12-19 19:19:51 +0300"},{"content":"Light sleepers stay away! Nice fitness center, hotel staff relatively decent, but if you are a light sleeper would not reccomend this hotel!Walls are so paper thin, and I could hear the person next door.. snoring!Good exercise to be had walking up hills to hotel, and right on the California trolley line for those too fatigued, infirmed, or just plain lazy to walk up hills..","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":-1.0},"author":"Mittie Champlin DDS","date":"2014-08-20 14:03:23 +0300"},{"content":"Great Time at the Mark Hopkins My wife and I spent a 3 day weekend at the Mark Hopkins in October 2005. We were very pleased with the room, particularly its size. There is a nice closet and nice-size bathroom in addition to a king-bedded sleeping area with windows that open to the San Francisco air. The location is terrific with easy access to two cable car lines. Close to Union Square and Chinatown, but it's a pretty steep uphill return walk from both places. We did not eat at the hotel restaurant but had cocktails at the Top of the Mark on the Saturday night of fleet week where we could see the evening fireworks. We really enjoyed the Top of the Mark with its panoramic view of the city. We were especially pleased with the $120.00 rate we got.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Charley Erdman","date":"2012-03-14 22:34:22 +0300"},{"content":"Lovely Experience We stayed at this hotel for three days in mid-July, 2005. We are Platinum Priority members and I don't know if that made a difference, but our check in was very smooth. The room wasn't quite ready yet (we got there at 10:00 a.m.) but the front desk put a rush on getting it ready and we went down to Fisherman's Warf for a quick bite to eat. When we got back, everything was ready. We stayed on the 12th floor in a corner room with a specacular view of both the city and the bay. We did have one snafu in the the tub/shower knob came off with the water running full tilt. We called down and reported a plumbing emergency and within moments a technician was there and fixed the problem. He was very professional and polite. If you can swing it, I highly recommend joining Club Intercontinental. They put out quite a spread and Ulysses was a fabulous concierge. Ask him about the French restaurant he recommends. For $60 per room per day, I feel you definitely get your money's worth in food and beverages alone, to say nothing of the internet access, books, games, service, etc. Top of the Mark was a bit of a disappointment in that the city was completely fogged in the night we were there, so no view. Very high prices but the drinks were good. Bar tenders could be a bit more outgoing and friendly (we sat at the bar). We did have a great experience with the hotel staff - definitely did not see the rude behavior mentioned by others. To a person everyone was very attentive, polite, and professional (again, especially Ulysses at Club Intercontinental). Even the bartenders at the ToM were polite, just not overly friendly or enthusiastic. If you are in San Francisco on a weekend, absolutely try to find time to check out the Farmer's Market at the Ferry Building/Terminal. It's amazing! I wish to goodness we had something like that in Tampa!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":-1.0},"author":"Melany Hoeger","date":"2014-12-28 00:04:50 +0300"},{"content":"Very expensive for what you get Stayed there as a treat hoping for wonderful service and to be pampered.Got average service in an average room for A LOT of money.Have to admit that the bathroom was just absolutely fabulous but really, how much of your time is spent in there????","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":1.0,"Rooms":1.0,"Location":-1.0},"author":"Krystal Yost","date":"2014-02-23 03:47:20 +0300"}],"public_likes":["Ophelia Renner","Tabitha Harris","Mrs. Madonna Crona","Norberto Pacocha","Ms. Zola Rowe","Dr. Adelbert Marks","Thelma Gislason DVM","German Lind"],"vacancy":false,"description":"A gay owned and operated hotel in a very pretty old building.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}