{"title":"London/Hammersmith and Fulham","name":"Premier Inn","address":"3 Putney Bridge Approach, SW6 3JD","directions":"tube: Putney Bridge","phone":"+44 870 238 3302","tollfree":null,"email":null,"fax":null,"url":"http://www.premierinn.com/pti/hotelInformation.do?hotelId=23883","checkin":null,"checkout":null,"price":"From £90","geo":{"lat":51.4681,"lon":-0.211,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16177,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Won't hurry back! Beaches were gourgeous! Thought the rooms were nice! Entertainment tried hard but was basically lame! Four males went basically to relax and get some sun. The bus ride from the resort was long and methodical hitting every resort on the way until finally reaching our destination. This was the same returning to the airport after the stay. All of us were sick at different times during our week stay. We all couldn't pin-point exactly what we got sick on, but the common consensus was the food. Two believed it were eggs they ate! We enjoyed the pool bar alot. The resort itself looked like the nicest one in amongst the Riu area except perhaps the Palace resort. However the Palace resort looked as though it may have not been as much fun. In socializing throughout the resort we found that the majority of the people that were there at some point were laid up with illness. It's hard to enjoy yourself after becomming ill with concerns of bad food or perhaps the possibility of dirty glasses for liquer. What happens is you try to find reasons for your illness and it ends up ruining your fun. We are big beer drinkers and found the the beer that they were offering to be awful. Five star resort, please. I shook my head after every sip I took. I'm told the better beer in the Dominican is called Presidente but that was not what they were serving. Overall, after working all year and finding time to take a well deserved vacation this would not be high on my list of return destinations. Sorry, but don't want to hurry back to a place that that was not as good as it was advertised. The Tequila in the Mayan was a better choice. The beaches weren't as nice but the resort was better. Next year will be Florida. I'll risk the weather in order to eat and drink without being poisened!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Harvey Barrows","date":"2013-04-27 20:13:24 +0300"},{"content":"Watch out if you go to Punta Cana.............. I made a great mistake... arrived at the Riu Bambu 24 hours after the Tropical Storm / Hurricane Jeanne om September 18.All Riu hotels were inaccesibe unless stepping into a tractor with a cart due to flooding.........no TV, no tours...and the flooded water was contaminated with served waters.....very smelly...Many other Hotels were very damaged, some inoperative.The staff was excellent, really motivated although they also certainly must have personally been very affected by the storm. They cleaned up the beaches as well as possible in 48 hours, but the whole area is very damaged ( no ATM's, etc. )Food was good, no problems with water or drinks. They tried to set up a show every night, but it was so amateurish and bad that I went to sleep better.If you want a beautiful beach, there it is, but expect no great pluses, which is understandable, and who knows how long it will take to clean up the mess.Really sad damage to a beatiful part of the world. Many tours cancelled and left.I stuck till the end and enjoyed the sun and surroundings, but was unable to do anything else than staying at the hotel 7 days...Good luck, check the REAL status before you go, that is my recommendation.Hope this was helpful to some traveler.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Bryce Kling DDS","date":"2013-01-20 22:43:07 +0300"}],"public_likes":["Ms. Jessica Roberts","Chauncey Feeney DVM","Danielle Rempel","Wayne Labadie","Domenica Beatty V","Mckayla Goyette","Emmie O'Connell","Garfield Stehr III"],"vacancy":true,"description":"In the extreme south of the district close to the Thames","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}