{"title":"Avignon","name":"Auberge-Camping Bagatelle","address":"Île de la Barthelasse","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.campingbagatelle.com/","checkin":null,"checkout":null,"price":"€16.56 with complimentary breakfast","geo":{"lat":43.95310204393943,"lon":4.799374084977899,"accuracy":"ROOFTOP"},"type":"hotel","id":1357,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"I've been to Venice many times and this is by far the best hotel I have ever stayed in. As an American you are used to nicer hotels, but european hotels are....more like a bad Motel 6 experience to say the least. You put up with it because well.....You are IN VENICE! Or Paris or somewhere else spectacular. But, I was pleasantly surprised by our hotel. I must say that finding it was not easy, but wondering around in Venice is never a bad experience. The front desk staff were very nice and helpful. You will have to get an internet access code every 2 hours, but they had surprisingly good internet access. The rooms were very large compared to european standards and very clean. Our bathroom was also HUGE compared to european standards and we also had a large rain showerhead and a shower door! I was thrilled. Our room had french doors that opened onto a small cobble stone courtyard and a minifridge. They also had the biggest towels that I've ever seen in Italy. The location was wonderful. You just follow the signs to St. Mark's or Rialto and you can walk anywhere. We did get lost one night, but that was part of the fun of it. It is in a quite location but even in the back area's of Venice there are plenty of restaurants and shops right around the corner. I would definately stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Sophie Kuhlman","date":"2015-10-01 12:28:06 +0300"}],"public_likes":["Ismael Auer","Grady Leuschke","Joanny Gibson","Domenica Gleichner","Pierce Hirthe","Hailey VonRueden PhD","Kenneth O'Reilly"],"vacancy":false,"description":"This Hotel/ Hostel and Camp Site is situated on Ile de la Bathelasse in the centre of the Rhone . This is perhaps the best place to stay on a budget. It has great facilities and offers perhaps the best view of the center of Avignon. Carries a basic menu restaurant. Another benefit is that is placed directly between Avignon and the opposite town Villeneuve-les-Avignon, both begin within 10 minutes walk.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}