{"title":"London/South Kensington-Chelsea","name":"The Park Tower Knightsbridge Hotel","address":"101 Knightsbridge, SW1X 7RN","directions":"tube: Knightsbridge","phone":"+44 20 7235-8050","tollfree":null,"email":"theparktowerknightsbridge@reservestarwood.com","fax":"+44 20 7235-8231","url":"http://www.theparktowerknightsbridge.com/","checkin":null,"checkout":null,"price":"From £309 per night","geo":{"lat":51.5018,"lon":-0.1588,"accuracy":"ROOFTOP"},"type":"hotel","id":16461,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Hotel was lovely and friendly. No tipping and very courteous - conceirge service was exceptional and arranged our dinner reservations, looked after mailing our parcels, arranged great baseball tickets for us; took us to the L-train and showed us how to use it (we're not from Chicago). Hotel rooms were very spacious - we had 2 bedroom suite with balconies and 2.5 baths, & 2 living/sitting rooms. Great for 2 couples to share and still have together space/time, and private time/space. 2 issues: Maid came to our door every morning at 9am, and every morning we turned her away -- rather irritating on a holiday. And 1 balcony was dirty with old food during our entire stay - even after mentioning to maid. Expensive so these 2 irritants count against value. Otherwise, near perfection.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Bradford Mann","date":"2013-08-26 11:25:57 +0300"},{"content":"I stayed at the Elysian for 1 night at I was blown away by the quality and service of this hotel. I was upgraded (despite booking a special deal) and the room was amazing. The spa was a real highlight.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Bettye Metz","date":"2014-12-01 18:49:12 +0300"},{"content":"We took my inlaws for their 60th birthdays to Chicago for memorial day weekend. We booked the hotel based on feedback from trip advisor and you were all right it was amazing. We have stayed in hotels all around the world and this is one of the best nothing is too much trouble and all of the staff have to be commended. We stayed in a suite and the room was spacious and well equipped I particularly loved the giant tub which i spent many a happy hour in there. We had all never been to Chicago but will go back for nothing else but the Elysian. The hotel has a level of class that outshines the larger 5 star hotels but also tries to make you feel welcome and at home at all times. Go you will not be sorry.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Casandra Glover DVM","date":"2013-03-15 11:59:17 +0300"},{"content":"We stayed 3 nights in this beautiful hotel, and thoroughly enjoyed their top quality service from check-in to departure. We recommend this hotel to any international traveller who wishes to experience the highest quality stay in Chicago.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Florence Haag","date":"2012-07-24 04:50:19 +0300"},{"content":"We had a four night stay here in May 2011, and were very impressed by the quality of the room and the excellent service throughout the stay. Staff were helpful and polite, and the hotel is well placed for shopping. The bed was especially comfortable. RIA restaurant deaerves it's two Michelin stars.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Ettie Simonis","date":"2015-08-14 02:38:48 +0300"},{"content":"there is no words to describe how wonderful is the elysian , first time in chicago we feel in love with the city thanks to this hotel, we ve stay in executive suite big enough , with perfect fire burning, two lcd 47 inch , premium english king size bed with italian filli doro linens,absolut incredible mini wet bar, undercabinet refrigerator and freezer , first class!! micro oven, and a free gift french champagne with macarrons. bath with asprey toiletries separate tub and shower and of course all in white marble exquisite !!! perfect brekfast , all local and natural merchandise , cofee , milk, cheeses ,bread jam etc with no preservatives at all. and last the 2 house car to go around 5 miles , complementary !!! All is first class , no dubts one of the best hotels in the world","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Karson Blick","date":"2015-09-30 19:14:28 +0300"},{"content":"I, like many others who have reviewed before me, am a picky traveller. The Elysian produced an experience BEYOND compare. The facilities are incomparable. But the staff really makes The Elysian as amazing as it is. My experience was \"made\" because of their hard work. It's not easy to staff an entire hotel with *happy* employees who love what they do and are willing to go the extra mile to make each person's experience a perfect one. Kudos to you all! And, as far as the review goes-- you have to see it to believe it. All that you read is true-- TVs in the bathroom mirror, plunge tub, terraces, fireplaces. I had my first single diner experience at 2* RIA. The food, staff, everything was fantastic. Again, entirely congruous with the hotel's standards and philosophy.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jimmy Schmidt DDS","date":"2013-11-02 22:42:29 +0300"},{"content":"My husband and I stayed here for the very first time on our wedding weekend in July of 2010. Our stay was so luxurious and amazing that we will be back again and again to celebrate anything and everything we can make an excuse for (even though we live in the Chicago area). We were already back again in March to celebrate hubby's birthday, and received a special birthday treat from the pastry chef (I didn't even ask for it)! Small gestures such as these, full of kindness and attention to detail, will keep us coming back to the Elysian for years to come.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Noemi Marquardt","date":"2014-11-10 06:56:25 +0300"}],"public_likes":["Dr. Lavonne Mante","Chase Jakubowski","Shanny Runte"],"vacancy":false,"description":"Five star luxury hotel in a Modernist tower across the road from Harvey Nichols, with views over Knightsbridge and Hyde Park.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}