{"title":"Rouen","name":"Ermitage Bouquet Hotel - Rouen, France","address":"58 rue Bouquet, 76000 Rouen,","directions":null,"phone":"+33 2 32 12 30 40","tollfree":null,"email":null,"fax":null,"url":"http://www.hotel-ermitagebouquet.com/default.aspx?lang=En","checkin":"12am","checkout":"10am","price":"95€-160€","geo":{"lat":49.4501,"lon":1.0892,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":24536,"country":"France","city":"Rouen","state":"Haute-Normandie","reviews":[{"content":"While I'm finally getting around to writing this review, I really enjoyed our stay at Harrah's. We got an upgraded suite when we checked in via the airport and were impressed with how big our room was! Additionally, we got room service one night and it was pretty good - I was constantly surprised with the level of service. I love how Harrah's is connected to the Paris too - where my parents stayed - so it was nice being able to easily walk over to their room and meet up with them, etc.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Reuben Macejkovic Jr.","date":"2014-09-12 17:23:41 +0300"},{"content":"My husband and I stayed and Harrahs Las Vegas for 4 nts for a convention. We stayed in the new updated Mardi Gra tower. The rooms were nice. The bed was very comfortable. I slept like a baby. Usually in a hotel I am up all night uncomfortable... not here. Although if asked again I might not choose a room on a low floor overlooking the pool like we had... It was a little loud when the band was playing. Also, having such a low floor(4th) made me feel as if we were at the pool when I looked out. But we were on the floor with the SPA. I had a massage, facial and a manicure. It was a great experience. I have been to many spas. The technicians for my services were top notch. Unfortunately the relaxation area with the HOT tub could have been updated.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Leif Cummerata","date":"2013-01-24 20:43:08 +0300"},{"content":"We stayed at Harrahs from 8/17 to 8/22. We had purchased roundtrip shuttle services so they dropped us off at Harrahs about 10:30am. We waited about 5 minutes in the check-in line; however, our room was not ready. Was told guests ocuppying had not checked out. So we left our luggage with luggage services and check out the areas. At about 1:30pm, we checked back in to see if our room was ready - it wasn't. They had another room in the Carnival Tower that was 2 queen beds that were available so we took it since we wanted to check-in and put our stuff away; besides, the King bed wasn't important (this is what we had reserved). Ours was a non-smoking room on the 7th floor. I thought the room was decent given the price we paid. Everything worked - we had no problem with it. We spent most of our time out and about so the only time we were in the room was to sleep. As most say - you get what you pay for. There was some noise (like a woodpecker pecking) but when we called the front desk we were told that it was due to construction and that we shouldn't hear it during bedtime. True to their words. Our room was a reasonale walk to the casino floor. We thought the location was a good place on the strip. We checked out all of the hotels on the strip during our stay. Looking back, I didn't think the Harrahs was smokier (meaning a lot of smoke floating around) than most. I think what it was is that it has a heavy smoke smell due to poor ventilation, perhaps? Outside of that it is the same as most other hotels. We thought their buffet was OK - we had coupons so that helped with cost. We at their Cafe' restaurtant and I thought for the price we had paid for 2 breakfast entrees - we would've found more value at the buffet but couldn't go there because it was after breakfast hours and we wanted breakfast. We also ate at Ming's Table - didn't like it so much. They have express check-out service via using menu on the TV. Based on others' reviews of the long lines, we took advantage of this feature and used the Express check-out. We didn't use any services while we stayed there nor touch the bar fridge so our account was '0' which made the Express check-out much easier. We then left our luggage with luggage services and $@!#% 2 hours inside the casino until our shuttle pick-up services arrived. For the most part, we were comfortable with our stay at Harrahs.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Thomas Wolff","date":"2015-09-08 16:59:39 +0300"},{"content":"Stayed at Harrah's for the first time during a recent trip where I divided the time between Mirage and Harrah's. I have always wanted to stay there. (Never go to a lesser hotel directly after an awesome one FYI...lol) I was staying on a comp but still had to come up with 100.00 per night for \"incidentals\" which I think is ridiculous on a comp but whatever...it just made things get started wrong... The walk to the room was quick and easy. We were in the Mardi Gras tower. I like the Harrah's breakfast buffet and did like the fact that my players card was also a line pass so we did not have a long wait. But with that being said..we already knew we liked it . Might not have chosen it if I was judging it by the front desk folks. The room was small and worn and cramped feeling. It was clean enough but just seemed a little dank or something. It was supposed to be an upgraded room but I really don't know. It seemed a little dumpy to be the upgraded version? I know , I know, you hardly see your room...but I want a place to put my stuff! No closet just a Chiffarobe. Most storage space was taken up by the refrigerators of over priced goodies. Had to lay my phone on the floor by the outlet to charge! The casino folks were friendly. The casino itsef was a little and a bit widy curvey and tight old but I enjoyed it. The walk to access tbe strip was simple except for when you were going thru all the vendors. The Valet parking was a little slow and getting into the valet parking from the strip is a Full On Nightmare... Like I said the place is okay but I won't go back and stay there. I will find another Harrah's property. I actually like IP much better as far as the room is concerned.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Location":5.0,"Rooms":1.0},"author":"Durward Purdy","date":"2015-05-24 00:54:33 +0300"},{"content":"We are in our mid 50's and have stayed at Harrahs twice before. We always enjoy the friendly staff and casino also the short distance from your rooom to the strip. I had a comped room this time and did not ask for an upgrade or view. We were on the 6th floor of the Mardi Gras Tower. Very quiet and a short distance from the elevator. Beds had good linen and were very comfortable. I spent one day at the pool. Quiet and relaxing, no loud music that day anyway. An older crowd. A few young people but no kids. I ordered lunch there..food was good and reasonably priced. Drink service was good also. There were cabanas but none were in use that day. Drink service was good in the casino anytime of the day or night. Overall a good midpriced hotel right in the centre of the strip.","ratings":{"Overall":4.0},"author":"Akeem Stroman","date":"2013-05-14 13:00:59 +0300"},{"content":"We had the best time ever , great deal and room was very nice good size and away from noise .Great selection of economical food and stores One minor complaint staff at other harrah's have been much more attentive but for price don't mind if they don't look up when they talk to you . Will definitely be back !!!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ezra Stoltenberg","date":"2015-12-03 12:33:33 +0300"},{"content":"They say the first person you meet sets the tone for the remainder of your stay and I never knew how true that is. I recently checked in at Harrah's while on a get-away trip with friends. When I got to the desk the girl was the most rude person I've experienced in a long while. McDonald's drive-thru staff have better customer service skills. I looked at the other checking in guests and they all seemed to be equally as miserable but the one I had won the prize. Since she couldn't handle the check in, 'Alame' didn't get anything right with the rooms. During the process with her perceived problems she went to a supervisor for assistance who seemed to just as unhappy with his job as she was. So, the check-in was terrible, the rooms were not right, and the rudeness of this person set the tone for the rest of my stay.","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":3.0},"author":"Madge West IV","date":"2014-05-10 22:57:21 +0300"}],"public_likes":[],"vacancy":false,"description":"Offers 10 rooms and 3 suites (some with fireplace), furnished in Charles X style with modern facilities (hydro shower or whirlpool bath, Wifi, air conditioning, electric shutters, etc...). The staff are very helpful.","alias":"3 star hotel","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}