{"title":"Achiltibuie","name":"Castlehill","address":"Polbain","directions":null,"phone":"+44 1854 622228","tollfree":null,"email":null,"fax":null,"url":"http://www.achiltibuie.net/castlehill","checkin":null,"checkout":null,"price":"from £300","geo":{"lat":58.0359,"lon":-5.3959,"accuracy":"APPROXIMATE"},"type":"hotel","id":65,"country":"United Kingdom","city":"Achiltibuie","state":null,"reviews":[{"content":"We were recently in Seattle for two days and stayed at the Hotel Monaco. We had a basic room with a kingsize bed, and felt the room was sizeable. Loved the crazy print robes! They were a nice touch. Did not adopt a goldfish for our stay, but had a chance to visit with some in the hallway and lobby. Another nice, quirky touch that makes you remember this place. The bedding was some of the most comfortable that we have had. We also enjoyed the wine hour in the lobby, where we got a chance to meet some other people and share travel stories. Aside from a lackluster breakfast at Sazerac where our waiter was one of the worst we have ever had, we would highly recommend this place to travellers.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":4.0,"Rooms":5.0},"author":"Joseph Hackett PhD","date":"2013-02-22 08:11:09 +0300"},{"content":"I arrived after nightfall and was greeted by a spectacular view of the Space Needle. Parking was easy. People friendly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Alexis Schiller","date":"2014-09-09 03:23:36 +0300"},{"content":"The Warwick is in an older building but the rooms and public areas are up to snuff. Flat screen TV, good internet (albeit at a charge), a dorm fridge, small bathroom but nicely appointed with good soaps and big towels, nice lounge. Public areas are small, but that is what you get with older structures. Easy to walk to a lot of places. Valet parking is $30/day, but I didn't need a car. This is no more than other downtown hotels where the rooms are much more expensive. Staff was courteous and friendly. I would definitely stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kristoffer Mraz","date":"2015-07-27 21:52:52 +0300"},{"content":"Love the Warwick! Two old friends joined me in Seattle to celebrate the New Year and we chose the Warwick. We were absolutely delighted! The staff is exemplary...Brian, Robert and, yes, even Bill, were so helpful and so very, very patient with a very tired and picky Alaskan guest.This hotel is located three blocks from Macy's; five blocks from Nordstroms...what more could we want? Oh yeah, and right across the street is Ralph's so if you need a latte in the morning or a bottle of wine in the evening you've got it! Perfect. I want to thank the whole Warwick staff for making the start of 2012 so good! I hope to see you again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Harmon Murray","date":"2015-12-31 23:09:42 +0300"}],"public_likes":["Maude Macejkovic","Edwin Thompson Jr.","Erick Ryan","Mr. Jaclyn Kassulke","Corene Hickle","Dorothea Walker","Eleonore Romaguera"],"vacancy":false,"description":"Tastefully modernised croft house with panoramic views over the Summer Isles to the Torridon hills.","alias":"self catering sleeps 6","pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}