{"title":"Castle Donington","name":"The Priest House Hotel","address":"Kings Mills","directions":null,"phone":"+44 845 072 7502","tollfree":null,"email":null,"fax":null,"url":"http://www.handpickedhotels.co.uk/hotels/priest-house/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.842983,"lon":-1.38128,"accuracy":"ROOFTOP"},"type":"hotel","id":41227,"country":"United Kingdom","city":"Kings Mills","state":null,"reviews":[{"content":"I arrived at the shuttle pick up and sat there for 20 minutes, called and they said they had never been called, that someone would be there in 15 minutes, 30 minutes later the bus drives by and never stops, I call the front desk for the 3rd time and they are non responsive, 1 1/2 hours later they picked us up, no apologies, nothing. The rooms are noisy and they place is run by people that do not care!! Don't stay here!","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Location":1.0,"Rooms":2.0},"author":"Vern Blanda DVM","date":"2015-11-03 12:47:01 +0300"},{"content":"My family and I are traveling from el paso and needed a place to stay for the night. Called several places and either didn't accept pets or had a big non refundable pet depost, so this place accepted pets for 10 bucks! What sold me was the rate with amentites that include buffet breakfast, inside pool and close to the freeway! By the way, my son and I has the pool all to ourselves!! Loved it, would absolutely stay again! Beds are very comfy! Great experience!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Arlo Weimann DVM","date":"2013-06-14 10:54:44 +0300"},{"content":"When my husband and I started to plan our wedding we started out with limited time and money. The staff at the Baymont made me feel like family from my initial call until I checked out of the hotel. We made the decision to have the wedding reception at the Baymont with no knowledge of the accolades and recommendations that come with the Baymont Inn and Suites. The customer service from the staff is superb. My family booked at least 10 rooms and I have heard nothing but praise and planes for return visits from those who stayed. Whether you are staying for business or pleasure you will enjoy your stay and the staff.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Camden Schaefer","date":"2014-11-11 06:39:38 +0300"},{"content":"We found this hotel on Trip Advisor. It was a great value. The hotel staff was especially friendly and recommended the adorably Texan Papas BBQ down the street. Great stay!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Erik Homenick","date":"2012-05-22 09:28:37 +0300"},{"content":"Sis and I came to Dallas for a quick weekend shopping trip to Dallas....We choose the Baymont Inn & Suites Dallas/Love Field for it's location....it was on the North side of Dallas and fairly close to several places we intended to shop.....From the moment we walked in the lobby, we were treated like valued guests.....Our room was so nice.....it was clean, it was comfy....and those beds....boy did they ever feel good after a long day of shopping....The front desk staff went out of their way to be friendly and helpful, even printing off maps for us and making some very excellent restaurant recommendations ( Pappacito's for great Mexican, and Texas Land & Cattle for steak).....I can honestly say these folks treat you like family and I'll only stay here when I return to Dallas for future shopping trips!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jocelyn Eichmann","date":"2012-06-15 23:19:24 +0300"},{"content":"The hotel is very run down and it's like they have air fresheners running through the AC vents... Makes us think that they're trying to cover up something?? The smell is too overwhelming!! It's as though they're updating because there are beautiful furnitures & fixtures, but tur walls, door frames, doors & carpet are in terrible shape so it almost seems like a waste? The walls are the thinnest that I have ever experienced... We heard every movement and voice in the hallway as well as every step taken in the room above us. The desk clerk was incredibly nice and accommodating. He went out of his way to make sure we were set up well.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Norma Connelly","date":"2013-12-25 12:53:32 +0300"}],"public_likes":["Fidel Jakubowski"],"vacancy":false,"description":"Country house, scenic location by the river Trent","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}