{"title":"San Francisco/Chinatown-North Beach","name":"The Green Tortoise Hostel","address":"494 Broadway St","directions":"at Columbus Ave","phone":"+1 415 834-1000","tollfree":"+1-800-867-8647","email":"hostel@greentortoise.com","fax":"+1 415 956-4900","url":"http://www.greentortoise.com/san-francisco-hostel/","checkin":"2PM","checkout":"11AM","price":"dorms from $25, private from $59","geo":{"lat":37.7983,"lon":-122.4053,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25503,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The Chancellor is an amazing, lovely botique hotel with smallish(who cares..part of the charm,Perfect for couples) rooms that are clean and the bed and pillows are so comfy..just what you need after a big day sightseeing in SF. Many thanks to Wes Tyler and his staff. Special mention to Matt on front desk for his help with the internet station. Great location with so much to see and do right on your doorstep. We will be back and YES we would choose the Chancellor again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ayana Swaniawski","date":"2013-01-06 00:58:13 +0300"},{"content":"Four day stay at Chancellor was wonderful. We love small boutique hotels and this one really fits the bill. Very well maintained, clean, with friendly, helpful staff in the best location. Convenient to cable cars, busses, etc. We used the valet parking and were glad we did. Allow 20-30 minutes for car delivery. Good coffee and cookies and fruit all day in the lobby. Our room was on 12th floor back corner so there wasn't much of a view but we weren't there for the view. A front room would have a great view toward Union Square but might be noisier. Our room was completely quiet. Small, cozy rooms with tiny bath but very well cared for and clean. We would certainly choose this hotel again. We skipped the touristy Sears Fine Foods but it is right next door for those who want to wait in line for breakfast. The hotel breakfast was very good and we took advantage of an offer to purchase a $20.00 coupon for food or drinks for just $10.00. With that, a nice breakfast for two cost only $10.00 plus appropriate tip. Highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Luisa Collins Jr.","date":"2014-06-29 06:41:35 +0300"},{"content":"We stayed here at the end of May and found it a great place for exploring San Fran. It's right on the tram line that goes down to the bay and it's close to restaurants and bars in the union square area. The rooms were smallish but clean and had everything we needed. Loved the pillow menu and the infamous bath duck!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Newton Gulgowski","date":"2013-10-20 01:10:34 +0300"},{"content":"I picked this hotel by other reviews. I was a little worried but no need to be. We have stayed in alot of high end hotels & the Chancellor is a very nice boutique hotel. The room is small but it has all you need. The bed is so comfortable & they have great pillows. I always have a problem with hotel pillows as they seem to never be soft & comfortable but theirs are. The real bonus is the ceiling fan. We have a ceiling fan at home & always miss it when traveling. This is one of the only hotels we've stayed in with one. The location is great - a couple blocks from all the shopping at Union Square. It is right on the cable car line to get to Fisherman's Wharf. Also, Starbucks is right across the street. The Chancellor is a very good deal for the price. Staff is very courteous & helpful. We will definitely stay here when we return to SF.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jailyn Waelchi","date":"2012-02-07 19:21:36 +0300"},{"content":"This was my second time staying at the Chancellor Hotel. I was just as happy with my time here on this trip as I was before. Since this was a longer stay, I had a chance to take advantage of the hotel bar and restaurant. I had breakfast at Luque's twice and the service was prompt and the prices reasonable. It's nice to not have to look for a place to eat before heading out for the day. It's also nice to be able to hit Happy Hour at your own hotel before heading to a show. While it's not a large hotel, it gives you more of that feeling of going back to your own apartment at the end of the day than that sterile feeling you sometimes get from a larger property. It's not unusual for me to get tired of a hotel after a few days, but that did not happen at the Chancellor. It's in a perfect location when you are using public transportation to get around. Same as last time, all the employees I came in contact with were friendly and helpful. I asked for a refrigerator this time and it was very handy to have. It was brought up to the room as soon as I checked in and I didn't have to wait around. Everything in the room worked and my room location on the side of the building was very quiet. The bed was comfortable and I had no problem falling right to sleep. Again, I would not hesitate to recommend this hotel to someone looking for a hotel with a great location, good price and great service.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Amy Schaefer","date":"2014-08-27 22:41:45 +0300"},{"content":"Chancellor Hotel on Union Square in SF is located just a block away from the Union square and 10-15 min walk from Chinatown. The hotel is located in an old building, but all the facilities are in good working condition. The lobby is smallish but cozy. Service was excellent. The rooms are quite small for the price, and there is no coffee machine.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Maybell Krajcik","date":"2015-12-04 21:57:52 +0300"},{"content":"After reading other reviews (and responses!) here we weren't sure what to expect, especially after arriving and dropping off our bags with a less than friendly receptionist. However, when we did get to our room we were pleasantly suprised. It was nicely furnished and a good size. It was quite warm, but we knew there was no A/C - it is a nice old building. We opened the windows, obviously it was fairly noisy being right in the city centre but it didn't keep us awake. Breakfast at the restaurant downstairs was very good. Although the staff didn't volunteer any information when we approached them subsequently they were helpful. The location is great - short walk to China Town and North Beach, right on Union Square with a tram stopping outside so you can get around everywhere really easily. You can buy a MUNI transport pass in the reception - its good value and the staff at the kiosk were brilliant. This is a great place to stay if you're visiting San Fran for the first time and want to be able to get around easily. The only realy downside is that its quite expensive for what it is.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Enos Hegmann","date":"2014-10-02 10:57:48 +0300"},{"content":"I stayed at the Chancellor Hotel for five nights and I must say it was one of the most enjoyable hotel stays I ever had. When I checked in, I asked for a room on the higher floors but none was available as the hotel was fully booked. I was given a room on the 5th floor facing Powell Street and was told by the front desk staff that she would move me to a higher floor once a room was available. Two nights later, I moved to a room at the back of the hotel on the 12th floor, where it was a lot quieter than on the 5th floor. Kudos to the front desk staff who not only arranged for me a room on a higher floor but also had my luggage moved while I was out attending a conference that day. Although the room was a little small, I found it was cozy and clean. The bed was large and comfortable and I slept well. There was no air-conditioning in the room and no need for it since it was cool enough when the windows were opened. Complimentary wireless internet worked without any problems. Hotel location is great: The hotel is next to Sears Fine Foods where I had breakfast; it is within walking distance to all the retail shops and department stores; less than three minutes walk to the cable car stop where I took the cable car to Fisherman’s Wharf; less than five minutes walk to Market Street where I took the F Line to the Ferry Building and Embarcadero; ... and less than one minute to free coffee and cookies down in the lobby. I will definitely stay here again the next time I am in San Francisco.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Tyson Kunze","date":"2012-02-07 06:53:41 +0300"}],"public_likes":["Anika Heaney"],"vacancy":true,"description":"A favorite of backpackers world-wide, price includes free internet and wi-fi, free breakfast every morning and dinner 3 nights a week, a 24-hour sauna, pool table, common room, free beer at the Beer Olympics on Tuesday nights and free live music on Sundays. An ideal location, right between Chinatown and North Beach and a short walk from downtown.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}