{"title":"Chamonix","name":"Hotel Du Clocher","address":"110 impasse de l'Androsace","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hotelclocher.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":45.92479,"lon":6.86836,"accuracy":"APPROXIMATE"},"type":"hotel","id":5333,"country":"France","city":"Chamonix-Mont-Blanc","state":"Rhône-Alpes","reviews":[{"content":"I have to admit I was not super impressed with Encore. I arrived at hotel registration and there was a ridiculous line, I found it a little frustrating being that I had just gotten off a long plane trip and did not want to deals with lines. I got to my room only to find it smelled like smoke and I asked for a non smoking room, when I called down to the lobby the person apologized but did not offer another room. I then had to call back and demand to be moved. The rooms were average size and nice the only problem was the noise from the night club could be heard until 3pm in the morning even though we were on the 53rd floor! The hotel is large and nice but nothing really stood out to me as being special or different or over the top making it unique compared to other hotels in Vegas. The one thing I was happy about was the Spa. I had both a facial and a massage and enjoyed both. the amenities of the spa were nice as well and I enjoyed the gym.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":4.0},"author":"Bailee Tromp","date":"2015-01-22 12:51:51 +0300"},{"content":"So this was my 7th or 8th trip to Vegas and this time I chose Encore as the rate was affordable when booked with flight package. Read a lot of reviews first and club noise and value were the two that concerned me. So first the pros. Steve Wynn has surely built one of the most glamorous hotel resorts anywhere. Just high end luxury abounds around every corner. Like most of the new mega hotel/resorts, this place is a sprawling Utopia with lavish decor, basically a mega mall with hotel, swimming, night clubs, fancy restaurants, and casinos. Encore (and Wynn) is basically a high end very upscale resort fit for the well off One percenters if you will. Its a white collar wonderland but if you happen to be blue collar, you better plan ahead because there are better value options. The staff was absolutely gracious, accomodating. I was concerned about the staff based on other reviews but quite honestly, they could not have been better, however when the safe wouldnt open it took 1 hour for security to help and that is just unacceptable. Upon arrival, I requested a high floor away from the strip as sleep is important to me/us. The request resulted in a $20 per night \"upgrade\" to a 61st floor panoramic view of north and west Vegas which was decent. Unless there is an ocean, the view matters little to me. How long you gonna stand there and look? The rooms are very very nice, huge bathroom. The bed was absolutely without a doubt the most comfortable I have ever slept in. The bathroom was not sufficiently clean when we went in, as I was looking to substantiate reports of mediocre housekeeping. In particular, they sink counter had splash residue from previous guests that a simple wipe down could have taken care of. Not enough for a complaint to the staff though. The bell boy who brought our bags up took time to explain the technology in the room which was quite helpful and garnered him a worthy tip. Housekeeping the remainder of the trip was timely and there were no issues. DO NOT tough the in room bar or snacks, unless your rich. You can get water and snacks downstairs at the shop by the elevators at still high but more affordable prices. This is NOT a place to take your children, and I would suggest this is an adult resort. So the rooms are nice, the staff was great as expected for a five star. The cons: Value. Be it a bottle of beer, water, coffee, a snack or meal, you are going to pay a premium. For a blue collar guy, this will hurt, but it is common on the strip to pay $7.00 for a bottle of beer. Double that for the clubs you pay to get into. Same for food. Its $50 foir the lunch/breakfast buffets, and over $80 for dinner that is basically that same with slight variation. THere are better values on the strip and the food was medicre for a pricey buffet. The SOciety Restaurant we had breakfast and still pricey for the quality. Service is good, but value no so much. Gaming. I am an avid blackjack player. I did not play one hand at Encore or Wynn and I probably never will. I searched for a mid limit table where dealer stands on soft 17s. Found one at $50 and one at $100. The rest were all dealer hits on soft 17s and that is a big house advantage. So I gambled at more player friendly places. Sad how some expensive Casinos are totally taking advantage of the small bettors. Should be the same for all. So Encore to me is all about the luxury resort itself, something to see, but for value and gaming there are better value options. I will never stay again because I refuse to pay high end prices for mediocre food and I refuse to play a game where house edge is double vs other places. THe one other negative which might be positive for some is location. Its far north end of strip so plan on walking or paying a lot of cab fares to see the rest of the strip. If you are wealthy this place was made for you and thats probably what Mr Wynn intended anyways when he spend 4 billion $ to create it so more power to him and those that can afford it.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":3.0},"author":"Elmo Gottlieb","date":"2013-05-23 08:36:24 +0300"},{"content":"This is a beautiful hotel with alot of high end amenities. My husband and I had a 10 night stay in Las Vegas. We stayed in 3 different hotels during our stay. First 2 nights we stayed at the MGM Grand (have stayed here over 5 times). Next 3 nights were at the New York New York Hotel (have stayed here over 5 times). Our last 5 nights were at the Encore (have stayed here 3 times). The encore has far nicer rooms than the MGM and New York New York. The Encore is at the complete opposite end of the strip from the first two hotels. We enjoy changing hotels and getting a different vibe from the different hotels. MGM has fairly large rooms but the views are always terrible. The casino is HUGE. The foodcourt is lively and very busy. There is a nice stroll to shopping facilities as well as many restaurants. When we checked out all we had to do was walk across the bridge to get to New York New York. New York has a younger crowd vibe (we are in our early 50's). The rooms are a little smaller than MGM however compared with other hotels in the U.S.A they would be classified as high end. We have always had good views from our stays at New York. Given a choice I would stay at the New York hotel over the MGM hotel. Casino is smaller and during our Friday Saturday night stay very lively. There is a dual ling piano bar that is very popular and fun. There is also a Irish Pub that is a great place to get a Guinness. Food is reasonably priced at the food court and very good. The deli sandwiches, fish and chips and deserts were particular favorites. We planned our trip that we would not walk any farther than halfway down the strip (we used the Flamingo as our stopping point. When we checked out of New York New York we decided to walk to the Encore (we have made this walk many times on previous holidays so we did know how long it was). Our intention originally was to take a cab but we were energized that day and had no problem pulling our 1 suitcase and carrying our 1 back pack. If you do decide to do this there are many places to stop and sit for a minute if your feet get tired. The vibe at the Encore is immediately so different from the first two hotels. Much more staff attends to you and they really do make checking in and checking out a delight. Much more efficient than the first two hotels. The grandeur of the encore immediately takes you aback. Beautiful, beautiful red decor. Rooms have floor to ceiling windows so views are great. We were on the 28th floor and were offered a upgrade to a higher floor for 20.00 more. We declined the offer and we were very satisfied with the view that came with our room. We ate at the Wynn buffet twice during our stay and upgraded the meal to 10.00 each for all you can drink champagne (there are some other drinks available at that price but we chose the champagne). Someone in another review stated that some of the food was not fresh. I would have to disagree with that statement. Everything was great and all was fresh. We intended to try some of the other restaurants at the Encore but it did not work out for us with the shows we were going to see. In this order my favorites are Encore - Classy New York - Fun MGM - Has everything I would stay at any of these properties again. Have fun in Vegas!!!!!!!!!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kale Weissnat DDS","date":"2012-11-17 03:04:23 +0300"},{"content":"We've been to Vegas several times and stayed at several places including Belagio. Encore was by far the best so far. The only problem was that the light system would go on everynight at around midnight and wake us up. There was no alarm on or anything and we never figured out why. Other than that, the spa was amazing and had the softest sheets I've ever felt. We had to go purchase them for our home. Also, the smoke smell throughout the casinos is always terrible, but not as bad for some reason at Encore as it was in Belagio or some of the others. We went golfing at the Wynn course and had Ray Romano tee off right before us and David Spade was about an hour behind us. We saw Garth Brooks who put on a great show. We also saw Le Reve by Cirque du soleil which was nice. Overall, best Vegas hotel so far!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Hipolito Runolfsson Sr.","date":"2014-08-10 09:45:22 +0300"},{"content":"We stayed for our anniversary in october. Everywhere you walked in the casino smelled so good, not at all heavy with smoke. Our room was beautiful!!! Bed was so comfy, loved the bathroom! Had a terrific view from the bed! Love the remote drapes!!! We could not eat there as the food was so expensive. Would definately stay again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mose Rosenbaum","date":"2012-07-14 18:23:02 +0300"},{"content":"Encore is a property that is Quintessentially Vegas! The only word to describe the experience is \"Grand\"! It is decadent from the minute you walk in, highly ornate and spectacular decor throughout the hotel, gaming areas and plush rooms that will make one feel like royalty. The service they provide is to die for, the attention to detail is intricate, and all the restaurants that I tried were spot-on. Encore is bustling with the best night clubs (XS was my favorite!) and high-end shopping. Particularly loved the connectivity to Wynn Hotel which has more gaming,dining and night clubs. The location on the strip is also great, accessible and close to the mall for those who need a break from the casinos. Absolutely loved every minute at the Encore and would hope to be back someday soon!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Elody Bernier MD","date":"2013-06-09 23:08:13 +0300"}],"public_likes":["Joan Trantow","Norene Glover DVM","Abigale Sipes","Rickey Schuster","Alberto Pfannerstill PhD","Viola Nader","Wilber Toy Jr.","Laury Marquardt"],"vacancy":true,"description":"Two star hotel in central Chamonix.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}