{"title":"San Francisco/Nob Hill-Russian Hill","name":"White Swan Inn","address":"845 Bush Street","directions":"between Taylor and Mason","phone":"+1 415 775-1755","tollfree":null,"email":null,"fax":"+1 415 775-5717","url":"http://www.jdvhotels.com/white_swan_inn","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7896,"lon":-122.4112,"accuracy":"APPROXIMATE"},"type":"hotel","id":25969,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The reasons of me rating Le Westin Montreal as three are the following: - Weird structure/architecture, you need to take an escalator, walk for a few minutes until you get to the lift that takes you to your floor - The pool is very small for a hotel like Le Westin, I am sure they could've done better with the space they have. - When one's on a business trip and spending hours in meetings / workshops, it is important to be in a \"relaxing\" atmosphere when you come back to the hotel lounge, bar, etc. The foyer is always very busy, the bar is almost full every evening, very noisy, and doesn't have an ambiance. - It's like a convention centre, always very busy Positive points: -Good rooms, spacious, although with empty mini bars - Front-desk, bar and restaurant staff are very friendly and provide great service - It's only 5-10 minutes walking away from the Old Town that has good restaurants, souvenir shops, etc I am rating Le Westin comparing it to other hotels in the same class and I think my rating is fair.","ratings":{"Overall":3.0,"Value":3.0,"Service":5.0},"author":"Miss Dorris Carroll","date":"2014-05-13 17:05:22 +0300"},{"content":"Our room wasn't overly impressive, but the service was fast & friendly and the location was good. We almost booked a hotel in the heart of Old Montreal, and we're really glad we didn't! We took a stroll through Old Montreal on Sunday afternoon, and it felt really dead - many of the shops and restaurants were actually closed. I was really surprised, because I had been there in the summer before and it was incredibly vibrant and bustling. It has an outdoor skating rink, so I thought Old Montreal would be just as busy as the summer. Or that shops would be open at the very least! Back to the hotel - the pool with the glass bottom was fun, but it was jam-packed with kids every time we went. The pool had an attendant, which was nice, but the attendants never asked the kids (or parents) to refrain from doing cannonballs into the pool, which got to be rather annoying for those getting splashed in the adjacent hot tub! I know that makes me sound old and curmudgeonly, but running around a pool doing haphazard cannonballs seems potentially dangerous, not just disruptive. The gym was great - clean and well-equipped. The room service was prompt and excellent. The morning breakfast buffet at The Gazette, on the other hand, was over-crowded and over-priced. We had to wait about 15 minutes to get a seat at the bar (not even a table!) and apparently we were lucky - the line to get in snaked all the way out the door when we left. At $22 a person, we would have been better off ordering off the menu. The buffet was ok, but I think $12 would have been a more reasonable price considering the selection. Loved the free wi-fi and in-room coffee. One minor housekeeping gripe: I opened the sealed shower cap and found it had already been used, and was full of soap! That was gross. Overall, though, I'd stay there again. It was comfortable and friendly.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Gennaro Blick","date":"2013-05-27 23:59:19 +0300"},{"content":"Le Westin is in a great location in Old Montreal. The rooms are nicely decorated and the beds are very comfortable. Staff was friendly and helpful allowing us to check in 3 hours earlier than the normal check in time. The service and food at the restaurant La Gazzette was fresh, tasty and the service was attentive and friendly. We will stay there again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Bridget Rodriguez","date":"2015-03-03 00:14:37 +0300"},{"content":"We stayed here for 3 nights at the end of November, upon arrival we were greeted and check in swiftly. The room was lovely - on the 15th Floor very modern and comfortable. Free wifi was included in the rate, which was a great benefit. The location was fantastic near the old town and within walking distance of all the attractions of Montreal. I would recommend taking a trip to Quebec, we took the train from the central station which took 3 hours 20 mins each way, but was so well worth it, for a fantastic day out. I would highly recommend the hotel and its location, and will return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Zoe Weissnat","date":"2013-05-08 10:49:48 +0300"}],"public_likes":[],"vacancy":true,"description":"A lovely small hotel with a fireplace in all 26 guestrooms. Dark wood paneling, floral carpets, comfy furniture, and English art and collectibles set the tone. Evening turndown service, breakfast buffet, and evening wine and hors d'oeuvres served fireside.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}