{"title":"Liverpool","name":"Hotel Indigo","address":"10 Chapel St","directions":null,"phone":"+44 151 559-0111","tollfree":null,"email":"info@hotelindigoliverpool.com","fax":null,"url":"http://www.hotelindigoliverpool.co.uk/","checkin":null,"checkout":null,"price":"From £79.00","geo":{"lat":53.408,"lon":-2.99366,"accuracy":"ROOFTOP"},"type":"hotel","id":15918,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"We stayed at the Intercontinental for a one day post cruise stay. All that I can say is that the hotel is amazing. The pool area is great with a large adjacent beach area. We were able to drop off our luggage and pick up towels to hang around the pool until our room was ready. We booked a city view room, but upgraded to an oceanview room. It was well worth the upgrade as we were on the 16th floor. The view was AMAZING! The room itself was fine, I would just say that it needs more up to date bedspread's. Other than that everything was great. There is also a Japanese Steakhouse as well as a Ruth Chris' Steakhouse in the hotel. We will be returning with our entire family next year. The value that we paid can not be beat.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Jazmin Kassulke","date":"2014-06-29 22:41:49 +0300"},{"content":"A very beautiful hotel.. the rooms were very clean and the staff was so nice and helpful. The resturants in the hotel are delicious yet a little pricey. The beach is very clean, i had the best time taking in the sun and swimming in the ocean. I would recommend this hotel to anyone and would love to go back! The only bad thing i can say about my whole experience is be specfic when ordering room service, they tend to mix up orders. So all in all its one of the bet!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Jarrod Reynolds IV","date":"2012-08-30 03:12:26 +0300"},{"content":"Just spent five days at the Intercontinental and had an excellent experience. Hotel itself is 3.5-4 stars, staff is excellent, food is over priced but where isn't it on an island. Be clear this is not a Four Seasons or a Ritz; but it provides an enjoyable vacation complete with the amenities which most of us expect. Beach is pretty but seaweed is a problem near the shoreline; venture out a bit and it goes away. Pools are very nice and well kept. Expect the beach to be pristine and beautiful as can be and you're setting yourself up for disappointment. Restaurants are good, location is central to other activites. I'd recommend renting a car for sightseeing. Price is right; enjoy.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Sonny Wyman","date":"2012-05-26 03:22:12 +0300"},{"content":"The basics: Very clean, large room, but nothing out of the ordinary. Very accomodating staff, booked our snorkeling and bioluminescent bay kayaking trip (highly recommended!) with no problems. Ruth's Chris steakhouse is in the hotel, which was great - when we arrived, they said they had no record of our reservation, which was made by the hotel, but quickly sat us anyways even though they were quite busy. We stayed here in mid-August, which was VERY quiet, definitely the beginning of the off-season. The hotel is located on the beach next to a strip of hotels, including the El San Juan (great casino). Across the street is Wendy's, Pizza Hut and a bakery, which is good for a cheap breakfast but be prepared to wait a long time for your bagel - they are very slow. Also check out the Palm restaurant at the El San Juan. The only drawback is if you are into the outdoorsy kind of activities, stay in Fajardo instead. We went on two trips and both of them involved 1+ hour trips to Fajardo by car. Overall, a good experience, there are so many fun things to do in Puerto Rico to keep busy!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Rico Vandervort","date":"2012-01-26 00:15:22 +0300"},{"content":"This hotel needs some work. A lot of work, actually. It's obvious they are trying to do just that, but in the meantime, the rooms are very, very outdated. The furnishings and amenities are way behind what we've come to expect in a hotel at $400/night. The doors, trim, air conditioning vents, balcony railing and plumbing fixtures are all in really awful, outdated condition. They should have been updated 10 years ago -- they are *well* beyond their prime. If you are accustomed to seeing flat panel TV's, contemporary furniture and duvets on the beds, this is definitely not the hotel for you. On the plus side, the beds are comfortable, the rooms are spacious and nicely arranged (other than the bathroom, which is the smallest hotel bathroom I've seen in years.) The beach access is fantastic and the beach itself is very nice. The view from the oceanview rooms is not going to be beat. There are a few restaurants (ie: other hotel restaurants) within walking distance, which is a nice plus, and the restaurants in the hotel (with the exception of the downstairs breakfast restaurant) are nice. The worst part of this hotel is that they had our email address since the day I made the reservation several months ago and we were never notified about the pool renovations. That is really an unacceptable oversight. (And I am probably being generous in calling this an 'oversight.') I cannot even begin to imagine the disappointment this would have created had my stay there been a family vacation! Until the pool is complete, I would be not recommend this hotel, unless you do not mind staying in an outdated room at a resort with no pool. Even when the pool is complete, I would personally not stay here again unless the entire hotel were fully renovated. We debated between this hotel and the Ritz-Carlton, and there is no question that next time, that will be our choice.","ratings":{"Service":2.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":4.0},"author":"Miss Felicita Casper","date":"2015-01-17 15:53:48 +0300"},{"content":"From the pictures and description on the web site I was expecting more luxurious accomidations. The walls were very thin, the furniture a bit worn. The bathroom was small. It had a nice balcony for city view. I was on 5th floor and didn't hear much traffic with door closed. Service was very nice, and really enjoyed the tours booked with the hotel. The bed was quite comfortable, mini-bar was a bit sparce for selections. Free Wireless access was nice. The room service food and the Yokahama restaurant were both excellent.","ratings":{"Service":3.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Haskell Feeney","date":"2015-09-08 22:53:23 +0300"},{"content":"My husband and I visited the Intercontinental San Juan June 8th-12th for my 30th birthday. Growing up my family had an apartment in the ESJ towers and I have been to San Juan several times. We have also been to other parts of the Caribbean, Mexico, Europe, etc., and I cannot really complain about this hotel. We stayed on the 15th floor with an ocean view. (Definitely worth it) The rooms were very nice and we did not hear any noise at all. The staff was very friendly and though we only ate lunch at the restaurant by the pool it was very good, yes it was expensive but you are paying for the convenience of sitting in your bathing suit and not having to leave the grounds. The only complaint I have and it wasn't even that bad was the pool could have been cleaner. I am not talking about leaves, etc., but the actual pool walls seemed dirty and it made the pool look murky. Not a big deal though. We had drinks and walked around El San Juan next door. Really fun on Saturday night. The lobby is beautiful, you could make a whole night out of relaxing by the bar and people watching. They have a live band and everyone dances. The prices are actually cheaper there than at the lobby bar at the IC. ($16 for a shot of Patrone) Starting that Friday there was a culinary food festival going on in Old San Juan. Perfect for us foodies! Instead of just going to one restaurant we got a chance to sample a few. They had tables set up all along Calle Fortalezza and several live bands. We had an appetizer of blackened seared tuna in a Thai peanut sauce at Tantra that was out of this world. We also ate at Dragonfly, Aquaviva, and the Parrot Club. The halibut at the Parrot club was excellent. We had planned and usually do go to more traditional restaurants while on vacation but ended up at these places and I am not complaining. It started off the first night when we ended up strolling into the water club near the IC and ate at Tangerine, One cevicehe appetizer later and we were hooked to the modern/fusion restaurants. We did go down the street from the IC to the Metropol for the black bean soup, it was yummy, just as I remembered. One more thing, the IC does hit you with a hefty occupancy tax/resort service charge, (about $66 a day on weekdays, $80 on weekends) I believe they tell you that when you actually book the room, I suppose I overlooked it and was a bit shocked upon checking out. Regardless, I would stay at the IC again. It is in a great location and Isla Verde beach is beautiful.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Nathan Ziemann","date":"2012-09-09 23:06:46 +0300"},{"content":"Just got back from a weeklong trip staying at the Intercon Hotel in Isla Verde area. We had a decent sized room (king bed, sofa) facing the ocean. It does make a big difference when you get that view and open your sliding door for a nice breeze off the ocean. The higher your floor the better the view. People have complained about the walls being very thin and hearing everybody else but honestly it depends who is staying next to you. It's pretty much luck of the draw. Tell the front desk if your neighbors are too loud. They'll handle it for you. The hotel is very very close to the airport so that's good but also bad in some respects. Only an $11 cab ride (5 min) away but you can hear the boom of the planes arriving and departing close by. Bewteen 11 pm and 7 am the airport has very minimal activity. The pool area is very spacious with plenty of comfy chairs to claim. The staff is very attentive and accommodating to help you enjoy your stay there. There are two bars/restaurants at the pool area, one closer to the beach and one has a swim up bar. The \"Splash\" swim up bar makes their drinks better than the Ciao restaurant. Definitely important when your paying $8 per drink plus tipping. Food at both places is your typical bar food. Pricier because of the convenience of eating right there at the poolside/beachsisde. You can walk right across the street to a few places for cheaper breakfast/lunch food (i.e. Subway). The beach outside the hotel is decent but the ocean water surprisingly has lots of seaweed. They have water activities such as jet skiing, parasailing, banana boat. Isla Verde beach area allows you to take nice walks up and down the coast. The hotel offers you chairs and umbrellas for the beach as a guest, free of charge, just throw a few $ tip to the guys busting their butts hauling them out for you. They have a decent gym overlooking the ocean close to the beach. It's included in your stay. The hotel has a few different restaurants- sushi, steak, italian, breakfast buffet. Did all of them except for the italian. Enjoyed all of them, little pricier but that's expected for hotel standards. The casino is pretty good, open every day from 10am-4am. Guy sells cigars in front of it during the evening. Little bar in the lobby area with salsa playing music in the evenings. If you plan on hanging in the lobby area during the evening bring a sweatshirt, it's cold in there! People actually hang out in there because it's nice. The concierge desk was very helpful to us in planning dinners and various other activities. Highly recommend Nestor or Joselle. All in all it was a very nice place and the weather in PR was great, obviously the reason people go to the island for vacationing. Would stay there again if we visited PR again. El San Juan hotel next door is pretty sweet with a cool lobby/ bar area but it's also much more expensive.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Jose Robel","date":"2013-10-29 00:52:24 +0300"}],"public_likes":[],"vacancy":false,"description":"Boutique hotel in the City Centre; Marco Pierre White restaurant on-site.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}