{"title":"Edinburgh/West","name":"Dunstane House Hotel","address":"4 West Coates, Haymarket, EH12 5JQ","directions":null,"phone":"+44 131 337-6169","tollfree":null,"email":null,"fax":null,"url":"http://www.dunstane-hotel-edinburgh.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.9454,"lon":-3.22869,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":8711,"country":"United Kingdom","city":"Edinburgh","state":null,"reviews":[{"content":"We stayed with a group of 15 recentlly. Hotel was nice, decent size rooms which had been recently renovated. Located close to the subway, but definitely not walking distance to Spanish Steps and Trevi fountain as they suggest. Lovely small roof top terrance and courtyard off the dining area.. Market close by. We wnt there to pruchase some wine and cheese for happy hour. When we got back to hotel we were told we could not use the outside terrace as they had an afternoon bar and you had to buy from them., 13 Euro for a glass of chardonnay., no thanks- went to upstairs terrance, as we were told to do. Last night barman came up and told us this would be the last night we could use the terrace as we had to buy drinks from them. No probem- as we were leaving next day. .","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Dale Kub","date":"2015-12-20 13:57:04 +0300"},{"content":"Great stay, clean rooms. Stayed there 3 nights all up, on different occasions, each time great service & clean. Within walking distance to the Main Rome Train station which made it easy to get everywhere. Great place - a little pricey, but I would still definately recommend it.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Cierra Rohan","date":"2014-10-29 12:16:57 +0300"},{"content":"The hotel itself is nice and clean, staffs are very friendly and helpful. However, the area around the hotel is not that safe, the first day we went back to the hotel early at around 5pm, and we had two guys following us at the last half block on our way back to the hotel, we tried to walk faster and faster, and we were also lucky to have some other people walked out the hotel when we were almost near to the front door, so we were safe. We end up took the taxi back to the hotel every night. It is safe to walk around the hotel in the morning, but will definitely not recommend to walk back to the hotel at night. It was a scary experience!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Location":1.0,"Rooms":4.0},"author":"Roxane Hand II","date":"2013-07-24 03:16:17 +0300"},{"content":"We stayed for 2 nights at this hotel, chosen mainly for its price and location. Its very small and not very noticable from the street. Although the rooms are quite small, everything is very nicely decorated and clean. It is about a 10 min walk to the Manzoni subway station and about 20 mins to the collesium. We didn't explore the area around the hotel, but there didn't appear to be many restaurants. There are a couple of cafes close by that sell pastries and drinks etc. Thre is however a complementary conntinental breakfast which means you can quickly eat and be on your way for sight seeing!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Mrs. Vivian Gutkowski","date":"2013-07-27 08:56:49 +0300"}],"public_likes":["Lyric Moen","Murphy Cartwright","Mina Bogisich","Rowan Johnson","Greg Stroman"],"vacancy":false,"description":"The hotel offers the comfort and elegance of a Scottish country house. The same people run the '''Dunstane City Hotel''' across the road.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}