{"title":"Oban","name":"Corran House","address":"Victoria Crescent, Corran Esplanade PA34 5PN","directions":null,"phone":"+44 1631 566040","tollfree":null,"email":null,"fax":null,"url":"http://www.corranhouseoban.co.uk/","checkin":null,"checkout":null,"price":"Beds from £18, rooms from £40","geo":{"lat":56.41813,"lon":-5.4749,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20956,"country":"United Kingdom","city":"Oban","state":null,"reviews":[{"content":"First time staying at Henderson's, and I was not disappointed. The front desk were very pleasant and accomodating, providing me with useful info for my stay, making sure I knew about the free continental breakfast and complimentary bottle of wine. The room could not have been any nicer, the bed was comfortable, it was immaculate with all I needed for my stay. I would stay there again and highly recommend it to anyone wanting to stay in Baltimore.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lemuel Paucek","date":"2012-11-07 05:37:11 +0300"},{"content":"My wife and I stayed at Henderson's Wharf Inn for 2 nights. What an amazing place to stay. The hotel is incredibly charming and the service was amazing. A good continental breakfast every day and a bottle of wine at check in. The location is very good as well as many restaurants and bars/pubs are in walking distance in Fells Point. The only thing I would change is the bath tub, which was more like the type of thing you would see at a Holiday Inn than this type of place. Otherwise, the room and hotel was amazing.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Aracely O'Hara","date":"2012-04-11 17:22:48 +0300"},{"content":"I'm somewhat a very picky traveler when it comes to hotels. Based on reviews on Trip Advisor, decided to stay for 2 nights June 25-26, 2010 with Loyola University bound daughter. Based on availability we were going to have to change rooms for the 2nd night, however, the hotel accommodated us prior to our arrival to a harbor view room. This was the most amazing boutique hotel which I've stayed in. The beds were extremely comfortable, the view incredible and the morning breakfast excellent. Will definitely stay here again over the next four years. Thank you.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hailee Will III","date":"2012-04-27 06:04:52 +0300"},{"content":"This was our 3rd stay at Henderson Wharf Inn. This time we had a corner room facing the wharf. We will keep coming back. Comfortable, classy rooms, a free bottle of wine, and the best complimentary breakfast you will find. You can't beat the location if you want to visit the pubs and resturants in Fell's Point. Parking in free at the marina right across the street.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Aron Schmitt","date":"2014-03-29 02:20:19 +0300"},{"content":"My husband and I celebrated my birthday at our favorite place -- Henderson's Wharf Inn! We love Baltimore and all there is to do there, but more importantly than the town is the place -- and this is it! There is just this feeling of \"ahhh\" as you walk in, feeling like you've just entered the home of a dear friend. From the welcoming lobby (and front desk staff) to the wine in your room to the beautiful furnishings, you'll know within ten minutes of your arrival that you picked the right place! The rooms are very large and furnished like a bedroom out of a model home. You will not feel in the least like you are staying in a hotel! The mattresses and sheets are top of the line -- you'll get a wonderful night's sleep! The breakfast is just incredible with every sort of fresh fruit, crunchy granola, a large assortment of fresh breads and pastries, cheese and crackers, many fresh fruits -- you name it, it's there! I took pictures but somehow they got deleted from my camera card and I'm very disappointed because I've described this place to my friends, but it's not until they saw the pictures on my camera that they realized how truly unique and wonderful this place is. The front desk staff will attend to your every need and are so gracious and pleasant to deal with. The Inn at Henderson's Wharf combines the best of a Bed and Breakfast (charm, good food, warm ambiance) with the privacy and luxury of an upscale hotel. The water taxi comes within a few minutes of the front door -- it gets you wherever you want to go in Baltimore within minutes at a very low cost. We would never consider staying anywhere else when we're in Baltimore and in fact consider the Inn a destination in itself!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Eloisa Crist","date":"2013-10-27 05:19:55 +0300"}],"public_likes":["Kristian Walker","Arlene O'Kon","Leonardo Price","Hollie Heathcote"],"vacancy":false,"description":"small ensuite dorm rooms and private guest rooms, sea-front location.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}