{"title":"Cardigan","name":"Over The Rainbow","address":"SA43 2JD","directions":"B4333 near Gogerddan Arms pub","phone":"+44 1239 811155","tollfree":null,"email":"info@overtherainbowwales.co.uk","fax":null,"url":"http://www.overtherainbowwales.co.uk","checkin":null,"checkout":null,"price":"Single from £45 Double £80-120","geo":{"lat":53.261371,"lon":-1.380181,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5080,"country":"United Kingdom","city":"Hollingwood","state":null,"reviews":[{"content":"If you're looking for a little elegance on Pacific Beach, this hotel is worth the extra bucks! The Pacific Terrace has exquisite rooms with beautiful new linens, etc. The views are perfect. All public areas are very well maintained as are the rooms. The staff is extraordinary & go out of their way to assure guests are happy (but not in an obtrusive manner). There's a nice pool & hot tub & a fantastic continental breakfast daily (not to mention complimentary warm cookies at 4pm & a glass of wine around 6pm). There is no restaurant or bar on the premises, but you don't miss them when... Steps out the door is the beach, boardwalk & many places to eat, drink or shop. There are many places to stay along Pacific Beach if your budget doesn't allow for it ~ but we'd rather stay one night in Pacific Terrace than 3 anywhere else!","ratings":{"Overall":5.0},"author":"Arlene Bogisich","date":"2014-10-01 15:11:50 +0300"},{"content":"Based on tripadvisor reports, we selected the Pacific Terrace Hotel in Pacific Beach. I wanted a nice place to bring my 8-year old son while we toured the zoo, LegoLand, and SeaWorld. I was not disappointed. The hotel was clean, well maintained, and modernized. The staff all were friendly, helpful, and never far away. I was amazed at the number of staff available to help the guests. I selected the least expensive room based on the rates quoted on the phone. I then booked the room online and got an even better rate. The \"garden view\" room I requested (rather than the more expensive \"ocean view\" room) still had a view of the ocean from the litte patio we had. And I could hear the waves from my room. I was pleased with the amenities we had in our room: free wireless internet, fridge, coffe pot, and mini-bar, 2 sinks, very handicap accessible bathroom, patio and chairs outside by a little garden area, 2 very comfortable queen beds, a desk and chair plus a little table and more chairs. We were very happy. While there was no restaurant onsite, we liked the free continental breakfast in the morning. We had lots to eat there. Plus there were drinks available there all day for free. Snacks and drinks were available by the heated outdoor pool. From 4-5 pm was a free wine hour. There were tons of restaurants nearby to chose from after our busy day. The location right on the boardwalk of the beach was great. It was quiet at night, and busy during the day. The area felt very safe to me (a single mom with her young son). This is a great choice for either a couple getting away or a family seeing the San Diego sights.","ratings":{"Overall":5.0},"author":"Russel Kassulke PhD","date":"2014-07-28 07:28:56 +0300"},{"content":"The first room we were in was a Jr. Suite which we were told was good for a family of 4. NO WAY! So, we immediately upgraded to a Family Suite. It was on the 1st floor, a little loud on Friday & Saturday nights but ok. There was a leak somewhere in the bathroom near the shower that got all of our towels wet after we used them to dry up the leak. The Continental breakfast was a hit with the kids & the cinnamon buns were yummy. We ordered \"room service\" one evening & the food was room temp when it arrived & both kid's meals were incorrect - we ordered chicken tenders & fries and grilled cheese & fries & got 2 hamburgers (whatever). We were told a crib would be in our room upon checking in, we had to ask for the crib to be delivered. Hmmm.... all in all- if we went again, we would rent a house instead of staying in a hotel - this or any other for that matter. A week is just too long in a hotel room with 2 kids - even if it is a 2 room suite. The room service was funny too - we came in two times while the turn down service was being performed & the maids were JAMMING to some \"Mexican\" tunes on the clock radio. They were nice & the room was always very clean, but it was pretty funnny.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Service":4.0,"Rooms":3.0},"author":"Janae Ratke","date":"2015-04-19 10:31:00 +0300"},{"content":"ok, I ill give this property a thumbs up but must add a few problems 1. the parking 15 dollars a day is alot but if you agree to pay it as I did you should not have to run to the front desk 40% of the time because your keycard wont work (actually worked 7 out of 12 times) They give the standard excuses every time; the lock is dirty, the card was too close to your cell phone and got demagnatized, just jiggle it a few times. Hey management, FIX the lock!!! it is the major complaint everyone is talking about at the pool. seems it happens to everyone 2. again the lock on the door to the boardwalk. it wont close unless you push it shut. was open almost everytime I went in or out. lessens my sense of security especially since my young family was staying on the ground level 3. the room prices. Made my res directly with the hotel and they matched the best rate I could find on the net. 199 plus 22 tax plus 15 parking. when I was checking in, 2 walk ups were quoted 60 dollars cheaper a night. I know supply and demand, but I was a little put off. Overall, a good hotel and a great location. The staff was young and polite and seemed sorry they had to keep ging the same old tired answer to the gate problem","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Service":4.0,"Rooms":4.0},"author":"Paxton Beier IV","date":"2014-08-23 19:24:18 +0300"},{"content":"We are a family of four who stayed at the Pacific Terrace for 3 nights. I cannot believe that other posts do not list the overriding fact that the area of Pacific Beach is a complete dump and not family friendly. It is a mix of collge nightclubs, run down motels, surf dives, and delapidated shops. The crowd is college party drinkers, homeless, and way-way out of towners (foreign/Michigan). Our guest's car was broken into the second night and the hotel would net help offset the costs of fixing the smashed window, they did not even check on us for the rest of our stay. The room was late in being ready at check-in, the concierge was completely wrong about availability of road bikes at their rental outlets, the hotel restaurant recommendations are the ones that are closest, and the whole thing has the feel of a motel with an expensive facelift. The price ($350/night) for a premium view room makes it seem as if the area, facilities, services will be high-end--this is not at all the case. BTW, the beach is across from the hotel but you have to go down a 30-foot bluff to get there--just don't get hit by a bike or trip over a homeless guy to get there.","ratings":{"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Service":2.0,"Rooms":3.0},"author":"Rey McCullough","date":"2012-02-26 21:00:25 +0300"},{"content":"We stayed here right in the end of September, the Hotel is on the beach and if you reserve a beach facing room (a little extra $ at reservation) - it's totally worth it. We spent this as a second honeymoon and were not diapointed at all. The staff was very helpful and extremely knowledgable on the area and where to go and what to expect - one of the front desk ladies assisted me with getting to the last Padres game of the year! If you're going to San Diego as a get away from it all and want the beach, spend the money and stay here. If you going for shopping check out the downtown \"Gas Lamp\" area hotels, but this is great for just walking on the beach and driving up to La Jolla for an evening as well!","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Cale Becker","date":"2012-10-23 23:04:32 +0300"},{"content":"I stayed here this past weekend with my girlfriend and absolutely loved it! We stay in San Diego at least one weekend a month, and this is definitely one of the best hotels. First of all, for location, it's tough to beat. Pacific Beach is a great area to visit, with excellent restaurants, a number of good bars, and a beautiful beach. Having said this, the area is lacking in nice hotels. The Pacific Terrace was fantastic. We booked a \"Garden View\" room online for a discounted rate, but when we arrived we upgraded to an ocean view mini-suite because the hotel was not full. The view was perfect, and if possible I would encourage the ocean view rooms, as the \"garden\" appeared to actually be an alley. The room was clean, staff excellent, pool and hot tub area very nice, the breakfast was good, plentiful, and fresh, and there was plenty of parking below the hotel. We will definitely return and highly recommend this hotel.","ratings":{"Overall":5.0},"author":"Iva Wisozk","date":"2013-07-21 09:50:43 +0300"},{"content":"I stayed at Sommerset Suites while on a business trip at UCSD Hospital. I enjoyed my stay there very much. The hotel is perfectly located. It is a few block from the main highway, but not right on top of it. So you can easily get to downtown or the beach without any trouble. It is within walking distance to all the hospitals and offices. There is a fabulous dining and shopping district right across the street. Pretty much anything you are in the mood for you can get within a 5 minute walk. Being a fairly young female and traveling alone, I am always careful of my surroundings. I felt safe walking around at night and being in the hotel alone. The hotel itself is nice. It is a simple hotel, nothing really fancy about it. But it is comfortable and clean. The rooms are very large! And comes with a full kitchen complete with a closet full of kitchen utensils and supplies. While my room only had a king, I felt as though with the right beds, you could comfortably sleep 4-5 people easily. The bathroom was nice and clean with a good amount of counter space. The hotel has a pool and hottub. I did not get the chance to go in, but I walked around it and saw people in there enjoying it. It has a good amount of parking underneath the hotel. The hotel served a wonderful breakfast with freshly made waffles, eggs, cereal, etc. The hotel staff was so wonderful and friendly. They were quick to help me when I got locked out of my room and had great recommendations for food and fun local places. If you are looking for a nice hotel around the hospitals and even a little out of downtown but still close to everything, this is a great hotel. It is reasonable priced, has great features, and can really accommodate anyone.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Loren Hermiston","date":"2015-01-17 23:32:01 +0300"}],"public_likes":["Itzel Eichmann DVM"],"vacancy":false,"description":"Vegetarian guest house, 3 miles from Cardigan bay coastline (Aberporth and Tresaith).  Quite secluded guest house, a restored georgian mansion nestled in 18 acres of garden and woodlands.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}