{"title":"Los Angeles/Downtown","name":"Ritz Carlton","address":"900 W Olympic Blvd","directions":null,"phone":"+1 213 743-8800","tollfree":null,"email":null,"fax":null,"url":"http://www.ritzcarlton.com/en/Properties/LosAngeles/Default.htm","checkin":null,"checkout":null,"price":"$450+","geo":{"lat":34.045581,"lon":-118.266793,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16639,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"My wife and I visit the Ponce area regularly and always stay at this hotel, even though there are plenty of other options in the area with which we are familiar. Our most recent stay was a four-day holiday weekend. It sits on a hill overlooking the Caribbean Sea, a campus-style property with a particularly pretty and ample pool area. Although the hotel's location is convenient for exploring area attractions, a car or some other ground-transportation arrangement is an absolute must for travelers staying at this hotel, which is also true for Puerto Rico as a whole, a car-dependent island. The rooms are very clean, comfortable, and nicely furnished. The front-desk, maintenance and food/beverage staffs are excellent. Rates are on the pricey end for Holiday Inns at large, but one definitely gets what one pays for. The on-site restaurant serves very good food. We will most definitely stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Travis Schimmel","date":"2012-01-02 02:21:38 +0300"},{"content":"We stayed at the hotel for 10 days and 9 nights. WOW what a veiw and the staff was so kind and helpful. The pool was clean and the water temperture was perfect and the breakfast was just awesome! There staff went out of their way to make us comfortable. I could not believe how close everything was: Walmart, Walgreens, Subway, McDonalds, K-Mart, Sams Club and many more just 5 minutes. Family own bakery 2 minutes away and more...","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Alverta Renner","date":"2013-01-04 23:29:12 +0300"},{"content":"While I agree that this hotel is nothing extrodinary I would disagree with the rest of the recent reviews. I stayed in this Holiday Inn last weekend and had a blast. The rooms were comfortable, the staff was friendly and polite and the views are breathtaking. The hotel is perched on top of a cliff and you overlook the ocean from the rooms and from the pool. The bar area also has a beatiful view of the ocean. I will definitely stay in this hotel again!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Elody Kuphal","date":"2013-12-25 15:01:09 +0300"},{"content":"We stayed here before and only returned because the web site said or was remolded. Our room and bath were old and our bedding was damp. We were on the 7th floor. During the night a roach walking on us awoke us! They no longer serve a cook to order breakfest and their great long lounge bar has been removed and a hot pizza place has been added. The front desk clerk did not know where the business center was printing off boarding passes. Our group had 3 rooms, one worse then the other. My recommendation is spend a little more money and go down the street!","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Queen Hackett","date":"2012-06-03 05:35:56 +0300"},{"content":"Stayed in Howard Johnson for a week with my friends last month. On th arrival it was slight longish, as check in procedure took a really long time. In fact, i think this was the longest hotel check in i ever had. We had a large room that had a big bed, so it was pretty comfy. Tv functioned ok with good choice of programmes, room was cleand & cleaned every day. Bathroom was little bit sloppy, but still ok. It was clean, but it kind of, needs some refreshment.... Breakfast we had was ok only for first day, already second day you don't know what to take because there is literally only few things displayed... A toast, jelly, butter, some cereals, 3 types of fruit, coffee, milk and juice... Not quite good, isn't it? And thing that really bothered me was the fact that 2 girls \"working\" there ate sandwiches with ham and chese during breakfast time, while guests had their empty toasts. Jummy..... Pool area was not too attractive, right next to reception, everyone on the reception can see you plus there are always some locals swimming, which we didnt like too much. Hotel location was good, close to airport (but far enough), bars, shops and beach which we used few times... Parking in the hotel is not free, but as special guest you have a special price, which was fair. Old SJU is some 15 minutes away (by car), which is ok. If you need/ some evening walks, disregard some previous comments about security in hotel's area, cause it is actually very safe. On the other hand, if you act unsafe, there isn't a place on the earth which is safe enough for you.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Earl Marks","date":"2012-11-03 16:33:18 +0300"}],"public_likes":["Dr. Adeline Doyle","Korbin Huels III","Robb Erdman"],"vacancy":true,"description":"This high-rise hotel is one of the newest in downtown, with stunning views from the upper floors. It's across the street from LA Live, the Convention Center, and the Staples Center.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}