{"title":"Wikivoyage:Listings/Draft","name":"Hotel Eldorado","address":"rue des Dames 18","directions":"17th, metro: Place de Clichy","phone":"+33 1 4522 3521","tollfree":null,"email":"eldoradohotel@wanadoo.fr","fax":"+33 1 4387 2597","url":"http://www.eldoradohotel.fr","checkin":null,"checkout":null,"price":"€23-39 sgl, €49-79 dbl","geo":{"lat":48.88487,"lon":2.32478,"accuracy":"APPROXIMATE"},"type":"hotel","id":41208,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"Great hotel recommendation for Downtown Dallas area! Hotel still seems newly renovated with modern styles & architecture. Cozy & spacious rooms with a very plush feeling. For those who want to be pampered at a moderate price, this hotel is for you. Didn't get to sample any foods, but the stay was memorable. Romantic feel! A++","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Zander Koch","date":"2015-02-02 14:06:24 +0300"},{"content":"This was my second stay at The Magnolia. I love the location, right in the middle of downtown, and the old building, but the best part is the view! Request a corner room, you get three walls of windows looking over downtown! There are a couple drawbacks to the hotel: the carpet needs to be replaced, the elevators are very slow. But the ambiance makes up for it. The staff are generally realy nice and helpful. I went down to the bar area to buy some OJ after breakfast had ended, and Jesus went to the kitchen and brought me two glasses of fresh squeezed for free! The shuttle is also great, they took us outside of the stated 5 mile radius. It was so convenient when we went out to dinner not to have to drive! There's also celebrities staying there almost constantly. The cast of Prison Break was staying there while we were there, as were the Black Crowes. You definitely can't beat the price for such a fantastic hotel!","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Franco Orn","date":"2013-09-14 15:00:32 +0300"},{"content":"Terrific stay at the Magnolia recently. Lovely old office building, very sympathetically converted to a hotel. Staff and everyone very friendly. Large rooms and very comfy beds, they even changed the bed linen daily! Despite an unusual (for October)93 degrees the room remained cool without the need for the aircon. Hotel in a good position, you could walk to JFK sites, Reunion Tower and West End etc. easily. DART public transport was a joy - clean, efficient and very inexpensive (by UK standards). Comp. breakfast was a good selection, pastries, cereals, muffins, bagels, yogurt and fresh fruit but the real treat were the wonderful milk and cookies at night! I'd highly recommend both the Magnolia and Dallas.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Minerva Sanford","date":"2014-12-13 02:01:51 +0300"},{"content":"We adored The Magnolia. We asked for a room w/a view & were placed in a corner room on the 24th floor, from which we could see Neiman Marcus below, the Cotton Bowl & the State Fairgrounds in the distance, and everything in between. Although not all standard rooms are decorated this way, our room had oak paneled walls, hardwood floors, & five windows w/ sills deep enough to curl up in. The public areas were amazing. The 2nd floor is dedicated to numerous small intimate seating areas for guests to sit & talk, read a book in front of the fireplace, have a drink w/friends, watch a ballgame, or even play billiards. No matter how many people were there, we always felt we had a \"private\" spot. The evening reception has \"standard fare,\" - true -- but the cheese, veggies, crackers, chips, & salsa, along w/the free drinks -- were served w/a smile, and there was always someone quietly cleaning up any mess from the people before you. We were walking distance to the Convention Center, the West End, and the Kennedy Memorial. The public library is just a couple of blocks, & the newly opened & fantastic \"Iron Cactus\" is LITERALLY out the back door. We thoroughly enjoyed the hot tub on the 3rd floor. It is in a corner room off the gym w/ barred but open (meaning no glass) windows, so the crisp outside air is a factor, but... the tub was warm so the January chill air felt nice. It was a unique experience. We didn't get to use the fitness room, but were impressed w/its equipment & size (how many hotel gyms actually have racks of dumbbells?). There is almost nothing negative I can say about The Magnolia. We will definitely return.","ratings":{"Overall":5.0},"author":"Daren Carroll IV","date":"2014-03-05 04:04:00 +0300"},{"content":"I had a 6th floor room facing the parking lot. The lights in that lot are on all night, and eaisly shine through the window if you do not have the shades closed. The room itself was small, and reminded me of a New York City room. The noise from the traffic below could be heard at all hours. That being said, the breakfast was very well done, and the food was replaced quickly when empty. The lobby was presented nicely, although there could have been more staff on hand when I checked in. There were several people in line, and only 1 staff person doing teh work. The area was safe and in walking distance of many resturants.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Mrs. Maud Wyman","date":"2013-11-21 01:14:12 +0300"},{"content":"I usually dont usually take the time for writing reviews since i don't have the time for it. nevertheless, this is such an specific case i have to. I want you to know what i terrible mistake i made by chosing this hotel. As soon as i got there they could not find my reservation in the system and made me buy a bigger more expensive room. This girl i dont wanna mention her name (the only at the hotel on that sunday night) had a very bad atitude. The hotel was empty so i parked my car outside at the door. It wasnt valet, they kept the key and still charged me an extra 25 for that. I arrived around 11 at night and left at 6 next morning, so my car was exactly where i left it. The room costed me around 220 plus taxes and valet costed me around almost $300. The room was very old. The air conditioning/heater had to be turned off cuz of the loud noise it made I couldnt sleep. Everything and all the equipments are very old. The location is very unaccessible and horrible. Im not very familiar with Dallas but that location seemed dangerous to me. the breakfast is very deceiving also. PLEASE DONT GO THERE! The price is really not worth it. they are absolutely insane to have prices like that for such a low quality and bad services. Honestly if you stay at Motel 6 it will feel more luxurious than that! I have originally chosen to stay there cuz of the price, i thought it should be good for that price! I was very wrong! I went next night to the Crowne Plaza and had a blast! I was very amazed with the friendly stuff, great food, great location and FREE accessible parking right in front of the elevators! All of that for half of the price! New comfortable rooms i felt in heaven after the horrible time i had at the Springhill Suites. I have to go back to Dallas several more times and will never ever go back to the Springhill Suites.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Antone Braun","date":"2013-04-01 16:17:36 +0300"},{"content":"We had a reservation for 2 rooms beginning December 31 for 3 nights that we made six or seven weeks in advance. We were in town for a football game and were excited because we were going to take advantage of many of the Downtown activities for New Years Eve. When we arrived at the hotel at 7:30pm, they didn't have our rooms and walked us to a Springhill Suites 6-7 miles away on Loop 12. While they paid for our rooms that night, we didn't get to attend any of the NYE activities because we didn't want to fight the traffic or deal with parking and the NYE drunks. We checked into the hotel again the next morning and our rooms weren't ready. We went out and about and by the time we checked in, there wasn't a king bed room available as we had requested. We also didn't realize till check out, but when they had re-instated our rooms, they put the rate in wrong. The location of the hotel is GREAT as are most of the staff are extremely helpful and friendly. They recommeded several places to go that turned out to be excelled. We used valet during our stay and it seemed to be constantly backed up. When we returned to the hotel the last night there after our football game, we left a leather coat and hat in the car. When we returned home, we realized we didn't have either one. From both our memories and our pictures, the only time it could have been taken was from the car that night. I called the hotel a couple of times and left messages for Lost and Found but never recieved a call back. We suspect the valet didn't lock the door and somebody wandered through the parking lot checking for unlocked cars. We realize we shouldn't have left anything in the car but locking the car should be a basic requirement for valet.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Mekhi Lueilwitz","date":"2015-02-02 10:12:00 +0300"},{"content":"I was recently in Dallas for a conference with a group which included several college students on a budget. We booked the Springhill Suites for the amenities it offered, such as the complimentary breakfast and free wireless in the rooms. We were very pleased with our stay and the location of the hotel. Our rooms were large with the extra suite area, so we were able to sleep 3 in a room comfortably. The rooms were clean and the beds quite comfortable (although I can't vouch for the sofa bed, since I didn't sleep on it). The hot breakfast was pretty standard, but a definite plus for the group in trying to save a few pennies. We liked the Texas shaped waffles! The hotel had karaoke the night we arrived, and it seemed like everyone was having fun, but it ended before we could get downstairs to it. The hotel lobby is quite small, but adequate, and the hotel staff were helpful for the most part. I did have problems after I returned home with a hotel clerk in trying to get a copy of my receipt showing my paid bill, but she eventually helped me. We relied upon the conference shuttle and the DART station nearby for transportation, so it was pretty convenient to get wherever we wanted to go. We also liked being able to walk to all the restaurants in the West End at night. There were many to choose from, and the students thought the location of our hotel was great. The Dallas Aquarium is practically at the back door of the hotel, and the JFK sites are close by, as well as restaurants like the House of Blues and Spaghetti Warehouse. Others at the conference who were staying in the hotels by the interstate were jealous of all the restaurants and attractions that were in walking distance of our hotel! Overall, it was a good experience and a great value for a group.","ratings":{"Service":3.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaylie Rippin","date":"2012-06-04 19:48:43 +0300"},{"content":"We hadn't stayed since it changed over from Amerisuites to Mariott. Can't see much difference- beds are great, rooms are standard, location is spot on. The desk staff let us check in at 1030! We were meeting folks from out of town and we all agreed that the desk staff and valet were very accomodating. Funny thing- there were actually people in the outdoor pool on a night when it was 30 degrees and below- BRRRRRR! Our friends said the breakfast was fine- especially after coming in on the red eye from Seattle. We like it there- will be back.","ratings":{"Overall":4.0},"author":"Hugh Farrell","date":"2015-09-05 21:26:22 +0300"}],"public_likes":["Virginia Harvey","Cameron Towne","Burdette O'Hara","Rowland Flatley","Cydney Beier","Emmalee Quitzon"],"vacancy":false,"description":"The Eldorado, a former ''maison de rendez-vous'', was once home to the kept women of the 19th century bourgeois. Now a very cute ''no'' star hotel, its charm more than makes up for what it lacks in amenities (who needs a TV in Paris anyway?). The  staff are super friendly, the décor is garage sale chic, and there's a lovely courtyard that fills with neighbourhood hipsters on warm evenings. It also has a very good location and you can easily avoid the noise of Pigalle or Montmartre's high prices, but they're within stumble distance if you decide to explore. For early risers breakfast (€5, until 10:00) is served in the attached restaurant/bar. Some English spoken, especially for those who pet the cat sprawled across the reception desk.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}