{"title":"San Diego/Downtown","name":"Courtyard by Marriott San Diego Downtown","address":"530 Broadway","directions":null,"phone":"+1 619 446-3000","tollfree":null,"email":null,"fax":"+1 619 446-3011","url":"http://www.sandiegocy.com/","checkin":"3PM","checkout":"Noon","price":"$169-249","geo":{"lat":32.7159,"lon":-117.15944,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25160,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"This writer is a native of the French Quarter, so when I tell you that the hotel is in a great location I know what I am writing about. You really cannot get a better location in the French Quarter that is convenient to all of the major attractions and the Frenchman St. Marigny clubs as well; you can easily walk to every club you want to go to. I was on a trip home to visit family and chose this hotel to stay at for my visit. The room I had was typical for a hotel of that age in the FQ as far as size goes; in other words my room was not spacious, but again, rooms in any other FQ hotel of the same age are not spacious either. If you want a large room stay in one of the tower monstrosities that have sprung up on Canal St. in the past 20 years. But why would you want to stay at one of those, you can stay at one of those in your own home town, so if that is what you prefer stay home. One of the things I like about the hotel is the scale of it. It's only two stories tall, so no elevator, one can move around in the hotel very easily. One flight of stairs and you are on the street, or in the pool, no long walks. I once stayed at the Bellagio in Las Vegas and hated it because it took at least 20 mins to get from my room to the street. A hotel can be too large. The room was clean and had a nice shower, no tub, but I do not use a tub and was glad that I did not have to step into a tub to take a shower. The TV was on the small side, with a minimum of channels, but I wasn't on vacation to watch TV. Breakfast was served every morning along with a copy of the Times-Picayune. I took my breakfast downstairs in the patio, the coffee was very good. The continental breakfast is nothing to rave about, but I have yet to have a continental breakfast in a U.S. hotel that is worth raving about, in that regard the Europeans are way ahead. But really, who cares, if you want breakfast you are in the FQ, just walk down the street, there are plenty of restaurants around. The best quality about the hotel is the staff. If you come to New Orleans remember this, people here will talk to you; its the norm, and if you speak to them you will get to know them and that makes all the difference in the world when staying in a small hotel where you will see the same staff day after day. Remember this too, nothing says hello like money. When you are served breakfast give a tip, when you go out leave a tip for the maid cleaning the room. Tipping is part of the culture in New Orleans; we tip everyone, and everyone expects a tip, and people will respond in kind. In New Orleans it is customary to give someone a little something extra, we even have our own word for it; lagniappe. I was traveling alone on my visit home, I left $2 for the maid, and $2 for breakfast everyday, that's $4 a day, not much at all, but it makes a difference to the staff. It also makes a difference to say \"good morning\" or respond in kind when someone says it to you. Treat the staff as your peers and with courtesy and you will have a pleasant stay I promise you. Parking: the hotel has offsite valet parking. I never used it because I flew into New Orleans and did not rent a car. No need for a car if one is staying in the FQ. But for those who drive to New Orleans or rent a car all I can tell you is that during my stay at the hotel I never heard anyone complain about waiting for their car to arrive once it was summoned. The bottom line is this, would I stay at this hotel again; yes. There are only four hotels in the FQ that I will stay in, and this is one of the four.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Alverta Mueller","date":"2013-03-07 18:47:48 +0300"}],"public_likes":["Zachariah Williamson","Isabell Von","Domenico Swaniawski","Noel Langosh"],"vacancy":false,"description":"A unique 245-room hotel where timeless charm is blended seamlessly with sophisticated comfort of modern guest accommodations. Ideal location in the Gaslamp Quarter.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}