{"title":"Castle Douglas","name":"Douglas Arms Hotel","address":"206 King Street, DG7 1DB","directions":null,"phone":"+44 1556 502231","tollfree":null,"email":"enquiries@douglasarmshotel.com","fax":null,"url":"http://www.douglasarmshotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.93948,"lon":-3.93151,"accuracy":"APPROXIMATE"},"type":"hotel","id":5192,"country":"United Kingdom","city":"Castle Douglas","state":null,"reviews":[{"content":"This is our 2nd visit to the Rex (from the UK). Hopefully that provides good endorsement. The best factor is it's location - a 2 min walk from Union Sq. Its second best feature is the complimentary glass of wine you get each day (Merlot was excellent). The service is great, we asked to move rooms, which was easily done. The rooms are air-conned, clean and a decent size. The bed was comfy enough. Free wifi throughout the hotel is a bonus. Would certainly go back.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Shane Langosh","date":"2014-09-25 00:15:56 +0300"},{"content":"The staff at the hotel rex were so accommodating. I booked 2 rooms at this hotel one for me and my boyfriend and another for 2 of my friends. I called at 6:00am and they let my two friends who had been driving all night have an immediate check in. No other hotel would do that. When I arrived late at night the guy at the receptionist was very nice and helpful. Great location. Small rooms but manageable for a couple not so much for a family. I really enjoyed the boutique hotel feel. I get really claustrophobic in hotels where the windows don't open. I really enjoyed sitting on the window sill by the fire escape and listening to the city buzz by. I will definitely stay here again.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Melba Gislason","date":"2013-07-14 01:32:26 +0300"},{"content":"Great location- shopping, restaurants. puplic transprtation are all literally steps from the door. Room was very clean; bed comfortable; service excellent; room service delicious and quick. The only thinkg that wasn't great was the wifi- it was a little slow/spotty in our room but fine at the bar. The Library Bar offered a free glass of wine per guest nightly during a designated time. We were able to enjoy this a couple of times and the wine was very nice, the atmosphere in the bar relaxing- we sank into some comfy leather chairs, ordered some cheese and crackers with our wine and rested our feet after a long day walking around San Francisco. Breakfast was very good. Coffee was very good, too. Loved the decor. Front desk staff was very helpful with directions, arranging trips and generally making us feel very welcome. We found a great room rate on a travel web site, but I would pay full room price to stay here if I were to return to San Francisco.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Dewayne Cruickshank","date":"2013-02-13 14:18:08 +0300"},{"content":"My fiance and I had a wonderful and relaxing trip. Be careful of pick picketers in this area. I thought I was being very careful about to make sure this didn't happen, please take precautionary measures. We still had a wonderful trip, but a very frustrating ending to our trip due to thieves.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Gaston Zulauf","date":"2013-07-30 06:21:02 +0300"},{"content":"Seriously, from the moment one enters, one is welcomed...and from the second visit, one is welcomed by name. It is refurbished, \"old San Francisco\" in the style of a mansion library. Cozy and warm, evening music in the lobby lounge, coffee in the morning and wine in the evening, barely a block from Union Square, exceptionally good rates and free wifi (ahem, FREE wifi throughout the hotel), lots of hot water, roomy bathrooms and GREAT beds. A disparate clientele guarantees good off-the-cuff conversation in elevator or restaurant, should you be so inclined; but all staff are warmly polite and professional and as friendly as one is open for them to be. I am returning to SF for a convention taking place at the Fairmont; but I'm staying at the Rex.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Aurelie Boehm","date":"2013-01-20 10:16:34 +0300"}],"public_likes":["Lucio Sporer","Newton Crooks"],"vacancy":true,"description":"&quot;The hotel has been tastefully modernised to meet the standards of today's traveller whilst retaining many of its original features.   The coaching credentials and the hotels reputation for hospitality have been well known over the years. The Douglas Arms Hotel is a warm and welcoming retreat for all.&quot;","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}