{"title":"Derby","name":"Rangemoor Park Hotel","address":"67-71 Macklin Street","directions":null,"phone":"+44 1332 347252","tollfree":null,"email":null,"fax":"+44 1332 369319","url":"http://www.rangemoorpark-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.920689,"lon":-1.480742,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7766,"country":"United Kingdom","city":"Derby","state":null,"reviews":[{"content":"Great location, Union square SF. almost all destination are walking distance from there, close to public transport, cable car just steps away, hop on hop off bus just a block away. I would say this is a hidden gem, room was excellent, old hotel but they maintain it well. Pillow menu is remarkable!, plenty to choose from. Service was great, quick and full of smile. receptionists are very helpful during our stay. I had a bit of situation with my missing luggage in the airport. Seems they know what they are doing.. they managed and keep monitoring my luggage arrival via airline delivery service. Concierge service was excellent!, they arranged my airport transfer straight away without hassle, giving a great tips about travel timing, etc. One downside: the bar/cafe area is a bit dark and not inviting.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Jose Johnson","date":"2014-12-04 09:16:53 +0300"},{"content":"Others have already mentioned the shortcomings of this hotel in the their reviews - no A/C, hearing noise through walls, small elevators, etc. so I won't belabor the point. These are all true and my advice is \"If you want five star , spend the money and get it\". However, if you want a good clean hotel for a good price in a great location, this is the place for you. Our San Francisco vacation was wonderful partly because this hotel was a perfect home base for us. It is steps away from the cable car stop, starbucks, Sears restaurant, and just generally in the middle of everything. We bought a week 'muni pass' at the concierge/gift shop downstairs and it was great way to get around (works on all cable cars and busses but not BART). If you drive your own car I don't think this would be the best place for you as I saw no parking nearby. But is was great for using public transportation.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Gennaro Kessler","date":"2013-02-02 01:00:24 +0300"},{"content":"Me, my husband and our friends recently spent a few days in San Francisco at the Chancellor hotel. We were really pleased with the service we recieved from this hotel, not only is just off the top corner of union square but the free cookies, Tea, coffee and apples were wonderful. It may not be a 5* hotel but the location and the service second to none. My husband left his MP3 player in a drawer in the hotel, when we went back 2 weeks later the staff had stored his MP3 carefully and were able to retrieve it easily. The cost of this hotel is great compared to other hotels in a similar (or worse) location. Next time we are in San Francisco we will be staying there and will be recommending it to all friends and family.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Burley Hoeger","date":"2015-01-19 07:11:58 +0300"},{"content":"We really enjoyed our stay at the Chancellor Hotel recently. We were able to check in earlier than the 3:00 p.m. check-in time and were given a complimentary bottle of champagne and a nice card wishing us a happy anniversary. Prior to booking the hotel, I read a lot about it, so I was aware that there was no air conditioning and to request a room at the back of the hotel, to avoid the noise of Powell Street. We were given Room 1509, a corner room at the top floor, in the back of the hotel. While the view wasn't spectacular by any means, we appreciated being able to keep both windows open without the noisiness of the street. The room was small, as expected, but with a large walk-in closet so that you could maximize what living space you do have by stowing your things away. The room was updated with newer decor, furnishings and electronics, but since it is an older hotel, it was only slightly rough around the edges (wall, window, older bathroom). The hotel offers a cute pillow menu, which we didn't take advantage of, unfortunately. The bed was a little stiff for my liking, but my husband had no problem with it in the least. There is an adjacent restaurant (which we never used) and a tiny bar where we shared a drink and watched a football game. The tour desk was helpful in providing us MUNI passes, information regarding booking a rental car (we decided against it in the end), maps and brochures for area attractions and securing a limo for the ride back to the hotel. The most important thing, however, was that it was very clean and comfortable and of course, in an excellent location off Union Square, near all the shopping and dining you could want and across the street from Starbucks (bonus!) and a few doors down from Walgreens (when your feet and back are dying for Advil after a whole day of climbing hilly streets). If you are looking for an affordable, clean, safe and centrally located hotel while staying in San Francisco, with a bit of old charm and a cute little ducky to perk up your bathroom, you cannot go wrong with the Chancellor Hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Claire Goodwin","date":"2012-06-05 06:48:07 +0300"},{"content":"We enjoyed our stay at the Chancellor, the location was excellent. The gent at the tour desk was very helpful and gave us very detailed information about where the many sights were and what transport routes to use. I can only just repeat what the great reviews have already said, which are spot on! I would recommend this hotel and would stay there again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Quincy Kautzer","date":"2015-09-17 15:43:13 +0300"}],"public_likes":["Lexus Runolfsson"],"vacancy":true,"description":"Macklin Street. Standard and En-suite rooms available. rates inc Breakfast and parking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}