{"title":"Santa Monica","name":"Ambrose Hotel","address":"1255 20th St","directions":null,"phone":"+1 310 315-1555","tollfree":null,"email":null,"fax":null,"url":"http://www.ambrosehotel.com","checkin":null,"checkout":null,"price":"$175+","geo":{"lat":34.03034,"lon":-118.48152,"accuracy":"ROOFTOP"},"type":"hotel","id":26493,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"Great Location, right around the corner from the Hollywood Entertainment complex and the metro stop (goes right to Universal Studios). First room on bottom floor was dirty and the mattresses were way tired, asked for a room on a higher floor, second room much better, recently redecorated, worked well for self, spouse and two teenage kids. Staff was super helpful, let us use their printer to print out Alcatraz tickets for second leg of trip in San Fran. We had a great time walking to (one block) and cruising up and down Hollywood Blvd and driving the Sunset Strip, Rodeo Drive, Bel Air, etc. THis Hotel was easily accessible from everywhere. Save your money on the hollywood bus tour, buy the $5 map and drive it yourself at the beginning of your trip to orient yourself to the area. It's almost impossible to get lost from this location. .","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":5.0},"author":"Raul Marquardt","date":"2013-01-30 00:09:02 +0300"},{"content":"We repeated our stay. Again, location was great for visiting UCLA and taking buses to Getty Villa and Getty Center. There is no parking at the hotel, and do not park in front of the hotel; you will get a ticket. So this time we flew into LAX and took the FLYAWAY shuttle and were within a few blocks away from the hotel in no time. No need to rent a car if you are visiting UCLA and Westwood area. No in-room TV (a good thing), computer, or shampoo; older bathroom and room, but kept clean by very friendly and efficient housekeeping staff. Looked like room and bathroom have been repainted and repaired. For food, Trader's Joe and Raley's are nearby and lots of good restaurants around such as Noodle Planet, one of our favorites. There is a microwave, fridge and free coffee and tea at the hotel for guest use. So if you don't mind a simple, old but relatively clean place with characters and be aware of a few things, you will be fine in a most welcoming place ran by friendly staff: Scott and Leon. For the total price of $88 per night for two in Westwood Village, it's an excellent deal.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Jensen Fahey","date":"2013-07-30 00:27:49 +0300"},{"content":"We were placed by an airline at the Westin LAX after our flight was cancelled. In all honesty, we had fairly low expectations given that we were staying on the airline's dime and given that the hotel is just minutes away from the airport. We could not have been more wrong. We were exhausted and grudingly visited the hotel restaurant. Much to our surprise, the hotel restaurant bar and eating area was packed, and not by convention visitors staying at the hotel I might add. Indeed, we learned that the restaurant is frequented by locals and based on our experience, I can see why. The food quality was exceptional as was the service. I especially liked the healthy choices on the menu. Our room was also terrific. Clean, incredibly quiet which is amazing considering the the hotel is located on a strip between two LAX runways, and very comfortable. We loved watching planes land one after another from our hotel window. We arrived following an international flight and didn't have a dime of American currency to tip the bell staff. Still, they could not have been more gracious. The service was of such a high quality that we made an effort to find an ATM so we could tip accordingly before departing. This is a place where service with a smile still means something. Everything worked like clockwork, from the high quality restaurant meal to the efficient check in. I will make a point of seeking out this hotel on our next trip to LA.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Tremaine Hammes","date":"2015-12-04 03:16:38 +0300"}],"public_likes":["Lance Beatty Sr."],"vacancy":false,"description":"While 20 blocks from the beach, the Ambrose Hotel offers great style and comfort for less than the large beach-front hotels.  Very convenient if visiting someone at St. John's Santa Monica Hospital.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}