{"title":"Paris/La Défense","name":"Hotel Pullman Paris La Defense","address":"11, av de l'Arche","directions":"North of CNIT and Grande Arche, accessible via a system of concrete walkways","phone":"+33 1 47 17 50 00","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":48.89499,"lon":2.23898,"accuracy":"APPROXIMATE"},"type":"hotel","id":21875,"country":"France","city":"Courbevoie","state":"Île-de-France","reviews":[{"content":"Let's get my only complaint out the way. Plain white bed linen without decent cover makes a room look unfinished so walking into my room, I was decidedly underwhelmed...after all this is The Ritz!! Bar that one moment, the rest of our stay was magical. We stayed on the club level...best $100 upgrade ever! 5 Meal presentations per day and an open bar...does it get any better than this? The concierge staff are the best. They were warm and friendly and made us feel at home. The Hotel and grounds are spectacular. Pools and jacuzzis were immaculately maintained. A short walk down to a secluded white-sand beach with full service. Everywhere we went we were greeted with a warm ALOHA! I could have spent the entire vacation just there but Maui has so much to offer. The location is a little out of the way which is both good and bad but the buzzing resort town of Lahina is a just short ride away. Alas, I am now back in Memphis. We went from 80F on Saturday to 22F on Sunday. But the memories will sustain me until I return!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dayne Haag","date":"2015-02-21 10:03:12 +0300"},{"content":"We spent seven nights at the Ritz Residence Club and then moved to the Hotel for 4 nights. They are both fabulous. We were on the club level for the hotel and the food was astounding. Breakfast each day in The Terrace was great with a sample of that days special smoothie. Room was a suite with large bathroom and overlooked the third hole of golf course. Residence Club was a large three bedroom, 3.5 bath. Fully furnished kitchen, gorgeous kitchen, Pool was incredible. Staff was wonderful at both places. I cannot","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kayla Torphy PhD","date":"2015-03-08 11:12:14 +0300"}],"public_likes":["Favian Abernathy","Leon Klocko","Margarete Lowe"],"vacancy":false,"description":"Renovated in 2013 as a part of Accor's initiative to refurbish all five Pullmans in Paris. Less expensive rooms retain much of the 1990s-style furniture, while the more expensive ones conform better to the current Pullman corporate standards.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}