{"title":"Los Angeles/Northwest","name":"El Tres Inn","address":"4439 W Sunset Blvd","directions":"above El Chavo","phone":"+1 323 666-6351","tollfree":null,"email":null,"fax":null,"url":"http://www.eltresinn.com","checkin":"3PM","checkout":"noon","price":"$150-225","geo":{"lat":34.097774,"lon":-118.286118,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":35075,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"Hotel is nothing spectacular but I always stay here when I travel to PR for business. Has good breakfast that's included in my rate and have tons of restaurants nearby. Rates are cheap. Located in Old San Juan so can walk to see the main tourist area on the island. Pool on roof. Fitness center kind of sucks.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Mr. Stephon Howell","date":"2012-05-18 10:29:32 +0300"},{"content":"The Sheraton in Old San Juan was great. The hotel was clean and the staff was so friendly. I felt like they were having a contest or something to see who could be the nicest and most informative about the city! Another bonus was the rooftop pool and the workout facility overlooking the dock where the cruise ships dock. You can walk from the hotel to any of the great restaurants.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Talia Stroman","date":"2012-06-29 03:51:22 +0300"},{"content":"Had a great time in San Juan and the Old San Juan Sheraton could not have been a better place to stay. The staff were excellent. There is a new \"green\" policy that lets you decline daily maid/linen service..Great idea. There have been negative comments about this hotel but imho knock it off. Ignore any negatives and enjoy this place. Room 633 had a \"juliet balcony\" with view of the cruise ship docks.Again just great and I can heartly reccommend it. I am a senior and the peace and quiet, consideration and helpful suggestions from the front desk and T. Schmidtz were much appreciated.. Go and have a good time..","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brown Heathcote","date":"2014-03-19 07:15:01 +0300"},{"content":"We arrived around 11 AM after not sleeping during the night on a red-eye flight from LAX and were told we would have to wait for our room, and that many others were ahead of us from much earlier in the morning (despite reserving directly with hotel and stating we would be an early arrival and being a Hilton Honors member). We took a few bags with us that we did not want to leave with bellman (laptop and purse/cameras) and found a place for lunch that was so-so after walking up and down some streets when a local resident recommended a place to us. The map the hotel clerk had given us and mentioned place for lunch adjacent was closed. We went back to the hotel after lunch, and were told by another desk clerk we had to wait and that many others ahead of us, but then fortunately the woman desk clerk (she had talked to us initially to check in earlier) said okay to let us have our room. We had booked one overlooking the bay. Once we had our room we immediately crashed to sleep for hours. Later we went out for dinner and walked along Paseo de la Princessa which was a delightful introduction to San Jose in the evening with beautiful fountains, music, and vendors - totally enjoyable. Back to the hotel for a good night's rest before taking a taxi to go to the Celebrity cruise ship at another pier the next day. The room had a safe so we could lock up valuables and hotel was in a good location. We ate breakfast at the hotel in the morning which was decent (but expensive) and wait staff was not attentive to refill coffee or water or take order. In summary, good hotel in nice location but don't expect great service. I had to use my data card as I could not get Internet to work.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Mrs. Lane Altenwerth","date":"2013-06-26 17:01:05 +0300"},{"content":"Stayed in one of the Governor's suites prior to embarking on a cruise. I booked the G-suite after I figured out it would accommodate our group of 3 adults and 2 kids and be cheaper than 2 rooms. The suite was very large including a king sized bedroom and a massive entry/dining/living room area with great views of the city and port. We had a roll-away bed brought up and between that, the king bed, and the sofa pullout had room for all. The location was great for our needs. We were able to hike around OSJ and then when it was time to get on the boat we literally walked across the street. I have 2 issues with the place. First is that standards of cleanliness are not on par with other Sheraton's. Not flithy, but just not completely clean. Second, is that the decor and furnishings were in my opinion not up to \"Governor\" standards. The furniture was a bit worn and some of it really did not match with the decor, minor point no doubt. If you are booking the suite for the lap of luxury look elsewhere, if you want a big place to spread out this is it.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Verdie Connelly","date":"2014-04-21 23:30:13 +0300"},{"content":"I purchased the room via priceline at a bid of $100.00 per night. Stayed 2 nights. Hotel is located right at the port for Carnival Cruise Line which was great as I stayed 2 nights prior to sailing. You can actually walk to the pier if you do not have much luggage and can walk a distance. However I took a taxi. $10.00. Service is great especially the doormen. There is a trolly stop 1 1/2 blks from hotel which is free. There are 2-trolley routes (2-buses), 1 trolley is enclosed which will take you to all the shopping in Old San Juan. You can hop off/on throughout the route. The bus run frequently!! The other trolley route, an open air trolley will take you to all the historical sites, i.e. the fort, museums, etc. Both of the trolley begin and end at the same location wihich is 1 1/2 blks in either direction of the Sheraton. There is a great restaurant behind the hotel called Latin Roots with great food. You must try the Roasted Pork which you will see a whole pig roasting in the window. You can get a combo which is 1/2 lb. pork and 2-sides for $12.00, or 1/2 lb meat only for $8.00. Inside the hotel is Chicago Beef Co. with good burgers if you must eat at hotel. The swimming pool at the hotel is on the roof with and excellant view of the Bay and the ships. Its great for enjoying the sun and relaxing and a nice pool and whirllpool. Very nice and quaint. Finally, the room was nice size and the beds at the Sheraton are really comfy. There is a casino at the hotel also if you are a gambler and they serve free drinks while gambling. I would highly recommend staying here if you want to be in Old San Juan. Great location, and great accommodations!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Sarai Fritsch","date":"2014-05-09 03:24:12 +0300"},{"content":"I hate writing negative reviews, but there is little to compliment about this hotel. The lobby constantly smells of grease and fried food (not sure why). One of the two treadmills was broken and when we reported it to the front desk, they shrugged. One morning we were awoken by the maid service before 8 a.m.; the next day they never came. We had to call the front desk three times that evening before someone came to drop off clean sheets and towels (though they did not offer to make up the beds or clean up). Other anomalies about this hotel include barking dogs in the hallways in the early morning(?); lots of small unsupervised children screaming in the gym and the pool. Because I have the Starwoods Credit Card, I typically stay at Starwoods properties (LeMeridien, Sheraton, W, etc.) This one felt more akin to a motel than a multi-star hotel.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Mrs. Coty Beahan","date":"2012-12-30 10:00:03 +0300"},{"content":"stayed here 1 night, post cruise....nice hotel in old town....there's alot to see, do, eat, and drink nearby.....pricelined for $145 w/tax on a friday night.....even got a room on the 9th floor facing the harbor...quite nice of them...would definately stay here again...","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Tiara Reichel","date":"2012-02-19 15:55:06 +0300"}],"public_likes":["Herta Hermann","Carmine Langosh"],"vacancy":false,"description":"An urban hideaway located in the heart of Silver Lake, and probably the coolest option in the area.  Deluxe suites with private balconies, large flat screen TV's, turntables stocked with vinyl, iPod docks, kitchenettes, free parking and Wi-Fi.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}