{"title":"Chippenham","name":"Angel Hotel","address":"Market Place, Chippenham, SN15 3HD","directions":"Exit ''M4'' at ''Junction 17'' and head southwest on dual carriageway''(A350)'' for 2.5 mi. At the roundabout, take the 1st exit continuing straight onto ''Malmesbury Road(B4158)'' for 1.2 mi. At the roundabout take the 3rd exit, turning around the ''The Bridge Brasserie'' onto the ''B4069'' for 282 ft. Continue onto the ''New Road(A420)'' (joining one way system) for 0.1 mi, get in the right hand lane. At lights, follow sign for ''Town Centre'' (under furthest railway arch) for 0.2 mi. At the roundabout, take the 3rd exit [follow sign to ''Calne A4''] onto ''Avenue La Fleche(A4)'' for 0.2 mi. Turn left onto ''Gladstone Road'' for 430 ft. The drive in entrance to the hotel is on the left","phone":"+44 1249 652615","tollfree":null,"email":"reception@angelhotelchippenham.co.uk","fax":null,"url":"http://www.angelhotelchippenham.co.uk/","checkin":null,"checkout":null,"price":"Rooms from £86.35 (Book using a discount site for best deals)","geo":{"lat":51.4576604,"lon":-2.1145436,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5839,"country":"United Kingdom","city":"Chippenham","state":null,"reviews":[{"content":"We stayed in this hotel for 5 days. Our room was clean, well cared for, and serviced promptly when needed. Breakfast, included with our room charge, was exceptional -- a buffet with the choice of an omelette, if desired. We had dinner one night, and all four choices were excellent. A Starbucks coffee kiosk was open early in the morning, and provided good coffee. Pet friendly, in my opinion, means no additional charge, if there is no service required, and provided there is no damage. This hotel meets the standard. There is a park a short block away for walking the dog, doggie cookies are available, and strokes to friendly dogs are liberally applied. Parking is a downside in this facility, as the hotel offers only Valet Parking at $32 per day.Initially, I accessed the self park option in a parkade across the street, but ultimately opted for the valet option -- the staff were friendly, helpful, and prompt when I needed to access my vehicle. The lack of a charge for my pet and the exceptional breakfast offset, in my opinion, the fee for the parking. I stayed at this facility, as my dog was not accepted at the Kona Kai Resort, where I was attending a meeting. Being a senior was of benefit in establishing the rate I was charged. The rates here are competitive, and the food and service here were of a very high quality. We had our best meal in San Diego in the restaurant at the Westin. I would highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Wilbert Schmeler","date":"2014-11-29 18:59:52 +0300"}],"public_likes":["Ryann Russel","Jodie Hickle","Layne Wolff","Dana Kessler","Alanis Murray"],"vacancy":true,"description":"A 17th Century coaching inn, extensively refurbished with a blend of traditional and contemporary style. 50 en-suite bedrooms, including: 4 four-poster bedrooms, 2 bedrooms equipped for guests with a disability, 32&quot; LCD TV with Freeview and Sky Sports 1 in all rooms, complementary WiFi in all bedrooms and public areas, private dining rooms, brasserie, 2 bars, 4 conference rooms, wedding receptions, heated indoor swimming pool and gymnasium and free parking","alias":"Best Western Plus Angel Hotel","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}