{"title":"Culver City","name":"Radisson Hotel Los Angeles Westside","address":"6161 W Centinela Ave","directions":null,"phone":"+1 310 649-1776","tollfree":"+1 888 201-1718","email":"rhi_cuca@radisson.com","fax":"+1 310 649-4411","url":"http://www.radisson.com/culvercityca","checkin":null,"checkout":null,"price":"Rates start around $130 per night","geo":{"lat":33.98216,"lon":-118.3971,"accuracy":"ROOFTOP"},"type":"hotel","id":7062,"country":"United States","city":"Culver City","state":"California","reviews":[{"content":"i live in Italy and i love Vegas and especially the desert arround :If one day i will go back The Stratosphere Tower is the best place to see the city until the desert just beautifull Fernando ciao","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":4.0},"author":"Alden Mante","date":"2014-08-08 20:11:25 +0300"},{"content":"Room were clean. No smell of smoke. Got to go to the top and view the sights below since we were staying in the hotel. Would stay here again, even though it's far from the main action of the strip. Concierge staff were very friendly and helpful.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Norris Murray","date":"2012-01-29 15:04:08 +0300"},{"content":"We had booked a suite as we were travelling with kids, but found that the sleeper-sofa was actually a sofa. Room was changed without any fuss and we found check in staff to be very friendly. Breakfast buffet had a decent selection and as we were down to the buffet early, everything was very fresh. The drink/plate service was hit and miss depending on the individual worker. The interior of the hotel and the rooms are a bit dated but when you consider the low cost of the rooms, the overall experience is worth the money. I would probably not stay again unless I was on a tight budget.","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":3.0,"Value":4.0,"Service":4.0},"author":"Shad Erdman","date":"2014-01-24 08:59:25 +0300"},{"content":"stayed here on 2 separate occasions in July 2011. once for 2 nts and again for 5 nts. first time got newly remodeled room in select tower for a rate of less than $40 !!! room was nice and clean. modern. had mountain view which was fine. im not in the room that much so not partial to strip view always. only complaint is I was on non-smoking floor and it reeked of people smoking weed. yuk. second stay they told us they had a \"nice room\" for us. well it was an older not remodeled room and it was smoking. it smelled of 30 yr old permeated smoke and everyone on the floor must have been smoking weed because it was coming thru the vents. it was disgusting. I'm not a smoker and couldn't breathe the first nite. I went to front desk and got a non-smoking room the next morning. they switched it and we got a strip view but still an older room. it was ok. again we got very good rate of less than $45. cons: bad neighborhood. do not even think of walking around hotel except out front entrance. also they hold $50 per nite for incidentals and it takes dome time for it to go back on. rudest people I have ever experienced at any starbucks working at the starbucks inside hotel. ridiculous. if u can get it cheap stay here but don't even consider paying more than $75 - not a great pool and poor strip location. you need a car if u plan on staying here.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":2.0,"Rooms":3.0},"author":"Anita Baumbach","date":"2014-01-08 06:07:43 +0300"},{"content":"Scouted out lots of hotel deals before choosing the Stratosphere. Yes the Excalibur, Circus Circus and Luxor were cheaper but the reviews I read about them were not pleasant. Stratosphere was a little more expensive but was an excellent choice, and it included our ride to the top. Not the rides but hey, I wasn't going to ride any of them. The room was great, and it was even better to find a restaurant open at 3:00 a.m. when our bodies told us it was still 7 a.m. in Boston. Check out this hotel, it's worth the quietness too.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Ms. Abigale Jacobi","date":"2015-08-11 09:18:29 +0300"},{"content":"I stayed here 4 different times from 2007 on. Sadly, each trip seems to get a little worse. I don't think I will return to this hotel any more, but I did enjoy it when it was cleaner and more customer friendly. PROS: 2+ shows running at all time, scary amusements at the top of the tower, yummy and fancier food at Top of the World restaurant, great views from the Tower, cheapest cab ride to Freemont from the strip, great for staying up late in the night gambling CONS: Resort fees are the pits! Also, it's a wasteland any more at the end of the strip. I hope they start rebuilding... but the economy needs to get better. THE CLOSEST CASINOS TO HERE ARE RIVERIA AND CIRCUS CIRCUS. If you haven't been to Stratosphere, consider the amount of walking you'll need to do to get anywhere. It's not as close as it looks on the map. Now that the Sahara is closed, monorail stations may be even further away once that station closes.","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":3.0,"Value":3.0,"Service":3.0},"author":"Susie Anderson","date":"2014-08-23 22:21:03 +0300"}],"public_likes":["Emmie Harris","Kiera Hudson","Marley Haley"],"vacancy":true,"description":"This chain hotel is located close to the 405 freeway and is a ten-minute drive from the LAX airport.  Amenities include free high-speed internet access, pool, fitness center, free airport shuttle, meeting spaces and dining.  Those expecting a five-star experience will be disappointed by the relatively basic rooms and somewhat dated elevators and floorplans, but despite a bit of age this hotel offers an upgrade over many of the area's other motels.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}