{"title":"Nice","name":"Hotel Anis","address":"50, Avenue de la Lanterne","directions":"near the airport","phone":"+33 4 93 18 29 00","tollfree":null,"email":"info@hotel-anis.com","fax":"+33 4 93 83 31 16","url":"http://www.hotel-anis.com/en/index.htm","checkin":null,"checkout":null,"price":null,"geo":{"lat":43.679307,"lon":7.2241902,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":20420,"country":"France","city":"Nice","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"The hotel was very nice. The staff was very friendly and helpful. Breakfast was good and they went out of their way to make sure everyone was finished and had all they needed before closing up the breakfast area. The room was clean and comfortable. There was a little wear showing in the bathroom but nothing unacceptable. The pool was warm but only 3 1/2 feet deep. They had a hot tub and a workout room. The location was good but a little bit hard to find if you didn't have a printed map with directions. With the directions we had no problems finding it. You had to wind through a residential area and appartment complexes. It was right near the Gallaria mall and close to the freeway. One evening my two children and I arrived back at the hotel probably about 11:30pm and we were approached in the parking lot by a nicely dressed man saying he and his wife were stranded back on the highway and his family was in Ohio and they needed money to stay in a neighboring hotel. They were short $16.00 and could I help them out. I gave him $20.00 and hurried into the hotel. Legitimate? who knows, well probably not but I figured 20.00 was worth there being no scene or other problems with my kids there. I didn't really feel unsafe and the parking lot was very well lit. This hotel is directly next to an Embassy Suites and a Motel 6 so there are other hotels in the area. We would probably stay here again but I would be ready to get inside the building right away after parking!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Ara Okuneva","date":"2014-05-23 05:22:41 +0300"},{"content":"My husband and I just spent 4 nights at this hotel and overall we were very disappointed. Mostly from two things - our air conditioner was SOOO loud, it sounded like an airplane engine. We were going to change rooms but figured they would probably all be that loud. Not only was it loud but also rattled - so annoying. But that wasn't the worst part, we got up on our second morning and walked to our car and see some people standing around their car and they asked if our car was ok because their truck's passenger window had been smashed out and items were stolen. Luckily our car was fine but we felt really bad for them. Then the hotel never cleaned up the glass, it was still there when we left this morning! The location of the hotel is not great. It is confusing to find, confusing to get on I-75N from, and there is a sketchy apartment complex right behind it with some creepy/sketchy people walking through the parking lot at all hours. No wonder you have to use your key card to access the front lobby after 9pm! The only good thing about the place, the price and the room layout. You have a separate living room area and separate bedroom area. Too bad the air conditioning is only in the bedroom area so that made it difficult for the living room to get cool enough. Oh, one last thing, you should bring an eye mask if you want to sleep in, the windows didn't have heavy curtains to keep the room dark. Only sheer curtains, I couldn't believe it. Anyway, I hope this helps you decide if you want to stay here or not. I would personally suggest staying a little more north - like at the Hampton Inn or Holiday Inn Select (along 75 in Richardson).","ratings":{"Overall":2.0},"author":"Sallie Lebsack","date":"2015-04-08 03:32:07 +0300"},{"content":"Hotel staff was very friendly and accomodating, though most of the housekeeping staff does not speak English. Room was clean except for one spot on the bedspread but I never use hotel bedspreads anyway, so it wasn't a big deal for me. Everything else was fresh and clean. Entire hotel is non-smoking which is a major plus for me. Pets are allowed with a deposit but if people actually take their pets there, you'd never know it. There was no smell at all nor did I have any issues with allergies from pet dander. Beds and pillows were VERY comfortable. Rooms and hallways were very quiet. We never heard our neighbors or any outside noise at all. Windows do open but it was too warm for us to take advantage of that. When we checked in the AC had already been turned on for us so the room was nice and cool - perfect after such a long drive. Hot tub and pool area were very clean and no too many people used them. However, the chlorine smell was VERY strong and caused some eye and allergy irritation for some of us - even those who didn't get into the water. We were able to prop open the emergency exit door to the outside and it got a little better. Room has a fairly low ceiling so if they used better ventilation or had a higher glass ceiling, it might not be so bad. Also, there is a lot of echo in that room - more than you'd think - and it's hard to carry on a conversation, even in the hot tub. Continenal breakfast included make-your-own-waffles and the waffle iron was shaped like Texas, which everyone thought was cool. Also had a limited selection of bagels, english muffins, bread for toast. Bananas and apples were the fruit choices. Small boxes of Kelloggs cereals available. Also had sausage biscuits, breakfast burritos and sausage/pancake corndogs that could be microwaved. No microwave in the rooms but the breakfast room was open 24 hours so you could use that if needed. Several restaurants and fast food places close by. Also not far from both Kroger and Walmart Supercenter. Overall, not a place I'd go if I was looking for a vacation where you relax at the hotel- rooms are fairly small but adequate for sleeping. Double queen room does not have enough room for an added rollaway, for example. But for an on-the-go vacation where all you need is a clean comfy place to sleep, a decent breakfast and that's convenient to everything, this is a great choice.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":4.0},"author":"Larry Klocko","date":"2014-04-02 02:22:50 +0300"},{"content":"We have stayed at this Fairfield Inn six times, the most recently in September, 2006 during a househunting trip. We have never had a bad experience there. The front desk staff is always accomodating and pleasant, the rooms are clean (love the queen sized beds), and the pool area (an indoor pool) is very nice! The location is also very convenient - you are 10-15 minutes away from Presbyterian Hospital, Plano, Northpark Mall, and Garland/Mesquite. And the room rates with AAA discount are always an unbelievably good deal. We highly recommend this hotel.","ratings":{"Overall":5.0},"author":"Henry Sporer","date":"2012-10-11 03:10:30 +0300"}],"public_likes":["Deangelo Jacobi","Bailee Batz","Ms. Linwood Kuvalis","Niko Hackett","Paul Connelly","Maribel Kertzmann","Mariam Ziemann"],"vacancy":true,"description":"Swimming Pool, Restaurant.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}