{"title":"Liverpool","name":"Novotel Liverpool Centre","address":"Gradwell Street, 40 Hanover St","directions":null,"phone":"+44 871 663 7816","tollfree":null,"email":"h6495@accor.com","fax":"+44 20 8283-4650","url":"http://www.novotel.com/gb/hotel-6495-novotel-liverpool-centre/index.shtml","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.40296,"lon":-2.98412,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15915,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"My husband and I recently stayed at the Intercontinental San Juan in a club room that we paid a good bit extra for. Perhaps \"my bad\" for not inquiring what exactly that entailed, but in our minds, we equated club level with club levels we have experienced at other chains: continental breakfast, evening hor d'oeuves, etc. None of that here. Nothing but some coffee and hot water for tea that seemed to be put out after 8 a.m. and seemingly never refreshed. Apparently they discontinued the services we were expecting on January 1st. The room itself was nice (tv could use some upgrading, and the ventilation is awful, so be forewarned, if your neighbor smokes in this nonsmoking hotel, you are going to feel like you are smoking too), the hotel was nice, service was excellent. The halls in the club level did smell mildewy and moldy, but it's on a beach, so not totally unexpected. Pool area and beach were more than adequate. The gym had plenty of equipment although in a somewhat small space; oh, bring your headphones for the tvs on the cardio machines, they do not provide them. I can recommend this hotel if you get a good deal (warning: there are tons of extra fees, but that was made very clear to us when we booked), but I cannot recommend club level. Save your money.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":1.0,"Location":4.0,"Rooms":4.0},"author":"Stella Doyle","date":"2015-12-01 03:10:39 +0300"},{"content":"My wife and I stayed for 6 nites last week and really enjoyed this hotel. We used a local travel agent who set us up with a pretty sweet deal. Ocean view, breakfast everyday, and all the 'resort fees' etc. for a very resonable price. (You have to try the banana pancakes!) The room was done well, modern and very clean. GREAT bed, flat screen TV and nice bath. You can tell it's an older property that has been kept up and improved very recently. Great pool area, (arrive early to save the best placed loungers) public spaces and a very nice business suite on the 3rd floor. From James the front door bellman to sweet little gal who hosts breakfast at Alfredo's -the staff was VERY courteous and VERY helpful. All in all a very relaxing hassle free time! I'd go back to the Intercontinental the next time.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":4.0},"author":"Callie O'Reilly","date":"2013-12-31 12:02:08 +0300"},{"content":"Not the Intercontinental quality that we were expecting.. a rather disappointing experience. The room had a funny smell and things were falling apart.. The staff was not too helpful. The place was very loud in the evening - felt more like a college dorm rather than an upscale hotel. The cleaning ladies were barely doing their job.. On the plus side, the beach was beautiful.","ratings":{"Overall":2.0},"author":"Jonatan Turner","date":"2013-11-17 01:47:31 +0300"},{"content":"We stayed at the Intercontinental for 2 nights before our Southern Caribbean cruise. We were met by a wonderful staff, always with a smile and a greeting. The entire staff were friendly and helpful. The hotel itself was beautiful, and our room was spectacular, very clean, with a comfy king size bed. The pool area was great, the pool itself was phenominal with a waterfall and a swim-up bar. The hotel is situated on the beach, which is a short walk from the pool. We had a great time and I highly recommend this hotel to anyone. The only downfall is the food prices at this hotel. However, there is ample food choices for the bargin hunter just across the street.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":4.0},"author":"Jakayla Armstrong","date":"2015-01-21 11:00:48 +0300"},{"content":"We had a great getaway and highly recommend the Intercontinental! Highlights: A very well kept and professionally landscaped pool area. Open 24-7. The beach is very well maintained also and only a few steps away. (The hotel is on the beach) Many excellent places to eat at the hotel and plenty of more affordable eateries within a very short walk. Excellent service in every area. Clean rooms - clean hotel. Very adequate fitness center. Spa appeared to be adequate although we never used the services. The hotel even set up a large screen television and showed family movies each night -with free water and popcorn for the kids. Concierge service was very helpful with maps and driving directions and bus information etc. (tour info too - although we preferred to go it on our own - mostly). There is an Avis car rental at the hotel. We used the free wireless internet to make our auto reservation, taking advantage of discounts. Service was very good there as well. We had excellent service without exception. We had a very safe and enjoyable time! We booked at this time of year to have a relaxing vacation during a \"slow\" time. Our goal was to relax, take it easy and not try to do too much. We made no firm plans - other than the flights and hotel - but had a few activities in mind, if we felt like it. We stayed five nights beginning September 8th. The taxi ride from the airport was very short($11.50 plus $1 per bag). Check in was smooth and timely. The representative did advise us, however, that there was a apx $10 per night service fee that was not collected by \"Priceline\" that would be collected a check-out. There were no other suprises. Being \"Priority Club\" members we asked to upgrade to an ocean front view room. After declining to purchase the upgrade we were upgraded free of charge. The view was wonderful! The restaurants at the hotel are top notch, steakhouse (Ruth's Chris), Japanese (MomoYama) and Italian. There is a pool bar and a restaurant/ bar with a large deck right on the beach. The restaurants, and \"pool drinks\" can become pricey fast. No worry, there is a small market across the street and Walgreens right down the street (either direction). And we had a mini fridge in the room! (which we stocked with bottled-water and diet Coke purchased outside the hotel) There are many affordable eateries all within a short walk: Mi Casita's (Local), Subway, Burger King, Wendy's, Church's, Lupi's (Mexican), Baskin-Robbins (ice cream), Taco Maker, Chinese ... We did eat one night at the Italian place at the hotel and had great food and service. We had the best of both worlds - We mainly went to the pool and beach each day ... and enjoyed the hot-tub each night. And we had the best of both worlds here too - pool and beach! Although we did not, there were Jetski rentals available on the beach by the resort next door. Although we brought our personal snorkle gear - we did not snorkle and I got the impression that for really \"good\" snorkling we would need to go elsewhere. Nevertheless, a great beach and water right outside your door! We did go to Old San Juan one half day. You can rent a car, take the city bus (easy and safe - just don't go late) or pay for a cab. We rented a car one day as well and drove to the National Park/ rainforest . (about 45 minutes drive - tops - use the toll road!) The conceirge and all the staff were very helpful with questions to help plan with these activities. Check-out was uneventful and prompt as well as the taxi to the airport. Just a wonderful, and clean place with good service. Our first time ... but hopefully not our last ... David and Tammy","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Hal Gerhold","date":"2012-08-10 02:49:19 +0300"},{"content":"My boyfriend and I have been planning our wonderful romantic get a way about 4 months in advance, after much reviews from tripadvisor, travelocity and everything else i could find we finally decided to travel to San Juan. It was a quick flight for both of us and we knew we wanted to stay somewhere fun and yet romantic at the same time. We choose to stay in Isla Verde and Im glad we did. All the beaches in P.R. are public and this particular beach, is lined with a strip of hotels. Upon arrival to intercontinental we were greeted by HELPFUL, sweet and really nice bell hops and service guys. We arrived early before check in which is 4 pm. They took our bags, allowed us to check in, and use their facilities while we waited for our room to get ready. We strolled the hotel, which is beautiful. It has an amazing pool and jacuzzi, a spa, 24 gym, and the beach is right in the backyard. There are many restaurants to eat at. Now at Intercontinental, im sure you can book the cheapest room and have the same experience. We purchased a laguna room and we face the front of the city towards san juan. You can see the city lights and sky at night from our balcony. This time of year seems to be tropical rainy season, which we had for the first 2-3 days but it doesnt last long, usually at night, and even if it kinda ruin your plans for the day, your room and the hotel is a great place to stay. We didnt eat much here at the hotel because we know it is expensive, but this ave is a strip full of hotels and shopping area. Right across the street there is a little center. There is ponderosa food (which is kinda like a buffet salad bar, finger food type place), lins chinese which is excellent, and this puerto rican home cooked style place called Mi Casita, which my bf and I particular loved, the food is great and the price is reaaaallllyyy cheap. We had breakfast 1 morning, and it was only $12 for the both of us, they give you really good food and the right portion. They are open from 7am-10pm, most places here close @ 11pm so make sure you eat according to time. There is also wendy's, burger king, a little supermarket, a walgreens a few blocks down, (make a right when you exit the hotel in front entrance). For night life, we went from hotel to hotel. Intercontinental is classy and sophisticated, but if you need a dj, bar, lounges and music, head to El San Juan Hotel, which is left from intercontinental. They have a huge hotel lobby which is fun and exciting, the dj plays music and there is also a house band for a more local experience. There is also lounges and alot of bars, dress to impress at these places. To the right of intercontinental, at the water club approx 2-3 blocks down, then a sharp right.. there is a restaurant called Tangerine/ Liquid. And a roof top sushi bar on the 17th foor, open roof that overlooks the ocean. Prices are ok. There is also local shops, bars, grills and other places on this avenue. For a Local experience, head to old san juan. We took the bus, it was just like a NYC bus. 0.75 cents to the last stop takes you to the bus terminal downtown. Be prepared to walk. We walked the tourist area where the cruise ships dock and also made our way to the historic sites, by the forts which was $3.00 per person to enter, definitely worth it because it was fun and you get a great view of San Juan. El Yunque Rainforest is a must. There is a half day trip from 9:30am-3pm. Its $57.00 a person through the hotel. The tour guide picks you up, gives you a tour while driving, a cave trip, history of P.R., rainforest info, and waterfall treats. This rainforest is about a 1.5 hr trip. Alot of walking, defintiely a cardiovascular workout, uphill and downhill through the forest, very beautiful and romantic .. a must see.. we stopped for lunch at a local place right by the rainforest for what i thought was some of the best P.R. food ever, definitely try the beans and rice with fried chicken and sweet plaintains, ($1.00 items -$6.00) other packages include 3 trips, the rainforest, beach and a nite rafting trip, supposedly the water illuminates in the nite while you boat near the forest. Food on the Hotel: we ate by the beach, at Splash , mostly wraps, finger foods, salads.. good food. drinks and food from $12. other than that, we didnt do much, the casino is not as big as some other hotels but if you dont like to gamble much like me, its ok. You can hotel hop, and no one I.D.'s you , you can enjoy the facilities everywhere. overall this was a great experience and i hope if others are like me, i hope this helped. I thought the service was great, the customer service was excellent, we never had a problem and if we did they were more than happy to help us, very friendly and CLEAN.. our rooms were cleaned everyday with new towels and linens. coffee maker, ice bucket, fridge, safe, iron, alarm clock (ipod home) and cable t.v. in room. official website and pics are accurate.. a beautiful experience!! and complimentary wireless internet from every room which i am submitting this review since we are leaving tomorrow :) we didnt rent a car but if you feel you need too, the hotel has an avis hook up in the lobby where you can get , if you need to or change your mind 24hr rental for about $40 .","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Aliyah Friesen Sr.","date":"2013-07-14 13:04:32 +0300"}],"public_likes":["Chyna Kertzmann","Aiden Schultz","Edwina Macejkovic","Skye Mante","Stephania Friesen"],"vacancy":false,"description":"209 bedroom city centre location, Restaurant, bar and pool, 10 minute walk from Echo Arena.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}