{"title":"San Francisco/Golden Gate","name":"Jackson Court Hotel","address":"2198 Jackson St","directions":"at Buchanan St","phone":"+1 415 929-7670","tollfree":null,"email":"ej@jacksoncourt.com","fax":"+1 415 929-1405","url":"http://www.jacksoncourt.com/","checkin":"2PM-7PM","checkout":"11AM","price":"$160-$230","geo":{"lat":37.7931,"lon":-122.4311,"accuracy":"APPROXIMATE"},"type":"hotel","id":25812,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Not a 5 star, expect 4 star and no more ! Mixed Reviews - Explanation-We have been on over 40 all inclusive vacations. We have been to Punta Cana 6 times. We always book a 5 star and we know what we are talking about.-We went with our 11 year old daughter-This is a huge property with about 5 separate hotels/sections. Gran Bahia Punta Cana, Gran Bahia Bavaro, Ambar, Golden Principe, Diamond section, Premier and more. There are at least 5 lobbies. With this big a property and this many employees you will no doubt be disappointed with something and this hotel is not for those seeking a high quality, classy quaint place. - There are lots of employees and most employees are great but some do not care so if you meet the ones that don't care you will be disappointed. -There are many buffets but its a quantity objective with so many people to feed so do not expect high quality 5 star food or service but rather expect good cafeteria style all lined up. The food is fine, a bit repetitive, and you will have some good meals and some not so good.-The resort is noisy all night because the shuttle buses are very noisy and they run until 3 am and start again at 6 am and they run throughout the property. Even if your doors are closed you will hear them. You need the shuttles because even as athletic as we are the constant walking/running rather large distances is just exhausting. If you get a room near the main lobby you will hear the 9pm show and then the rerun late show at 10:30 pm.-The pools are nice and the beach is beautiful but these can be found at most of the hotels in Punta Cana.-The shows are for the most part pretty good for a resort like this.-There were not a lot of organized activities and some pretty basic if you were lucky to find them (bingo, mini put, mini golf is pretty good, darts, bike riding, pool activities almost non existent, beach activities few and far between) Don't come late because we were denied any bingo after the start.- Towels and towel cards. They ran out every day ! Get towels early or you may not get any. This is a huge resort with many guests and at peak times or rainy days they run out. Again, this is a mass market hotel.-They will fix problems with the rooms or switch your room. With a big property like this there are many many problems but they do get resolved. We heard of no hot water, requests for certain room types that the hotel claims they did not know about, no in room towels, etc. In all cases we also heard the hotel made good.-We highly recommend the premier section. It will give you the highest quality service and you will not pay extra. Do not pay extra for any section because it is not worth 2 pennies more. Its a bit of a marketing ploy. The Dalhia buffet in the Premier section is the best of the buffets. The specialty restaurants are for the most part not bad but quite frankly the Dalhia was better because the specialty restaurants still do not deliver 5 star at best 4 star.-So if you ask is there a better place in Punta Cana we say there is. The Riu Palaces (Macau or Punta Cana) are true 5 star service and quality and you pay maybe $500 more but its totally worth it if you want a 5 star experience.-Overall we could not stay at the Bahia Principe again because we know that for the money you can get more and we do not accept the short comings that we noted. But, there are lots of people who go to the Bahia Principe are very happy because they do not know better, really only want a 4 star experience, met some good employees who they bonded with or like really huge properties.","ratings":{"Service":2.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":4.0},"author":"Monte Rice","date":"2015-09-26 08:30:17 +0300"},{"content":"Amazing Wedding! Ignore the Complainers!       group photo at the beach","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Deven Donnelly PhD","date":"2013-07-15 10:02:35 +0300"},{"content":"Gran Bahia un posto stupendo   showReview(23050731, 'full');","ratings":{"Service":4.0,"Business service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":4.0},"author":"Dr. Elfrieda Carter","date":"2013-06-28 01:45:09 +0300"},{"content":"Best Windows Venice is a brilliant place to stay in Venice. The window view is amazing! Can you imagine be located at St. Marks Square? So, I was there! Perfect place for couples, very romantic atmosphere. The room has everything you need and the Wii fi was very good. Best Windows Venice é um lugar incrível para ficar em Veneza. A vista é perfeita! Imagine ficar no meio da Praça de São Marcos! O lugar é muito bom para casais, o quarto é bem romantico. O quarto também é muito bem equipado, tem tudo o que se precisa. O wii-fi tinha ótimo sinal no quarto.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Leatha Lebsack","date":"2014-04-12 19:38:11 +0300"},{"content":"Arriving in Venice in anticipation of a wonderful stay in a unique place in the world , we were absolutely thrilled and delighted with our accommadation in the \"Best Windows\" chain of hotels.. The location is priceless, open your window and look below over the famous Saint Marco's Square... out to the Grand Canal..how grand!! One can open the windows for the music wafting up from the plaza bands and the muted clock chimes or close the world out and be in your own little royal palace. The room and it's furnishings are five star, the richness and class of fabrics, decor and amenities are superb. Complete with a jacuzzi to pamper your weary body after strolling the many lanes of Venice.. Feeling secure in a strange city is also a priority for the hotel.. nothing has been overlooked for your comfort and pleasure while you stay in \"Best Windows\" suite.. Thanks.. see you next time 10/10","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Valentin Bode","date":"2015-06-22 14:38:05 +0300"},{"content":"We booked this hotel at the last minute. We were very impressed as soon as we walked in the door. Friendly and helpful staff. Our room was big with high ceilings. We made coffee each morning. We also had a few drinks at the bar. There are some cute restaurants in the area as well as a convenience store and Starbucks. We always felt safe being in the financial district (lots of security around), and it was also great to escape the craziness of Times Square etc.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Nova Okuneva","date":"2012-06-05 01:16:28 +0300"},{"content":"Your taxi driver might not be able to find this place, so print out a map of the Financial District before you leave home. The rooms are very large by NY standards and include a fridge and microwave. The bathroom is big and modern. There is a seating area along with two double beds and extra room to spare. It's not a bad choice if you are in NY for business on and near Wall Street, otherwise I can't think of any reason to stay in this part of NY. Unfortunately, the biggest drawback is the noise from the street below. The street is not that busy, but you can hear noise from delivery and garbage trucks below.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":3.0,"Rooms":4.0},"author":"Dr. Deondre Hilpert","date":"2013-10-22 00:31:10 +0300"}],"public_likes":["Lenore Koss","Pink Abbott","Josh Wilderman"],"vacancy":true,"description":"This is an opulent three-story brownstone Victorian mansion set in upscale Pacific Heights.  With only 10 rooms, it's more of a B&B than a hotel.  The price includes a continental breakfast and afternoon tea.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}