{"title":"Trégor","name":"I Need A Holiday Too","address":"21 rue St Jean, 22450, La Roche Derrien","directions":null,"phone":"+33 296 91 55 97","tollfree":null,"email":null,"fax":null,"url":"http://www.ineedaholidaytoo.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.7496,"lon":-3.2666,"accuracy":"ROOFTOP"},"type":"hotel","id":30930,"country":"France","city":"La Roche-Derrien","state":"Bretagne","reviews":[{"content":"Palace exceeded expectations! I recently stayed at the New York Palace for 5 nights during a shopping trip to NY with my daughter. We booked one of the newly renovated executive rooms with access to the executive club. On arrival the lobby was rather busy as it was for most of the duration of our stay but we were checked in almost immediately. We were allocated a room on the 31st floor with a terrific view of the cathedral and the city. The room was also bigger then we expected (especially by NY standards) but the bathroom was really quite small, and in my opinion not big enough for two people to share (for example there was only one sink, for a hotel of this calibre I would expect twin sinks). However, I would just point out that when the hotel says 'renovated' rooms I think they mean they have just installed new carpets and wall paper, as the furniture, linen, curtains etc. did not look too new, although overall the room was in very good condition. The beds were very comfortable and the room clean, however, on the second day we noticed a slight problem with out room in that certain areas of it had a slight smell if sick. We contacted reception making them aware of out problem and they were very apologetic and rather embarrassed at the problem and promptly moved us to a room on the 33rd floor with the same view. We only ever visited the executive club for breakfast so didn't really take full advantage of it, but the breakfast was superb and we made sure that when we did eat there we ate in large volumes! But if you plan on eating most of your meals in the hotel I agree with other reviewers that executive club access would be great value.The staff are very attentive and arrived almost immediately if we phoned to request something to our room, and made sure that all our needs (e.g. alternative bedding due to allergy to feathers) were taken care of. The concierges and doormen seemed helpful but were often very busy and I think it would probably be better if there were a few more of them around.The hotels location is just perfect for shopping, and apparently it is good for sight-seeing as well, but with so much shopping to be done we had more pressing activities to be completed.Overall, our stay at the Palace was great and I would definitely recommend it to anyone travelling to New York- We're looking forward to hopefully returning next year!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Adolph Spinka","date":"2012-06-11 08:35:04 +0300"}],"public_likes":["Aurelio Gislason MD"],"vacancy":false,"description":"A former cotton mill on the banks of the River Jaudy in La Roche Derrien. Converted in 2007 into six wheelchair accessible apartments, all have level access showers with wheeled shower chairs. Ideal for disabled travellers.","alias":"Wheelchair Accessible Holiday Accommodation","pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}