{"title":"Bangor (Wales)","name":"Tyn Rhos Country House Hotel Bangor","address":"Ty’n Rhos, Seion, Llanddeiniolen, CAERNARFON, Snowdonia,LL55 3AE","directions":"Short drive from the main city, in the countryside","phone":"+44 1248 670489","tollfree":null,"email":"enquiries@tynrhos.co.uk","fax":null,"url":"http://www.tynrhos.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.179221,"lon":-4.175837,"accuracy":"APPROXIMATE"},"type":"hotel","id":2240,"country":"United Kingdom","city":"Seion Llanddeiniolen","state":null,"reviews":[{"content":"Great location, easy walking distance to all the sights (San Marco, Rialto) but has a local feel in the courtyard and not so touristy. A great breakfast with the staff being very friendly and gracious. Our room was superb, top floor, modern and very comfortable. We slept great every night and loved the over sized bathtub. It's on a canal so water taxi took us right to the hotel. The hotel arranged a Murano trip for us, with a nice water taxi, which was free. The Glass Gallery had lovely pieces which were very spendy and there is a bit of a hard sell but overall very enjoyable. The wifi cost euros, but that seems to be the standard in most of the nicer hotels. My fave hotel of the three big cities we stayed in.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":5.0,"Value":3.0,"Service":4.0},"author":"Warren Yundt","date":"2012-01-30 20:17:23 +0300"},{"content":"The location is a short walk from St. Marks Square, but away from the hustle and bustle. Our room was clean and very comfortable. Each room was unique in this restored former palace. The water taxi delivered us directly to the steps of the hotel. All of the staff we meet were friendly and efficient. The breakfast buffet was delicious, but we did not eat dinner at the restaurant. I would definitely recommend this hotel to my friends and family, and would stay here again if we return to Venice in the future.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Alayna Smitham","date":"2013-02-19 02:34:10 +0300"},{"content":"My wife and I stayed in the Ruzzini Palace for a 3 night break. Location is perfect - close to the centre of Venice, but away from the really touristy parts. Service was excellent - staff were helpful, polite and friendly. Lovely breakfast (plenty of choice) and fantastic cocktails in the evening (at a very reasonable price - for Venice!). Room was large enough, comfortable and very clean. Had all the facilities we expected. We will definitely be staying there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jamaal Feeney II","date":"2013-10-21 11:27:09 +0300"}],"public_likes":[],"vacancy":true,"description":"Has superb gardens. There is a large choice of individually decorated rooms and the establishment. It also has its own restaurant, with lounge, bar, main restaurant or conservatory areas, which serves delicious and visually beautiful food sourced locally.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}