{"title":"San Francisco/Fisherman's Wharf","name":"Argonaut Hotel","address":"495 Jefferson St","directions":"at the end of the Powell-Hyde cable car line and right across from the historical ships, with nautical exhibits next to the lobby","phone":"+1 415 563-0800","tollfree":null,"email":null,"fax":"+1 415 563-2800","url":"http://www.argonauthotel.com/","checkin":"3PM","checkout":"noon","price":"$250-$450","geo":{"lat":37.8073,"lon":-122.4202,"accuracy":"APPROXIMATE"},"type":"hotel","id":25673,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Location was decent for what I was in Seattle for, although 5 blocks closer to downtown shopping would have been nice. I asked for a quiet room as I am a light sleeper and I got exactly that. The decor could use a refresh, it's looking pretty 90's in the rooms with plaid chairs and green & beige wallpaper. But the bed was comfortable. Had a fridge. And FULL hot breakfast in the mornings in the lobby restaurant, included in the price. Staff was very accommodating to everything we asked for. Will stay again. Not sure about parking - we left the car up on Capitol Hill and walked down. Hotel is about 10 minute walk to downtown shopping, 15 minutes to Capitol Hill/Broadway, 15 to waterfront. And free pass to the fitness center across the street.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Candelario Walter","date":"2012-03-31 19:12:29 +0300"},{"content":"I just read the trip report of the people who satyed over the same weekend we did (4th July 2009 weekend) Everyone in our party of 6 loved this hotel. Here is a mini summery of our stay. mini trip report about the hotel. First off whoever said they wouldnt recommend this hotel was just a bit off in my opinion. We had a great time at this hotel. The only charge per night is a 20 dollar a night parking charge...no biggie.(its a BIg city and Ive seen 60 dollar a night charges before) We got 2 rooms thru Priceline for 65 each, 3 nights amenities incuded an indoor pool and hot tub, free wireless or free computer use and printers in their business center FREE buffet breakfast each morning (GOOD) good selection of Fresh and Buffet foods eggs sausage bisquits yogurts breads cereal orange apple juice milk coffee etc The lobby was just recently remodeled and it looks like a 4* quality lobby. VERY Impressive remodel!! Every employee was as nice as can be and very professional, On sundays they have an appetizer promotion (2.50) and they were GREAT KOBE beef sliders/Chix Skewers Poke,,,,,pan asian spicy noodles... everything was GREAT. The rooms are basic but nice enough and large. Its listed as a 2.5* hotel but really is a 3.5* hotel. Its and incredible deal We even got a Space Needle View from our rooms. I would Highly Recommend this Fine Mariott Property!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Abbigail Ritchie DVM","date":"2015-07-25 21:09:29 +0300"},{"content":"Stayed here end of september for one night,sheets and pillow cases worn to bits, and creased like one star. Complained to the management, and the car parking was taken off my bill. Very dissapointed with thebedding standard for $240 with tax Never again,.","ratings":{"Service":2.0,"Cleanliness":3.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":1.0},"author":"Asa Wolf","date":"2015-12-28 06:58:04 +0300"},{"content":"This hotel was an awesome deal! We booked through seattlesupersaver.com and it was only $100 a night for king suites! It's in sort of a random spot but it's a quick walk, shuttle ride or cab ride to downtown stuff. They have a shuttle that leaves the hotel once an hour and it was only $6-8 for a cab ride to other neighborhoods. The rooms were big and clean and and the hot breakfast buffet was great.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":2.0},"author":"Franz Kemmer","date":"2014-07-18 20:45:30 +0300"}],"public_likes":["Demario Nitzsche MD","Coralie Cronin","Roscoe Gutmann","Diana Nikolaus","Judy Ward"],"vacancy":false,"description":"A high-end luxury boutique hotel overlooking the bay and very centrally located on the Wharf. Ask for a room away from the front if you mind noise. It's a 100% smoke free environment.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}