{"title":"Llanfynydd","name":"Meadow&nbsp;View Bed and Breakfast","address":"SA32 7PR","directions":null,"phone":"+44 1558 669199","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":51.927556,"lon":-4.093269,"accuracy":"ROOFTOP"},"type":"hotel","id":15956,"country":"United Kingdom","city":"Carmarthenshire","state":null,"reviews":[{"content":"We arrived the hotel at night and the guy in the door told me the hotel had no parking lot and I had to park my car in a parking lot in the next street for $0.5 per hour (I heard the hotel has itself parking for $20 per night). So I went to the next street, found a parking lot and parked there. The next day when we left, we found the parking fee is $42! It is actually a public parking lot and have no contract with the hotel. Maybe we went to the wrong parking lot but the hotel should have given a more clear guidance because we are not familiar to this area. The other services are really good. The front desk girl upgraded our room to a suite, with great location and view. I will come to the hotel again but I prefer not driving there.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Mohammad Schmitt","date":"2012-07-31 13:33:04 +0300"},{"content":"I stayed here for one month with my husband who was in San Juan for business. The best things about this hotel is its location in Old San Juan and the staff. You can walk everywhere in Old San Juan easily and the hotel is right on the bay so some rooms have nice bay views and the patios of the restaurants have great ocean views of all the cruise ships coming and going. The staff overall was wonderful, friendly and very helpful-especially JANMARILY at the front desk and ALEX and LUIS who worked in both restaurants. The housekeeping staff was wonderful as well and if you put the sign on your door that you weren't interested in service, they actually respected that and did not come in. Often I would pass them in the hall and they would offer extra towels or see if there was anything we needed. Top notch housekeeping and I felt very comfortable that my things were safe in the room (unlike other places I have stayed in Puerto Rico). Negatives were there is no real hotel room service, only from the restaurants which are at the hotel, one being a burger place (mediocre at best) and one a more expensive Italian restaurant. The room service food available during the day is very limited and they stop at 11pm at night. Both restaurants are also pretty slow so don't go if you are starving. However the happy hour offered at the Italian restuarant, Il Palacio I think it was called, is great-VERY affordable drinks and appetizers. My other complaints were the water in the shower never held its temperature- it would go back and forth between hot and cold during every shower (and we stayed in 3 different rooms) and also half the equipment in the gym was broken or needed maintenance. These aren't the worst things to find in a hotel so overall I am giving them a good rating.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Jerod Trantow","date":"2012-10-20 14:08:34 +0300"},{"content":"We stayed here 2 days prior to a business trip to St Croix and two days after the trip. We had a suite overlooking the cruise ship terminal. The access to the attractions and restaurants in Old San Juan was truly superior. The hotel itself was adequate and the room location was quiet with a great view. Do not gamble at this casino - London rules on Blackjack and very few table games. Lots of slots but no really large payouts. This hotel is older and frankly need a renovation but the staff was friendly and the suite was large.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Teagan Effertz Sr.","date":"2015-04-16 01:16:00 +0300"},{"content":"My husband and I traveled to Puerto Rico over Christmas and stayed at the Sheraton Old San Juan for 5 days because of it's location which is awesome! We used it as a base to explore and drive around the whole island during the day, then we could park the car and walk all over Old San Juan exploring some really amazing restaurants, bars and shops. It would also be the perfect location pre or post cruise. That said, I wouldn't consider it anything more than basically a place to sleep. Our room was on a higher floor overlooking the docks where the cruise ships come in which was scenic but the room itself is plain but serves it's purpose. The hotel is older so the elevators are small, there's only 2 and they are slow. Be prepared for hordes of pre and post cruisers checking in with tons of luggage into the really small lobby, but considering the amount of turn over and 1 night stays this hotel has, I think they do a pretty good job. We checked out the casino which is small but ok for trying out a couple of slot machines. The only other thing is the hotel is impossible to find if you're not familiar with the area. It took us over an hour to get to the hotel from the airport when it should have taken about 15 minutes (granted it was at night). All the directions you get ahead of time seem easy enough but the words on the directions don't match the freeway signs and when you actually get into Old San Juan there's alot of one way streets that get confusing. There was no signage at street level, only at the very top of the hotel. But getting lost makes things memorable right?!?!","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Mrs. Winnifred Kautzer","date":"2015-12-29 18:23:04 +0300"},{"content":"We reserved the OSJ Sheraton for 2 days before our Carnival Victory Southern Caribbean cruise at the end of Nov 2010. We reserved the room through Hotwire for about $125 a night. The best thing about this hotel is its location. It is only a couple of blocks from the pier that our shipped docked at, so we were able to walk our backs from the hotel directly to the ship at boarding time (saving an extra taxi fee). Pros: Great beds – very comfortable and large. Good air conditioning in our room. Very close to the free trolley pickup (which can take you around Old San Juan). Close to some of the better restaurants. Close to Senor Frog’s and a CVS drugstore. Has hard-wired internet service. Hertz rental car facility in main lobby. Cons: A little noisy at night (depending on your room location). No continental breakfast. Casino is pretty small but takes up a good bit of the lobby floor space. Brumbaugh Street (in front of hotel) is completely congested with traffic at rush hour and cruise docking times. It can take 20 minutes for a car to travel 200 ft. at these times (including the free trolley). Not much parking space. If you have a car, I recommend using the parking garage across the street – much cheaper than the valet service. When we arrived, the reception desk was very friendly & helpful. We arrived at a slow time, but I assume that if you were to check-in at the busy time (when the ship is boarding/docking), the friendliness would be replaced with more of a hurry-up attitude. They were very busy on Sunday morning between 10:30 – 1:00. We had called the hotel in advance and asked them if we could check-in early (normal check-in is 3:00). They noted this and allowed us to check-in around 12:30 when we arrived. The entrance to the hotel is on the side of the building. Check-out is 11:00, but the official boarding time for the ship was ~ 2:30. The bellhops will watch your luggage from 11:00 to whenever you want to board (suggested tip 5-7$) which gives you some extra time to see Old San Juan before you have to board. Hotel has a nice sized exercise room and pool on the top floor. You can see a lot of the harbor and city from the top floor lookout. Although the hotel was nice, it was barely worth the above mentioned Hotwire price ($125 and no continental breakfast???). I certainly would not pay the $200 normal price. If you are taking the Carnival Victory on a southern Caribbean Cruise, this hotel is a good location for you. See attached pictures for more.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Coy Orn","date":"2012-09-28 04:04:42 +0300"}],"public_likes":["Camilla Romaguera","Kiel Hettinger","Linnea Harvey","Mr. Manuel Bernier","Quentin Sawayn","Jayde Schaden","Johnathon Hauck","Fermin Dickinson","Fae Lowe"],"vacancy":false,"description":"Three guest bedrooms with ''en suite'' facilities. 3* rating via the Welsh Tourist Board.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}