{"title":"San Francisco/The Avenues","name":"Great Highway Inn","address":"1234 Great Highway","directions":"right next to Ocean Beach and the N-Judah line","phone":"+1 415 731-6644","tollfree":null,"email":"greathwy@pacbell.net","fax":null,"url":"http://www.greathwy.com","checkin":null,"checkout":null,"price":"$125–$155","geo":{"lat":37.7631,"lon":-122.5095,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26140,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I went for the weekend wiht my husband. we were given an upgrade to a 2 bedroom suite on the 2nd floor with a city view. The service at this hotel is above reproach. This was my second time here and the concierge and the manager both greeted me by name and actually seemed sincere in their pleasure at seeing me again. The rooms are lovely and huge. The complimenary breakfast is very nice. The car is available to take you anywhere you want to go within 3 miles of the hotel and was really appreciated by us. We used it to take us to North Beach, Pier 39 and the Disney Museum in the Presidio. Nice touch. Will definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Johan Cole","date":"2014-04-21 00:15:45 +0300"},{"content":"After staying on Nob Hill last time we were in San Francisco we wanted to stay closer to Fisherman's Wharf this time. We chose the Fairmont Heritage Place largely on the strength of the TripAdvisor reviews and were not disappointed. The location is great for sight-seeing and there are lots of good restaurants within an easy walk. As for our three bedroom apartment, it was almost ridiculously well-appointed and comfortable: gorgeous, well-equipped kitchen, spacious living room, good mattresses, three baths, multiple TVs, hardwood floors, and everything gleaming with cleanliness. The staff was among the most pleasant and efficient we've had the pleasure of dealing with anywhere in our travels, without being in any way obtrusive. I should also mention that our kids loved the long list of DVDs they could borrow from the hotel's video library to watch after dinner in the evenings. Although some reviews have mentioned traffic noise, we didn't notice any to speak of from our apartment and slept well each of the several nights we spent here. Bottom line: we will look forward to coming back here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rusty Beer","date":"2014-08-02 15:23:59 +0300"},{"content":"We pulled up in the taxi from the airport in late August and a very friendly doorman approached, opened the car doors and said a hearty welcome. We entered the sedate-looking brick building and the lobby was incredibly calm and sparing...hmm, I thought. Then a couple of well-mannered, friendly Fairmont staffers immediately greeted us and gave us the lowdown about the one-bedroom cityview unit I'd booked at a comparatively low price several months earlier (less than $350) for me and my two teenagers in tow...and then staff proceeded to tell me we'd been upgraded at no cost to a two-bedroom cityview unit! Yo! Well, OK! We were pleased, without question! The building is more like a condominium property than a hotel, so it's rather quiet and there aren't tons of folks hanging around. I liked that. And then the unit itself, well, it was gorgeous. The full kitchen gleamed, with a center isle and sufficient pots and pans, silverware, dishes, a medium-sized drawer-type refrigerator, an icemaker and a small dishwasher (I rarely used any of this stuff except for tea-making!), The living room was genuinely spacious and comfortable with a lovely couch and a few chairs and a big ol' flat screen TV atop a gas fireplace. The bedrooms were also quite spacious and each had its own large TV and bathroom - one, even, with a jet-stream-type tub...VERY nice! I like firm mattresses and these were a tad bit less than firm, but my teens thought the beds heavenly, so I'm sure you will, too! We also loved the continental breakfast...boiled eggs, pastries, toast, fresh fruits, orange juice, milk were the major offerings and, of course, coffee and tea. The late afternoon 4pm-5pm refreshment bar of red/white wines and sodas and cheeses/crackers was also a nice touch. Again, it seemed like there were never many folks around, although we knew there were...they just - like us - stayed largely in their own units and enjoyed the amenities there! However, note that the property also has a great deck facing the San Francisco waters and this deck has lovely firepits in the evening that blaze seemingly all night, with plenty of outdoor furniture on which to lounge about... One of the best features of the Fairmont is that it's intimately connected to the Ghirardelli Square shopping square...a small, high-end place with lots of fun little shops and wine-tasting places and some good restaurants. This square was extremely close to the water and within immediate walking distance of Fisherman's Wharf. What's not to like???!!! We loved it and the staff was exceptionally friendly and helpful. The Fairmont town car came in very handy when my teens decided to catch a night movie in the city. The staff's attention to ensuring their safe arrival and pick-up was much appreciated by me. The only downside of note, and there was only one and I feel like I should mention it to be genuine, was that the city view wasn't exactly a skyline-type view...it was of smaller-type rowhouses immediately across the street. Now we were on the second floor, so keep that in mind. It wasn't a Ghirardelli Square high-end-type view, but it wasn't bad, either. And the windows have some super nice curtains including pulldowns that let light in but keep outsider viewers out. I easily found ways to arrange these to my absolute satisfaction. So book yourself in this place, without hesitation! Would we return...you bet we would!!! :)","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Daron Krajcik","date":"2012-05-27 08:02:12 +0300"},{"content":"I booked this Hotel after it's rave reviews on Trip Advisor. While it is a very nice Hotel and the rooms are lovely I felt it overpriced compared to other Hotels we stayed in while in the States. The staff were very friendly and the rooms were comfortable I didn't feel the location was the best. It is very close to Fishermans Wharf which was a let down. Very dirty and a lot of beggars and homeless people. Next time I will stay up around Union Square which is more close to the action and better restaurants.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":2.0},"author":"Henry Lueilwitz","date":"2013-06-01 14:33:10 +0300"},{"content":"We stayed there for a family vacation. While the property is nice and pretty new, most of the the staff is incredibly helpful and friendly and did whatever they could to improve our stay. Location is great if you want a bay view and enjoy the wharf. I preferred the location of the Fairmont Beacon hill when I was traveling without kids ! Make sure when you reserve to ask for a room with double glass windows: For the night price, you should be able to enjoy a quite night. The hotel is at a corner with traffic lights and the bus traffic may be noisy.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":4.0},"author":"Willard Hamill","date":"2012-04-17 07:04:01 +0300"},{"content":"We stayed here for 8 nights on our trip to San Francisco from Australia, and we absolutely loved it. From our arrival and check-in, to check-out, service was faultless and facilities were wonderful. We got a 2 bedroom apartment, with 2 bathrooms, and a fully equipped kitchen. All appliances were state of the art, and our room also had a Bosch washer and a separate dryer, which was really helpful. The apartment itself was very spacious, with large windows, automatic blinds, 3 large high-def LCD screens, cable TV with 100's of channels, DVD players - as well as a gas heater in the living area! We loved it so much we wished that we lived at Fairmong Heritage Place Ghirardelli Square. Also downstairs, there are 3 or 4 Ghirardelli chocolate cafe's and shops, which were fantastic. There are several restaurants as well as specialty shops at the Square, and it's only a short walk from the Fisherman's Wharf itself. Staff were fantastic, with the concierge doing everything he could to accommodate to our requests, from in-room dining, to arranging a in-residence masseuse for my wife. The Maserati town car was absolutely fantastic as well, as it took us to Union Square, shopping areas, or other restaurants that are a just a bit too far to walk to. There's a guest lounge area as well, with a high quality pool table and daily breakfast in the morning. We loved it, and so will you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Haskell Kemmer","date":"2012-01-14 22:33:59 +0300"},{"content":"We stayed at this hotel for three nights...we had a gorgeous one bedroom suite with balcony and bay view (#314). It was also perfect for people watching as it overlooked the square. Some of you tourists really should not wear low cut shirts and shorts :) The room had a modern feel with a nicely stocked kitchen. We ate breakfast in everyday but the hotel also provides a complimentary continental breakfast. What set this place apart was the awesome service. The employees really seem to like their jobs and our sincere (as much as they can be while earning tips) in giving you the right information and best help. Plus my son loved the free chocolate :) The rooms are pricey but with the economy there are always specials. We paid an average of $400.00 a night and it was worth it. The hotel also provides a car service and is also convenient to the SF public transportation system. Restaurants close by can be touristy but I enjoyed a small sushi place on Hyde: Grandeho's Kamekyo.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Justen King","date":"2015-12-28 00:53:37 +0300"}],"public_likes":["Antwan Ankunding","Miss Gloria Gorczany","Easter Gleichner"],"vacancy":false,"description":"A no-frills motel across the street from the beach.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}