{"title":"Fontainebleau","name":"Chateau de Bourron","address":"Bourron-Marlotte","directions":null,"phone":"+33 1 64 78 39 39","tollfree":null,"email":"BourronILA@ila-chateau.com","fax":"+33 1 64 78 35 35","url":"http://www.ila-chateau.com/bourron/","checkin":null,"checkout":null,"price":"€160-250","geo":{"lat":48.3408,"lon":2.69611,"accuracy":"APPROXIMATE"},"type":"hotel","id":9292,"country":"France","city":"Bourron-Marlotte","state":"Île-de-France","reviews":[{"content":"We've been to this hotel twice for a mom-daughter bonding/shop-til-you-drop weekend. The hotel staff is very friendly. Florida Mall Hotel is always neat and well run. It offers great package deals (be sure to sign up on their email list for last-minute specials). Unlike most hotels in the area, this hotel is well built and the rooms offer privacy, peace, and quiet. We never hear our neighbors. The staff members are courteous and always go out of their way to help you. The mall is great fun and offers an eclectic blend of stores. Be sure to ask for a coupon book at guest services--great deals in there. The hotel bar/restaurant has great specials--like 2 for 1 drinks and appetizers--much cheaper and far more enjoyable than eating in the food court. Several conferences going on each time we stayed--the patrons were all very happy with the conference amenities too. We'd definitely go again for business or pleasure","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mr. Ottis Mills","date":"2012-09-06 03:39:02 +0300"},{"content":"Awesome hotel, great service, gorgeous rooms & bathrooms (I'm very picky about bathrooms), a Starbucks...and attached to a mall with an enormous food court and plenty of shopping.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jamel Oberbrunner","date":"2014-09-08 05:03:57 +0300"},{"content":"The service at the hotel was very professional and I had nothing but positive experiences with the staff. The room was comfortable and clean. The hotel has a great location (near the airport) and is attached to the Florida Mall, which allows you to shop and eat without ever driving off the property. There are many upscale shops and good places to eat, including a nice breakfast buffet in the hotel's restaurant. I enjoyed my stay and would recommend this hotel to anyone looking for a reasonably priced, clean place to stay.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Lexie Schoen Sr.","date":"2014-03-14 15:06:59 +0300"},{"content":"Very good hotel, but Air conditionning to cold in facilities (I caught a cold) with respect to the external temperature in September Security measures in using lifts are too constraining: as soon as there are 3 people or more living at different levels, it is impossible to program the lift with different keys !","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":3.0,"Rooms":4.0},"author":"Gabe Sauer","date":"2012-03-24 10:01:51 +0300"},{"content":"It seems like there are a lot of negative reviews of this hotel and I don't know why- stayed there two nights in september this year and loved it. The rooms are large and comfy with big tvs and nice bathrooms, and with it being right on the mall there is so many options to eat, drink and shop! There is also a very nice pool, weather permitting, as it is outside! I heard there is also a very nice gym which I did not visit. A colleague had some trouble with no bottled water being supplied in her room but this was easily resolved by the reception staff. While there we also asked the staff for some details regarding local bus services, and they have a useful print-out showing you the bus routes to get to all the local attractions. The reception staff were very helpful indeed about this. High speed wireless is also available for free in the lobby which was great. Ordered room service while there and it was very nice, well presented and tasty. They also followed it up with a call to check everything was okay which was nice. The only annoying thing about this hotel is the staff constantley asking you to fill out feedback cards about them! We were only there 2 nights and ended up doing about 8 or 10 of them! Apart from that i loved this hotel and it's easy access to the mall, stay there!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Colton McLaughlin","date":"2014-03-08 00:54:56 +0300"}],"public_likes":["Conner Towne","Sophia Reinger","Warren Kreiger"],"vacancy":false,"description":"Romantic chateau set in 100 acres of woodland, 7km south of Fontainebleau. Wi-Fi, restaurant, tennis, heli-pad, horse riding.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}