{"title":"London/East","name":"Ibis Hotel Stratford","address":"1A Romford Rd, Stratford E15 4LJ","directions":"tube: Stratford","phone":"+44 20 8536-3700","tollfree":null,"email":null,"fax":null,"url":"http://www.ibishotel.com/gb/hotel-3099-ibis-london-stratford/index.shtml","checkin":null,"checkout":null,"price":"From about £50","geo":{"lat":51.5424,"lon":0.0046,"accuracy":"APPROXIMATE"},"type":"hotel","id":16112,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Iberostar Dominicanan-GREAT! April 2006 Don't listen to all those reviews from people that nit pick the Iberostar apart. This resort has something for everyone.This is a huge resort with numerous palces to eat. Food is good (remember you are not in the US, so just go with it! there is plently so you won't starve! and maybe eat out of your comfort zone for a change!)2 Huge Beautiful poolsBest Beach I have ever seen! White sand no rocks no seaweed-warm!Very nice clean spacious rooms  bathroomsCasino, Disco, shops on siteSalon is a good barginBeautiful PeopleI recommend the Safari excursions-long day  can be very hot, but great experience  great way to see the sitesFishing was also great!It's Vacation, RELAX  enjoy yourself!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Mrs. Dolly Nitzsche","date":"2014-01-06 04:19:37 +0300"},{"content":"Good Things To Know My wife and 12 year old son just returned from the Iberostar Dominicana which shares grounds, bars, and restaurants with Iberostar's Punta Cana and Bavaro. Here are a few thoughts/experiences.While admitedly the bus trip from the airport had us wide eyed doubting our decision to go the the D.R., that section of road is an uncharacteristic view of the rest of the D.R..It took a while for us to unwind from the whirl of travel and the rush of our lives and settle into vacation mode. The lobby is welcoming tropical beacon. The landscaping in a word...gorgeous. The soft beach sand encourages long walks. All staff was friendly and usually multi-lingual. I loved practicing my Spanish, but English only is just fine.A rough guess of visitors prime language: 30% English, 20% French, 20% German, 20% Spanish.You could be as busy as you wanted or as relaxed. We had no problems getting pool side loungers or a beach pallapa. In addition to a large choice of optional non-stop organized activies, there was the; natural beauty, pool, ocean, food, and drinks. Each evening had different shows, bands, contests, and dancing. The talent was truely amazing. We especially liked the Grammy's and Broadway shows. The 2 night clubs go to 3am.We brought snorkle gear and snorkled to small reefs right off the beach, though extra cost day trips were far better for that. The waves at Punta Cana were not made for surfing or boogie boarding though other areas of the D.R. are different and known for that. Windsurfing and Hobie Cat sailing was great. Do sign up for tennis court time early each morning or be disappointed!On Punta Cana Beach the trade winds blow a steady 20 mph but pool side breezes were lighter. There were no mosquitos, or no-see-ums. Make sure to use sun screen or you will be sorry. That sun is hot. The ocean was about 72 degrees the pools about 78.Yes, the buffet food wasn't great. Not bad, but not great. The diversity of choices more than made up it. The seasoning were Carribean and different which is why I like traveling to foreign countries. The theme restauants were actually quite good by the way. Theme restauants request long pants and collared shirts for men. I saw no suit coats. Elsewhere else was strickly T-shirts, shorts, and swimwear.We drank only bottled water (the water at the restaurants is out of the tap)and had lots of iced drinks. We did not get ill.We took two day trips; The Marinaria and Bavaro Runners. Both were fun. The Runners trip showed the real side of the D.R. we had come to see. The road from the airport is not representative of the D.R. at all. If you do Bavaro runners - seriously - be sure to bring enough cash for souveigners; photo ops, coffee, cocoa, real cigars, massages, rum, jewelry, even a DVD about the D.R. with you in it. Yes, the rooms were simply O.K. but who spends that much time in their room? We visited other nearby resorts which were much more posh. At one I almost wished I had a neck tie - no thanks. Most others we visited made us glad we were where we were. The Dominicana was very comfortable. On an overall scale the resort was like a Raddison.Remember this is not America; which is why we went. Bring your sense of adventure. Have a Santa Libre or a Miami Vice at the bar. Get out...explore and by all means try to pack light.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":-1.0},"author":"Lucas Crooks","date":"2015-12-23 12:26:20 +0300"},{"content":"Great vacation! Just returned from a week at this resort (Feb 4-11). There were 6 in our group and we all had a great time. We went through Apple Vacations, which we have used before, and there were no problems here.Upon arriving at the airport, we got our $10 tourist cards, which were then taken from us after being stamped. We thought we needed them to leave, but apparently not. Do make sure when you leave that you get immigration forms from either your Apple rep or at the airport when you check in.Got our luggage and found the Apple people; they directed us to our transfer bus. Beware of the porters trying to act like they work for Apple; they are just looking to take your luggage to the bus and then want a tip. It鈥檚 not that far to the bus, so if you can manage your luggage by yourself, do it. About 陆 hour ride to the resort. The room was very spacious and was always very clean. Air conditioning worked very well (almost too well for me, but hubby likes the room very cold!) You will more than likely need the outlet adapter; but as others have stated, they sell them in the store by the lobby. Also, there are no clocks in the rooms.Headed to the buffet for the first night and found lots of good things to eat. We ended up only having dinner at the buffet on 3 of the nights. We ate the other nights at the Steakhouse, Mexican, Tropical, and Star Rock Caf茅. They were all very good. Reservations are required for all but the Star Rock. Star Rock has open seating from 7-9 PM. And contrary to what you might read, of these 4 restaurants, long pants for the men are only required for the Mexican restaurant. Now that doesn鈥檛 mean you can wear your swim trunks and $@!#% flops to the others; should wear nice 鈥淏ermuda鈥?type shorts to the Steakhouse and Tropical. More casual clothes (i.e., jean shorts) are fine for the Star Rock. The Steakhouse, Mexican, and Tropical all have small buffets for the appetizers; thought the Mexican was the best on this.As for breakfast and lunch, the buffets are what they are 鈥?buffets. If you鈥檙e expecting 5-star cuisine, you鈥檒l be disappointed. Thought the breakfast buffet was very good 鈥?you can get eggs and omelettes made to order; loved the pancakes and the sugar donuts. Tip on the pancakes 鈥?they only make them on one side; a plate gets made up and carried to the other buffet. So if you want the freshest ones, get them from the side where you can see the guy actually making them. Yes it is basically the same thing every day, but how much different can you get with breakfast? There鈥檚 all the basic breakfast stuff, and some things that Americans don鈥檛 think of as breakfast foods, but apparently are normal for Europeans.The lunch buffet down by the beach was pretty good; I usually had pasta and fish or chicken of some kind (and fries and nachos!). And they cook up something on the big grill outside; paella a couple of the days, brats and burgers another day. It maybe got a little repetitious, but we never went hungry. Our big limitation on the buffets is that we don鈥檛 eat any of the salad or fruit 鈥?just think this is why a lot of people get sick. Ice cream stand next to the beach buffet was very good.Beach was very beautiful and we never had any problems finding beach chairs or a palapa. But, we are also early risers and were usually settled in by 9:30 or so. Sort of a 鈥渟hortcut鈥?to get to the beach: exit the building from the opposite side from the pool/elevators. There is a nice straight walkway all the way to the beach. If you exit the other way, the walkway kind of meanders through the grounds, you have to go around the pool, and through the tables outside the buffet.Also, grounds are very nice and well maintained. There are a few flamingos and peacocks, and most days we saw George the rooster strutting his stuff.As for the Europeans vs. Americans thing 鈥?yes it is predominantly Europeans, but we never had a problem with rude Europeans as some people have talked about in other reviews. If anything, it was the Americans we had a problem with. We encountered several cases of Americans on the beach who felt the need to talk non-stop and did not seem to have any volume control. It鈥檚 no wonder Americans get a reputation of being loud and obnoxious. This seemed to be more of a problem when we were on the Punta Cana side of the beach one day.Service by the bartenders and bar waitresses was good. We do tip these people, so that might be part of the reason for the good service. We found other staff to be very friendly. Would like to have had a better selection of liquor; Iberostars in Mexico seemed to do better in this area. But, the El Presidente (draft) was always cold and my husband enjoyed the Bohemia beer (bottled). Seemed to only be able to get the Bohemia in the minibar in your room or at the lobby bar.We did the Marinarium snorkel excursion and that was a lot of fun. The nurse sharks were very cool (and very large!!). Saw some interesting fish and the coral was OK, but we have gotten spoiled in that we don鈥檛 usually snorkel with large groups of people, so that was the only downside.All in all, it was a great vacation and a much needed break from the Ohio winter!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Marc Conroy","date":"2015-10-15 16:40:36 +0300"},{"content":"100% GREAT TIME - very satisfied       Me and my boyfriend on the beach","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":-1.0},"author":"Modesta Moen","date":"2013-06-30 18:28:48 +0300"},{"content":"Great resort, with one exception I just returned from a stay at the Iberostar Dominican with my husband and we had an excellent time, despite a medical emergency we experienced while there. I will reiterate the positive comments previously posted about the hotel: great pool, excellent beach, clean rooms, great service. The food was good and presented us with no health problems. The one warning I have about the hotel is about the 24 hour medical clinic. My husband had a little accident while on an excursion and it was obvious that his collar bone was broken. Other American travellers advised us not to go to the local hospital. The medical staff at the resort clinic was of absolutely no help at all. They could not supply us with a sling or pain killers of any kind. It was obvious they had little medical training and did not care about my husband's welfare. Shortly after the accident occured, my husband passed out in our room and was unconscious for close to a minute. I called the medical clinic for help but by the time they arrived he was awake and back in bed. I was told that I should not have bothered them. We had to wait 2 days to fly back to the States because the number of flights out of Punta Cana are limited. At the hospital back here in the US, we found that he had a broken collar bone, 6 broken ribs and a concussion.I hope this information can act as a word of caution to anyone who may have medical problems or to those who are accident prone. The resort is excellent, but not equipped for an emergency.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":-1.0},"author":"Luther Hayes","date":"2014-04-13 04:56:01 +0300"},{"content":"would recommend but wouldn't go back I travelled with my husband 43 daughter 20 and son 16, 15 - 29 August. We travelled with Direct holidays from Gatwick, the flight was horrendous. Left Gatwick at 11 am after 30 minute delay and then touched down in Manchester to pick up passengers and were delayed here another 2 hrs 45 minutes. Eventually arrived at the resort 9 pm Dom Rep time. We were very annoyed because we were told by Direct Holidays that we couldn't board in Manchester because there was no availability even though we booked in September 2004, then we had to off load at manchester due to a shortage of flight crew and had to re board, so why couldn't we have just got on at manchester in the first place? beyond me! We landed at La Romana airport but would advise against this as it was a 2 hour drive to the hotel, fly to Punta Cana, I would even pay a bit more for my holiday if I had the choice. We were advised to take malaria tablets due to 4 cases reported from this area by English tourists who are now suffering. This is since the 2004 hurricane.When we arrived at the hotel it was one of the best sites I have ever seen. It usually takes me a few days to relax and get into it, but the stress was taken away instantly and I new I had arrived in paradise. Check in was quick and smooth with our cases brought to the room within minutes of walking through the door. The rooms are a bit dated but large, immaculately clean, comfortable beds, lounge area with TV, well stocked mini bar and plenty of bottled water, which is not tampered with as some people have stated. There is also an electronic safe which is big enough to put a video camera in as well as all other valuables. The bottle opener is on the wall in the bathroom. There is a hair dryer in the bathroom and also shampoo and body wash dispensers on the wall next to the shower. We were in rooms 3242 and 3244 with a view of carribean street, not brilliant but very quiet. Just leave the maid a note to let her know what drinks you want re stocking in the mini bar, we did leave her tips now and then but she would have done so without. The main reason we left her tips was because she looked after our daughter one day when she had to stay in doors due to sickness and diarhoea - and thats another story. We all suffered with it through out the 2 weeks we were there. It did spoil the holiday some what as we had to make sure that we were always close to the toilet. After a visit to the pharmacy it was confirmed that we were all suffering from food poisoning along with the rest of the holiday makers we spoke to. When you consider the hygene standards of certain nationalities then it's not surprising food poisoning is so common, i was following other women out of the toilet who weren't washing their hands and then going over to the the self service drinks area and touching glasses, I was astonished and sickened.The grounds are beautiful, gardens with ponds, flamingos, peacocks, ducks and a big fat cockerel that likes to watch the entertainment (well thats what they call it) in the evening. There are 2 swimming pools, one for each hotel building. The Punta Cana and Dominicana are identical buildings stood opposite each other with all bars and restaurants shared between the 2. The Punta Cana is quieter with its own lobby bar and a small band playing in the evening where you can have a dance if you wish. The local music is bachata which to be quite honest I found a bit boring, I was looking forward to some salsa but apart from day time lessons it was never to be heard in the evening. The bars are plentyfull around the resort and the food is literally 24 hours. The evening entertainment was not up to much, people were comparing it to Butlins but to be honest I wouldn't insult Butlins. The star friends do work very hard organising games in the day time and putting on the shows at night, I could name a few of them but not all as the entertainment team do not form part of our holiday enjoyment. The kdis did go to the disco a few times but not as often as they normally would due to sickness and diarhoea attacking intermitently. The only other complaint I have is that the beach bar shut at 11 pm, my husband and I thought this was the most relaxing place to sit and have a chat and just watch the sand crabs at play, it was blissful. Now for the beach, WOW, it is awesome, white powder sands, clear turqoise sea and seaweed cleared every morning, but does build up again later in the day. Because of designated swimming areas the sea did get crowded and this created sand churning so the sea was not so clear for the rest of the day. I was up and on the beach every day by 7.30 am and if you werent out there by 9 then you would have no chance of a sun bed as they would all be reserved by this time. To say that this is damned annoying is an uderstatment and the worst culprits were the Americans who I found out are not only greedy with food but everything else, they would reserve sunbeds for each body in the shade and the same amount of beds in the sun, then walk away and come back 3 hours later, I dont see any reason why the rule of no reserving can not be enforced, there is enough staff around the place. The same problem happened at the 2 pools also but we only layed around the pool on 2 days as we much prefer the beach. Topless bathing is allowed on the beach but not by the pool. It's does state in the brochure that all none motorised sports are included, what it doesn't say is that you have to first pay $40 for a briefing lesson prior to taking out the kayaks and wind surf boards. It also states that pool is included in the all inclusive, but again there was a charge of $1 a game.The staff are really friendly, from the grounds staff to the hotel manager. Every one speaks English contrary to what the travel brochures state. I did speak in Spanish when ever possible and this was appreciated and corrected where necessary with a smile.The food - 2 buffet restraunts for breakfast, lunch, dinner and midnight snacks. 2 buffet restaurants next to the beach, one at each hotel which served food from 10 am until 5 pm and the choice of food was enormous, I would defy any one to be picky at this hotel. Fish was in abundance so, if like me you love any kind of fish then you will be in fish heaven, from sardines to salmon and lobster. We even had champagne for breakfast as this is inlcuded also. Cocktails that would put Tom Cruisie to shame, my daughter and I did justice to the strawberry daquiries as our afternoon tipple and then followed with a fitful sleep on the beach! We also visited some of the a la cart restaurants, make sure you book all a la carts at the start of your holdiay as they get booked up pretty quick. 4 days before we were coming home I wanted to book the gourmet but it was full up every evening. The oriental (not up to much), the steak (excellent) nothing was too much trouble for these guys, the tropical we visited on our daughters 20th birthday and I whispered to the head waiter that it was her birthday and could the staff please sing happy birthday to her, they did more than that, at the end of our meal they turned out all the lights and carried out a huge cake with 4 candles on it and all the staff and guests sang happy birthday, the cake was too big for us to eat it all so my daughter told the staff to share it after they had finished work, we left a good tip to be shared among all the staff and this was appreciated not expected. And the food was excellent. Didn't try the gormet or mexican but did hear they were also excellent. Dress code is not strictly enforced in the a la cart's which i found dissapointing, I dont want to sit in my finery while the guy on the next table is wearing jeans/shorts and a t shirt. They were strict in the buffet restaurants, turfing out any body wearing beach shorts and sleeveless t shirts at dinner. We also ate one night in the Rock Star cafe, OK but didn't go back even though reservations aren't required.Wine - which was good, beer and soft drinks are served at lunch and dinner in the buffet restraunts and champagne at breakfast. The food in the buffets was very good with lots of choice for every one. Do go steady with the salads as the pharmacist warned this is where the food poisoning could be lurking, so be warned. The coffee was excellent quality as were the cheeses and deserts. If you smoke there is a smoking section in all restaurants.We did 2 trips which we felt were very expensive but enjoyable. The jeep safari costing 拢70 each was informative of Dom Rep life and a swim on Macau beach at the end was most welcome. My husband and son swam with sharks which they felt was a bit of a rip off as they only actually spent 1 hour in the water and at 拢50 for an afternoon was pretty steep. My daughter and I spent a blissful afternoon in the spa being pampered and as high class hotels go the treatments weren't that expensive.If you want to shop i recommend you steer clear of the hotel shop as it is ver, very expensive. My husband did buy some hand rolled cigars from the hotel cigar shop and the quality was excellent. Further up the beach past the Bavaro are some shacks selling almost anything and this is where we did our souvenier shopping, be prepaired to haggle, we ended up paying a quarter of the asking price.There is also a casino which made a pleasant alternative some evenings as overall we came out $140 dollars up. We didn't play the tables only the machines and won jackpot 3 times on different machines. Drinks are also included in the casino.We had a fantastic family holiday and probably our last together as the kids are wanting to do their own thing next year, so we had a great holiday to remember for ever. Would I go back, the answere has to be no because of the food poisoning but we will definitley be going back to the carribean, probably Barbados.Don't hesitate to email me if you wish to know anything that I may have forgotten to report.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Miss Jazmin Schiller","date":"2013-10-27 13:02:35 +0300"},{"content":"overall it was brilliant I had a great time at the iberostar dominicana. The junior suites were very spaceous with a nice balcony. The pools were big and clean, situated next to the beach there was a nice breeze although it was still extremely hot. The staff were very friendly and happy considering the hours they work especially the 'star friends'. The disco was good and open till the early hours of the morning however the music was the same most nights this didn't really bother me though!!!It was a great holiday and I would definitely recommend it to friends!!!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":-1.0},"author":"Enola Stoltenberg","date":"2015-08-17 04:04:37 +0300"},{"content":"Great Place for all! My family and I just returned from a two-week holiday at the Iberostar Punta Cana. I flew out of JFK on a non-stop American Airlines flight. It was great! The plane was not crowded. I traveled with my husband and two children ages 2.4 and 1.1 years. Both children did not get much sleep the night before. They both fell asleep about one hour into the flight. Lucky me! The plane arrived half hour early at 11:00 a.m. Once you exit the plane the hot and humid air hits you right in the face! It was a smooth exit from the airport. I was one step ahead of the game because I purchased my tourist cards at the consulate in New York and had them already filled out. I headed straight for Customs. My bags came right away. I did not have ground transportation to and from the airport. I was told you can grab a cab as soon as you exit. The advice was correct.I had an air-conditioned van for $24 USD. The ride to the hotel was a little scary. However, I wasn鈥檛 surprised because the roads are similar to my grandparents city of Coamo, Puerto Rico. Going towards the hotels in PC there are two lanes. One going and the other coming. If you want to pass the very slow moving vehicle in front you would have to go into the oncoming traffic lane to pass the vehicle. This is scary. However the Dominicans are used to driving like this so I wasn鈥檛 concerned. I was also not surprised on how some of the poor people live. The housing is called shanty-towns 鈥淢ake Shift Homes鈥? I am familiar with this because I traveled to RIO and the poor people live like the same. Well to get off the subject and on to the hotel.Of course there was only one person at the reception and his last name happened to be RUIZ which is my mothers last name. He spoke English but I spoke in Spanish. I gave the guy $30 to upgrade me to a Junior Suite. I could have given him less because he didn鈥檛 even ask for money. The Junior Suite was nice but it was not conveniently located. The Junior Suites are located near the front entrance of the property. The front entrances is close to the buffet and Japanese restaurants. The suites have double or king size bed with a small table and chair a sofa and a very nice bathroom with a big tub. The downside of this location is that it is a far walk to the pool and beach. Not a big deal if I was married with no kids. But shelping beach stuff with two kids in toe is difficult. The same day I went to the front desk and ask to speak with the manager. The manager鈥檚 name is Mr. Coleman. He is a very nice gentleman and has a way with words! I guess that is why he manage鈥檚 all three hotels Punta Cana, Dominicana, and Bavaro. I asked if there was anyway he can get me a standard room closer to the beach. He pleasantly advised to come and see him the next day around 2:00 p.m. and he will see what he can do. Well patience paid off because he gave us a family suite! The family suite was located on the second floor hop skip and jump from the pool area.The suite was two rooms. The first had a king size bed, sofa bed, TV and bathroom. The other connecting room had two double beds w/ a TV. Both rooms had a patio with table and two chairs. It was really nice. I also asked for a crib it was clean and it served the purpose. The decore is a little outdated but the rooms serve the purpose. Pool  Beach  FoodThere are two pools side by side one for Dominicana and the other for Punta Cana. They were a good size but would have like a bigger pool. But then again who goes to the carribean to sit in a pool. The sun is strong to the pool water gets warm. There is a lot of space for kids to place. There is also a baby pool. The pools are kept very clean. The first week of arrival was not crowded so I did not need to reserve a sun shade. As the week past I found I had to wake up in the morning for the prime spot. Only because I had kids. The beach is absolutely beautiful. This is where I spent my entire vacation. I set up shop on the first row of huts. So I was two steps from the pools and two steps from the beach and right between the beach buffets! The front of the Dominicana pool is the activity side. They have lots of games provided by the wonderful star friends. I danced Merengue and my 2 year old sun did too! The ice cream at the La Cana is way better than the La Yola Icecream Stand. The La Cana has rotisseree chicken that is great better than the other buffet. BUT the buffet near the dominicana has frenchfries with cheese, rice and beans, etc. More of a selection.Food and RestaurantsI was pleasantly surprised that the food was pretty decent. I mean come on you are in the Dominican Republic not NYC! The buffet is an open air restaurant so you will see flies. Some people freak out. They are not swarming all over the food. They basically annoy you at the tables. I have a great tip. Take a napkin and place it over your food while you are eating. Leave a small opening. No flies will come. It worked. I did this the entire week. People must have thought I was crazy. I had low expectations of the food and brought every medication in gods creation. I only got sick once for a 陆 day took Ammodium AD pills and walla it was gone! At the buffet they have steaks made to order. Rice, Vegees, Pork, pasta, pizza, etc. I stayed away from the salads but I found everything was temperature controlled. I found them checking the temperature of the cold foods often, which is a good thing. The were constantly cleaning up. First couple of days I tipped the waiters for getting me water and soda but it was easier just to get it myself so I stopped tipping after the first week. Another tip is to make sure you eat your food well done. The pork shoulder is cook well. But the little cuts of meat (steak) is not cooked well. They just brown the meat to meet the demand of people. Just ask the cook to cook it more well done and you won鈥檛 get sick. This is why I had to take Ammmodium AD because I ate a raw piece of steak.A lot of people get sick because they drink too many of those frozen drinks. The frozen drinks are very sweet. Especially the coconut ones; these are pure laxatives! Hey if you drink in the sun and eat a lot you will get sick! I met a couple from PA and he was drinking lots of RUM. I said to him that you better slow down buddy you will get sick. He said nahh! I drink all the time and sure enough he was in the room the entire day sick as a dog with diareara. Lucy鈥檚 ClubThis club is for children 4-12? The club was small but they do have lot鈥檚 of games, movies and various indoor/outdoor activities. There is a staff of two. During the crowded point of my stay I saw about 12 children walking from one activity to another. There was one girl in the front and one in the back making sure everyone played follow the leader. The girls understand English quite well but speak a little English. They did a great job at the Mini Disco which is held nightly. It鈥檚 repetitous but that鈥檚 because they want the kids to follow them. They march, dance and do play skits. It鈥檚 really cute. My son loved the mini disco even though he was only 2.4. He danced around the stage by himself at times! and tuckered himself out that when we went back to the room he fell asleep really fast. IT was wonderful! The girls work really hard because again this is not there end of the day. They start at 10am and work until 10 pm. That鈥檚 a long day. Make sure you tip them. One of the girls lived in Santo Domingo and goes home every 11 days!I would recommend this resort for everyone. It鈥檚 a great chain. If you like to party stay on the Domincana side. If you like peace and quite stay on the Punta Cana. Remember the Dominicana side has everything from the shows, casino, etc. RUDE PeopleBefore departure I read numerous posts about people being rude (ie. Americans and Europeans). I always have an open mind when I am on vacation because who wants to argue? Well that statement was short lived. I guess because I was one week and five days into my vacation and the buffet was getting to me. I was standing in front of a dish that had ONE hot dog left. I had a plate in my hand with three hot dog buns (mind you my son was hungry). A gentlemen was using the thongs to pick up a piece of steak. I was waiting for those thongs because I have proper etiquette. Well long behold this French guy behind me (who see that I am waiting for the thongs with three buns in tow!) reaches over me and grabs the hot dog with his fingers!!!! I couldn鈥檛 believe it! That really ---- me off. I told him nicely that I was waiting for the thongs to get the hot dog and he pretended that he didn鈥檛 speak English. Well since he did that my husband went up to him and told him he was an ----. I knew he understood because a few minutes later he was sitting one table away speaking English to his friends. Go figure. The buffet at Lunch is like going to a High School Cafeteria. Everyone for themselves. Well that was my experience at the Buffet.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":3.0,"Location":-1.0},"author":"Freida Bailey","date":"2013-04-13 02:21:32 +0300"},{"content":"The food was really bad, but... We have stayed at the Iberostar in Playa Del Carmen, Mexico, for the past three years and loved it. This spring we decided to try the Dominican Republic for a change. The weather and beaches were excellent. The resort itself was not up to the same standars as the Quetzal, in Mexico. I don't think the Dominicana should be considered a 5 star. The rooms were smaller, not as clean, and in need of minor repair. For example, the shower was really not operational. We complained, but no action was taken. The air didn't work very well either. The room had some peeling paint, and cracks in the tub and bathroom floor. Our biggest disappointment was the food. It was just awful. We are not picky, and can eat just about anything. I don't plan vacations around eating, but this was really bad. They were always running out of everything too, from ice to silverware to cups to fries. There were not enough staff, and the tables were dirty. We found none of these problems when we stayed in Mexico. Another thing was the staff was not nearly as friendly or helpful as in Mexico. Actually they were somewhat rude!! We found many more European tourists in the D.R., and a lot more topless!! All in all, it was okay, but I would much prefer to go to Mexico, and stay at the Iberostar Quetzal!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Aaliyah Daugherty","date":"2015-01-26 04:28:34 +0300"}],"public_likes":["Dedric Nitzsche","Jada Russel","Ned Oberbrunner","Keegan Hessel","Gudrun Jenkins","Maude Ratke","Eudora Legros","Donnie Boyer"],"vacancy":true,"description":"104 room hotel with the usual identikit, Ibis set-up.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}