{"title":"Los Angeles/Downtown","name":"DoubleTree by Hilton Hotel Los Angeles Downtown","address":"120 S Los Angeles St","directions":null,"phone":"+1 213 629-1200","tollfree":null,"email":null,"fax":"+1 213 622-0980","url":"http://www.doubletreeladowntown.com/","checkin":null,"checkout":null,"price":"$110+","geo":{"lat":34.050739,"lon":-118.24261,"accuracy":"ROOFTOP"},"type":"hotel","id":16632,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"Yearly trip to PR ends with three days two nights at the Embassy. It is just great hotel, great value for the money and truly representative of the Embassy chain. Had a suite on the 8th floor overlooking the pool area...wow. Check in flawless, complementary two hour cocktail party and breakfast in the morning, flawless as expected. Room was clean, comfortable, the best housekeeping person I have ever met or dealt with bar none. No request was ever too much. The staff at this hotel, everyone I walked by always said hello, good morning, have a good day...from the valet parking attendant to the guy vacuuming the lobby...now thats customer service. All calls to the front desk for special request were handled promptly and courteously....I mean, the only negative on this hotel is that is about two block from the beach...but guess what...they have their own Embassy area at the beach and the excellent customer service extends there too....I honestly cannot say anything wrong about this hotel, this is my third years coming here and they outdo themselves everytime.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Moshe Beer","date":"2015-11-19 15:24:36 +0300"}],"public_likes":["Miles Hilpert","Jeremie Yost","Caleigh Fadel","Dahlia Toy","Corbin Blick","Corene Schaefer","Gabrielle Hermann I"],"vacancy":true,"description":"Featuring spacious rooms, modern decor, and a variety of amenities in Little Tokyo.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}