{"title":"San Francisco/Civic Center-Tenderloin","name":"Inn At The Opera","address":"333 Fulton St","directions":"between Gough St and Franklin St","phone":"+1 415 863-8400","tollfree":null,"email":"karinmerzenich@aol.com","fax":"+1 415 861-0821","url":"http://www.shellhospitality.com/hotels/inn_at_the_opera/index.html","checkin":"3PM","checkout":"11AM","price":"$153 year round","geo":{"lat":37.7787,"lon":-122.4223,"accuracy":"APPROXIMATE"},"type":"hotel","id":25598,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My husband and I decided to try the Chancellor for our first \"get away from the teens\" anniversary ...our 22nd ... we had a marvelous time! We arrived very early so our room was not yet available but they gladly offered to stow our luggage and then called us when the room was ready. They put us in room 1203 (a nice high room on the union square side ...see pics!) and to top it off we were greeted with gifts for our anniversary! I see from other reviews that this is a somewhat common practice, and I say good for you Chancellor! It was thoughtful, made us feel special and the wine was good which was a nice surprise! The hotel staff was GREAT and the room was nice. We recommend it. It may not be a modern swanky hotel but it's an historic SF hotel that is more reasonably priced. It's clean and well cared for, and has a lovely personality and a 5 star location!","ratings":{"Overall":4.0},"author":"Clementina Kuhlman","date":"2013-10-10 01:46:13 +0300"},{"content":"We read lots of reviews before booking and I agree with another writer that Wes's willingness to read and respond to comments was a plus. Yes, it is old and small but having stayed in lots of city hotels around the world where space is at a premium it is only to be expected. The location makes it worth it. Very central and the tram stopping outside the hotel makes a fun addition for tourists. I can't believe the guy below who thought a $10 note would get him respect. First because it is not required here - all the staff were great; helpful and friendly and there were always lots of front desk staff and porters around who helped us for no consideration and second because he's so cheap!!! Small, quirky shaped (in our case) rooms but very clean and comfortable and quiet. With an average temperature around the 70s AC is really not required; and the fan was adequate. Some recommendations regarding eating - hotel breakfast was very good and reasonably priced but we enjoyed Lorie's diner (one just up the road and one just down the road) - great fun and very efficient - the kids loved it. We ate at the restaurant next door which sometimes had long queues (forgotten the name) but it was very disappointing (dull American fixed menu - sorry) and service was poor - 10 minute wait at the bar for a table but no bar service and no wine list offered at the table. There was one but it took so long to get it the food was delivered! The Italian restaurant opposite the hotel was the fantastic - we didn't book a table (advised) but as we were early (6pm) and agreed to eat within the hour we got a table. Really great food served by friendly staff and the same price as the other restaurant. Wish I hadn't been with children as it had a very buzzy cocktail bar section and it looked fun. A find which was only a short 5 mins walk away was a small,classy but again reasonably priced French restaurant called Anjou. Off the beaten track but I'm sure the hotel staff can direct you. Food cooked by a chef who's travelled and was on site. Enjoy your stay - we did!","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Ursula Murphy","date":"2012-01-20 02:13:24 +0300"}],"public_likes":["Verner Haag","Ana Orn","Mellie Schneider","Mrs. Dannie Torphy","Jeremy Hauck","Alejandra Vandervort"],"vacancy":true,"description":"This hotel has 29 guestrooms and 18 suites which are individually decorated. It is situated in an excellent location.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}