{"title":"Mull","name":"Tobermory Youth Hostel","address":"Main Street, Tobermory, PA75 6NU","directions":null,"phone":"+44 1688 302 481","tollfree":null,"email":"tobermory@syha.org.uk","fax":null,"url":"http://www.syha.org.uk/hostels-in-scotland/islands/tobermory.aspx","checkin":"17.00 - 22.00","checkout":"10.00","price":"from £17 for a bed","geo":{"lat":56.62314,"lon":-6.06664,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":19323,"country":"United Kingdom","city":"Tobermory","state":null,"reviews":[{"content":"My family and I stayed at the Hyatt Place near the mall about two weeks ago. The room was nicely decorated and the flat screen tv was great. There were only a few minor things that needed to be fixed such as the mini fridge was not very cold and the bathroom is really small. We stayed two days and received pretty good room service (we ordered pizza which was tasty) and our room was cleaned by hotel staff. The hotel staff were friendly and greeted us by name. My family did go to the pool and found that it was not very sanitary. There were leaves everywhere and there was a group of basketball teams that were staying in the hotel. They sort of crowded the pool area and were a bit noisy--they had won their tournament game so it was understandable. The location of the hotel is great, near restaurants, shopping, fast food places, and pretty much anything that you need. There was a walmart nearby and a walgreens too. I would recommend this hotel to anyone wanting to stay near memphis but not in memphis. The area was nicer and better than staying in downtown memphis.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Deondre Friesen","date":"2013-03-25 08:47:26 +0300"},{"content":"My friend and I both agree that we wouldn't bother staying anywhere else next time we're in Barcelona. The Hotel Curious is perfectly located down a cozy street just off of La Ramblas and La Boqueria. You are a 10-minute walk from the Liceu (Green) and 15-minutes from Plaza Catalunya (almost all lines); which is also one of the stops for the airport shuttle bus. The hotel has clean modern-styled decor and although the rooms are relatively small in size, they are clean, stylish, comfortable, and have all the conveniences that you need. Service was fantastic and the breakfast was adequate. However, I would recommend walking 5-minutes to the Boqueria in the morning for breakfast, market strolling, and fantastic people watching. Overall, the location and quality of the Hotel Curious exceeded our expectations and won us over as devout fans.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Mikayla Herman","date":"2015-10-11 02:39:57 +0300"},{"content":"I stayed there last week for three nights and everything was perfect. Everyone from the staff were extremely helpful and they made my stay so much more pleasant with information about the city I came to them asking. My room was just what I needed, clean and quiet, the bathroom was also clean... I basically cant think of one bad thing to say about this hotel. They are as advertised! One thing is for sure, if you chose Curious you wont make a mistake.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rachel Pfeffer","date":"2014-05-18 21:34:59 +0300"},{"content":"A clean and modern hotel located off Las Ramblas and behind the Boqueria. The rooms are small, but extremely clean. Conveniently located and even has a room that can fit three people. Great neighborhood and easy access to key attractions.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Enoch Bogisich","date":"2015-02-17 22:49:52 +0300"},{"content":"Our choice of Hotel Curious was driven off tripadvisor rankings and reviews and I must say we were not disappointed at all. Hotel is located just off La Ramblas- so that noise of La Ramblas is mitigated. However metro stations and most of the Barcelona sites are within a short walking distance. Our triple room was on top floor with a small balcony- which was a bit of disappointment - as there was no view of La ramblas as I was hoping for. But you can't have low noise and a sight of Ramblas together. Wireless internet signal was solid. Room was clean and compact. It did feel a bit claustrophobic for 3 people, but my comparison is to US hotels. Also, I do not understand why all spain hotels have a small shower curtain extending for 1/3rd the length - resulting in spilling of water on bathroom floor. Key factors which stand out is the cheerful and customer oriented attitude of service staff at reception. You can ask them for whatever problem you have - right from planning an itinerary, questions abt barcelona, suggestions on icecream shops and SIM card shops in vicinity, availability of tickets to La Musica, US style wall plug adapters to availability of sharpener for daughter's pencils made blunt while recording her journal. Breakfast is nice and wholesome. It was nice of them to prepare it for us at 5.30 am on day of our departure. We took a cab from airport to hotel which cost us 33 euros in evening (meter showed 26 and 7 euros were added on ). While leaving hotel folks called a cab and that cab charged us 49 euros (meter showed 32 euros and 17 was add on charges). Not knowing spanish , I could not argue, but I would suggest confirming the 'add on ' charges before taking a cab - esp if you are doing it at odd hours. Overall a great experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hope Daugherty","date":"2013-02-19 09:32:49 +0300"},{"content":"We recently spent two nights at Hotel Curious after an 11 day cruise to the Canary Islands. The hotel is in a great location just steps from La Rambla and the metro. The room is a good size as many hotels in Europe tend to have smaller rooms. The front desk is very friendly and helpful with suggestions on good restaurants and local attractions. We found the continental breakfast served in the morning to be a bonus as well. On the negative side, the bed is a cot and a little on the hard side. Also, there is little storage space in the way of drawers or shelves to lay down clothing. The bathroom also has limited shleving for toileteries, etc. It is really a hotel for a very short stay. A word to the wise. I booked the hotel on their web-site and got a very good rate which was non-refundable. Unfortunately, the airline, Air Transat (that's another story) cancelled our flight. So, I had paid for 3 nights but was only able to stay for 2. I did not hear from the manager although the front desk staff told me that non-refundable means that, no exceptions. So, even though it was out of my hands, I was out of pocket for the one night accomodation. All in all, though for the price, it is an adequate hotel.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Vena Mueller","date":"2013-02-01 17:07:49 +0300"},{"content":"We were in Barcelona for 6 nights and stayed here. Wonderful location right down the street form La Rambla. Not a lot of night or morning noise on this street being so close to the main street. Bedrooms were decent size and clean. The beds were not very comfortable though. Breakfast was continental and decent. Free computer use in the lobby. Staff were very friendly and Mateo was very helpful upon our arrival and whenever we had questions. Would stay here again and would recommend to others...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Gregory Lindgren","date":"2014-05-05 03:44:43 +0300"}],"public_likes":["Alan Steuber","Kendall Leannon IV"],"vacancy":true,"description":"SYHA Hostel on the seafront, with great facilities, awarded 4 stars by the Tourist Board.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}