{"title":"Birmingham (England)","name":"Hampton by Hilton Birmingham City North","address":"98-104 Constitution Hill","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48757,"lon":-1.90491,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3610,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"My first visit to Chicago was made even better by staying in the Hotel Burnham. It's easy to get to from the airport on public transport and could not be better located for all the things you will want to see during your stay. The lovely Hotel Reception staff could not have been more helpful getting us restaurant reservations. The fitness room, while small, has all that you will need. The restoration of the building is documented in photos on display and it shows what an amazing rescue job was done to bring back to life a derelict site..","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Marjorie Kassulke","date":"2015-12-25 05:55:55 +0300"},{"content":"I stayed at the Burnham for a recent business trip to Chicago. From the time I checked in, till the time I checked out the staff could not have been more accomodating. The hotel is located right across the street from Macy's on State Street and 1 1/2 blks from the El. I took the train from Midway and it was a short walk to the Hotel. The room was small, but well appointed. Appreciated the in-room controls for air and heat. Room Service was able to accomodate my request for something \"not on the menu\". Definitely made my trip very enjoyable.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Aurore Bernhard","date":"2012-02-16 01:47:08 +0300"},{"content":"I had the pleasure of staying at the Hotel Burnham for a conference I was attending at the Palmer House Hilton. The hotel is in a great location at the corner of State and Washington in the hear of the Loop. Kimpton has renovated the old Reliance building and the work they have done is stunning. I arrived at about noon and my room was not yet ready. They took my cell phone number and gave me a call when my room was done (about 2 pm). In the meantime, I took a walk and had lunch. The room I had was on the 10th Floor and had a queen bed. The bed was very comfortable and I found the room easy to work in. The bathroom was the perfect size for a solo traveler and being a member of the InTouch program made internet usage free and provided me with a $10 minibar credit. Both mornings of my stay I had breakfast in the Atwood restaurant in the lobby. While I only had the continental breakfast (orange juice, coffee or tea, toast or pastry), it was served quickly and with a smile. If I had to pick something that was lacking at the hotel, it would be the workout room. Located on the 3rd floor, it was small and had only 2 treadmills, 1 elliptical, 1 stationary bike and some limited weights. I used the gym both days, but would have loved to have had a little more variety. Overall, this was a wonderful hotel for business and I would not hesitate to stay there again for either business or pleasure. Once again, Kimpton service exceeded my expectations.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mark Zieme","date":"2014-06-03 05:31:34 +0300"},{"content":"Beautiful, classic hotel. Rooms and service excellent. Spotlessly clean and staff very helpful. The in-house restaurant was first class and I can honestly say I can find nothing bad to say about my stay here.","ratings":{"Overall":5.0},"author":"Alexie Lemke","date":"2015-01-09 11:55:12 +0300"},{"content":"It was perfect for our needs - and the service was unparalleled. The location was perfect for the theater weekend we had planned. Our room was lovely, if small, with very comfortable beds and a view of Macy's with its lighted Christmas windows. The desk personnel, housekeepers, and bellman were all very attentive - as well as the servers at the Atwood Cafe in the lobby. We walked to the Art Institute, Macy's, Millenium Park, two theaters, and Pizano's without difficulty. The El is only a block away. We would love to stay here again someday.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Noelia Schultz","date":"2014-01-16 20:09:58 +0300"},{"content":"I must say staying at the Hotel Burnham really took the whole experience of Chicago up to another level. We just spent a long weekend in Chicago. As an architect, the fact that I am staying in the Reliance Building --- so brilliantly restored --- is a dream come true. It is part of American architectural history. This is one of the first skyscrappers in the world! The elevator lobby is a sight to behold. We stayed on the 14th floor. The room door had the original hardware. It is a very compact hotel, and the way spaces are utilized is very fascinating and efficient. Even though we were right next to the elevators, there wasn't much noise. We would hear the \"L\" go by, but that is lovingly considered as part of the experience of being in the center of the Chicago \"Loop\". Even little quirks in the room such as loose cabinet doors and bathroom doors that wouldn't close entirely didn't bother us much. We are within walking distance to many historical downtown buildings, and two blocks away from the amazing Millenium Park and Art Institute (with its new Modern Wing). The Hotel Burnham is rated as a 3-star hotel, although with all the history, charm, and character I feel it is definitely a priceless 5-star experience.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Else Abbott","date":"2013-10-01 14:57:39 +0300"},{"content":"Definitely the best service at any hotel in Chicago so far. Tracy at the front desk is a gem - and fixed any problem caused by others - but every employee is concerned with your stay - right down to the guy that changes the air filters. (No kidding.) Rooms are generally small but well appointed. Wine hour is a nice touch. Location is great for theater, shopping, dining, Millenium Park, etc. Easy access from El train. Historic building.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Mrs. Salvatore Abernathy","date":"2015-05-30 23:50:40 +0300"},{"content":"I liked the look and feel of this hotel. It's older, but it has personality. My room was clean but also a bit worn, with an older Zenith analogue TV (but a very nice new and easy-to-use Sony clock radio) next to the bed. It was a bit dark, and could have benefited from a lamp next to the sofa for reading purposes. The service was rather friendly although not too polished at times. Attention to detail seems an issue: when I checked into my room, there was a card and gift addressed to another guest and my check-out took awhile owing to a credit card mix-up. Warning for those who like to use room service: there is none at this hotel during a renovation of the restaurant downstairs (there is, however, a complimentary Continental breakfast spread in the morning in the lobby, which includes a fireplace). One thing I really liked at this hotel was the long list of complimentary 'on request' amenities for the rooms, including humidifiers. I would return to this place, because the price is right and the staff have the right attitude. After the restaurant is open again, and with some more room modernization, I imagine it will be especially nice.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Reuben Donnelly","date":"2012-02-11 18:09:27 +0300"}],"public_likes":["Esteban Blanda","Brendon Renner","Maggie Balistreri IV","Tabitha Nader","Franco Gaylord","Edyth Trantow DVM","Yvette Hirthe","Albina Wisoky","Erika Stark"],"vacancy":false,"description":"The new Hampton brings some colourfulness to Birmingham's economy hotel market, merging new with old as it is located in a building dating back to 1910. Its name honestly describes its location northwest of the city centre.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}