{"title":"Yosemite National Park","name":"Yosemite Lodge at the Falls","address":"9006 Yosemite Lodge Dr","directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_YosemiteLodge.aspx","checkin":null,"checkout":null,"price":"Room rates are $219 per night, with slightly lower prices during the winter","geo":{"lat":37.743258,"lon":-119.598498,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33889,"country":"United States","city":"Yosemite Valley","state":"California","reviews":[{"content":"Bavaro Beach Hotel - warning! We returned last week from a trip to Bavaro Beach hotel The hotel was a huge disappointment - the rooms were old and tatty and the whole place was reminiscent of a holiday camp. Everything needed refurbishing. The staff throughout the resort were rude and unhelpful. The food wasnt great and we both gor tummy cramps while we were there. The drinks were worse. If you drink beer or rum you will be fine but everything else was just awful. I lost count of the drinks I tried and just couldnt finish. The cocktails some are OK but served in plastic tumblers was unacceptable. The Palce hotel next door was in a different class and we took to going there every day for meals and evenings.Overall a very big disappointment and we will not be returning to the resort or the country.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":2.0,"Rooms":2.0,"Location":-1.0},"author":"Sincere Hartmann","date":"2013-11-03 15:54:06 +0300"},{"content":"Great Resort       FROM THE BALCONY","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":3.0,"Rooms":5.0,"Location":-1.0},"author":"Carissa Mertz","date":"2012-01-13 17:45:40 +0300"},{"content":"If you don't speak fluent Spanish, stay away I have just returned from my honeymoon at Barcelo Barvaro Beach and I have to say without a doubt that I will NEVER return to Punta Cana. The employees at the resort wanted nothing to do with Americans. They had no problem taking or using our money, listening to our music or trying to act American but they do not want to interact with Americans. I too am in the service industry and I know how people can have bad days at work therefore I am more tolerant when it comes to wait staff etc., but the employees were rude to me every day. No hello or good morning. My trip was all inclusive so we just walked into the restaurant to eat. It took 10 minutes if ever to get water or to be asked if we wanted pop or something else to drink. Extra napkins forget about it. And, it wasn't like they were very busy, they would walk past our table 4 times and take care of the Spanish Speaking people first then again before they would come to our table. We tried to be as polite as possible and tried to speak Spanish when we could but then they treated us worse. We had to jump through hoops to get things that were all-inclusive. For example, I wanted to go snorkling. First I had to go all the way from the beach acquatic center to the front desk to get a card and fill out my name and room number(remember, you have an armband on showing that you stay at the resort) then you had to take the card back to the acquatic center. You are allowed 1 hour with the gear. I was there at 12:00 and they didnt have any gear. I went back at 12:30 still none. At 1:00 they still were all out, but when I stated that it had been an hour since I first arrived the girl went in the back and got some gear. Horseback riding, forget about it. I was told twice to come back in 20 minutes. They didn't know what to do. When walking around you would come upon an employee or a Spanish speaking person. Instead of both people (you and them) giving a little bit of room to get by, they would not move. They would always walk between you and never an excuse me or sorry. There were other Americans and Canadians that I spoke with that got the same treatment. I would say that 70% of the employees could speak English but they chose not to even when I would speak in English to them. How do I know they could speak English, because I would here them with others. In closing, if you do not speak fluent Spanish stay away from Barcelo Bavaro Beach Resort.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mr. Issac Strosin","date":"2015-10-18 14:17:13 +0300"},{"content":"great spring break destination this place is AWESOME. they should advertise better because it is great. safe, clean, fun, friendly, great weather, just awesome.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":-1.0},"author":"Brent Walker","date":"2013-02-17 02:05:18 +0300"},{"content":"Wonderful My boyfriend and I Just got back Jan 17th. This was the best all inclusive resort I have ever been too. Even thought it is a 4 star hotel I thought It should be atleast a 5 star. The food was great, the staff was great, the beach was pretty. The only thing I would change is maybe teach the staff some basic English. Even though the guests are from all over the world, english seems to be the common language that everyone speaks to the staff, and believe me there was more than on occasion I ordered a martini and got a mudslide. Besides that I would recomend this hotel to anyone.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Dorthy Gaylord","date":"2014-09-28 04:28:48 +0300"},{"content":"It was the best week ever It was the best week ever especially without my mom. the people were great and polite and very down to earth. I went to an island called saona and that was also something to see. It was beautiful. i fell in love with the beach. night life was fun. the discos were discoteca bavaro and discoteca-restaurante caribe (where the employees were) were excellent. i met people from all over the world and i can't wait to go back in december and visit my friends from the hotel.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Clotilde Senger","date":"2014-11-09 16:49:04 +0300"}],"public_likes":[],"vacancy":false,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Located near the base of Yosemite Falls, this lodge offers 245 rooms, but be aware that no rooms have air conditioning.  Internet access (in-lobby kiosks and WiFi in guest rooms) is now also available. There is an outdoor pool located on the premises, as well as the main activities desk for the park.  There are five accessible rooms.  The public facilities are accessible and most walkways are paved.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}