{"title":"Crowden-in-Longdendale","name":"Crowden campsite","address":null,"directions":null,"phone":"+44 1457 866057","tollfree":null,"email":null,"fax":null,"url":"http://www.campingandcaravanningclub.co.uk/siteseekerlite/aspx/details.aspx?id=8060","checkin":null,"checkout":null,"price":"£4.50–£7.30 (adult)","geo":{"lat":53.4895,"lon":-1.893,"accuracy":"ROOFTOP"},"type":"hotel","id":35669,"country":"United Kingdom","city":"Crowden","state":null,"reviews":[{"content":"Nice resort very busy casino, rooms are super clean and outstanding staff, best service we have had in PR. It was our anniversary my wife had a great massage and I played Golf, great course conditions, but very windy! Thanks.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Branson Kihn","date":"2013-07-22 16:37:57 +0300"},{"content":"Been here now for 3 months. Accomodations are excellent. The beautiful people that work here are all very dedicted to make your stay the best. When they get real booked with holidays clients or conventions one can always go over to the Costa Caribe to spend some quiet relaxing time. Yes the food is pricy but this is a HILTON. Great for extended stays Em Jay_56 now in Ponce, PR","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Sydnie Mueller","date":"2015-01-23 13:58:39 +0300"},{"content":"Just got back after 4 night stay. The hotel itself is great , exceptionally clean, well maintained and quiet. There are staff members that need to be trained in hospitality and being cordial. They have a little casino which caters mostly to locals and unfortunately theres a lot of nepotism. Customer grievances are handled hap-hazardly and unprofessionally. The wait staff really try to treat customers like family and do a fantastic job. The casino rates players but All I was able to get after 4 days of blackjack at $10 a hand was 4 virgin pina coladas, I took them. The slots are just tight . Since its that nicest hotel in the area I don't have much to choose from. Since my family lives in the area I have to deal with it. If you come here hope for a positve experience but remember youv'e been warned. It's in a isolated spot, there plenty of sun but beach is like volcanic ash. They charged $4.50 for guests to park overnight even thoough I was in the casino playing but locals have parking validated. They charge a $11.90 resort tax and there are no boats, kayaks or beach toys. They have a little gym and restaurants I did not patronize. A day trip to Ponce area can be done in three hours.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":2.0,"Value":3.0,"Rooms":5.0,"Location":4.0},"author":"Hilton Beer","date":"2015-01-21 00:00:29 +0300"},{"content":"Perfect vacation for the rejuvenating effect. We decided to take a weekend off and go to the carribean. We had been to San Juan last year and thought ah it was ok. Ponce on the other hand, well at least this resort was very good. The only reason I dont give them an excellent was because of the first impression I got from the staff. The person that checked us in wasn't to helpful, granted we checked in at about 5:30am but he could of been friendlier. Other than that two thumbs up, the grounds of the resort are kept very well. Everything was clean lawns where manicured small beach but nice. Casino on the location is mainly slot machines but have 2 craps tables 2 roulette tables 1 black jack table 1 carribean poker table and 2 texa's hold'em tables. The locals are regulars in this casino they seem to be of the retired age and have nothing better to do than burn through their money. The cost of things are U.S. prices, its not like traveling to D.R. where you'll get more for your dollar. Food is expensive in the hotel. $22 dollars lunch buffet and $30 dollars dinner buffet. There's this one seafood restaurant $@!#%'s Seafood restaurant, food was good there service was ok we went there after a drive thru town. The golf area was very nicely kept they actually have residences on the grounds of the course its a 27 hole PGA course, which probably means they get funds from PGA to keep the place that clean. Quick tricks for you if you do decide to go for a short stay 1- Pack light take carryon luggage only 2- Rent a car even if its for 2 days its worth going out into town and looking around. Get the economy size car its cheap and it'll be enough to get you around. 3- Fork over the extra 30 bucks to stay in the executive rooms, this will give you acces to the executive lounge which includes a free continental breakfast and free drinks (non-alcoholic) and snacks throughout the day. Plus you get free internet access and you could check in and print your boarding pass when you are ready to leave. 4- Check out the pier right by the hotel lots of food kiosks for eating typical greasy puerto rican food Overall good fun","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Justus Grimes","date":"2012-09-17 16:48:01 +0300"},{"content":"This is an authentic San Juan inn; inexpensive yet comfortable, with clean classic decor. I booked a room with a double bed. Wind Chimes is one block from the beach, and walking distance to the main commercial Condado area. The room was small, but the bed was comfortable. The shower was clean and the water hot. The sister hotel, the Acacia, half a block closer to the beach had a spa and a restaurant also available to us, but I never had a chance to enjoy it. The staff was the most accommodating and helpful I have ever experienced at a small hotel, with recommendations and concern for my well being. My room did not have a view, but it did have wifi and cable TV. If you want to keep expenses to a minimum but have a safe and comfortable stay in San Juan, I heartily recommend Wind Chimes.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Gonzalo Deckow III","date":"2012-12-15 04:06:12 +0300"}],"public_likes":["Hilton Stiedemann"],"vacancy":true,"description":"Camping and Caravan Club site.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}