{"title":"Paris/14th arrondissement","name":"Hotel Le M","address":"20 bis, rue de la Gaîté","directions":"100 m from Gare Montparnasse and Tour Montparnasse, very close to Saint-Germain-des-Prés and the Luxembourg Gardens","phone":"+33 1 40 47 48 49","tollfree":null,"email":"reception@hotelmparis.com","fax":null,"url":"http://www.hotelmparis.com/","checkin":null,"checkout":null,"price":"€125-250","geo":{"lat":48.839792,"lon":2.323609,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21608,"country":"France","city":"Paris","state":null,"reviews":[{"content":"We stayed here with a groupon June 12-June 16. I upgraded to an ocean front room when I made the reservation. When I checked in I was told that the room I booked (two double beds) was not available due to \"damage\" and they had put us in an ovean front room with one King bed and a pull out couch. I as disappointed about the change, but they discounted the upgrade by $10.00 per night, which I appreciated. When we got to our room on the 6th floor it was clean but not up to the standards of a room we would normally stay in. If I had paid full price for the stay I likely would have checked out right then and went someplace else. The shower head was pulled from the wall, corner molding pulled from the wall, faucet was leaking/dripping and the room just felt run-down. You can read the other reviews about the place needing updates, I agree. THe best part of the room was the view of the ocean, and my children really enjoyed that. My older son appreciated the free wi-fi and it worked well for him. The pool area was great and my younger son and I spent most of our time there. They really seem to put alot of effort into making sure he outside of this hotel looks nice. I would suggest that they do all the pool maintenance and cleaning of the area before the pool opens at 8 am. I had to move all of my stuff one morning so that a maintenance guy could hose down/wash the windows in the meeting area. I think he should have done this before the pool opened. I found the front desk/restaurant/bar staff to be very friendly and interesting to talk to. The staff is likely the best part of the hotel, followed by the pool area. In the end, I am glad I got over my initial dislike of the place because it ended up to be a good stay. I hope they continue with the upgrades and improvements.","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Rosalind Douglas","date":"2014-05-25 15:17:03 +0300"}],"public_likes":["Eloy Witting V","Oda Ratke","Caroline Thiel","Esperanza Wilkinson DVM","Madyson Strosin","Aiden Huels","Ricky Hilpert IV","Sylvia Yost"],"vacancy":true,"description":"The hotel offers 59 fully renovated, comfortable and soundproofed rooms, in an elegant designer setting.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}