{"title":"San Francisco/Nob Hill-Russian Hill","name":"Cornell Hotel De France","address":"715 Bush Street","directions":"at Powell","phone":"+1 415 421-3154","tollfree":null,"email":null,"fax":null,"url":"http://www.cornellhotel.com/","checkin":null,"checkout":null,"price":"$80–$180","geo":{"lat":37.7899,"lon":-122.4091,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25960,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I am actually a timeshare owner with this resort. I am stuck with it since I would not sell it even to my enemy. Every time I stay there, the stay is terrible. The rooms have a stench that a whole can of Fabreeze cannot cover up. Every room I have stayed in has had roaches or some sort of bug in them. They are never truly clean and the managers act as if they do not care about your comfort at all. I will say that if you make a big enough stink about it you at least get some of your money refunded to shut up. However, the cost is not that high so I would rather just get better service. They say they have renovated some of the rooms and I have stayed in both the \"not yet renovated\" and the so-called \"renovated\" rooms. They are both disgusting with that moldy horrible smell and second hand store furniture. I do not believe the owners know what renovation looks like. If I could dump this property, I would. If you are the type of person that spends most of your time on the strip returning to your room to get a quick shower and power nap, then this is the place for you. If you are like me and want to enjoy you stay in your room as well, stay somewhere else, anywhere else. The Motel 6 that rents rooms by the hour has better rooms.","ratings":{"Cleanliness":1.0,"Overall":1.0,"Value":2.0,"Service":1.0,"Rooms":1.0},"author":"Alfred Sauer","date":"2013-02-18 08:16:11 +0300"},{"content":"5/12/2005- We recently spent a week in Las Vegas at the Summer Bay Resort. This resort is located within easy walking distance to middle of The Strip. The remodeled rooms are comfortable enough with nice furniture and appliances. I reserved two one bedroom units for two people in each room. However, I requested no stairs, for the rooms to be near each other, and a roll away for each room. None of these requests were honored when I got there. I was told by the person at the desk just because I made that requests did not mean that these facilites were available. We were given rooms on the second floor, on opposite sides of the building, and the rollaways never materialized the entire week. My husband and I were interested in information about the RCI Points System, so we attended their timeshare presentation. The reward were tickets to a magic show at the Greek Isles. The tickets and show were not worth the time. The Greek Isles is a very run down place. If you attend the presentation, I would take their option for a show at the Sahara instead. The sales presentation was not high pressure, however. Two things that we did during the week that were really oustanding were going to the show, KA at the MGM. It is pricey, but worth it. Also, we spent a day at the Valley of Fire State Park and the red rocks were just incredible. The park is an easy drive to get to, and worth a visit on your own, or taking a tour if you don't have a car.","ratings":{"Overall":3.0},"author":"Aric Cummerata","date":"2012-04-17 20:28:04 +0300"},{"content":"Fairfield Inns may not be Marriott' s top of the line, but If you need a place to stay just before Baltimore that is new, immacate and has great service, then his is the place. The conti e real breakfast was more than continental and the hotel is very family friendly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Madilyn Blick I","date":"2013-05-04 22:12:11 +0300"},{"content":"Let me preface this review by saying that I received a voucher for a free night from a recent horrible experience at ANOTHER Fairfield Inn & Suites. So when I made plans for a mother-daughter overnight trip, I used the voucher for this hotel. This hotel is located right off of I-95 and in a well populated area with hospitals, shopping centers, stores and restaurants. It is one of the first hotels in the development, very easy to find, right next to a gas station, a McDonald's and a Taco Bell. The parking lot always had plenty of spaces, check-in was a breeze, all staff we encountered were very nice and accomodating. The lobby was beautiful, with plenty of seating and as is customary in Marriott brand hotels, hot tea and coffee 24/7. The room was very bright and comfortable. My only gripe was the channel selection on the TV was limited and there was a fuzzy reception on some cable channels. There was no fan in the bathroom but the mirror cleared up pretty quickly once the bathroom door was open. My only complaint (and it's not really a complaint) is that the location of the hotel is still far out from the harbor. Every restaurant or business we went to in that area was at least 20 minutes away each way by car. But the hotel was great, quiet, excellent for our needs and our standards. The only issue is the beds were a bit uncomfortable but that didn't stop me from having a good night's sleep!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":3.0},"author":"Henri Fritsch","date":"2015-03-17 19:07:02 +0300"},{"content":"Clean, Clean, Clean. The staff is exceptional. Katie runs a five star hotel in fine staff, clean accomodations, great breakfast area, free trolley service to restaurants and stores and free Wednesday cookouts.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Cornelius Moore","date":"2014-03-07 01:24:00 +0300"},{"content":"Loved It! Really good hotel. Clean and nice staff.","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Maurine Pagac","date":"2014-12-10 20:39:15 +0300"},{"content":"Let me start off by saying that I would definitely stay here again! However, it may not be for everyone for several reasons. First of all, we rented the \"Ko'olani Kai\", which is directly on the water. When I say directly, I mean we were looking at the ocean from about 20 ft away from both windows in the master BR, as well as both windows in the livingroom! It was just beautiful in this regard and exactly what i had hoped for. There was little (if anything) else on the north shore for the same price that was right on the water. The unit was plenty spacious for my husband and me, traveling with my (adult) son. This 2 BR unit had 1 bathroom, so consider whether this is a comfortable arrangement for your party...it was fine for us. It is, however, a little basic...maybe \"rustic\" in some ways. If you normally stay at the Four Seasons or the Ritz Carlton, you are unlikely to be happy here. The linens and pillows were not what I would consider hotel quality. There was no bath soap or shampoo provided, and many of the windows were not in working condition. Too bad, because we would not have needed the A/C, if we had been able to open the place up and get some of that beautiful ocean breeze! The kitchen was up-to-date, with decent appliances...we did a fair amount of cooking in as there are few restaurants close by. The kitchen is a little \"funny\" though...some of the cabinets are blocked by the new fridge, which is apparently bigger than the original! And, yes, we did see (just one) cockroach, but I killed him! And yes, there were tiny ants that were attracted to the counters if food was left out...easy enough--we simply did not leave anything on the counters. So, overall, we were quite happy here, despite a little tackiness, and these few issues above. Would I recommend it to people? Well, it depends on who you are and what your priorities are. Also to consider...some units are closer to the road, ours was not which we liked.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Miss Ramona Doyle","date":"2015-05-07 13:34:33 +0300"}],"public_likes":["Erick Franecki","Myrtie Marquardt","Mara Bashirian","Taylor Kertzmann","Katarina Cartwright","Carlie Ullrich","Travis Mante DDS"],"vacancy":true,"description":"A small and historic hotel with a French theme.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}