{"title":"San Francisco/Union Square-Financial District","name":"Hotel Nikko","address":"222 Mason St","directions":"between O'Farrell and Ellis","phone":"+1 415 394-1111","tollfree":null,"email":"info@hotelnikkosf.com","fax":"+1 415 394-1106","url":"http://www.hotelnikkosf.com/","checkin":null,"checkout":null,"price":"$101–$200/night","geo":{"lat":37.786,"lon":-122.4094,"accuracy":"APPROXIMATE"},"type":"hotel","id":26223,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The hotel itself is new and well located, but the manager is incredibly rude! On the day that I was checking out, while I packed my suitcase to go to the airport, I noticed that my lingerie bag full of Victoria Secret's underwear worth over US$400 had disappeared from the room. I was in shock! Would it be possible that a hotel of this calibre had thieves? After all, this is supposed to be a 4 stars hotel, not a bedsit next to La Rue Saint Denis!!! I complained to the manager, Ms. Laura Lamblin, who told me that I had to go to the police station (WHERE???HOW DO I GET THERE???) and file a report. Well...for one I didn't have the time because I had transatlantic flight to catch and also, I do not speak French. The incident was very upsetting, but worst of all was the way that I was treated. Ms. Lamblin was supremely rude (doing a disservice to the reputation of Parisians, such a cliche') and decided that the best way to solve the problem was to issue a 'certificate' stating that my lingerie bag was \"accidently' thrown in the rubbish bin by the cleaning staff. And how does that exempts the hotel of any responsibility??????? Also, you had to be a moron not to see that my silk bag was full of barely worn expensive underwear. All I know is that: 1) my belonging were inside the hotel and disappeared; 2) the manager not only did not offer any compensation, but also did NOT apologize. 3) I hope that this message will avoid you going through the same distress that I went through. Ms. Lamblin, what comes around goes around.","ratings":{"Overall":3.0,"Location":5.0,"Service":1.0},"author":"Moises Collins","date":"2015-04-04 20:06:44 +0300"},{"content":"We had two rooms right at the top floor. It was a climb with bags and all. The rooms were acceptably clean and we had clean towers everyday. The shared bathroom/toilet arrangement is not good, some guests are less considerate than others, which means sometimes you have the entire bathroom floor wet and blocked toilets. The walls are thin, which means you can hear your neighbours. Breakfast was the worse we had in any B&B in the UK, terrible croissont and no hot breakfast at all, just plain cereals and toast. They ran out of hot choc on our second day there and was never back on the menu for the rest of our stay. Not worth the price we had to pay, but the staff were friendly.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Estell Hagenes","date":"2015-07-16 16:28:39 +0300"},{"content":"Won't go back. Nice staff but ironing was a real problem","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":4.0,"Rooms":3.0},"author":"Dane Crona","date":"2013-03-04 21:25:46 +0300"},{"content":"Large rooms, free internet & free bottles of water in the fridge! Very clean! GREAT. Local bus brings you in 25 min to Plaza Del Sol!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":3.0},"author":"Kitty Stark","date":"2012-02-06 23:40:38 +0300"}],"public_likes":["Marianne Greenfelder","Amiya Howe Jr.","Preston Gleichner","Gina Hane","Brett Schultz","Jeremie Armstrong"],"vacancy":false,"description":"Swanky large hotel with a boutique feel and very large bathrooms. Rooms are equipped with high-speed Internet, stereos and large flat panel televisions, and you can ask for the few rooms with Japanese style amenities. There is also an indoor fifteen-meter heated pool, whirlpool and a 24h gym. Hotel dining includes restaurant [http://www.restaurantanzu.com ANZU], which serves fresh sushi and excellent steaks. Also located inside the hotel's lobby is the [http://www.therrazzroom.com Rrazz Room Theater], with nightly cabaret and R&B and the Imperial Club rooms on the top floors provide some great views of the city.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}