{"title":"Death Valley National Park","name":"Furnace Creek Inn","address":null,"directions":null,"phone":"+1-760-786-2345","tollfree":null,"email":null,"fax":null,"url":"http://www.furnacecreekresort.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":36.60624,"lon":-117.1467,"accuracy":"ROOFTOP"},"type":"hotel","id":7384,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"We stayed here twice during January 05....Great service. Nice rooms..The king delux suite was really nice (had a living room plus a desk area)..A great breakfast (free) plus a boxed lunch every day and a paper delivered to your door for free. Add to this baked cookies at the desk every evening and you have it all. The rooms were spacious with old world charm (huge windows- tall ceilings and beautifully decorated) with high speed internet in your rm for free....The location was great. We were one block from Bourbon street and all the activities and only a few blocks to the riverwalk....It was on the trolly line if you needed to go any further but for us it was central to everything and we could walk to most rest's and attractions...Will stay again if in town...","ratings":{"Overall":5.0},"author":"Odessa Koch","date":"2013-04-08 02:21:39 +0300"},{"content":"I liked the courtyard with the pool and that some of the rooms opened to this area. We were in a party of 15 couples so that part was good, but our room in particular was down a hallway on the first floor. The part I did not like was that the rooms were HOT!! I was never cool the entire time we were there. We asked for a fan, some of our friends got them, but we were told they did not have any left. It would be a better place to stay when the weather is cooler since the air does not work well. The rooms were not as clean as I would like either, and everything was really old. The carpet was worn out. A reno in much needed.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Mr. Ima Klocko","date":"2013-03-21 06:56:11 +0300"},{"content":"During Spring break 2012 had confirmed reserved room, not multiple rooms. Came back the evening before departure to find room vacated without prior notice or permission. Found suitcases, which had been moved to another room, packed willy nilly with dirty clothes and street shoes packed in on top of clean cloths. Brochures we collected from the different art galleries we visited were not to be found. Never in our lives have we ever felt so violated by such unwarranted action. Even in communist Russia we were always better treated.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":5.0},"author":"Edgardo Bergnaum","date":"2013-08-13 03:22:15 +0300"},{"content":"After being so rudly treated last year by a staff member of the Place d' Armes hotel I looked for another hotel near the heart of the French Quarter for my 3 week stay. Chateau Hotel is 2 blocks from Jackson Square at the corner or Chartres and St Philip Streets. This is a basic hotel made up of some 19th (and possibly 18th) century buildings surrounding a large courtyard with a swimming poor and a much smaller courtyard. All the buildings are at least 2 stories with some having 3. I got a room entering on the courtyard next to the swimming pool. A breakfast of toast, muffin or roll with juice and coffee or tea can be ordered which will be brought to your room at your specified time costing nothing except tip. My maid service was very timely which I liked. When I got back around noon from my morning jaunt the room was always clean and made up. The reception and cleaning staffs were polite. The hotel does offer parking but there is no restaurant. The furnishings were old and drab with a lamp that didn't work (there always seems to be one in these hotel rooms) but I was very satisfied.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Bertram Wuckert","date":"2012-01-16 19:30:57 +0300"},{"content":"My husband and I have stayed at this hotel many times in the last 20 years! It's in a great location in the French Quarter and reasonablly priced. Each room is unique, decorated with antiques. It's old but comfy, a little musty in some of the rooms, but not unbareable, ( I always carry room spray anyway) the sheets are clean and the bathrooms are clean. The courtyard is full of charm, we love to sit there by the pool in the evening and have a glass of wine before going to dinner. They deliver the paper to your door and coffee, juices , and muffins if you leave the menu on the door knob before you go to bed. They offer off street parking in a lot across the street. Wendell will take very good care of your car, he's been there for years! He knows just how to pack your bags in the trunk when you leave! The Service is superb! Great Atmosphere!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Joey Schowalter","date":"2015-04-23 05:31:33 +0300"}],"public_likes":["Katelynn Block"],"vacancy":true,"description":"This inn advertises itself as a first class, AAA Four Diamond historic resort with 66 rooms and full amenities. Rates range from $250–$370 per room with $20 per each additional person. Closed during summer season.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}