{"title":"San Diego/Downtown","name":"Hostelling International San Diego-Downtown","address":"521 Market Street","directions":null,"phone":"+1 619 525-1531","tollfree":null,"email":null,"fax":null,"url":"http://www.sandiegohostels.org/","checkin":"2PM","checkout":null,"price":"Rates start at around $25 for dorm rooms and around $65 for private rooms (rates vary)","geo":{"lat":32.71127,"lon":-117.15979,"accuracy":"APPROXIMATE"},"type":"hotel","id":25153,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"After reading some of the reviews here, we were a little hesitant about what we might encounter upon our arrival in the Big Easy. But . . . We found this hotel to be really good. The staff was EXCELLENT - from the moment we pulled up in front of the hotel until the moment we pulled away. The lobby was clean and open - like Embassy Suites are usually. Our room was in great shape. Clean. Quiet. Comfortable. We even had a small balcony overlooking Julia St. Breakfast was good and plentiful each morning, and again the staff was so friendly! The building was not perfect. Sure it has seen its share of conventions and Mardi Gras and football games I am sure. This is New Orleans for heaven's sake! We never felt uncomfortable. And would certainly consider staying here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Lauretta Thompson","date":"2014-11-15 00:41:07 +0300"},{"content":"I stayed at this property for the CTIA convention this year. When I travel domestically I try to stay in Hilton or Embassy Suite properties as they tend to be convenient for meetings. Check In: We arrived mid day, before check in time. We were attended to quickly, and I suppose since I am the person with higher priority I was given a room and the other two in my party had to wait. That is too be expected in convention time, and they were polite and organized about it. What I did not like was that one of my people was put in a different type of room, a non suite (which I did not know Embassy Suites had) and the rate was the same. The clerk knew this was a bad deal and could not look us in the eyes, mumbled she was sorry and dismissed us. When i got to my room I found either it was a smoking room or someone smoked there, and since the hotel was full, that was that. I have significant alergies to smoke so that is an issue, I had made our reservations 5 months ahead of time just to make sure that we got non-smoking rooms. Dining Room: We did have a few meals in the restaurant. Food was good, and the service very polite, but painfully slow. Manager's Cocktail party. A little above average in terms of the snacks etc. It is a large area for the event so there is plenty of comfortable seating. Definately a high point :-) Breakfast The buffet line was organized and moved well. Typical Embassy Suites breakfast, which is a selling point for the restaurant. Gym This is a little gem in the hotel with enough room and machines to accomodate the crowd. Very well done and maintained, another high point. Overall property condition The property, being very close to the convention center (it is two blocks away), gets alot of hard use I am sure, and it shows. It is a well worn property, generally clean. My room had a newer flat screen TV in both room, the carpet, and furnishings were tired. And the smoke smell (see previous comment). Staff I was impressed with the staff here in general. They were friendly to a fault, and smiling. Someone has trained them up on customer service, little things like taking you to where you were asking about, instead of pointing and saying \"its over there\" is pretty rare these days. Kudos to the GM or person in charge of training. Overall the staff, the manager's reception, and breakfast slightly overweigh the condition of the place, so we will most likely return. Would be nice to see this property get a facelift though. There are alot of nice hotels close....","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":4.0},"author":"Jack Crona","date":"2013-10-04 08:48:42 +0300"},{"content":"3 of us went to New Orleans for a conference at the Convention Center. The hotel is 5 minutes walk from the Convention Center. Staff is very friendly and professional. A hot breakfast is included. There is a free Happy Hour from 5:30 - 7:30pm. You can get the street car (tram) from River Walk or from Julia Road to the French Quarter or the Garden district or wherever. Both stops are within walking distance from the hotel. There was a small balcony off the bedroom. The front door faced the inner courtyard of the hotel which was very nicely decorated. Cons: The sleeper couch in the room was not very comfortable. Sunday night it was extremely noisy outside the hotel. Sounded like cars racing around. They need to put an extra mirror in the room out of the bathroom so that someone can be showering and someone else could be doing their makeup. I would recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":5.0},"author":"Queen Grant","date":"2014-04-07 21:53:57 +0300"},{"content":"Wasn't sure what to expect - we were staying here for the first time during Mardi Gras (a crazy time) and some of the reviews on here were less than positive. Yes, the hotel (main tower) did seem a bit aged in places but people, New Orleans is not a new city! Our experience - from the valet to the front desk to the room - was very positive. The room was a perfect size for us. We had some special requests to accommodate friends joining us and the front desk staff could not have been nice or more helpful. The valet staff was great, even when parades were blocking street and tempers could have been short. Our room overlooked the atrium, which could get noisy, but our room was quite soundproof. A great location as well, especially for a family with children - children's museum, aquarium, insectarium and two museums all within walking distance. Great restaurants in the neighborhood too. We would definitely stay here again.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Brenden Aufderhar DVM","date":"2012-02-28 04:15:43 +0300"},{"content":"We spent three days at the Embassy Suites in New Orleans. I read the reviews from other TA members, some of those reviews were negative but I am an ES guy so I gave it a go. Our stay was excellent. We were treated like VIP's from the moment we arrived right up to the time we left. The staff goes the extra mile to ensure your happiness. We requested the early check-in (granted). We asked to be placed as close to the top as possible (15th floor) and when I was told that there would be a cost for the internet and playfully complained, it was given to us free. Yeah, the rooms are smaller than the average ES but the hotel was not built for ES. Our room had that mold smell so we opened our front door and the patio door and after a few minutes it was fine. The breakfast was great (although they do not have shrimp at the omelet station) with lots of options. I thought the location was perfect, close enough to walk to the Quarter but far enough away from the noise (it's about a 10 down, 15 back after a few adult beverages). The Riverwalk Mall is about 5 minutes away. I plan to return for the French Quarter festival and if I do attend, the ES will be my hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Steve Hintz","date":"2013-02-08 11:09:33 +0300"},{"content":"The hotel has a very good location, close, but not to close to where the action is in New Orleans. It is in a rather quiet and upcoming part of downtown called the Warehouse/Arts District. I experienced two extremes regarding service. On one hand, the porters and bellhops were excelent and nice. Some people at the reception desk were not as nice. The bartender was rude. During the \"Manager's Reception\" there were two people in line (one was I) and three bartenders. I moved over to the bar and sat on a stool as to suggest that another bartender could help me. Instead, the bartender had me go back on the line and two more people had taken my spot. The bartender noticed but said nothing to them. That was rude. He was so slow serving that I just left the line instead of waiting. I guess the instructions are to take their time with the \"Manager's Reception Customers\" so that not much is consumed. On the brighter side, breakfast was great ad the rooms were big and spacious. The coffee served was not best quality, but...The hotel is set up like a motel and the room doors look to the outside. This can be a problem when it is cold outside. My suite's door was old and rusty and the shower/ bath faucet connection were faulty. I did not report this as the water still flowed. There are no in-room safes and that is a drag. There are other more expensive amenities in the room, but having safes should be good. The place could also take a little better maintenance. Overall it was not bad, but some things may be improved.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Frieda Beer","date":"2015-07-17 19:50:24 +0300"},{"content":"My sister and I stayed in this hotel for a long week to see the city. The rooms were spacious, but rather musty. All in all - the hotel was good and we really liked the free breakfast and managers reception every afternoon. The only drawback was the front desk staff... they were very rude - although the rest of the staff was polite. would stay again for the price.","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":3.0},"author":"Jacky Swaniawski","date":"2012-08-19 09:26:43 +0300"},{"content":"The Friendliest City in USA. Always allow 2 weeks when visiting this City, as there is SO much History to See, Learn, and Explore.The choice of Restaurants is endless .Madi Gras is a Must. Allow at least 6 days for that. PublicTransport is Good. Not so much Jazz to be found during Madi Gras, but plenty of varied music,fun,and madness. You need to be willing to walk.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":2.0,"Location":5.0},"author":"Paula Hansen","date":"2012-04-11 17:51:23 +0300"},{"content":"We stayed here over Halloween weekend. It was clean and comfortable. It is not in the French Quarter but is close to it (and you could walk there or take the waterfront train/trolley). It is within walking distance of the Riverfront shops/mall and waterfront train/trolley station. Mulates, a terrific cajun restaurant, is right down the street. It is near to other restaurants as well. As with most ES, there is a free happy hour and breakfast which is a plus. I would definitely recommend staying here is you don't mind staying a little outside of the French Quarter. The rooms and bathrooms are nice and clean. It is a good value.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Vilma O'Reilly","date":"2012-05-31 00:24:21 +0300"}],"public_likes":["Franz Connelly","Mr. Theodore Donnelly"],"vacancy":false,"description":"Located in Gaslamp Quarter, clean, friendly, offering 24-hour desk service, free breakfast, laundry facilities, lockers, and wifi. This hostel is part of a non-profit organization, HI-USA. The only hostel in this area to offer air conditioned rooms with iPod dock alarm clocks. Also offers free activities including: Walking tours, pub crawls, a screen printing workshop and bicycle tours. In addition there are three donation based dinners offered per week.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}