{"title":"London/South Bank","name":"Express by Holiday Inn London Southwark","address":"103-109 Southwark St, SE1 0JQ","directions":"tube: Southwark","phone":"+44 20 7401-2525","tollfree":null,"email":"info@exhisouthwark.co.uk","fax":null,"url":"http://www.exhisouthwark.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.5061,"lon":-0.1022,"accuracy":"ROOFTOP"},"type":"hotel","id":16346,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Nice enough....... just not my thing Just returned from 3 nights at the Riu Taino. We were down for a small family wedding. As a result we saw different kinds of rooms. All were clean and had hot water. In some rooms plumbing screamed. Other rooms were close to the Caribbean street and had to deal with loud music and crowd noise in the evenings until around 11:30PM. Our room was closer to the beach and quiet. Maid service was excellent. We were on the 2nd floor of a building and our AC was not super effective in the hot and humid summer weather but we had a ceiling fan and that helped.Most of the other guests were European and we heard French, German and Spanish principally. The property is well maintained and has an abundance of palms, tended flowers and grassy patches. We saw some peacocks wandering around. The beach is exquisite, very fine white sand, The sea warm and benign. Every morning I walked from 6:30 - 8AM and witnessed super efficient beach cleaners raking up seaweed from the tide and putting it in huge black plastic garbage bags. It was a very beautiful and peaceful time of day. The major pool scared me. People stayed in there longer than bladder control might extend. Heavy chlorine clouded it every night but I didn't feel like jumping in the next day and drinking at the in-pool bar!The food is fine if not particularly good. Breakfast was my favourite meal. Lots of fresh fruit, many varieties of eggs, deli meats, croissants, breads and freshly squeezed juices. Lunch and dinner served burgers, pasta, fries, rice, beans, chicken in various guises and always, a few kinds of pizza. Not inspiring but okay. Beer was cold and satisfying. Wine in casks was essentially not potable. Very inferior. Other booze not my thing when generic and served with sweet who knows what! Others seemed to be enjoying it plenty and plentifully!Front desk service was good. Especially Gregory. But all spoke English and were friendly and helpful.If you can stand the crowds, for a reasonably priced all inclusive I'd say it is pretty good.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Claudie Lemke","date":"2015-09-15 22:58:50 +0300"},{"content":"Had fun.. but not a 5 star hotel... Me and my boyfriend stayed at the Riu Taino On May 14th - May 21, 2007. it was a 5 star hotel.... but not really... here is my take on the hotel...Beach: Beautiful... loved it... water was cool, and wavy.. There was lots of coral reefs to snokel and look at fish. Lots of shade on the beach and very clean. If you walked down the beach you could go to a market that sold everything for cheaper then the stores in the hotel or on carribean street. Food: Well the food was not very good.. the same food all the time. We never got sick so I guess thats a good thing. The a la carte resturants were good, we enjoyed them. The alcohol is very basic and not many international drinks to chose from. Bring your own mugs to keep the drinks cold beacuse the cups that they give you are small. Pool: It was nice, we only went in it once. We were at the ocean the whole time. the pool is bust with lots of drunks and young people! Rooms: Ask to be put near the frount of the beach or the pool. Our room was in the middle of this huge resort and it was a long walk to the beacheveryday. I feel sorry for people whose rooms were all the way at the back. Basic rooms. Kept very clean . Maids were Awesome! never any problems with anything being taken from our rooms. Use the safe though. Don't lose the key 50us dollars to replace!Weather: Awesome, couldn't of asked for better! No rain only once at night time .... sun, sun, sun and more sun... It was hot..so bring lots of sun screen and hats.Entertainment! : Was funny and great! we loved it... the main guy who does all of the hosting and runs the animation was so funny and we loved him.. The shows aren't las vegas style but they are a great way to pass the evening and we laughed at them. During the day they had the entertainment by the pool, we werent there that much.Overall a great vacation. We had a lot of fun and enjoyed ourselves a lot. Beautiful gardens and beach. Lots of stuff do do and the people were very nice to us. I wouldn't say that it is a 5 star resort more of a 3 1/2 - 4 star. But You can use the bambu which is next door and was very nice as well.. the only thing with the Riu bambu is that one afternoon while we were eating lunch in the restartant we found bugs.. i mena lots of bugs in our soup... it was really gross.. but we didnt' let it ruin our trip. Be careful for ant bites i got them everywhere all over my legs and feet. It was really annoying... and there were a lot of flies everywhere. But we didnt' bring any bug spray so you might want to bring it.!","ratings":{"Service":3.0,"Business service":3.0,"Cleanliness":2.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Nayeli Hahn","date":"2012-10-11 02:06:19 +0300"},{"content":"Mixed Feelings My boyfriend and I traveled to the DR from March 9-14 for a short getaway from the daily grind of the East Coast. Where to begin? Before we left, we read these reviews religiously, and I will attempt to make this entry as helpful and honest as possible for whoever is traveling to this resort next. Overall, we truly enjoyed our stay. The people were great, the staff was very friendly, and the entertainment staff really did work hard to keep us engaged and entertained. The drinks were great, the beach was beautiful, and overall we're really satisfied with our vacation. The food: if you love meat, look before you eat, numerous times I cut into a piece of chicken and it was still pink. Also, we discovered that we could walk to the Riu Bambu up the beach for dinner! You should also explore Taino when you first arrive, we discovered two restaurants and another buffet place to eat on our 2nd to last day there. The resort: While Taino has the best beach access from the resort, Riu Bambu had a much more fun and lively crowd for us, especially since we are in our early 20's! We even got to dance under the stars to a live musical performance. : ) Also, the sunrise is gorgeous so try to wake up to see it one morning! My boyfriend and I love to take photos, so it was a great opportunity to take some great shots. The people: Lots of Europeans who like to wear Speedo's and go topless on the beach. Everyone was really fun loving though, which made it pleasant!VERY IMPORTANT: When it comes to the trips that the resort or your travel agent may recommend that you take, BE AWARE! We went on a day trip to SAONA ISLAND, a secluded island where we would be given unlimited alcohol and enjoy a bbq lunch on the beach, and were sorely disappointed by (1) the fact that it took 5+ hours to just get to and from the island itself, (2) the unlimited alcohol was just Rum and Coke, and what they call mamajuana and (3) the food made my boyfriend so sick that he has spent the past 12 days in the hospital (he just got out, which is why this review has taken so long for me to post). We think he caught something from the pork he had on the beach, or the fruit he had been eating, but we aren't sure. All we know is, he was fine before we went, and extremely sick the day after. The trip cost us $80 each and in our opinion, was NOT worth it, especially after the illness. ALSO (possibly even more) MPORTANT: DO NOT DO NOT DO NOT drink the water, don't even brush your teeth with it. People get really sick from it, and it just isn't worth it. Shopping: Shop AT THE RESORT SHOPS on Carribean Street at Taino- DONT buy stuff from the vendors who sell things in the lobby, because they are there to rip you off, AND the hotel doesn't even endorse their products. We bought some rum from one of the guys, and he started at $40 a bottle, and we went to caribbean street and found the same bottle for about $12. So (1) bargain with them, and (2) don't bother getting it if the price doesnt seem right, you'll find it cheaper in the shops. Also, the stores at the end of the beach have some cute stuff but be careful they will pounce on you to buy things the moment you look in their direction! Airport: Don't let people grab your bags, you will have like 6 people come try to help you and then you will have to tip each of them because they won't leave UNTIL you do! We carried our own bags, and never had that problem, but saw another couple who had 4 bags and were attacked by helpers. The bright side is, if you hate carrying your own bags, someone will be there to help you out : )Lastly, the ROOMS: Yes, the beds are hard, yes the sheets are course, yes they are a little outdated, and yes there are some mosquitoes in the room. SO: if you are particular about that kind of thing either (1) find another hotel with better beds and newer rooms, or (2) tire yourself out SO MUCH throughout the day that you will forget how uncomfortable the bed is! Also, if you leave money laying around in your room, your cleaning person may think its a tip for them (this happened to us with a few pesos), so be aware of that!DONT FORGET TO BRING: pepto bismol (it costs $9 on the resort!), bug spray (to fight those mosquitoes), and sun block (there were some REALLY red people). Also, the CDC says Punta Cana is a high risk area for malaria, so talk to your doctor if you want to be overly cautious. I would do that if we went again to that area. To sum up, would we go again? Probably not. Would we recommend the place? If you're looking for a few days of RR, a ladies week away, or just a budgeted vacation, then definitely. If you're planning a honeymoon, look elsewhere... heck, look at a different country, I hear Vancouver is pretty awesome. And you can drink the water. Contact me if you'd like photos or more information! We'd be happy to provide you with any help we can : ).","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":5.0},"author":"Jeanette Dickinson","date":"2013-05-19 08:35:28 +0300"},{"content":"Riu Taino a very nice holiday I just arrived home from the Riu Taino yesterday and had a wonderful time. I'd like to address some of the things I read in past reviews about this hotel. The rooms are a little dated so I wouldn't call this a 5 star but the slightly shabby rooms did not affect my holiday one bit. They are very clean and the staff at this hotel are constantly working to make it nice. We had face clothes in our rooms as well as pillow slips. The beds are firm but they are the same as any other Carribean resort that I've been to. There is no bottled water in the resort except to buy at the gift shop but the gallon jugs they provided suited me just fine for teeth brushing. Any time I ran out of anything in the room such as pop, beer or towels I called reception and they were at my room within 10 minutes. The grounds are wonderful and the beach is spectacular. The food was plentiful and I was always able to find a wide variety of things to eat. Like in all foreign countries they try very hard to make the food to our standard but it always had a Dominican twist to it. It's true that they put corn and weiners on pizza but they also had many other varieties so you didn't have to choose it if you didn't wish to. We had no problems with bugs or flies at any time on the resort or near the food. The staff was very helpful and the Animacion team worked very hard to entertain. The pools were also very nice and never in my time there did I smell sewage by the pool bar as had been reported. We had one day of rain and while walking around we could smell sewage but that's all part and parcel of going to a country that doesn't have the same level of sewers systems that we are used to here in North America. The one complaint that I have is that they will not let you change your wet beach towel in for a dry one on the same day. One towel per person per day is the allotment. To get around this we simply had one person take the towel back and obtain the card and sent another of our party to retrieve a new towel. All in all I have tosay that my holiday was a success and worth the money spent.","ratings":{"Service":5.0,"Business service":2.0,"Cleanliness":5.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Miss Leonardo Littel","date":"2014-09-30 11:20:26 +0300"},{"content":"Absolutely Average We just got back yesterday from the Riu Taino and had read many reviews on this resort prior to going. We had read extremely positive reviews and negative ones. We have travelled to other islands in the past so we had a good basis to compare this one with. We both would rate this hotel as a absolute average to slightly above average resort. We booked this vacation through Sunquest Vacations who rated the Taino as a 5 star. Both my wife and I would say it was a good 4 star but in no way a 5 star.If you are looking for a 5 star resort then stay at the Riu Palace (sister hotel) a few doors down. It was absolutely beautiful! Getting back to the Riu Taino..... The rooms are in need of updating. The bed covers were worn and stained. Their was mold in the bathrooms and the beds were singles. We had a family of four and booked 2 Super Saver Rooms. Our price was fantastic at only $798.00 CDN plus taxes each for 1 week. We stayed from Jan 1-Jan 8 2007. The pools are not heated and were probably about 75 degrees. Not freezing but definetly cooler than expected. The ocean was about the same temp. The beach was beautiful (one of the best we have ever seen). The grounds crew kept the resort very clean but again it is in need of a serious update. The food was average (good selection) but not very tasty. The kids club very rarely had anything for the kids to do and only ever had 1 or 2 kids in it. Our kids are 8 and 9 and they chose to entertain themselves rather than go to the club. Most of the staff were very friendly but some were rude and chose to ignore you. One of the staff said to friends of ours (14 year old daughter) that she and him would do the boom boom and she would have his baby in 9 months. NOT APPROPRIATE!!! In fairness to the staff member he may not have known how old she was but he should not be saying that to any guest regardless of age. On another note the weather was about 25-30 degrees celcius every day. It was very breezy and the waves were fun for the kids. Everyday a brief downpour would happen for about 5-10 minutes (once or twice per day). Overall as mentioned before everything about this hotel is average. If you go there expecting a 5 star resort you will be disapointed. Expect a true 4 star resort and you will enjoy your stay. The family that we met from England said that it is rated a 3-1/2 star resort in the English brochures. For the value it was a good vacation but we will look to stay at the Riu Palace next time.","ratings":{"Service":2.0,"Business service":2.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":4.0,"Rooms":2.0,"Location":4.0},"author":"Hank Kunde","date":"2012-09-22 18:40:33 +0300"},{"content":"beautiful beach We just returned from Punta Cana where the weather was gorgeous and the beach was the best we have every seen and we have been to Hawaii, Jamaca, Riveria Maya, Greece, Spain, California and many east coast beaches. We traveled with my three teenage children, my sister and her teenage son. All agree the beach was the best. Water sports were convenient and easy to obtain. We went snorkeling (free with the resort) with some interesting fish in the right corner of the swim area, kayaking (free with the resort), scuba diving (free trial in the pool, but extra to go on a dive) and parasailing (paid extra). If scuba diving remember to get a note from your doctor if you are taking any prescription medications!The accomadations were very nice. We liked the villa type accomadations (4 units per villa), but booking through Orbitz (even when we contacted the hotel 4 weeks prior to our arrival) we did not get all our rooms in the same building. Plus there are no connecting rooms which make it difficult for family travelers. The air- conditioning was great in all our rooms. The higher the room number, the less noice and traffic, but the maids came later (3-4 pm) at the high room numbers. Other reviews noted the pillows are all flat and there are no wash clothes. We concur, but we did not let this ruin our vacation. Food was very good in the dining area with a great variety. All the teenagers found something they liked and all had some foods/beverages that they have never had before. The food is very un-American, which was OK with us, but would be a problem for people who were reluctant to try new things. There were french fries and pizza available at each meal for the gastronomically impaired. There is an abundance of fruit, but the staple vegetables are cabbage and carrots. Which may have contributed to the loose stool problem experienced by 4 of 7 people in our party. Also the water from the tap is not drinkable. This was very hard to remember when you are brushing your teeth. Drinkable water is supplied in abundance, but it is hard to remember not to drink from the tap. We came prepared with an antidiarrheal medication. We did eat out at the restaurant for Carribean food and Steak and our whole group agrees that it was not as good as the buffet. We do not recommend the experience.The resort pool was very nice and the 14 year old boys spent most of their time at the pool, with the 18 year olds at the swim up bar with Hector. We always got loungers, but it was a little competative by the pools particularly on Fridays and Saturdays. There were always lounge chairs on the beach with lots of palm trees to rest under. The Entertainment crew was very enthusiastic and multiligual. We attended one show, the kids loved the bingo and watched some poolside programs. They were good -- the usual quality for the resort. Probably 25% of the resort guests were from English speaking countries. We are used to travel in Europe, but if you are not then the fact that English is not the primary language can be a bit of a challenge. We did not go off the resort this trip and still found plenty to do. There does not appear to be a children's program and there were not a lot of teenagers at this resort. That was nice for us, because it was truly a family vacation, but the teenagers said they would like to come back with a group of friends!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Randi Price","date":"2015-08-23 12:57:08 +0300"}],"public_likes":["Ms. Ismael Hintz","Cielo Powlowski","Toney Bergstrom","Jessica Turcotte","Lula Bauch"],"vacancy":true,"description":"Situated on the River Thames, clean and charming hotel.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}