{"title":"Yosemite National Park","name":"The Ahwahnee","address":null,"directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_TheAhwahnee.aspx","checkin":null,"checkout":null,"price":"Rooms and cottages start at about $500 per night, with suites running up to and above $1000 per night","geo":{"lat":37.745744,"lon":-119.574186,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33883,"country":"United States","city":"YOSEMITE NATIONAL PARK","state":"California","reviews":[{"content":"This was our 4th stay at a Disney property and one of our best!!!! Certainly it's location stands out as #1. We arrived at the hotel AT 2:30 finding our room available, 10th floor bay view with easy access to the Contemporary via elevator to the 5th floor walkway. Our one bedroom slept 5 people with ease. There were two full baths with a jacuzzi in the masterbedroom, balcony, flat screen in both living room and bedroom, everything you would expect in a vacation club property. Since we are not vacation club members we were unable to access the 16th floor viewing area for the firework display.....not to worry, the view from the 5th floor walkway provided an unobstructed view of Cinderella's castle. This viewing area also afforded you the opportunity to watch to \"Electric Light\" parade on the Bay, however, this parade was BORING. Recommendation - do not waste your money on a Castle view, depending on your room, you will will view the track to the monorail and/or parking lot until the Castle lights up! I have two complaints regarding this property, 1- I do not believe housekeeping is efficient keeping track of \"vacation club rooms\" as opposed to \"guests\". Vacation club members have different guidelines as to the upkeep of the room and restocking of supplies. I was never able to get a firm answer from Concigiere whether the pullout couch and chairbed were supposed to be closed after the room was cleaned each day(as would be on a cruise). Instead the beds were made and left open, which I found to be somewhat inconvienant and made the room like unkempt. Secondly, this may seem like an silly complaint, except this is a Disney property. As you leave the Contemporary heading towards the walkway of the Bay Lake Tower there is a large gated unused landing that runs under the monorail. This part of the hotel had garbage, chairs, wet towels on the floor and dirty cigarette containers about. At no point during our 8 day stay was this area cleaned. Also, being a smoke free enviroment, guests would sit in the stairwell between both buildings smoking - a little unexpected for a Disney property. The delux dinning plan is a must!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Roma Schiller","date":"2015-04-17 21:47:55 +0300"},{"content":"We visited in June 2010, in a 2 BR \"Lake View\" room. I checked in at 10am on a Sunday and our room was ready. We were spending 11 nights at Bay Lake in a \"Lake View\" and spent just over $15,000 for the whole package, including the deluxe dining plan for 6 guests. For that cost, I expected a \"Lake View\" to actually have a view of the lake. However, we were assigned to room 7605. Our room overlooked the building opposite ours and the pool. Less than 25% of our window view was of the lake. I was very disappointed and called the front desk. After being told by the person answering that indeed room 7605 was a \"Lake View\", I asked to receive a discount on the cost as this was not a fair \"lake view\". A manager got on the line and agreed to transfer us to another room after 4pm. We were transfered to 7602 and it was better, but still not a wonderful lake view. There were swampy looking trees that blocked a significant part of our lake view. On the positive, we could view the fireworks from our balcony. Disney REALLY NEEDS to reclassify the views. There's no way the rooms on the inside of the \"C\" shape of the building should be considered \"Lake Views\". For the amount of money we paid for a \"lake view\", I cannot believe Disney would think it acceptable to have our balcony facing the balconies opposite ours. It was very disappointing but they did make it semi-right. The room was clean, had nice amenities and was convenient to everything. I would recommend it but I would worry about the risk of paying for a so-called \"Lake View\" again. I think I'd go for a \"standard view\".","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":5.0,"Rooms":2.0,"Location":5.0},"author":"Delilah Windler","date":"2012-10-20 15:43:10 +0300"},{"content":"Since I was a kid, I wanted to stay at the Contemporary Resort, and after many....many years, I can say it was worth the wait. The Contemporary has allot of appeal with its architecture, decor, the monorail in the lobby, the view and so on, but an unexpected highlight for me was the location. With monorail right there in the lobby, access to the Magic Kingdom and Epcot is easy and convenient and with the bus stop just outside the main lobby entrance, catching the bus to other Disney Parks and attractions was a breeze. Also with the bus, you're at the beginning of the run to the other parks so we always got a seat, and coming back we were the first ones dropped off. Crowds on the bus and monorail weren't bad at all, far less than I was led to believe they would be. Transportation by boat is also available at this resort. This ease of transportation made staying at the Contemporary well worth the money! Regarding the room, I have no complaints. The room was tastefully furnished in a kind of a \"retro-contemporary\" look (make sense?!) and not the Disney theme that we experienced at the Disneyland Hotel in California. The room was comfortable and clean (I found the bed very comfy) and the cast members always made sure we had clean towels and linen and things were in order. The room was quite with the only thing breaking the silence was the occasional over excited child in the hallway trying to get their parents to move a little faster to get to the park (what else would you expect at a Disney hotel) or the nightly fireworks at the Magic Kingdom. These are sounds you would associate with a stay at Disney and so they only add to the \"Magic\"! The only complaint we did have is that there is no counterpace in the bathroom to put things on. Also it is a long walk from some of the rooms to the main lobby, so if walking is an issue with you, keep this in mind. As for the restaurants, we ate at the The Contempo Café and The Waves Restaurant. The Contempo Café is a self serve restaurant and was handy when you wanted to grab a quick breakfast before you head off to the parks. The food is ok, actually some of the baked goods were tasty, but it is a bit pricey as with most things at Disney but it is kinda cool to watch the monorail pass by when you're eating at the Contempo! The other restaurant, The Waves, the food and service was very good with the only complaint I had was the food is more adult oriented so sometimes our 12 year old ordered off the child's menu. Unfortunately with the child's menu, the portions were a bit to small for him. Other things at the Resort include a couple nice gift shops, an arcade, a pool with a slide and lots of activities to keep the kiddies entertained. You can also watch the fireworks from the resort and they pipe in the music for it, so it's a great way to watch the show, and avoid the crowds. Check-in and check-out was easy and there were no issues. Staying at the Contemporary also allowed us to use the airline check-in service so we checked our bags and got our boarding pass right there at the resort. Not all airlines use this service so check with the resort to see if yours does. That's it. I hope you have a MAGIC time at Disney!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Tre Gaylord","date":"2015-02-04 10:01:42 +0300"},{"content":"I was just at Disney with 4 adults, a 4-year- and two 2-year-olds. This hotel was perfect. We got a 2 bedroom condo, perfect for two small families. It had three full baths which were nice when the kiddos were napping and one of us had to take a shower or whatever so we didn't wake the kids up. The living and kitchen area were in the middle of the bedrooms, which kept each family very private (and we couldn't hear each other - crying or whatever). The pool at the Bay Lake Towers had a zero-entry and small slide PERFECT for little ones who just wanted to splash around. It also had a little \"splash\" area, with padded floor. There was also a pool bar (great cocktails!!) and it had light food as well, sandwiches and etc. You could always walk to the Contemporary for food - short walk in my opinion and not a hassle at all. We ate breakfast at the condo each morning, then ate lunch and dinner at the Disney parks or hotels. This hotel is perfect for just walking to the Magic Kingdom for a quick bite to eat! I really enjoyed my trip to Disney, and this hotel really made it magical for us....okay, Magic Kingdom was the most magical! You could watch the fireworks from the hotel. Chef Mickey is at the Contemporary as well, I recommend it. Most of the Character dinners were buffets, but let me tell you, they were the best buffets I've ever had. And like good/gourmet food. The food was fabulous! They had kid friendly, as well as adult friendly (fish/salads) food. I was impressed. Everything about Disney is great. The service was excellent as well. I just can't complain about anything - well one thing - DON'T TAKE YOUNG KIDS ON THE HAUNTED MANSION RIDE!!! That is my only regret. I also recommend if you go to Disney to go to www.tourguidemike.com and check out his services for getting you through the Disney parks on the least crowded days, and he also tells you which rides to ride first and etc. It is worth the $17 fee! I've used his service twice, and it got us through Magic Kingdom without waiting in crazy lines! I could write more, but it would go on and on. Please email me if you need any further info. Have fun at Disney if you are going and I would stay and pay the extra money to be as close to Magic Kingdom as possible. It makes the world of difference when you are so close and don't have to take up time on a shuttle or monorail. Happy Travels!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mable Huel","date":"2014-01-20 18:17:54 +0300"}],"public_likes":["Gisselle Roob"],"vacancy":false,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] 99 luxury hotel rooms and 24 cottages in Yosemite Valley.  The lodge is a national historic landmark and the most upscale lodging in the park, with rooms facing Half Dome, Glacier Point or the West Valley.  There is a small heated outdoor pool.  There are three fully accessible rooms, four partially accessible, and two fully accessible cabins.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}