{"title":"London/Hammersmith and Fulham","name":"Jurys Inn Chelsea Hotel","address":"Imperial Rd, Imperial Wharf, SW6 2GA","directions":"train: Imperial Wharf; tube: Fulham Broadway","phone":"+44 20 7411-2200","tollfree":null,"email":null,"fax":null,"url":"http://londonhotels.jurysinns.com/jurysinn_chelsea","checkin":null,"checkout":null,"price":"From £79","geo":{"lat":51.474,"lon":-0.1836,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16174,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"I gave the all-inclusive concept a second try - never again Positives:- gorgeous beach with plenty of chairs and palms on beach for shade and sun at the same time- perfect weather 83F sunny and cloudless daily- free water sports (if you thought ahead to reserve two to three days in advance)- attractive pool area- no tipping necessary or expectedNegatives:- Really really bad food - We found nothing appetizing in the main dining areas and there was no variety each day. So, we tried the ala carte restaurants where reservations could only be made between 7am and 10am the day of (very annoying). This food was worse than the buffet food to the point where people were walking out in the midst of their meals. Specifically, the Steak House was horrible. My steak was medium rare and I have never chewed so hard on a piece of steak - it was like beef jerky. And, the restaurant was the regular Mama Juana dining pavilion with a section set aside for Steak House and Mediterrean. Also, I found several insects in my food.- bad drinks - the drinks were all sugar, no alcohol and not very diverse. What bar can't make a mudslide? Also the bars smelled a little like rotten fruit- unaccomodating staff (1) they ran out of pool towels at 10am and would not hand out more until 3:00 (2)we didnt get maid service on our second day and they would not call housekeeping to the room when we called the front desk - they told us to wait until the next day and would not give us fresh towels in the mean time (3) no change at the water sports booth - so when we gave $10 for the $3 daily insurance - they couldnt make the $7 change - so we had to walk around with hand written IOUs and hope they had change the next day - bugs in rooms - bed bugs, floor bugs, you name it bugs- awful bedding - pushy resort staff walking up and down beach constantly trying to sell extra activities- no ATM on resort","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":2.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":1.0,"Rooms":2.0,"Location":-1.0},"author":"Antonio Breitenberg V","date":"2013-06-24 07:17:00 +0300"},{"content":"Great Holiday My husband and I stayed at the Riu Bambu from 31st October for 2 weeks. We are both 35 and quite well travelled.The other reviews that have been submitted pretty much cover our points so we will try to keep it brief.Travel - We travelled with Thomson. Flight and transfers were really good and we found the Thomson reps to be informative and friendly. Transfer took about 45 mins from airport and the check in at the hotel was quick and well organised. So much so that we were in our room with 10 minutes. Transfer back to airport and return flight also on time and no problems.Rooms - Cleaned immaculatley every day. Fresh towels and bedding on a dialy basis. We requested extra pillows and they were brought to our room within 10 minutes. Air-con worked well and rooms also had a cieling fan. Clean bathrooms and a good selection of toiletries. Mini Bar in room was well stocked and replenished every 2 daysFood - We had read alot of mixed reports on the food so didnt quite know what to expect. We didnt eat alot but this was partly because it was so hot. The main buffet restaurnat was great, lots of choice at breakfast, lunch and dinner. There are theme nights every week such as carribean and mexican and the staff really work hard to make sure everyone has a great night. There are also 3 A La Carte restaurants. The menus were limited but the food and service was first class. The only complaint we would have was that the main restaurnat was very hot at all times and is in desperate need of air-con.Pool - Pools were clean and always well maintained. Larger pool with swim up bar at times did get noisy but if pool games arent your thing then there is a quieter smaller pool.Beach - This really was the highlight of the whole holiday. The beach was stunning. Powdery white sand and clear blue sea. Lots of sunbeds avaliable all day and natural shade if you need it. The beach was really clean and well maintained. Pool and beach towels are avaliable.Entertainment - Lots going on throughout the day from volleyball to darts! But no pressure to get involved if you just want to enjoy a Pina Colanda by the pool. Evening entertainment did seem to revolve around kids such as kids disco and talent competitions. If you dont have kids though there are plently of places to just enjoy a quiet drink.Overall - We had a great holiday and would recommend the Riu Bambu to anyone looking for a relaxing and informal holiday. The weather was fantastic the whole 2 weeks. We did have rain most days but this seemed to be on a evening or late afternoon and wasnt a problem as only lasted 20 minutes. We did find it very humid on an evening but daytimes were really pleasant.Just a few tips:Make sure you take all medication etc with you. We were not ill but did hear of people spending 拢7 on a tube of Savlon in the hotel shop!Swimming with the sharks was a great day out. About 拢40 each and worth every penny.VIP lounge can be booked for 拢13 per person for your wait at Punta Cana airport on return flight. Its great vlaue as all drinks and snacks are included as well as internet terminals and comfortable seating and air con.Sorry, not so brief afterall!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":-1.0},"author":"Dr. Adelle Beier","date":"2014-10-26 06:21:30 +0300"},{"content":"Was Good Until... ok the riu bambu is a very nice resort. it has a very nice beach with a great part of the ocean. the rooms are very good and are kept clean by the great staff. evry1 there wants to make sure that you have the best vacation possible. That is one thing that i enjoyed about the bambu that the staff are awesome. some late nights the night bar staff would let me go behind the bar and pour some beers and make some drinks for people. the food is not that good. it gets very repititive and there isnt a lot of alternatives. the 24hr snakc bar is a joke! i was expecting to go there at 2am and find something really good to eat. not the case, instead i found 12hr old hot dogs that tasted awful. terrible!! if u r looking to buy some gifts do not buy from caribbean street, instead there are vendors about 20min walk down the beach. these guys can be talked down to less than 60-75% of their asking price. however, i urge you not to buy cigars from them or anyone else in the resort. only buy from a government run store in town. now then, your all probably wondering if it sounds so good why is he writing only a neutral report. here it is...i dont know how but i got the most sick i have been in years. my symptons were headache, fever (103), extreme sore throat, and vomiting. i never drank any of the unpurified water so it leaves me to believe its from the food. and if its from the food how are you supposed to protect yourself??...not eat? honestly it was the worst ive been sick since i can remember and i wouldnt wish that on anyone, especially someone on vacation. oh and if yer a single guy goin with buddies, do yourself a favour go somewhere else, theres no single girls here. it consists of couples mostly all european. i find that spanish people from spain are incredibly rude to the point where i almost ended his vacation! ok well beware and thank you.Steve","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Mrs. Ramon Cartwright","date":"2014-06-25 03:47:33 +0300"}],"public_likes":["Dante McDermott","Sheridan Hahn","Ernestine Ebert"],"vacancy":true,"description":"Affordable hotel of one of the better hotel chains. All rooms are ensuite and large by London standards.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}