{"title":"Serre-Chevalier","name":"Grand Hotel Serre Chevalier","address":"Place du Téléphérique Chantemerle 0","directions":null,"phone":"+33  4 92 24 15 16","tollfree":null,"email":null,"fax":null,"url":"http://www.grandhotel.fr","checkin":"12","checkout":"11","price":"€80-€230","geo":{"lat":44.93600528614395,"lon":6.590251922607422,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26999,"country":"France","city":"Saint-Chaffrey","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"When we tried to book a hotel room for our one night stay in San Diego, I contacted a travel agent to find us a good deal. The bargain she found for us was $160 per night in a decent hotel near Seaworld. As all we were looking for was a clean, safe place to crash for the night, I decided to do a little search of my own and I am glad I did. I stumbled upon this hidden gem on tripadvisor. This quiet little motel cost us less than half of my travel agent's bargain. The rooms were clean and the customer service impeccable. I highly recommend this place and I myself will stay there without second thought.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Cody Blanda Jr.","date":"2013-10-09 06:40:04 +0300"},{"content":"When I travel I try to stay at clean, family run hotels and this place fits the bill. It's nice to talk to the owners Alan & Holly over their continental breakfast every morning. Rooms were very clean as usual and the staff helpful and friendly. Love this place! Makes me feel at home...I'll be back. P.S. Don't much care for the big impersonal chains.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cortez Aufderhar","date":"2012-04-09 02:32:39 +0300"},{"content":"I echo the previous reviews. Yes, the rooms are small and it has minimal amenities, but it is VERY clean, is available for a good price and has an excellentand central location. Perfect for staging a long range fishing trip or playing touriston a budget. Everyone there was extremely helpful. I had family issues which required that I extend my stay. They really made things easier. You could easily come to think of them as extended family.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Brennan Bednar","date":"2014-12-09 10:21:25 +0300"},{"content":"The Dolphin has very clean, well appointed rooms, and a nice sized bathroom. Great location near to the marina with a choice of restaurants, and the bus into the centre stops about 10 yards away. Staff were incredibly friendly and helpful, which always makes a great difference to any stay. Good continental breakfast. Free use of a laptop with WiFi connection was also an added unexpected bonus. Doubt you'll find better value for money in the area. One word of warning - if you're not coming by car, its better to get public transport to the motel, which is regular and good if you're arriving from the centre - we got thoroughly ripped off by a taxi.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Dejah Abernathy","date":"2013-11-15 18:39:57 +0300"},{"content":"We have visited SD twice before, staying at the Homewood Suites in Del Mar and Motel 6 respectively. This time we wanted to try a location in Point Loma for a number of good reasons. After considering several options (most of the Pt. Loma properties are clustered close together) we opted to try the Dolphin based mainly on price and TripAdvisor reviews. We drove in after dark on I-8 and turned onto Nimitz Ave. at the end of the freeway which brought us right to the Dolphin. Our reservation was accepted and we checked in without problem. Our room was on the second floor which was fine. On first impression we were a bit surprised at the compactness of the room which reminded me of some I had stayed in throughout the UK. Apart from that the room was clean to an acceptable standard and everything that was in it worked accordingly. The place has a kind of '70's feel to it which we have experienced at other SoCal accomodations! We found that the Dolphin was a combination of several pluses and a couple of minuses. The pluses included being situated in Pt. Loma which is a self contained community with most amenities within easy walking distance of the Dolphin. There is a great selection of restaurants, C stores, laundromat, gas stations etc. nearby and the streets are safe to walk after dark. In many ways it resembles most large towns that you would find on the Great Plains with that same \"Howdy neighbour\" friendliness. Pt. Loma is also strategically located in SD to provide quick access to all of the local attractions. We found that having wi-fi was a great convenience as we packed the laptop along. Morning coffee,OJ, and muffins are served in the outdoor courtyard which is very nice on warm sunny mornings. As many other commenters have mentioned the staff and management are very nice folks. The minuses were few and rather petty. The hotel doesn't have a pool (one is located beside the office but belongs to the neighbouring Comfort Inn.) The hotel advertises itself as being on a quiet street (Garrison) which is technically correct, however it is sandwiched between two very busy streets (Rosecrans and Scott). My wife likes to sleep with the windows open and the early morning traffic was very noticeable. The street traffic can be overcome by closing the windows and turning on the circulating fan. Another irritant was the vibrating roar of fighter jets taking off from North Island late in the evening. The snug rooms are fine for sleeping but don't expect to entertain guests. Overall we were quite satisfied with our stay at the Dolphin and would recommend it to anyone planning a trip to San Diego.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":3.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Mavis Rogahn","date":"2013-11-07 00:03:15 +0300"},{"content":"My wife and I stayed at The Dolphin for three nights in July 2008. The room was clean, neat, safe, and very comfortable. As some of the other reviewers mentioned, the rooms are a little small, but we were on the go constantly, so it worked out fine for us. The owners and staff are always around seeing to your every need. All of our basic needs were met including a very comfortable bed. We wouldn't think of staying anywhere else when visiting San Diego.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Danika Lesch","date":"2012-09-29 09:40:30 +0300"},{"content":"DH and I stayed here one night pre-cruise and thought it was worth every penny. The owners are sweet, sweet people and actually apologized for chatting with us so long. We assured him we southern folks are used to chatting with strangers on a daily basis! This is a motel, yes, so please don't expect the Ritz. The windows are not insulated so you will hear some street noise and the rooms are small. However, it's clean, has cool retro-styling with neon, the water pressure is great, and the free juice, coffee, muffins, etc. were all very good. We would stay here again in a heartbeat.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Cecil Purdy","date":"2015-03-27 08:14:37 +0300"}],"public_likes":["Mollie Gleason"],"vacancy":false,"description":"Grand Hotel offers twin, double, triple and quad rooms with no, half and full-board. 2-minute walk from the ski lift station and a ski rental shop (discounts available).","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}