{"title":"Edinburgh/West","name":"Holiday Inn Edinburgh City West","address":"107 Queensferry Road, Edinburgh, EH4 3HL","directions":"Near the Craigleith shopping centre, about 1 mile from the city centre, on 41, 42, 43 bus routes.","phone":"+44 871 942 9025","tollfree":null,"email":null,"fax":null,"url":"http://www.hiedinburghcitywesthotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":55.95578,"lon":-3.24286,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":8710,"country":"United Kingdom","city":"Edinburgh","state":null,"reviews":[{"content":"here are some pictures for you thinking of staying here.","ratings":{"Service":4.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":4.0},"author":"Dorian Strosin","date":"2012-06-23 00:35:47 +0300"},{"content":"My boyfriend and I stayed at Best Roma for 5 days and wished we could have spent longer. Generally, the hotel is very nice, and quiet at night. Our room was large enough and very chic with modern decor and wooden floors. Furthermore, it was extremely clean, and cleaned everyday afterwards whilst we were out. The room overlooked a very pleasant garden to the rear, where breakfast and evening drinks were served. The staff were friendly and very helpful giving directions and recommending restaurants. The hotel is only 5 mins walk to Manzoni underground station, so it's very easy to get around the whole of Rome within minutes (it took about 20 mins to get from Manzoni to Vatican City on the underground). When the underground closes at 9pm, taxis are not hugely expensive (we got a taxi from Testaccio to the hotel,at 3am, for 15 euros). Breakfast was the typical selection of meats, cheeses, breads, cereals and juices. Though, there is a supermarket and cafes/restaurants just down the street. All in all, it was a great hotel for our week of sightseeing and nights out (24 hour open reception was very helpful).","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Nya Kovacek","date":"2012-10-26 16:49:25 +0300"}],"public_likes":["Graciela Hane","Precious Moen","Miss Treva Mitchell","Benny Gorczany"],"vacancy":true,"description":"Rooms on the east side have a distant view of Edinburgh Castle.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}