{"title":"Birmingham (England)","name":"Premier Inn Birmingham Central East","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.49133,"lon":-1.88604,"accuracy":"APPROXIMATE"},"type":"hotel","id":3622,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"My husband and I stayed at the Hotel Monaco for 3 nights and really enjoyed our time. The room and hotel overall was very cute. I loved the striped walls in the bedroom and the big sun like mirror. I enjoyed our pet goldfish too! The staff was very friendly. We were able to get tickets through the concierge for Cubs tickets the night before! The man at the front desk who likes white chocolate(the staff had fun name tags)recommended a good pizza joint for dinner our last night in town. The hotel was in a great location just around the corner from Michigan Avenue. The best thing is the hotel is small not like the big chain hotels. It definitely felt very intimate!","ratings":{"Service":4.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Elna Renner","date":"2013-12-14 23:18:37 +0300"},{"content":"Our family (two daughters 13 and 10) just returned from a stay at the Hotel Monaco for one night (also stayed at the Park Hyatt~ wrote a review for that hotel as well). The Hotel Monaco does a nice job making you feel welcome but it is no Park Hyatt as far as the greeting goes. What I mean is that the PH has at least 6 people meeting you between the car and the front desk. At the HM there is a person to help you with your luggage (dressed a bit casual, I thought) and the person at the front desk. The front desk was very pleaant and informed us that our room was not ready but would call when it was, which she did. We had the hotel hold our luggage while we went to see Wicked (loved it!). When we returned our room was ready and we were given a key. Unlike the Park Hyatt, we were not taken with our luggage up to the room. Instead we were pointed to the elevator and the luggage came up a few minutes later. We splurged and stayed in the Karen Newburger (sp?) suite. Since I was not able to find any info on this suite, I will try to elaborate as much as possible. The door is special with curtains pulled back along the side and the door itself is padded. Nice touch! You feel special just arriving! Inside the door is a small hallway with a closet containing the robes (safari prints), even ones for the children, Karen N. pjs and socks that you can buy, ironing board and iron, blankets, etc. The blanket was extremely soft~ My dd13 loved to wrap it around herself while lounging in the window seat! Next is the dining/living room. There is a small round table with two chairs, a couch that makes into a queen size bed (not too comfy according to dds), a cupboard with games and misc. in it with a fountain hanging above it. They make a big deal of this fountain on the website but it's just ok. This room also has a LG flat screen tv on the wall and a big window seat with lots of pillows. Each window seat (I think there are four total) has a very comfortable cushion to sit on...So comfortable I could easily sleep on it! The window seats are very deep with a ton of pillows. Our family loved to people watch from these, especially the construction of the Trump Tower just across the street. We also enjoyed watching the boats on the river. The next room contains the king size bed which was very comfy with a pillowtop on the mattress. There is a bench at the foot of the bed, a tv in an armoir which also holds the honor bar, a large, very tall chair with a small table next to it where we put our 2 goldfish, and 3 more window seats. Lastly is the bathroom with a very large deep tub with a built in sitting area like in a juccuzi. It has jet sprays too. The sink is adequate with a rolling cart underneath with a blowdryer, wash clothes, and fizzing bath balls (I tried one and it was just ok, I think it cost $6). The shower stall is very small with no room for the shampoo, conditioner, and soap. The shower is stuffed into the corner like they used up too much room for the tub and the shower was an afterthought. The toilet is in the same room as the shower and tub. There was only one garbage can in the whole suite, the one in the bathroom. The towels are very soft! We had room service which was timely and very courteous. The bellstaff was friendly, helping with restaurant suggestions. On our departure, the bellhop was also efficient and friendly. We didn't partake in the evening wine festivities so can't discuss that. Overall, my family enjoyed the hotel and would recommend it. Especially if you are planning on doing activities close by. We were able to walk to the following places: Millenium Park, Art Museum, Oriental Theater, Chicago Architectural Boat Tour (go early if you plan on doing the 10:00 ride). If/When we return, we will probably try the Rock Star suite as it seems like it would be more fun. The Karen N. suite is great for a romantic visit.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Helene Ernser","date":"2014-11-03 22:49:26 +0300"},{"content":"We booked ourselves an anniversary weekend at the Kimpton Hotel Burnham, but for some reason the room wasn't ready at 11pm when we arrived, so they quickly sent us to their sister hotel, the Monaco, for the night into a \"sweet suite\", cab fare included and they picked up the tab for the night. Fantastic service, friendly and accommodating. We loved the room, the view and the beautiful, funky furnishings. It was a pleasure...then back to the Hotel Burnham in the morning for another excellent stay in a beautiful room with wonderful service from bed turn-down to chocolates, soft music on the radio and bathrobes on the bed awaiting us after a long evening out sightseeing. The clean, appointed rooms were a nice plus for these weary travelers who usually stay in middle of the road places. Highly recommend the Kimpton chain...both the Burnham and Monaco.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Gussie Roob","date":"2015-03-13 12:42:31 +0300"},{"content":"A perfect stay! Room was beautiful and very comfortable, staff was friendly and accommodating, restaurant was excellent, and the wine happy hour was a great time!","ratings":{"Overall":5.0},"author":"Meta Mertz","date":"2013-05-29 19:35:51 +0300"},{"content":"My husband and I stayed at the Hotel Monaco for five nights for an anniversary trip in early October. We stayed at a Kimpton hotel for our honeymoon three years ago and were hoping for similarly splendid service and accommodations at the Monaco. We were not disappointed. We were able to check in early (around 11am) and received our requested coffee maker within minutes of arriving in our room. The staff members were very friendly and helpful. On our first night, the concierge recommended a very good local Italian restaurant within an easy walking distance. Housekeeping services were prompt and thorough. The location was perfect for exploring the Magnificent Mile, going on several architecture tours, and going to the opera. The free wireless Internet was a nice bonus. We will definitely book the Monaco on subsequent trips to Chicago.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Eloisa Shanahan","date":"2012-10-23 07:34:29 +0300"},{"content":"We like Kimpton properties -- they are funky and friendly with great beds and good styling... oh sometimes there isn't much closet space, or the bathrooms are old, but they are always in THE best locations the city has to offer. The Hotel Monaco in Chicago couldn't have been more perfect for our stay. We had a Mediteranean Suite to accomodate 2 adults and two teens for 4 nights... the corner suite was right on the corner facing the Chicago River and we had 4 of the famous window seats that everyone raves about. My 12 year old was so taken by them that we cancelled his roll-away and he slept on one everynight.... two of them were the size of twin beds, and every afternoon we'd climb in one together and sit with cocktails/ cokes and watch the city go by! It was one of the things that make a trip truly special and I have no doubt the kids will every forget it. The location was terrific -- close to the Theatre District, the museum campus, the Art Institute and Milennium Park/Grant Park -- we walked to everything except the museum campus -- it was too hot to go that far. The valets and front desk staff were terrific and we fell in love with our evening housekeeper -- she was a doll. Our breakfasts in the hotel restaurant were delicious and fast. The bedding and amenities were top-notch. My older son even said the sofa bed in the living room wasn't too bad. The one bad bump was with a conceierge -- Richard -- who, we found out after a $30 tip, was absolutely wrong on everything he told us. He said we couldn't get tickets for \"Wicked\" without a broker and that they'd cost \"$150 easy\"-- we walked into the theatre a block away and got front row balcony tickets for that night at $80 each.... He said take a bus to the museum campus as it was much cheaper than a taxi -- Wrong -- we took a cab because of a rainstorm and found that it was faster, easier and $3 cheaper! His restaurant tips were to big chains not to smaller local places.... He kept pushing Navy Pier, which everyone told us to avoid at all costs.... The other two concierge we talked to seemd fine tho' and gave us great directions.. Bottom line -- stay at the Monaco. And take an architectural boat tour! We give the trip an A++++++++","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Harvey Luettgen","date":"2015-06-17 23:56:05 +0300"}],"public_likes":["Armani Langworth","Elfrieda Gutkowski","Maureen Ruecker","Arely Fadel II","Marley Koelpin","Dr. Kaya Wehner"],"vacancy":true,"description":"There is nothing &quot;central&quot; about this motel-style Premier Inn at the junction of M38 and M4045, which faces a similar Campanile across the canal, but if you are a motorist, you will enjoy its convenient location and free parking.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}