{"title":"Camberley","name":"RSVP Cambridge Hotel","address":"121 London Road","directions":null,"phone":"+44 1276 26488","tollfree":null,"email":null,"fax":null,"url":"http://www.cambridgehotelcamberley.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.339905,"lon":-0.745317,"accuracy":"ROOFTOP"},"type":"hotel","id":4951,"country":"United Kingdom","city":"Camberley","state":null,"reviews":[{"content":"We booked our trip through a deal on Living Social for 2 nights which included the resort fee, breakfast each morning and a spa credit. We did have to pay taxes on the room which was an additional 27.00 dollars but that's ok it was expected. The resort is great, our room was so nice it was right across from one of the pools and of course it was clean and comfortable. I understand what other reviewers mean about the televisions, but are you really there to watch tv?? I hope not because the Oasis water park is great. We loved the wave pool and the lazy river. My husband and 8 year old son used the water slides and enjoyed those as well. There was never a lack of tubes to use for the pool or river, and plenty of chairs around the water park to lay out during the day. We ordered lunch on the second day there from the Oasis grill, it was just ok, maybe we didn't get the right thing we ordered fries and shared a club wrap. Everyone we encountered was friendly, service was excellent. Our free breakfast with the deal was actually a credit for 26.78 per morning which can add up fast considering a cup of coffe is 4.95, but it's totally doable if you watch what you order. The lobby grill has a nice outdoor seating area and the food was great. We didn't use the spa. You can charge everything back to your room if you put a credit card down for incedentals. We paid cash. We stayed mid week which was nice I could see it getting crowded on weekends and if you want to stick to a budget the resort is near plenty of restaurants so you don't have to spend that much to eat on site. I would definitely go back again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mable Lindgren","date":"2013-06-29 18:23:30 +0300"},{"content":"When you hear \"resort\" you think nice, attentive, polite, grand!!! Unfortuantely this resort is not grand. Their level of communication is horrible. We stood outside our room in triple digits heat for over 3 hrs waiting for the replacement key they were supposed to be brining \"right away\". Apparently they went from 40% capacity to 100% capacity in 3 hours so they weren't as quick as they had hoped. However, had they of told us, \"you can come get a replacement key now or you can wait a few hours and we'll bring you one\" we would have chosen to go up to the front desk to retrieve a new one. The maid service is HORRIBLE!!! The maid for our room yelled at me for about a minute because I interrupted her while she was cleaning my room. I would love to tell you what she yelled at me but it was in spanish and being I'm an American and only speak English I have no idea what she yelled at me, but take my word for it she was pissed at me. Needless to say we will not be returning to this \"resort\".","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":3.0,"Value":2.0,"Service":1.0},"author":"Lonzo Schmeler","date":"2013-09-24 05:26:22 +0300"},{"content":"This was our second stay at the AZ grand. The package we booked over the phone was not the package we recevied when we checked in! Hotel ignored our complaints about housekeeping. Room was filthy, asked for an extra pillow, never received it. Asked for extra towels only for housekeeping to take them the next day. Never had any coffee in room...we just got to look at a coffee maker. Floors never vacuumed. Patio littered with beer bottlecaps, empty water bottles and cigarette butts. Food is always good at the Lobby Grill and Bar. Marketplace staff had a horrible attitude and should have their Starbucks affiliation taken away since the coffee was horrible. Wait staff at Oasis was great! Food was great at the Oasis grill. The Oasis part of the resort needs some work. It was filthy! Empty food trays, cups and trash everywhere. So when the wind blew, the trash blew into the wave pool and lazy river. No one ever picked this up. On the last day of our 5 day stay, housekeeping knocked on the door at 8 am to make sure we were checking out! Check out is at noon. NICE! Recommend to others to spend the money and stay at one of the Scottsdale Resorts. Same price and better quality. We will next time.","ratings":{"Cleanliness":1.0,"Sleep Quality":3.0,"Overall":2.0,"Value":1.0,"Service":2.0},"author":"Krystal Mosciski","date":"2012-05-04 20:03:01 +0300"}],"public_likes":["Annamae Jerde","Herman Stehr","Bo Murray","Mrs. Eudora Berge","Johnnie Treutel","Carmela Volkman"],"vacancy":true,"description":"A landmark pub in the town has changed its name to RSVP, but is still known by locals as The Cambridge.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}