{"title":"Birmingham (England)","name":"Jurys Inn","address":"245 Broad Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.4767,"lon":-1.9114,"accuracy":"APPROXIMATE"},"type":"hotel","id":3632,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"The room I was in was a nice size. Very difficult to navigate the numbering system to the floors but as a compromise there are pictures of very famous entertainers all along the hallyways so you can remember \"turn right at Nat King Cole\".. or something similar. The room I was in had been upgraded at some point because it had granite in the bathroom and a newer bowl shaped sink. But the age of the hotel still shows through in the tiling in the bathroom. Also I had wallpaper peeling in my room and the part of the showerhead that attaches to the wall was hanging off. Not appreciated for this level of hotel and the rates it commands. I didn't have a view, just some part of the rooftop. Kept the curtains drawn. However I did not have a view of the train tracks, which I heard several complaints about. The tracks are very close to the hotel. This is not the hotel's fault but if you are on that side of the hotel it may disturb you. Seems they run more frequently during the day but it's something worth checking out. For sure if you are on that side of the hotel request a high floor so you are not literally next to the train. There is no shelf space in the bathroom if that is important to you. The sink takes up most of the counter and there is no additional shelving. There is a small glass shelf about the size of a couple of postcards on the wall but that was very loose and unstable in the room I was in. The bathroom door would not remain open so I propped it open with an ottoman and put a towel on top of that and used it for additional space to lay items. In room dining was fast and very nice; usual hotel pricing. About $22 for a full breakfast of meat, potatoes, eggs, juice, tea and toast, including tax and mandatory service charge. I found the service to always be top notch.","ratings":{"Overall":3.0},"author":"Cullen Sauer","date":"2013-09-15 13:04:38 +0300"},{"content":"Spent three nights here on business. The room in the 20th floor was huge compared to typical European hotel rooms. Breakfast was not included in the price, so I took the Hilton buffet breakfast (USD 20) every morning. In this option you can also order omelette, pancakes, etc. separately, but all waiters did not remember to tell that. The buffet was very good. The swimming pool is too small and warm for serious swimming, but nice for just relaxing. I did not find any change room, so I had to change the swimsuit in the separate toilet/shower room. The location is great, and the hotel is very beautiful, especially the famous lobby. There was a large meeting at the hotel, and during the meeting the elevators were really slow: in some cases I had to wait 5-10 minutes to get one.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Elijah Howe","date":"2014-03-12 13:33:55 +0300"},{"content":"I have been staying at The Drake for the past few years after having stayed here a few years ago with disappointment at the noise and room size. I returned with my sister for the weekend and we were pleased overall. As some have commented, the wait for the elevators is a problem. We were lucky as we were upgraded to the executive level and so had use of an express elevator. A couple times though we took the regular ones and the wait was very, very long. The hotel was quite busy this weekend for Sox Fest which could explain the long waits. All staff we encountered - at the bar, restaurant, front desk and even housekeeping were so nice and friendly. Even the doormen were exceptionally nice. As others have stated, the rooms are a \"bit\" small but not tiny by any means. We had no noise issues this trip whatsoever and that might be because we were on the executive level. It's not the most convenient for shopping, but taxis are frequent, prevalent and inexpensive so really no issue at all. I thought the price was very reasonable at $130 per night for downtown Chicago. I recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Hildegard Douglas","date":"2014-04-10 10:13:38 +0300"}],"public_likes":["Mrs. Coby Denesik","Nona Wilderman","Phoebe Brakus","Wilber Goodwin","Mr. Eloy Stark","Lavina Leffler"],"vacancy":true,"description":"A huge and hotel in a concrete block, catering to business visitors of the ICC. Enjoys solid reputation despite a complete lack of charm.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}