{"title":"San Diego/Downtown","name":"Omni Hotel","address":"675 L Street","directions":null,"phone":"+1 619 231-6664","tollfree":null,"email":"reservations@omnihotel.com","fax":"+1 619-231-8060","url":"http://www.omnihotels.com/FindAHotel/SanDiego.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.70687,"lon":-117.15869,"accuracy":"ROOFTOP"},"type":"hotel","id":25168,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"I had the chance to stay at the ME Barcelona in early Sept for work. The first impression was nice but I was really impressed once I got up to my suite on the 22nd floor. The room was tricked out with little details that make a difference , my highlight was certainly the Nespresso maker but also the heated towel rack and fully loaded ipod with a great selection of music, showed that great thought went into the ME EXPERIENCE. The highlight for me was the service..I am convinced that the staff was some of the sweetest I have encountered. They remembered my name and I was made to feel special. Thank you to all the staff from the front desk team to the experience managers to the girl at the breakfast who made my stay so memorable. Kind regards, H. Spinner","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Watson Adams","date":"2015-07-29 22:50:09 +0300"},{"content":"This is a nice hotel. But you do get the fealing that they are trying a little too hard to be too cool for school. Good secure car parking imediately adjacent to the hotel - not too expensive at €25 for the 1 day / night that we were there. check in staff all very nice and helpful and rooms again were nice and bright. We were on the 12th floor looking out over the outdoor pool (on the 6th floor) and sea beyond (and I mean beyond.) Tiny gym - nice equipment but not much of it and also the air con in the gym wasnt working with predictable noxious results! Other comments re the noise from the nightclub are spot on. Make sure you are on as high a floor as possible away from the pool if you want to sleep. Its clearly a very popular nightclub right now and was heaing all night until 5am. We didnt go to the nightclub but we did have cocktails in the bar downstairs. One was very nice - one was hopelessly made. In summary its nice - but would I stay again? Probably not. If spending this much I'd spend a little more and stay at Mandarin Oriental or W Hotel. Check out Pla spanish restaurant though on Bellafila 5. Very nice and reasonably priced.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":3.0},"author":"Rosie Kuhic","date":"2014-10-03 15:41:43 +0300"},{"content":"Takes a bit of getting to, but worth it. Amazing views from higher rooms and great design.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Jerry Gutkowski","date":"2012-06-12 07:02:44 +0300"}],"public_likes":["Marcellus Schneider","Kari Lueilwitz","Eugenia Trantow","Wellington Gleichner","Grayce Davis PhD","Dr. Armani Davis","Clair Kub","Emmet Krajcik"],"vacancy":false,"description":"A modern luxury hotel connected to PETCO Park via a skybridge across the street, the Omni was built along the new ballpark and has a few baseball relics inside, such as Joe DiMaggio's cleats in the lobby, Babe Ruth's 1932 contract with the Yankees in the Presidential Suite, and a broken bat autographed by Willie Mays in the fifth-floor hallway.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}