{"title":"Nelson (England)","name":"Lovett House Guest House","address":"6 Howard Street, Off Carr Road, Nelson BB9 7SZ","directions":"About 700&nbsp;m from Nelson Station","phone":"+44 1282 697352","tollfree":null,"email":"lovetthouse@ntlworld.com","fax":null,"url":"http://www.smoothhound.co.uk/hotels/lovetthouse.html","checkin":null,"checkout":null,"price":"From £25 per person breakfast included","geo":{"lat":53.837294,"lon":-2.222763,"accuracy":"ROOFTOP"},"type":"hotel","id":36155,"country":"United Kingdom","city":"Nelson","state":null,"reviews":[{"content":"My family and I stayed at the Palazzo Odoni this past weekend and found the place beautiful, well-situated, excellently priced, clean, and amazingly spacious! Our apartment (named for Titian) was two floors with a very large living room with windows that opened to the canal and a great dining area. The couches in the room converted into beds for my two children, while upstairs was another bedroom and the bathroom. The included kitchen area made making snacks or little meals simple and easy, and the street that the Palazzo is located on is filled with great little restaurants, shops, and the occasional gondolier. The staff and owners of the Palazzo Odoni were very friendly and helpful as well. All in all a terrific place to stay -- we will come back again when we are in Venice. Ciao!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Merritt Greenfelder IV","date":"2013-06-01 01:25:45 +0300"}],"public_likes":["Mrs. Itzel Ratke","Alden Little","Ashtyn Carter","Lew Dare","Tony Kuhn","Kariane Hane","Eva Hyatt","Ms. Henriette Kohler","Jalyn Corkery I"],"vacancy":true,"description":"Victorian terraced house with 3 guest bedrooms of which 2 are ''en suite''. Offers courtesy pick up from local train and bus stations; excursion planning advice; full Lancashire cooked breakfast","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}