{"title":"Wales Coast Path","name":"Great Orme Lighthouse","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.lighthouse-llandudno.co.uk/frame.htm","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.342276,"lon":-3.868865,"accuracy":"ROOFTOP"},"type":"hotel","id":40017,"country":"United Kingdom","city":"Conwy","state":null,"reviews":[{"content":"Our stay at the I Hotel was brief but wonderful. The rooms are quiet, the beds are very comfortable, and the decor is modern and elegant. There is much beautiful woodwork throughout. The staff members went out of their way to be helpful and informative. The landscaping is lovely. They provide a free shuttle service to anywhere on the University of Illinois campus and a room rate discount for those of us on a college visit. I highly recommend this hotel and we certainly plan to stay there again on future visits to the area.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Vaughn Miller","date":"2013-05-19 00:10:35 +0300"},{"content":"My son and I spent two nights at the I Hotel and Conference Center which is located adjacent to the University of Illinois in Champaign. We found the staff to be friendly and very helpful yet unobtrusive, the hotel and rooms spotless and comfortable, and the location next to the university very convenient. Wireless internet was free, and when I asked to use a printer to I was given access to a computer in a peaceful and secure room. I would definitely stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Mable Mertz","date":"2015-11-13 20:37:19 +0300"},{"content":"It is really the best stay with value for money I ever stayed in Dubai. If you want economic stay with 5 star hotel, this is the one. For bed room including kitchen, 2 bathrooms and living room with 2 LCD tv, you pay ONLY less than $120 per night. So what do you think? It is really lovely hotel. The breakfast is delicious. The location near Dubai Mall and the Metro station on Zayed Road. It is your best shot if you are coming with your family and small kids.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Mya Feeney","date":"2014-08-26 23:06:14 +0300"},{"content":"Hotel quality is very terrible. Last year turkish great hotel chain company \"dedeman\" release this hotel to the best western. Before releasing hotel had acceptable management even, over the expectations. After best western took control of management hotel staff did not change but their mentality changed. They are look like a summer intern and do not care about anything. Staff's skill terrible and they are rude. Tea and coffee smells chlorine from the water. I asked them to control their waters and tea smells chlorine. One staff answered me i dont know because i did not do tea. Also extra bed is about the 150 cm. Its like a comedy and the bed sizes looks like children's bed but its NOT !!! :O Never go there !!","ratings":{"Cleanliness":2.0,"Sleep Quality":1.0,"Overall":1.0,"Value":2.0,"Service":1.0},"author":"Donna Schultz","date":"2014-09-01 12:48:34 +0300"},{"content":"With a wealth of hotels to choose from in the Chi area, I have sampled from the best. Many of them have been quite good, but for the past couple of years, I've opted for the Dana. Location-wise, it's just off the Magnificent Mile in the midst of everything that particular stretch has to offer. Room-wise, it's got everything I need -- they're relatively spacious, have floor to ceiling windows/Juliet balconies that afford you a great view or if it's a balcony, just some fresh air (a great alternative to air conditioning), to-die-for bathrooms situated in the middle of the room (with glass-enclosed showers that let you see out while you shower if you desire, or shades if it's privacy you want), wonderful bath amenities, and -- something I've never had at any other hotel -- hand-made chocolates/candies in their honor bar in lieu of the usual M&Ms etc. Plush bathrobes and slippers too. Room service is good (in terms of offerings and timeliness) and the food is fine. The gym is just OK, unfortunately. Rather small & cramped, there is only 1 workout bench and only a couple of machines. Earlier this week I was there with 4 other (unrelated) guests and we were falling over each other and jealously watching as soon as someone finished his/her reps or workout so we could grab the equipment before anyone else. Dana management -- this is an easy fix -- please expand. The restaurant (Aja, pronounced like the continent) is pretty good too. I've only eaten there once (there are so many choices in this neck of the woods), but when I did, the menu was varied and unusual, and the service good -- even a bit over the top (I lost count of the number of people who checked in with us to make sure everything was OK); I almost expected the chef to be next! Unless my company changes its travel policy, I expect to continue to stay here, esp if they expand the gym.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Demarcus Bartell","date":"2015-02-26 09:41:16 +0300"},{"content":"This is a very trendy, fun place to stay. My girlfriend loved it and anytime someone is coming into town we recommend it. The food is excellent, although the only complaint was that the nueskis bacon wasn't the black pepper crusted type, which is the best bacon on the planet. Other than the small disappointment here we were both thrilled with the room, service, and food. slightly pricey, but you get a lot more than the average hotel. def a step up from the more popular W downtown. And close to a lot of great downtown and river-north spots.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Tierra Schultz","date":"2015-11-30 09:56:58 +0300"}],"public_likes":["Jameson Koch","Laura Wisozk","Marcos Ledner","Mrs. Roscoe Labadie","Dr. Letha Mitchell","Katlyn Schoen"],"vacancy":true,"description":"Fortress style built in 1862, now a hotel","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}