{"title":"San Francisco/Union Square-Financial District","name":"Galleria Park Hotel","address":"191 Sutter St","directions":"at Kearny","phone":"+1 415 781-3060","tollfree":null,"email":"twillis@jdvhotels.com","fax":"+1 415 433-4409","url":"http://www.jdvhotels.com/galleria_park","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7896,"lon":-122.4036,"accuracy":"APPROXIMATE"},"type":"hotel","id":26219,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Nice and cheap hotel. 10 minutes from Disneyworld, 20 minutes to Seaworld and 30 minutes from Universal.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Itzel Konopelski","date":"2015-10-17 05:49:19 +0300"},{"content":"I live in Orlando and have stayed at this hotel several times before when family members come in from out of town. For the money, it is the best deal in town. The property is clean and a safe place to stay. My family members from out of state said that they would never stay anywhere else.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Elsie Lowe","date":"2013-02-26 01:08:33 +0300"},{"content":"We have been back to Champions about 5 more times since the first review was posted and every time things were great!. This last trip we stayed in a different room near the pool with a sofa that tuned into a bed since we had another with us this trip. Room was nice with double sinks and new tile work the bathroom. The pool has had a fresh coat of paint and is looking good! The bathrooms look like they have had the tub/showers re-lined and there is new tile, looking good Champions! I would like to take a minute and talk about a unique feature of this hotel the fields outback. They have baseball fields and soccer / football area and courts, a nice feature when you are there with a team and could use a place to work out or you want to keep up your skills during a summer vacation. The grass on the soccer field was lush it felt like you were walking on a carpet, no holes and nice and level. A+ And for those of you who like to kick back with a magarita and some home made nachos you need to swing by the bar and get some of their awesome nachos! Even if you dont get the magarita get the nachos the kids were at Disney and talking about cant wait to get back and get some of those nachos again LOL Once again we have been back 5+ times since December and everytime has been great! A friend of ours suprised Dad with a trip down and now they are hooked also. This is a good place to stay with good prices a family oriented hotel. You can find fancier hotels but as far as value Champions is hard to beat!","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Robb Mitchell","date":"2014-09-04 13:20:32 +0300"},{"content":"We usually stay at the Champions World Resort when we visit Orlando. This weekend proves why we always come back. Staff is friendly and willing to help. Special thank you to Latisha for making our stay and my birthday weekend special. Rooms are always clean and beds are comfy. Can't wait until our next visit.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Kasandra Trantow","date":"2015-03-08 07:17:48 +0300"},{"content":"We were looking for inexpensive lodging while visiting Disney Parks and found it here. The staff was great, the room was clean, towels were nice... Daily cleaning service. Beds and pillows were comfortable. Beds didn't \"creak\" which was nice since I got up a few times at night with my 14 month old while my husband and older son slept in the same room. Air conditioning was loud! Everything about the hotel was good (not fancy, but clean). The only downside was since this is a budget hotel it draws a different standard of people... kind of rough crowd, which is not our style. We had guests above us and out at the pool that were screaming and yelling until late at night. They were having fun in the pool without any regard to other guests sleeping. I did call the front desk at 10pm since it was so loud I couldn't even sleep with earplugs. They sent security over right away and the noise by the pool died down shortly thereafter. At 12 o'clock at night I could still hear the people above us banging around while I had earplugs in, but I didn't call security for that. The next day I asked the front desk if the guests above us had checked out (and luckily they had!!!) or I would have asked to switch rooms our second night. The pool outside was very pleasant, the indoor pool temp was like a hot tub (well, not quite, but pretty darn hot for a pool). I might consider staying here again if the price was the deciding factor, but based on the clientele we would probably opt for a higher grade place for more money with the hopes that the clientele would be of a higher standard too :)","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Van Corwin","date":"2012-08-24 01:25:15 +0300"},{"content":"I stayed here from 04/24 to04/28 the rooms were clean had no problem with that. I had a pet, and because of that we were put in the last building where there was NO ICE machine I Had to walk forever to get Ice. It was like we were in another world I wanted a room around the pool but I couldn't have it. they are pet friendly but not friendly to the people with the pet. I. didn't want maid service so ask for just towels but they were never brought. I felt like I wasn't part of the resort it's self because of my pet. I had to give my credit card to have the phone turned on, but they could call my room to get me to go on a time share tour. I will NEVER stay here again. If you have a pet and would like to be treated like a outcast this is the place to go.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Flo Moore","date":"2012-11-21 15:35:25 +0300"}],"public_likes":["Godfrey Ebert III"],"vacancy":false,"description":"A boutique hotel with a half-acre private urban park. Good linens, flat-screen TVs and complimentary wine hour.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}