{"title":"London/South Kensington-Chelsea","name":"St. Mark Hotel","address":"4 Barkston Gdns, SW5 0EN","directions":"tube: Earl's Court","phone":"+44 20 7373-0060","tollfree":null,"email":null,"fax":"+44 20 7373-4796","url":"http://www.st-markhotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4927,"lon":-0.1903,"accuracy":"APPROXIMATE"},"type":"hotel","id":16445,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Beautifully modern furnished hotel. Some ants in bathroom but otherwise very clean and spacious. Breakfast was so so but great staff. Front desk and doorman staff were ok but not great. Location is good if using train but otherwise not great location and not all that safe a feeling at night given general overall neighbourhood. If you like walking, it is ok to get around to all major sites other than Vatican. Need to add more english speaking tv channels to reflect customers they have and are trying to attract. Not including internet in rate lowers the overall perception of what Star rating this hotel is trying to portray considering it is 2010 and 'lessor' hotels do it readily. Overall a gem in a seedy neighbourhood that will get better with time.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":2.0},"author":"Santos Kuphal","date":"2013-12-03 03:38:58 +0300"},{"content":"We stayed 7th to 12th March in a Superior room on a travel zoo special offer. The hotel is very conveniently placed near the Termini. The rooms are very modern with excellent beds and bathrooms. The buffet breakfast included in the deal was very good with plenty of choice. The waiting staff very helpful and service very efficient. Unfortunately the weather was not very good but the room was very warm, computerised heating system which we never seemed to work out. Only drawback was no hospitality tray. We ate locally as the weather was not conducive for walking far. On the Via Principe Amedo we enjoyed meals at Elletra /Aquila Nera./ Tudini Gabriele and Tomoko. Penty of choice and fresh ingredients. The staff were very helpful and spoke good english.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Charlie Gorczany","date":"2015-10-05 09:41:02 +0300"},{"content":"Stayed at this hotel for two nights. Arrival was perfect, good explantion of facilities and shown to room - brilliant! Room was immaculate and the bed simply huge. Bathroom was clean and highly functional. Breakfast was typically Italian - good and wholesome buffet with staff bringing drinks. The location of this hotel is ideal for a central stay and close to the main railway station and buses to the airport. All in all, oustanding.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Else Friesen","date":"2014-05-10 01:16:33 +0300"},{"content":"What should I say when everything was super and excellent? The room was big enough, clean and modern. There was a safe box as well. The breakfast was top. Best quality. Fruits were fresh. You got coffee in best quality. One cup or two cups or three cups... No problem. The next time when I will stay in Rome again I hope there is a room free for me","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jodie Mosciski","date":"2013-11-09 22:15:39 +0300"},{"content":"We have just returned from a week's break at this hotel and really enjoyed our time there. All the facilities that you would need are on hand including a small gym on the top floor. Everything was clean and the staff were very helpful. It was nice being just outside Rome so that we could eat and drink locally without overpaying. We also enjoyed the homely sitting room area by the reception area and there was an easily accessible computer to check on e-mails/internet. We would thoroughly recommend this small boutique hotel which was excellent value for money.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Karl Strosin","date":"2013-04-03 07:34:40 +0300"}],"public_likes":["Dr. Donna Bogisich","Else Heller","Lexus Rempel","Junior Purdy Jr.","Roxane Satterfield"],"vacancy":true,"description":"This hotel offers 25 guest rooms all with private en-suite facilities. Book online for best deals.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}