{"title":"Beaumaris","name":"The Bulkeley Hotel","address":"19 Castle Street, Beaumaris, LL58 8AW","directions":null,"phone":"+44 1248 810415","tollfree":null,"email":"reception@bulkeleyhotel.co.uk","fax":null,"url":"http://www.bulkeleyhotel.co.uk","checkin":null,"checkout":null,"price":"£50.00 - £150.00","geo":{"lat":53.263,"lon":-4.0914,"accuracy":"APPROXIMATE"},"type":"hotel","id":2609,"country":"United Kingdom","city":"Beaumaris","state":null,"reviews":[{"content":"We have stayed at the World Quest Orlando resort several times over the past few years. We have 3 children and love visiting Disney World and the surrounding attractions. Although we normally travel later in the summer, we got \"Spring Fever\" early this year and decided to to take a long weekend to visit our favorite escape from Atlanta in February. As usual, we had a top-notch experience at World Quest. The staff is very friendly, and the rooms have always been impeccably clean. We especially like the tiled floors and always select a 3 bedroom unit. We had stayed at more traditional hotels in prior years but found that for essentially the same price, we are able to stay in a condo unit and have a much more comfortable experience. It is essentially a \"home away from home\", complete with a full kitchen and washer/dryer. The kids especially like the large pool. It's kept very clean, and my wife and I like to sit in the shade and sip drinks from the Tiki Hut bar. I highly recommend World Quest to anyone!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Kaitlyn Deckow","date":"2013-01-03 22:07:36 +0300"},{"content":"Our family recently spent nine days at WQR. We had booked a two bedroom unit and an upgrade to a three bedroom unit was easily accommodated by the front desk staff. They also accommodated our request for a unit in building 1 or 2 because we wanted to be close to the pool and the administration building where free continental breakfast was provided daily. Pros * screened balcony allows you to enjoy the balcony at all hours without worrying about pesky bugs getting into your unit * close to EVERYTHING, e.g. Walmart, restaurants, SeaWorld, Disney, Premium Outlet (Vineland Ave.) * free breakfast (which you can take up to your room) * big pool (albeit a bit cold) * quiet units * heater that worked (it dipped to -6 Celsius one evening) * great for families or big groups Cons * perhaps because we were in one of the original buildings (building #2), it was a bit \"tired\" ... but this wasn't a deal breaker given the value proposition (we used a Facebook promotion code) * two lightbulbs burned out and we twice requested that maintenance come up to replace the bulbs but they never did make the trip to our unit Would I stay again? If we were to get the same price ... for sure.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Maximo Flatley","date":"2013-06-27 22:05:03 +0300"},{"content":"The 3 bed-3 bath condo at WQR was a pleasant surprise. We had a very good winter rate and we were concered that the property might be subpar...boy were we wrong! We stayed at the World Quest with our family from Ft. Lauderdale that had two 31/2 year old twins, and it worked out great! It was clean, fairly modern, with plenty of room. It had a full kitchen, large master tub, and a large screened balcony. There was a tv in each room (although not a flat screen) and a cd/dvr player. The pool was large with ample towels, and it even had a snack/beverage bar. We were minutes away from all Disney parks. A free breakfast and shuttle was included, however we would have liked it a little more if there was a little better breakfast choice and if the shuttle was more flexible. We would definately stay there again!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rylee Streich DDS","date":"2014-01-06 17:58:51 +0300"},{"content":"As with the majority of service related industries, when compared to the UK, they exceed in the alot of cases, and The WorldQuest Resort was no different. The location for us as a family was perfect, over the busiest period of the year. We decided not to stay at one of the resort hotels due to the fact they would be extremely busy and enough time could be spent in queues during the day at Disney. Although The WorldQuest Resort was full over Xmas, you wouldn't have known it. The standards were as high as the rest of the year. We did spend a couple of days by the pool, and this was fairly quiet as alot of people we at the theme parks. There is a small bar which has a limited menu, but for the occasional meal is fine. We didn't use the shuttle provided by the resort to get us to the theme parks, but used a taxi instead - we could then come and go as we pleased. Sweet cakes etc for breakfast didn't suit us, so it is worth ensuring you make a trip to the local supermarket for supplies if you are the same. The condo's are excellent. We had a two bedroomed suite, which had lots of space and made for a really enjoyable stay. All things considered, price, location and service - I would say that you would struggle to find better in the area. One last thing - the concierge service is available from 7am each morning where you can buy your park tickets. Emily - very helpful! We would definately consider booking again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Garfield Larkin","date":"2014-11-26 23:14:43 +0300"}],"public_likes":["Ruthe Pfeffer Sr.","Elizabeth Koch","Emerald Schaden","Maynard Cremin","Mrs. Cordie Kemmer"],"vacancy":false,"description":"Built as a Georgian show piece in 1832, the hotel now boasts a garden with a terrace, as well as a fine restaurant, a coffee shop, a bar and a lounge. The Bulkeley Hotel offers stylish rooms. Creative cuisine prepared with local produce is served in the hotel's restaurant.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}