{"title":"San Diego/Downtown","name":"La Pensione Hotel","address":"606 West Date Street","directions":"at India","phone":"+1 619 236-8000","tollfree":"+1-800-232-4683","email":null,"fax":"+1 619 236-8088","url":"http://www.lapensionehotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.72321,"lon":-117.16853,"accuracy":"APPROXIMATE"},"type":"hotel","id":25156,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Hotel was unsafe and dirty-staff was unattentive and not cooperative....away from everything........terrible stay","ratings":{"Overall":1.0},"author":"Carolyn Terry","date":"2015-06-30 17:04:31 +0300"},{"content":"The rooms in this Embassy Suites hotel are not up to normal standards. We were originally assigned a room in the main hotel. The room was an old run down room without a wetbar. The bellhop was very nice and told us that the rooms in the Loft were nicer. We were able to change. These were much better. The rooms were interesting with some of the brick walls exposed. Decor was nice and furniture was fairly new but upholstery had been spilled on and wallpaper in bathroom was peeling. Rooms and bath looked clean. No mold in shower. Bed was very comfortable. Low shower head and normal shower rod. Breakfast and the manager's reception were better than most of the other Embassy Suites we have stayed at. The Loft is in a separate building and you have to go outside to get to the main lobby and dining areas. Valet parking only and it was slow at times. No carts available for luggage unless with bellhop. It took a while for them to come for our luggage on checkout. Staff were all very pleasant. We normally stay at Hampton Inn, Fairfield Inn, Embassy Suites, Marriot, Holiday Inn Express.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Ottis Schimmel PhD","date":"2012-08-09 11:45:03 +0300"}],"public_likes":["Helena Pfeffer V","Alicia Nicolas","Adolph Grady","Alta Gusikowski","Roxanne Macejkovic III","Wiley Monahan","Myrl Heathcote"],"vacancy":false,"description":"Located in Little Italy, this lovely hotel has 75 small rooms with views of the bustling neighborhood. Parking is quite tight here, but the place is quite affordable at around $80/night.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}