{"title":"Sea Ranch","name":"Sea Ranch Lodge","address":"P.O. Box 44, The Sea Ranch, CA  95497","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.searanchlodge.com/","checkin":null,"checkout":null,"price":"180-350","geo":{"lat":38.68,"lon":-123.428,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26731,"country":"United States","city":"Annapolis","state":"California","reviews":[{"content":"Fantastic location, very close to Chinatown and Union Sq. Friendly and helpful staff. Rooms are small but clean. I read some previous reviews but I did not experiecnce any problems. I would recommend this hotel for people on budget and who don't need any special luxuries. No free internet ($9 per day) but go to Starbucks and you'll get one free.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Dedric Blanda","date":"2013-10-02 05:14:24 +0300"},{"content":"I would definately recommend this hotel. Have been visiting for many years on day trips, but treated three 18 year old girls for their Birthday so we spend the weekend. Plenty of room for all of us. The lobby and rooms were nice and clean especially the bathroom which had plenty of nice towels. Comfortable bed and great pillows. Hotel staff very friendly! Parking was not bad for the price which you have to pay for anyway when staying for the day. Great Place overall and for breakfast on the cheap there is a Starbucks next door and Subway 1/2 block. China Gate is right there, Union Square 2 blocks away along w/the cable cars. Overall very nice updated condition for an older hotel in a big city. I am looking forward for another stay here in the future","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Armani Schowalter","date":"2013-07-03 21:50:06 +0300"},{"content":"This is a good hotel for city sightseeing trip. It's very well located, calm, affordable in price, the staff is very friendly and so on. I cannot say anything negative about this hotel. But its location in the very city center has one serious demerit: no space for parking. We arrived by car, and I returned this car to the Hertz office (which is just 5 minutes away) in the next morning. Ah, one more: internet is not free. I paid $23 for 3 days.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Urban Marquardt DVM","date":"2015-06-18 23:49:56 +0300"},{"content":"This is a very well appointed and conveniently located hotel. My room was excellent and quiet considering the location. Easy for all downtown business and entertainment, great shopping just outside. Chinatown is right there, short walk to Moscone or the waterfront.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Ransom Wiegand","date":"2014-09-24 19:20:32 +0300"},{"content":"Great location near Union Square. Good hotel, no air conditioning. No fridge. No microwave.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Kale Greenfelder","date":"2012-09-20 17:13:40 +0300"},{"content":"We had a very enjoyable stay here. The rooms were clean we were two blocks away from Union Square and next to Chinatown. The staff in this hotel were very helpful and made us very welcome. Good for holiday and business. Do not get the shuttle bus to airport (10 dollars) better off in Taxi.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Madie Schuppe","date":"2013-01-06 22:29:08 +0300"}],"public_likes":["Darryl Lakin","Moises Stracke","Dorcas Sawayn","Audrey Schowalter"],"vacancy":true,"description":"The Sea Ranch lodge has 20 rooms.  Some include hot tubs, fireplaces and corner ocean views (with windows that open and bench seats).  Only the Hot Tub room has a TV. Free Wi-Fi.  Made-to-order complimentary breakfast.  Decor leans on the architecture which emphasizes natural materials, local art, a simple aesthetic and the ocean.  A small herd of sheep add to the bucolic setting across the road from the lodge.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}