{"title":"Beynac-et-Cazenac","name":"Balcon en Foret","address":"Tral Pech","directions":null,"phone":"+33 553282401","tollfree":null,"email":null,"fax":null,"url":"http://www.dordogne-bed-and-breakfast.com","checkin":null,"checkout":null,"price":"high season: €95-125; low season: min stay 2 nights","geo":{"lat":44.843968228141875,"lon":1.1400832994751227,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3430,"country":"France","city":"Beynac-et-Cazenac","state":"Aquitaine","reviews":[{"content":"We stayed at this hotel last week for 3 nights. What gracious service and hospitality! The staff couldn't have been nicer or more accommodating. Catie Copley, the Canine Ambassador, is a warm, welcoming face after a hard day of site seeing. The rooms are clean and fairly spacious with comfortable, well-appointed beds. The bathroom was way too small to maneuver about comfortably. However, it's a lovely hotel, right in the heart of the action. Would I return? In a heart beat!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vernon Schmeler","date":"2013-04-30 13:24:40 +0300"},{"content":"Clean, well located, fantastic old bar. Go to hotel for me when in Boston. Not small or quaint but very upscale functional.","ratings":{"Location":5.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Jarrod Rolfson","date":"2012-07-18 11:51:34 +0300"},{"content":"We have now stayed twice at this Hotel both times we were visiting for New Years Eve (First Night) celebrations. This hotel is ideal for this as the parade comes around Copley plaza where the hotel is situated. The rooms were very well equipped and we were given a free upgrade which gave us a separate lounge area. We didn't eat in the Hotel so can't comment on the food but we did go in the Oak room for cocktails and drinks. This is a very cosy place to sit and enjoy a drink or two. Would recommend this hotel to anybody","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Jennyfer Toy","date":"2012-03-08 05:25:49 +0300"},{"content":"Have stayed at the Fairmont Copley Plaza before so I knew the hotel would meet all my expectations. Spent the 4th of July night there and was checked in promptly with no issues. One negative (though minor but still rare for a top notch hotel like the Copley Plaza) was that the staff was not attentive when we walked in with bags. No attempt to help us and even after checking in ... no attempt to bring our bags up to our room (the front desk didn't even ask if we had bags and if we needed help). It's an oversight worth noting (even though I am very capable of handling my own bag) because you would not expect this and never experienced it prior. The room was laid out perfectly and plenty of space. Another minor thing that completely stood out was the half empty bottle of water just sitting on the table. Big oversight for a first rate hotel (and a bit gross since it leads you to question how thorough they clean). The room did appear clean though and the bed was comfortable. Ordered room service and it came up promptly and hit the spot. We ordered extra towels and said we would be leaving the room and to leave them on the bed. No one delivered them. We called again and eventually got them upon our return. The small \"misses\" are noted because of the hotel wanting to be a 5 star facility and my prior experience being so positive. Had breakfast the next day in the Oak Room and it was excellent.","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":4.0,"Value":3.0,"Service":2.0},"author":"Morton Paucek","date":"2015-03-23 20:36:26 +0300"},{"content":"We spent a full weekend in the hotel. It has pluses and minuses, but overall our impression was more on the negative side. On the positive side: - the location was very good - the bedding was nice - the bathroom was also reasonably nice On the negative side: - the doors have no insulation whatsoever. We could see the hallway lights under the door directly from the bed, and could hear everything - the tv did not work well, and repeated inquiries were useless - $7 for a bottle of water ? $15/day for internet access ? Most hotels include these amenities for free.","ratings":{"Cleanliness":4.0,"Sleep Quality":2.0,"Overall":2.0,"Value":2.0,"Service":2.0},"author":"Marielle Braun","date":"2012-10-29 06:53:13 +0300"},{"content":"We were there for a wedding (in the hotel itself). The rooms were really nothing special. Even with an event discount, a 2 night stay for 2 was close to $700.00. Parking was not included even though we were guests at the hotel. We liked the location; though if we were not there for the wedding, we would probably stayed at a hotel in a different location","ratings":{"Cleanliness":3.0,"Sleep Quality":3.0,"Overall":3.0,"Value":2.0,"Service":4.0},"author":"Lazaro Cummerata","date":"2013-01-16 18:59:58 +0300"},{"content":"Fairmont Copley Plaza staff is an outstanding array of professionals. All great you by your name with a smile.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Madeline Robel","date":"2012-08-27 08:27:56 +0300"},{"content":"First - great location. You are located 1 block from Newbury avenue, for great shopping, and minutes from the Copley Mall. If you are looking for a 'Boston' experience, then you have a great location and very nice hotel. The downside - The hotel is not great for kids or for folks looking for a lot of space. The rooms are beautiful, but small and really ornate. You are across the street from the Westin and can easily enter the entire Copley system (i.e. no need to walk in the snow to reach the mall and other Copley hotels). My kids love Katie (the Copley mascot) and the great people. The gold level is very nice and the gold level concierge, breakfast, and evening cocktails are great. The rooms just feel a bit tired, so I'll probably look for other options (maybe Fairmont Battery Warf, Nine Zero on Beacon Hill, or the Intercontintental on the waterfront)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Derick Fadel","date":"2014-04-09 13:25:18 +0300"},{"content":"This hotel is typical of the Fairmont chain: A hotel run by professionals, with friendly but not intrusive staff, good food and drinks in the restaurants, and nicely decorated and clean rooms. You can walk from the hotel to the Museum of Fine Arts, Northeastern University, the Prudential Center, Symphony Hall, the Public Garden, the Common, and good shopping. If you want to go farther afield, there are T stations nearby. All in all, what an urban hotel should be: a convenient refuge when one has had enough of the city.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Kendrick Greenholt","date":"2012-11-05 00:33:37 +0300"}],"public_likes":["Angela White"],"vacancy":false,"description":"Spacious suites with fireplace next to the Chateau Beynac.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}