{"title":"London/South Kensington-Chelsea","name":"myhotel Chelsea","address":"35 Ixworth Pl, SW3 3QX","directions":"tube: South Kensington","phone":"+44 20 7225-7500","tollfree":null,"email":"chelsea@myhotels.com","fax":"+44 20 7225-7555","url":"http://www.myhotels.com/my-hotel-chelsea/chelsea-boutique-hotel.html","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4919,"lon":-0.1685,"accuracy":"APPROXIMATE"},"type":"hotel","id":16459,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"We spent New Year's Eve here and had a very nice stay. This is part of a very large complex of four hotels. The staff even though busy was quite nice and helpful. The free breakfast was one of the better I've had at a hotel. Besides all of the standard things they had Jimmy Dean breakfast sandwiches in a small fridge to heat and have; a good addition. The room although a little small was very nice a clean. The easy access to the restaurants and bars in the other hotels were a big plus. From this hotel you can get to a whole lot of places in downtown Indianapolis without even walking out side.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Sienna Lindgren","date":"2014-06-29 11:04:01 +0300"},{"content":"My 17 year old daughter and I stayed at the Fairfield this past weekend as we were in town for a cheer competition. We were extremely pleased with our stay. The staff could not have been more kind and accommodating. They always asked how your were and what they could do for you. Ben was of the upmost professionalism. The complimentary business center in the lobby was a nice amenity and the internet was high-speed. The breakfast buffet was extremely well run and was constantly being replenished and the tables wiped to allow more patrons to sit and eat. The selection of breakfast food was very good. Our room was a little small as we only had one bed in the room. However, it was more than adequate for our stay and since it is brand new, everything was so fresh and clean. The color scheme and carpeting colors were very pleasing too. The location to the convention center was just one block away and as soon as the JW Marriott opens up everything will be connected by a skywalk. Even so, the walk to the convention center was very close and we even had lots of snow to contend with! There is a busstop right across the street and the Green Zone bus from the airport stops right across from the Fairfield. This made it very convenient since we didn't have the extra expense of a cab. The TGIF restaurant is connected to the Fairfield and we ate there twice. It was so convenient. Great place to stay and very affordable. I highly recommend it!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":4.0},"author":"Tamara Kerluke","date":"2013-11-01 08:05:53 +0300"},{"content":"We stayed at an appartment in St Germain for just a few nights, but found it so much better than a hotel. Our 2-year old daughter loved having the run of a few rooms and we loved being able to put her to sleep in a bedroom so that we could enjoy our evening in the rest of the flat. We'll definitely be back!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nils Grimes","date":"2015-04-23 22:01:06 +0300"},{"content":"Recently I stayed in my third Special Apartment. Each has been unique in style character and ambience, but all have been in sensational locations, and all have allowed me to live the fantasy of being a Parisian - even if only for a few days! My only hesitation in writing this is that the \"secret\" is revealed!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Dayton Abshire","date":"2015-02-05 18:26:03 +0300"},{"content":"We stayed on ile St Louis in a one bedroom apartment in October ( managed by specialapartments.com). The apartment was on the fourth floor with no lift but it was clean and spacious. From the beginning we felt at home in Paris. The location and set up had atmosphere. We became residents not tourists. The location is perfect, we walked to Notre Dame, the Louvre, the Shops and enjoyed the ile de la cite in the early morning before the bus loads arrived. Very close to metro line 7 and Notre Dame RER it was easy to visit anywhere in Paris. The management could not have been better. We were able to check in early ( arrived in CDG at 6am) and they were most concerned about our being disturbed by workmen. We were given the option of another apartment or a200 euro refund for the inconvenience of scaffolding , dust and noise. We will return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Pamela Rutherford","date":"2015-06-18 03:12:06 +0300"},{"content":"One of the most amazing hotels I have ever stayed in. Service is phenomenal, rooms are spotless, roomy and extraordinarily set up with a great layout. There is a no tipping policy that is strictly adhered to no matter how hard I tried!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Amelie Nolan","date":"2015-12-03 07:50:59 +0300"},{"content":"This was our third time back to the Elysian. Our first night it was the Elysian and our second night it was the Waldorf-Astoria. Good news: You now get Hilton Honor points. Bad news: No one knows if the name will remain and you get Hilton Honor points. Service is still impecable and the spa is the cities best. If you love a good whirlpool, they have perhaps the best in the USA. And if you love a good rain shower, they are #1 in this category as well. Love the lap pool and pilates studio but wish they had more free weights and space for the gym. Fresh fruit abounds along with small bottles of Evian. All rooms are pretty much suites and well kept. Every convenience is available including two pull out refrigerator drawers filled with goodies along with an ice maker drawer. The bar is intimate but they pour very small drinks. Wine is your best bet. And pass on the housemade potato chips unless you want to eat several bowls. The casual restaurant is OK and could use some improvement in food quality and prices. We have yet to dine at their fine restaurant. Overall, still the best place in Chicago. No tipping policy is enforced and hope it stays that way. Service is the best.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Deshaun Kunde","date":"2013-05-29 19:16:34 +0300"}],"public_likes":["Mikayla Stracke","Norval Lindgren","Barrett Brekke PhD","Emil Schaden"],"vacancy":false,"description":"Four star hotel on a quiet residential street on the doorstep of fashionable shops and minutes from South Kensington and King's Rd.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}