{"title":"Volcano (California)","name":"Volcano Union Inn","address":"21375 Consolation St.","directions":null,"phone":"+1 209 296-7711","tollfree":null,"email":"hello@volcanounion.com","fax":"+1 209 296-7727","url":"http://www.volcanounion.com","checkin":null,"checkout":null,"price":"$89-139","geo":{"lat":38.443071,"lon":-120.630771,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":32861,"country":"United States","city":"Volcano","state":"California","reviews":[{"content":"Loved it and everything about it! Am planning to return soon! Amazing service, lush rooms with views to die for! Beautiful poor area and great bar staff.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jed McDermott","date":"2013-11-28 17:35:32 +0300"},{"content":"Part of a Southwest Airlines four day package. Chose the Vdara because it was new, totally non-smoking, no casino and in the middle of everything. Got a free upgrade to a Panorama Room - windows on three sides. Only negative - it was on the fifth floor. Room was great - large kitchen, living room and bedroom. Electric curtains and electric room blackout shades on all windows. Very quite and housekeeping was excellent. Had a small cafeteria style restaurant in the lobby. I picked up breakfast each morning and we ate in our room. Short walk to the Bellagio on a private walkway from our lobby. Also same access to the overhead tram that stops in the Aria, City Center and Monte Carlo. Two trams running - wait always less than six minutes.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dianna Pfannerstill","date":"2014-04-23 23:51:38 +0300"},{"content":"I love going to Vegas, but hate the constant smell of smoke at night so this was a perfect fit for us. The room was upgraded for free to the belagio fountains view. the beds, shower, and set up was just amazing. They do not have a place to eat late at night though so prepare for that. Also its not actually on the strip you walk through the belagio to get to the strip which was fine for us","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Taylor Gutmann","date":"2014-02-06 03:04:09 +0300"},{"content":"I have been to Las Vegas twenty-three times on business. This is my favorite hotel and I'll tell you why - no casino and no smoking! You walk in the front door, pass the beautiful reception desk in the lobby and head right to the elevator. No walking a mile through a smoky casino to get to the elevator to your room. This hotel, originally planned as luxury condos, I believe, is beautifully appointed with comfortable modern furnishings. The unit was extremely clean, the bed was wonderfully comfortable, and the bathroom was luxurious with a large glass shower and separate tub. Each suite has a small kitchen. If you ask at check-in, you may get a room with a view of the Bellagio fountain! We did! Even though Vdara is not directly on the strip, it's a short walk to the Bellagio. Not an inconvenience at all. I will definitely stay here next time!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Anthony Harris","date":"2014-02-04 03:26:41 +0300"},{"content":"First of all, being charged a $20 \"resort fee\" is a rip-off serious enough for me to take away one star. They jack up the daily room rate by this fee supposedly for internet access, local & toll-free phone calls, access to the Fitness Center, a daily newspaper, two bottles of water, and turndown service on request. A decent hotel would include internet access and turndown service on request in the regular room rate - which is not low; with cellphones, who needs free calls; the newspaper is at the front desk, not delivered to the door, and can be grabbed by anybody coming off the street. If a guest wishes to use the Fitness Center, he/she should be able to opt to pay or not. On general principles, I refuse to return to any hotel which engages in this abhorent rip-off. If more travelers would stop patronizing these places, maybe the hotels would stop doing it. However, if you don't mind being ripped off $20 per day, here are the pros and cons: Pros: Being in a completely non-smoking hotel is wonderful. Also, I liked being able to go to our room without going through a casino. The location is good; easy access to Bellagio and from there to the Strip. We had a 50th-floor room with a fantastic view. The room is divided into bed and living area. It's spacious, and the bathroom wonderful, with a huge tub and lots of space. The hotel is very clean, and the hotel staff were all helpful, friendly and courteous. Big kudos to them; they are the best feature of this hotel! Cons: There's a kitchen, but you have to beg for plates, cutlery and pots & pans because nothing is in the cupboards (which is annoying). Worse, they don't have a coffee maker -- they wouldn't even bring one up for me. No coffee maker??? Even a Holiday Inn will have a coffee maker in the room! Supposedly the pricier rooms have coffee makers, but this lack almost convinced me give the place two stars instead of three (the staff kept that third star). They'll bring you a robe, but don't bother; we saw people wearing them to/from the pool. The robes are flimsy and cheap and you'll look like an inmate in a psychiatric hospital.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Corbin Crist","date":"2014-10-09 05:44:20 +0300"}],"public_likes":["Catharine Hahn","Maritza Gorczany","Rylee McClure","Zachariah Braun I","Johathan Daniel","Hailee Miller","Hollis Treutel II","Lavonne Reynolds"],"vacancy":true,"description":"Four rooms, each with its own decor, are available.  No pets and children are not recommended.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}