{"title":"Barmouth","name":"Coedmor Self Catering Holiday Cottages","address":"Caerdeon, Barmouth, Gwynedd.LL42 1TL","directions":"A496 Barmouth","phone":"+44 1341 430332","tollfree":null,"email":"coedmorenquiry@hotmail.co.uk","fax":null,"url":"http://www.coedmor.com","checkin":null,"checkout":null,"price":"From 220.00 - 440.00 per week","geo":{"lat":52.7453,"lon":-3.9925,"accuracy":"APPROXIMATE"},"type":"hotel","id":2480,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"We'll stay here again! The room was nice size and very clean. The bed was comfortable. We asked at the desk about internet pricing and the very helpful clerk pointed to the computer in the lobby. She said we could get a better rate online than she could give us. She was right. They have a nice pool and hot tub area. Again, very clean and well kept. The location is very good, easy to get in and out. We checked out the breakfast but did not eat there. It is the usual carbfest that all hotels have. All in all, a great place to stay. I would recommend it.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mallie Block","date":"2014-01-05 19:35:09 +0300"},{"content":"Did not need to shop around for a motel in Branson. We had stayed here last October and we were very pleased with the accommodations. So, we made reservations again this year. Once again, we were very satisfied with our stay at AmazeInn. Clean rooms, friendly service, great location all add up to a motel we plan to use every time we go to Branson.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Bart Gulgowski","date":"2012-08-26 00:53:21 +0300"},{"content":"This was the most unexpected stay . I booked this trip online without seeing the hotel i let my partner choose the place. When he told me the great price i expected a DIVE! I was soooooooo wrong!! This is a well maintained, comfortable, courteous hotel. It is located in the best spot to have access to all Branson has to offer!!! Thanks to the staff for a GREAT 1st but not last trip to your beautiful establishment. LC&RS","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lorenza Beahan","date":"2015-02-04 01:01:20 +0300"},{"content":"High rating for value and pillowtop beds. I have stayed in hotels for over 1000 nights for business travel over the years. The bed in this room was more comfortable than most hotels that cost twice or even three times as much. The rooms are simple and all are exterior access. Room is clean and everything works, including a fridge and microwave. Climate control is fairly new, quiet and in good working order. This is a great place to rest after a busy day in Branson, especially if you are searching for an inexpensive hotel. My room had two queen beds, TV with hutch, luggage rack, 3' square table with 2 chairs, basic bathroom, and adequate lighting. The room is a lot like you would find in an older-generation Holiday Inn (except the beds are NICE and the carpets are clean at this hotel). It is obvious that the owner and staff of this hotel want to provide a clean, comfortable, inexpensive place to stay. Great job!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Era Terry","date":"2015-12-12 09:23:39 +0300"},{"content":"Rooms are larger than most other hotels. The staff was very accommodating to our needs. Clean rooms. Easy walk to restaurants, shows, etc. Great location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mae Gottlieb PhD","date":"2012-08-17 03:59:13 +0300"}],"public_likes":["Cecilia Dickens","Trey Bartoletti","Lindsay Hartmann","Marisa Purdy","Norberto Wuckert","Claudia Brakus","Ron Wilderman","Virgie Ullrich","Dock Kuhic"],"vacancy":false,"description":"Four newly renovated one bed-roomed self catering units situated between Barmouth and Dolgellau.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}