{"title":"San Diego/Point Loma-Ocean Beach","name":"Ocean Beach International Hostel","address":"4961 Newport Ave","directions":null,"phone":"+1 619 223-7873","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":32.74628,"lon":-117.25058,"accuracy":"ROOFTOP"},"type":"hotel","id":25326,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Ideal San Francisco Experience We spent our anniversary weekend at the Mark Hopkins. Never having stayed there, but having heard about it my whole life, my expectations were dangerously high. I am pleased to report that the hotel met or exceeded my expectations in every way. The location is very convenient--at the intersection of all three cable car lines--but atop serene and civilized Nob Hill. (Do get a transit pass, by the way--at $5.00 a ride the cable car fares really add up fast). The hotel is old but perfectly maintained, and has all the charm and character you could hope for. Our room, a corner on the 11th floor, was outfitted with all the luxuries you would expect, and more (like an umbrella, clever two-way shades in the bathroom so you could see out but no one could see in, and the newpaper (NY Times, no less) delivered in a cloth bag on your doorknob.) The bed was top-notch, and the bathroom was luxurious and spacious. A small but thoughtful touch: your room key holder has a handy folding city map attached. The Top of the Mark bar is justifiably world famous, and as a hotel guest the cover charge is waived.","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Benton Parker DVM","date":"2012-08-21 10:33:34 +0300"},{"content":"I used to believe in second chances.... This was my second visit to the Mark Hopkins. I stayed here last year with my partner and never imagined I would experience the same problems all over again!Last year I booked directly with Intercontinental and was assigned a substandard room when I clearly booked and paid a lot of money for a high level room with a Financial District view. After much huffing  puffing on my part I was eventually assigned the room that I had paid for. I had hoped this was an oversight last year, but I was annoyed to return a year later to encounter the same experience leads me to believe this hotel has some staff in needs of some serious training issues in guest relations and hotel hospitality!As I was arriving late (11pm), I had emailed the hotel directly 2 weeks in advance to confirm my reservation and to ensure that the hotel knew I would be arriving late. My email was answered by Guest Relations and I was welcomed back to the hotel as a returning client. On arrival, check-in was less than welcoming and I was not welcomed as a Platinum level Priority Club account holder. I was also, rather rudely, informed that the hotel was full 鈥?why should this concern me? Despite requesting a high floor and having booked and paid for a superior room via Venere.com at $350 a night without tax, I was allocated a room on the 4th floor facing the street. This was not the best start to a holiday after a 20 hour journey. The 5th floor room also had dirty towels lying on the bed. I returned to reception to complain and was told that I would need to speak to a manager. I questioned whether the room allocated was indeed a superior room which was confirmed as such although having stayed in the hotel before I find that hard to believe. I commented on the dirty towels on the bed and stated that the room was unacceptable and did not match my booking. The only response from the on duty manager was a smirk and an 鈥淥ops鈥?in regard to the dirty towels. He also told me that the hotel was full. Was this supposed to excuse the fact that I was allocated a room that was unsatisfactory? I never received any apology. Eventually I was allocated a smoking room on the 9th floor 鈥?my booking and my Priority Club profile clearly states a non-smoking preference. Reluctantly, I accepted this for one night as I was very tired from travelling and it was now almost midnight local time. On the second night I was moved to a non-smoking room on the 11th floor with the proper view, at my request. Overall, I was very disappointed with the service that I received at the hotel and was given the general feeling that the staff were doing me a favour by accommodating me for something that I had already paid for! My subsequent stay at the new Intercontinental San Francisco was a completely different, and better, experience and I will never again return to stay at the Mark Hopkins.","ratings":{"Service":2.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":2.0},"author":"Ward Zemlak","date":"2015-06-23 13:21:58 +0300"},{"content":"5 Star service without the Attitude!~ We are a family of 5 with 3 small children, usually 5 star hotels or small boutique hotel dont always let us feel welcome......We booked this hotel after I saw it on travel channel, the room is good size , clean, bed is comfy, but since the hotel is older , I think the AC just blew on one side of the room, We love the size of our bathroom, but they can improved of the toiletries. Aside from that, we love this place, they have the 5 star concierge without the 5 star attitude !! We asked information on shuttle to the fishermen's wharf but didnt make reservation, when we arrived at lobby, we decided to change our plan and take the hotel shuttle, the conciege greeted me with my name and said he had a limo reserved for me, keep in mind I NEVER made the reservation! The Limo came though the front in less than 5 minute, again the chauffer greeted us with OUR NAME again, introduce himself and gave us a bit of the history of the place we were going. If you are just looking for a luxury hotel, there is plenty in SF with the price tag, but Mark Hopkins tops my chart for customer service, their well train friendly staff made us felt like home.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Keith Gibson","date":"2015-01-30 23:48:53 +0300"},{"content":"Stay across the street at The Fairmont Not as nice as The Fairmont. Also, the guy at the front desk (when we checked out) argued with us when we told him we had not used their parking facilitiy (sooooo expensive) and to take the charge off our bill. He told us he would have to check the surveillance tape and could not trust us! We left, feeling mad -- not the way to exit a vacation in San Francisco! Also, the walls are paper-thin -- we could hear the couple next door having LOUD relations at 3 am in the morning. Embarrassing, because we had our kid with us!","ratings":{"Service":1.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":5.0},"author":"D'angelo Bernier","date":"2014-05-21 20:52:20 +0300"},{"content":"First Class all the way. This was my third stay at this hotel. Stays one and two were uneventful and the second stay was in 2005. What a difference. The staff, which I thought rude and unattentive in 2005, are incredible. And I put them to the test! I am an Ambassador member of InterContinental and the service was the best I've had on the west coast. The room was on a lower floor, but at Number One Nob Hill, everything is in view! Hotel guests get virtual no-wait tables at the Top of the Mark, access to the small-but-well-equipped gym, quick valet parking for a fee and an irreplaceable concierge. Two notes...I'd like to have the bell staff/door staff number increased. There weren't enough folks around to help us with luggage or to greet us at the door with a friendly welcome back or can I get that for you. Second, a little knowledge would have gone a long way in knowing that as an Ambassador member, I had free access to the club floor lounge and didn't need to pay for the Club Intercontinental, which is available to all hotel guests for a fee, not just Ambassador or Priority Club members. Overall, a comfortable place to call home for my three night stay.","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Destiny Legros","date":"2012-08-16 12:33:38 +0300"}],"public_likes":["Hillary Cronin","Bryon Stamm","Scotty Shanahan MD","Mr. Reggie Hilll","Raoul Krajcik"],"vacancy":true,"description":"A popular hostel with backpackers and budget travelers.  There is a bus line on Cable Street that makes it possible to reach the airport.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}