{"title":"Paris/17th arrondissement","name":"Mercure Paris Arc de Triomphe Etoile","address":"Avenue des Ternes 27","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.mercure.com/gb/hotel-0372-mercure-paris-arc-de-triomphe-etoile/","checkin":null,"checkout":null,"price":"€134-","geo":{"lat":48.87829,"lon":2.29498,"accuracy":"APPROXIMATE"},"type":"hotel","id":21673,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"The Bel-Air is really beautiful, quiet and cozy. The staff is pleasant (though the concierge had an attitude). And you will run into the occasional movie star, which is fun. But the food and food service at the hotel is really quite poor and annoyingly overpriced. You really can't eat there, even for breakfast. Luckily, there are a zillion great restaurants a short drive away. And yes, the rooms are \"cozy\" but that's a nice word for \"a little small\". Also, the bathrooms clearly need updating. My shower was a joke. (I'm a guy who really appreciates a nice shower!) The Bel-Air is a VERY expensive place and yes, its beautiful, but by luxury hotel standards, its surprisingly mediocre.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Location":5.0,"Rooms":3.0},"author":"Jayson Hessel","date":"2014-06-03 00:01:22 +0300"},{"content":"Truly a place that knows its business. From start to finish, the experience is everything one would want. Arrive at the discrete entrance, an intelligent and interested employee sorts your car and your luggage whilst escorting you across the bridge to check in. The rooms are mainly in single level villas, spread along various winding pathways in beautiful and immaculate gardens - so there's noise neither from above nor nearby, and it never feels crowded as you make you way through the hotel. Every detail is carefully attended to - the valet parking noticed I opened the roof on my car, so afterwards always delivered it to me with the roof ready down, the rubbish cleared out, fresh bottles of chilled water in the cup holders. The pool attendant placed a towel on the ladder the moment I dived in - and had everything from fruit to sun lotion and magazines to hand in case you wanted it. The concierges really made the place. Tickets for the Getty Villa, arrangements for the best studio tour you can get, advice on good routes to destinations for seeing interesting stuff along the way, all this and much more. The best was to describe a type of skateboard I wanted to take back as a gift, but didn't know the name of - and come back to my room to find one sitting on the desk. Rooms are excellently specced out and every one of the staff was of the highest calibre - from the gardener I asked about some work they were doing to the parking staff, the bar waiters - and of course those concierges.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Miss Carmen Halvorson","date":"2015-06-15 13:54:48 +0300"},{"content":"The Hotel Bel-Air is as lovely as they come with a level of service without rival. I have stayed here for many years and was introduced to it when the Beverly Hills Hotel went under construction. For me, the most charming rooms can be found in the older part of the hotel (think 1950's glamor) but my wife loves the newer rooms in the North Wing - either way you won't be disappointed. The terrace restaurant has a very European feel with plenty of movie moguls and hedge fund-types in abundance. The food is always good and the wine list filled with great vintages. I could go on and on about this hotel but the real asset here are people - they are warm and welcoming and will go the extra distance to ensure your happiness.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Linnie Corkery","date":"2015-08-16 05:01:34 +0300"},{"content":"Upgraded premium room was small and not overly comfortable or luxurious. No place to sit other than the bed or the desk chair. Bathroom was very spartan and not luxurious at all. Service was very good and Sunday brunch at the Restaurant was excellent, however the hotel did not fully live up to expectations.","ratings":{"Overall":3.0},"author":"Armando Ledner","date":"2012-12-21 04:46:50 +0300"},{"content":"its nothing special. it has some nice things like excellent wifi, very clean, the location is great. but on the other hand, the room is the size of a shoebox... seriously. also, my room faced this dingy looking area... i don't know, but it looked shady (it was like the inside of the building? i don't know). if you're not spending much time in the hotel room, then it is perfect, it's on via firenze which is off via nazionale, you're close to two metro stops and termini, all the shopping you could want, and so much more :)","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":3.0,"Value":4.0,"Service":3.0},"author":"Larissa Cummerata","date":"2014-09-22 17:47:24 +0300"},{"content":"We stayed here 2 nights as we were taking ferries and the hotel is directly across from the harbour. It is very old but has recently been renovated. The first night we required 2 rooms and as we were 3 they olny had 1 room for 3 that was already booked so it turned out to be quite expensive. The bed was amazing! Nive to have an outside balcony. The second time we stayed they accommodated us with providing a cot in the room. The fold out cot was absolutely terrible, the worst I have ever slept on; they need to provide better folding beds. there was also little room to move in the room, ended up taking some furniture out to the balcony.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Glen Abbott","date":"2013-11-20 07:31:57 +0300"},{"content":"Our second time in Maui, and our second time at the Pioneer Inn. We adore this hotel, it's got so much character (not the seen one of the chain .... seen them all variety). It's in the centre of town so all the restaurants and shops are within easy walking distance, but more to the point the staff at the Pioneer Inn are so friendly and helpful - you tell me in what other hotel the receptionist (the lovely Katherine) would offer to lend you her library card because you had run out of books to read?? And really that sets the tone for all of the staff, nothing is too much trouble and they are all only too ready and willing to go that extra mile to make your stay wonderful. Staying on the rooms on Front Street won't be right for you if you are 'light sleepers' because the action goes on into the early morning but it suits us because we can sleep through anything and one of the highlights for us is sitting on the balcony and 'people watching' with a drink in hand late in the evening - or sometimes with a coffee early morning (and this time we had a 'Grandstand View' of the Maui Marathon which went right down Front Street) I hope we get back to Maui sometime because we love the island and if we do it will definitely be another stay at the Pioneer Inn. Oh and a special mention for Alex the African Grey Parrott in the bar for making everyone laugh with his repertoire!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaycee Muller","date":"2014-12-04 22:48:20 +0300"}],"public_likes":["Destin Lesch","Gertrude Gibson","Elna Hoeger","Camila Yost","Ms. Audrey Reinger","Maverick Conn","Trinity Kilback","Wilma Bruen"],"vacancy":false,"description":"Modern rooms featuring frosted glass and stiff curtain dividers between sleeping areas and bathrooms, which may not be to everybody's liking. The most expensive rooms enjoy terraces with views over the 17th all the way to La Defense.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}