{"title":"Birmingham (England)","name":"Comfort Inn","address":"Station Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47672,"lon":-1.89816,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3608,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"We spent two days mid-week here while visiting family. All the usual amenities were up to standard, but what we specially noticed was the cheerful and SO helpful staff, not so common downtown anywhere. The breakfasts were great too - continental was included in our stay, but for $1 each we could have `the works', including omeletttes and such cooked to order. This is the fifth Chicago hotel we've tried, and the first we've liked enough to want to come back to.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Service":5.0,"Rooms":4.0},"author":"Shayna Parisian","date":"2012-12-27 08:32:04 +0300"},{"content":"Superb location, very nice room and friendly, helpful staff. Had booked thru Priceline ($50 per night). Arrived at 5am with the hope that I could leave my luggage and check-in later - no problem, my room was ready and also given free breakfast vouchers (HH Gold). Late check-out was no problem. I called as the free high speed internet would not connect in my room and within 10 minutes they rebooted the system and was working perfectly. Room was clean and decent size and bed was comfortable. Definitely stay again.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Ethyl Lind","date":"2015-12-22 15:02:05 +0300"},{"content":"We had wanted to stay at this hotel for some time - prices often more than we wanted to pay. On a special deal weekend, we finally enjoyed this unique landmark hotel. The staff was very friendly - best bellhop ever - gave us the full history of the place on the way to our room. Room was very small, but appointments up to the usual Kimpton standards. The location is excellent for walking to many of Chicago's attractions and shopping.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Imogene Daugherty","date":"2014-08-06 06:50:27 +0300"},{"content":"We've stayed at The Burnham for the past few years, both when passing through Chicago & enjoying a long weekend. I cannot say enough good things about this hotel. The staff is unbelievably friendly & we always feel at home here. We sometimes travel with our dog & this is the only hotel I would consider in that case. The location is wonderful, the Atwood serves good food & the overall feeling of the hotel is warm & welcoming. The rooms are always spotless & we always enjoy our time there. We loved it so much that we extended our stay an extra day over New Years weekend!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Julien Sawayn","date":"2013-05-17 16:12:39 +0300"}],"public_likes":["Merle Sporer","Watson Labadie","Juana Collier"],"vacancy":false,"description":"Comfort Inn is a brand of non-standardized properties where price often trumps modern comforts, and this hotel is no exception. It also boasts a location right in front of the New Street station.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}