{"title":"London/Hammersmith and Fulham","name":"Abbey Hotel","address":"23 Wood Ln, W12 7DP","directions":"tube: Shepherd's Bush","phone":"+44 20 8749-8780","tollfree":null,"email":"info@abbeyhotel.org","fax":null,"url":"http://www.abbeyhotel.org/","checkin":null,"checkout":null,"price":"£69","geo":{"lat":51.5062,"lon":-0.2248,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16167,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Amazing!! I went to the Riu Bambu with a friend and had the time of my life. I read alot of these reviews before going and certainly went trying to keep an open mind. I am not a world traveler by any means BUT that does not mean that I do not know a good thing when I see it. I was greeted at the resort with a cocktail, they brought my bags directly to the room and checkin was a breeze!The rooms were beautiful and very clean. The booze in the room was a great extra. I must also add that my friend called the day before we arrived and requested that our rooms be as close as possible and close to the beach. They gave us rooms across the hall from one another and the closest building to the beach!One night I heard some sort of alarm going off from another room and when I called to inquire, someone was at my door minutes after hanging up.Unlike others on here, I thoroughly enjoyed the the nightly entertainment. I watched the entertainment team rehearse each afternoon and then made sure I went to each show in the evening. I found it a great way to end my day. From 'Sexy Belly' to ' Baby Face' to Evelyn, they were all amazing.As for the food, I never had any stomach issues and ate at all of the restaurants. The selection was wonderful and very tasty. I think those that do complain may have set their expectations too high or are just picky!The resort itself was very clean, service top notch and never felt as though they treated one nationality better than the rest. I found that if you were polite to them, they were the same back. Never noticed anything different from Canadians to Americans...etc. The beach was amazing and always tidy. The pool was the same and always some games happening somewhere.I am very much looking forward to going back and having another week of fun. I was thrilled at how nice the resort was and how nice the staff were. Everyone on the bus heading back to the airport felt the same.Please do not let the few 'negative' reviews turn you off, Im VERY glad they didn't for me!!Thanks RIU BAMBU and see you soon!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Caleigh Wintheiser","date":"2014-07-23 23:05:11 +0300"},{"content":"Very Happy Canadian!!!! Myself and 5 friends just arrived home from the Riu Bambu and had a blast. (It was my first time to Punta Cana.) The resort was very clean. Everyone was extremely friendly. The food was very good. By the end of the week we would have liked a little bit more variety at the buffet ,but all in all very good. The A la carte's were very good. The Seafood Restaurant at the Riu Palace Macao was extremely good. (We went there twice.) The pool was clean. The beach just magnificent. We could walk for hours. Shopping was okay. I really didn't go to shop but still found some unique things to buy. We had no communication problems everyone spoke very good English. I read a lot of reviews before leaving and was a little worried. Now I know they must be hard people to please. We had a great experience and would go back in a heart beat. .","ratings":{"Service":5.0,"Business service":3.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Chanel Schinner","date":"2013-04-21 03:56:37 +0300"}],"public_likes":["Tremaine Collins","Christ Bashirian","Sharon Crooks","Kevin Lockman MD"],"vacancy":true,"description":"Budget hotel close to the BBC Television Centre. Discounts for long stays.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}