{"title":"San Diego/Downtown","name":"Marriott Gaslamp Quarter","address":"6060 K Street","directions":null,"phone":"+1 619 696-0234","tollfree":null,"email":null,"fax":"+1 619 231-8199","url":"http://www.marriott.com/hotels/travel/sangl-san-diego-marriott-gaslamp-quarter/","checkin":null,"checkout":null,"price":"$200-$350","geo":{"lat":32.70855,"lon":-117.15872,"accuracy":"ROOFTOP"},"type":"hotel","id":25163,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"The location of Avenue Plaza was very good. The streetcar ran directly across from the hotel, though the schedule was not reliable. The unit we were in was recently renovated and nice. Small kitchenette area with a stove top cooking area and microwave. Kitchen and bathroom had granite countertops. Bed very comfortable. Bedroom on the small side with no closet but there was a small closet upon entering the unit. Staff was extremely pleasant always offering a greeting and a \"Welcome Back\" when we returned from a day out. Guest services staff helped with suggestions. We were concerned over the notices stating renovations taking place but we did not experience any noise. Took a great Garden District/Cemetery walking tour, which we met in front of the book shop located in \"The Rink\" bldg. Our guide Dave was wonderful and informative. It was only $20. For eating out near the hotel, Cheesecake Bistro was only a block away and offered a nice meal at an average price. For breakfast the Trolley Diner has a 2 eggs, 2 strips bacon & small grits for only $2.99 between 6:30 - 8:30 a.m. each day. I would recommend Avenue Plaza for it's comfortable accomodations, nice staff and good location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Violet Graham","date":"2012-11-13 11:27:13 +0300"},{"content":"I would recommend that if you are staying at this resort, request a renovated room, floor 4 and above. Otherwise you will be stuck with older furnishings. Worst of all you will be stuck with a rock hard bed and maybe a window in the bathroom that does not close all the way, and a door key that chooses not to work 4 nights out of the 6 we were there. The best thing about this resort is the staff! They are very nice and always willing make suggestions on local places to eat. I could write a book about how nice they were to us on our honeymoon. The other great thing is the courtyard in the resort. It is very relaxing after a long day of walking. The front desk has games for you to check out and a great reck room to watch TV and play them in. Great location for the street car, right outside the resort, to get into the French Quarter. Make sure to take a short walk to the Trolley Stop for breakfast, just down the way from the resort, well worth it!!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":5.0},"author":"Horace Gibson","date":"2015-04-16 05:18:06 +0300"},{"content":"This hotel leaves nothing to be desired; there's no-charge laundry facilities, optional maid service (no 7 a.m. knocks on the door), a streetcar stop across the way, and courteous friendly staff. Our unit had a kitchen-an amenity I could really get used to! The gym had plenty of machines and towels. What more could a girl ask for?","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Ms. Amani Goodwin","date":"2013-04-29 02:34:56 +0300"},{"content":"Hotel is very clean, on the \"Naw' Orleans\" main drag. The trolley car runs right by and it only takes a few steps to the stop. Magazine street, where all the cute shops and boutiques are only four blocks away. A great breakfast place, the \"Trolley Stop Cafe\" is two blocks away (towards the Quarter). There is also a great bar on the same block named \"Igors\" that is open 24 hours a day, full of locals who are very polite and talkative. Drinks are cheap and you can do your laundry there, while eating their tasty chicken nuggets while you talk to a local about the best night clubs in town. Here are some great guidlines that we learned in Orleans: Monday: We got to Orleans on a Tuesday, so no help here. Go to Igors and ask local. Tuesday: The Rebirth Brass Band at Maple Leaf. About a 15 minute trolley ride from the hotel. All the locals go here. Wednesday: Head to Toniques on Rampart and St. Ann and ask for a \"Frenchman's Dark and Stormy. Hang out here for a while, then hit up Fat Cats on Bourbon, great funk/ soul band named \"Connections\". Very mature crowd (25-60 years old). Thursdays: Go to Tropical Island on St. Peters and Bourbon, grab a Hand Grenade. Find a great band and just hang out. Fat Cats is always a can't miss with the band. Friday: Hit up at Pat O'Brien's just past Bourbon St. and St. Peters. Grab a Hurricane. You can either ask for a plastic cup or get the gigantic Hurricane glass cup that will cost $3 extra. The glass cup is a great souvenir. Sit down and eat dinner. Try the gator strips. Ask for \"Frank\", the Sous Chef at Pat O's. He is a great guy who will give you great pointers. Tell him Josue and Ian still think it is his fault. If you want hip hop and club stuff stay on Bourbon. If you want great music, head to Frenchman st, where the locals hang. Keep reading. Saturday: Head to Frenchman Street, Just a 5 minute walk from Bourbon Street, just off of Esplanade Street. The Soul Rebel Brass Band plays at Blue Nile. They are great! A reggae band plays a block away. And at Snug Harbor you can catch the best Jazz musicians in New Orleans. After you get out of the clubs head a block up for Burritos. Swayze thought the green hot sauce was \"pretty good\". Then head back to the Quarter, knock on Brad Pitts door, then head to Cafe Du Mond for some hangover food... Coffee and Benites . Sunday: Recovery.... Head to the Trolley Stop Cafe down from the hotel, have a good breakfast. Then head back to Bourbon and head to Lafitte's Blacksmith Bar, Oldest bar in the U.S. Grab a seat, chill, and make a playlist on the juke box. For lunch head to Port a Call on Espandele St, few minutes from the Black Smith. Eat at the Bar and enjoy that burger. Finish up at Tonique with a Dark and Stormy. Hope this helps. Have a great trip!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mr. Hallie Heaney","date":"2014-12-01 23:48:52 +0300"},{"content":"We stayed at the Avenue Plaza Hotel last March. We stayed in a one-bedroom suite which was sorely in need of some work. Paint was peeling, walls were scuffed, some lights worked, some didn't, the remote controls worked only sometimes. The bathroom was the worst, hardly any room to put cosmetics or anything else. The service here isn't fabulous. Several times we asked the evening clerk for directions, to which she responded somewhat nastily, \"Why would you want to go there?\" When we actually made it to 'there' (Magazine Street) we were thankful that we didn't take her advice to just stay in our little corner of the Garden District. By the way, Magazine Street has wonderful, wonderful little stores, cafes, and galleries. Definatly worth the trip. Also, we were two couples sharing a room. Every day we'd have to call down to get a 4th set of towels as EVERY day they would leave us only 3 even though we kept telling them we would need 4 sets everyday and asked them to note it in housekeeping. This is a mild inconvenience, but annoying to have to keep calling. The location is great, close enough to the French Quarter via Trolley to enjoy the action there, but far enough away to have some peace and quiet when you needed it. It goes without saying that the Garden District is lovely. We spent at least two days strolling around looking at the architecture. Overall, this place is fine to stay at, but nothing fabulous. The kitchen is nice if you aren't interested in always eating out. However, if this was where I owned Timeshare, I'd be very upset at how they are keeping up the property.","ratings":{"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Service":2.0,"Rooms":2.0},"author":"Loraine Walter","date":"2015-02-25 15:35:37 +0300"},{"content":"Some friends and I stayed at this hotel from 7/31-8/3 and it was the absolute worst. We were told that the rate was so reasonable because it was the \"off\" season but it was horrendous. The housekeeping staff was terrible. We were actually ASKED if we wanted our bathroom cleaned. The tub backed up while showering so you actually were standing in this dirty water while rushing to shower to get out of there. This \"so-called\" maintenance man came and pulled all the gunk out of the drain with his bare hands whic was totally gross and as a consequence, 2 of us caught Athlete's Foot! We had to ask for clean towels twice. The entire floor we were on smelled terrible!","ratings":{"Overall":1.0},"author":"Lisandro Kihn","date":"2015-07-09 04:30:02 +0300"},{"content":"Did not stay here on this trip, but enjoyed wine and cocktails on the large porch overlooking St. Charles. Service was great; the menu looked inviting, but we had dinner plans elsewhere. The Columns is a terrific, relaxing place to kick back with a drink and reflect on the beauty of old New Orleans.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Location":4.0},"author":"Eliza Schaden","date":"2013-02-20 16:02:08 +0300"},{"content":"I don't usually start out this negative, but what a dump. This place was once used for a movie setting back in the 70's and has been trying to live off that reputation. That is also the last time the place was renovated. It was supposed to look like a cheap bordello and it still looks that way. If old and dumpy mean charming, then that describes this place. It's also known by locals for it's happy hour but it's mainly for college students and groups of middle age housewives. The bar could be really nice if someone there could actually make a classic cocktail. The bar and lounge area are sticky and the upholstery is lumpy and seen better days. The bar is loud late into the evening and the noise echos throughout the hotel. Considering the price, you could go online and get a room at one of the luxury hotels downtown. There's plenty of faded elegance in this town, this place is just plain old and retired. Never, ever ,pay more than $100 a night for this place. Be careful as well, a local bartender was shot just down the street on a Saturday evening (not exaggerating, check the local paper, online). Best of luck.","ratings":{"Service":2.0,"Cleanliness":3.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Jettie Moen","date":"2012-08-24 22:55:30 +0300"},{"content":"The Columns is wonderful place to stay if you don't mind other people staying with you that won't split the bill. My experience at the Columns started out wonderful. The bar is excellent especially happy hour, the rooms are lovely, the staff is great, and the decor beautiful. However on the third night, I was visited by someone who didn't want me there. This spirit made my room freezing, no air conditioning on, and then the bed shake. It took me and my boyfriend three more shakes over what seemed like eternity but was more like an hour before the bed finally shook so hard, we jumped out grabbed a blanket and headed to the lobby, jamy's and all. Once we got down there, another enternity, the staff immediately knew we were staying on the third floor and the stories started coming. By the end nite or morning, I had called my parents at home and asked for them to pay for another hotel someplace else so I could sleep some place without a \"history\". I never went back into my room but did venture with a hotel maid back to the third floor to visit another room that had many sightings and hauntings. To this day my own recollections of the events send chills down my back and make me feel a bit leary of sleeping. Enjoy your stay but don't sleep on the third floor.","ratings":{"Overall":3.0},"author":"Jaquan Hoeger","date":"2012-08-19 15:56:36 +0300"}],"public_likes":["Elisha Zieme","Marie Muller","Mr. Buck Renner","Golda Kutch","Nelson Terry","Lupe Parisian","Isobel Welch","Caleigh Senger"],"vacancy":false,"description":"22-floor hotel in the Gaslamp neighborhood with most of the services and features typical of Marriotts (sadly, no pool or jacuzzi). Rooftop bar, on-site restaurant.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}