{"title":"Ardèche","name":"La Pradella","address":"rue du village, 07290 Preaux, France","directions":null,"phone":"+33 4 75 32 08 52","tollfree":null,"email":null,"fax":null,"url":"http://www.lapradella.fr","checkin":null,"checkout":null,"price":"de 55 à 120€","geo":{"lat":45.143653,"lon":4.663653,"accuracy":"ROOFTOP"},"type":"hotel","id":1072,"country":"France","city":"Preaux","state":"Rhône-Alpes","reviews":[{"content":"I work in a hotel for a living so I can very critical on other hotels. This hotel was amazing. The staff was great!! Our concierige Roger was the BEST!! He was always there to help us or answer a question. The food was great at each restaurant. Who knew that in Mexico you can get great French & Italian food. My new husband and I will definitely return to this hotel again.","ratings":{"Overall":5.0},"author":"Sigurd Hilll","date":"2012-02-10 00:56:49 +0300"},{"content":"this was a great resort, more than we could ever want. no kids and all you can eat and drink.we had no problems with the resort or its staff. will go back again someday","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Cara Zemlak","date":"2014-02-16 13:37:05 +0300"},{"content":"My wife and I visited for 5 days in early October. We stayed in a honeymoon suite room 2731. If you want to know what it looks like, go to youtube and search for Secrets Maroma honeymoon suite and that is it. Upon entering, we were taken immediately to the Preferred lounge for check in. We would have at least enjoyed seeing the lobby but were taken via golf cart before entering. We were offered a drink and towel and our concierge took us to our room for a tour. His name was Sabastian. Unlike others have mentioned, we used our conceirge and preferred club a great deal. It was like our own personal butler and personal bartender. There was never anyone there. We are beach people and used, walked and relaxed on the beach each day. Very uncrowded. We could not understand why the pools were so crowded. The beach was incredible as advertised. Service was incredible! We tipped a great deal, but really did not feel that things would be better or worse if we did not. A tip was treated with indifference at bars and restaurants. I struggled with this as since this is an all inclusive, I would have thought a tip would be greatly appreciated and would make a difference. there was a ton of people around and the only service complaint was that we had to ask all the time for something, not servers asking us. Overall, the restaurants and food was great. Oceana was our favorite followed by Il Patio and then Bordeaux was just not good. Why would you want to sit in a small, poorly air conditioned restaurant when you can sit outside enjoying the breeze at Oceana. Finally, the overall resort, service, beach, pools, room drinks, activities were all memorable. We would definitely return and do highly recommend. I hope whoever reads this goes to this resort and enjoys as much as my wife and I did.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Amani Gerhold","date":"2015-01-24 09:38:31 +0300"},{"content":"My husband and I researched numerous resorts before settling on Secrets Maroma. I must say, some of the reviews were worrysome, but I am glad we went anyways. We had a brief trip 10-2-09 - 10-4-09, and my only issue is that we didn't have more time to enjoy paradise. Bugs - For us, there were not that bad. They gave us bug wipes, and we kept the screen door closed in our room if we were outside. The fogged around daily numerous times, so maybe they got a better handle it by the time we went... this was a non-issue for us. A/C - Not an issue at all. Our room was cold at times. Here is the deal... you must close your doors to have the A/C kick in. If you leave the doors open all day, it will get warm. The only places we thought the A/C was lacking some was at the World Cafe for Breakfast, and the lobby tended to be warm in the daytime, but not in the evenings. The swim out suite is well worth it. We really enjoyed the privacy of having our own area to swim. The concierge at our own building was so friendly and sweet. She truly would have done anything we needed, and asked us all the time if she could help. The resort overall was so well serviced. The food was excellent at Oceana, the lunch sit down at the Steakhouse by the pool and the breakfasts. This is really all we had time to eat. I would say the World Cafe buffet for dinner was not overly impressive... maybe impressive with the amount of food, but not the quality of food. I did not enjoy that as much. The drinks were so plentiful and awesome. Top shelf for sure. Enjoy!!! I would say that overall it was a wonderful way to spend our 10th anniversary. We will definitely go back and for longer. Don't let the other reviews worry you. Also, just as a side note, we used Cancun Transfers as our transfer. They were direct transfers for $82 roundtrip for 2. They drove us directly to our hotel in a transfer van, but picked up in a nice Suburban. For the price, you can't beat that. We felt that it was very reputable and safe.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dr. Lonzo Wehner","date":"2012-01-06 00:15:10 +0300"},{"content":"My husband and I have been to at least 8 all-inclusives in Mexico, Dominican Republic, Bahamas, etc. We always keep coming back to Mexico for the beautiful beaches and decent prices. This was our first time at a Secrets resort. This hotel was amazing! We had no problems with our AC in our room. It was always a decent cool temperature, but I made sure to always leave the doors and shutters shut with the fan on full blast all week. It was always cool when we got back to our room. We had a swim-out suite which was great, but we only used it 3 of the 6 days we were there. You really didn't even need it, because of the two beautiful pools at the resort, but it was a nice extra! The beach was gorgeous, we always found a nice hut to lay under and they give you free snorkels to use for 2 hours, great for swimming with the awesome angelfish right off the beach. The pools were a little warm which I actually like. I hate getting into a cold pool. They were still very refreshing! And again, we could always find a spot to sit by the pools as well. The chefs walk around sporatically on the beach and around the pool with little snacks which were great! And the waitresses/waiters walk around to bring you drinks were awesome! The entire staff was SO friendly and welcoming. We were glad we brought $50 worth of singles to tip everyone, since they were excellent! The italian restaurant was our favorite. We went twice! The seaside grill for lunch was great also! My only complaint was the Mexican restuarant. We were there our first night hoping to get tacos or fajitas, but all they had was fancy & strange items on the menu, such as grasshopper salad and suckling pig. A big EW to us! We did go to the Spa, my husband loved his massage, but mine was just so-so. Other than that, the place was amazing and relaxing! We will defintily return!!! If your looking to relax and enjoy some sun, this place will not disapoint!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Rigoberto Bogisich","date":"2012-02-11 05:46:14 +0300"}],"public_likes":["Sadye Frami","Melyssa Zieme","Rene Gaylord","Murl O'Connell","Dr. Layla Leuschke"],"vacancy":true,"description":"C'est à Préaux, petit village de l'Ardèche Verte, bercé par le chant du coq, rythmé par son clocher et ses 560 habitants que la Pradella (ancien nom du village) et ses chambres d'hôtes vous accueillent. Olivier, Edwige, Elisa et Alaya vous invitent à venir profiter en toute tranquillité du calme de l'Ardèche, dont vous pourrez apprécier les paysages et les lumières. Du farniente pour les uns au vol en montgolfière pour les autres, vous goûterez au plaisir de savourer chaque instant de votre séjour.","alias":"Chambres d'hôte","pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}