{"title":"London/South Kensington-Chelsea","name":"Exhibition Court Hotel 4","address":"25 Collingham Pl, SW5 0QF","directions":"tube: Earl's Court or Gloucester Road","phone":"+44 20 7370-2414","tollfree":null,"email":"info@exhibitioncourthotel4.co.uk","fax":null,"url":"http://www.exhibitioncourthotel4.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.494,"lon":-0.18957,"accuracy":"ROOFTOP"},"type":"hotel","id":16440,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Que no cunda el panico   showReview(19869772, 'full');","ratings":{"Service":3.0,"Business service":2.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Shakira Lesch","date":"2015-08-23 01:53:05 +0300"},{"content":"Horrible, no recomiendo!!!!!   showReview(7628247, 'full');","ratings":{"Service":3.0,"Business service":1.0,"Cleanliness":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":2.0,"Rooms":3.0,"Location":5.0},"author":"Brendon Murazik","date":"2015-05-20 05:48:28 +0300"},{"content":"the location is great, the staff is friendly, but the room is minimalistic to the point of skeletal. White everything, which means the inevitable scuff-marks on the walls stand way out; having a curtain instead of a bathroom door means a bit too much intimacy when traveling with teenage children! I enjoyed the roof terrace, but having to run up and down to get the keys was a bit much. I asked for a quiet room, which meant a nice air-shaft view (I don´t mind that), but our door opened right onto the elevator door, too -- rather defeating the quietness request! Really liked having fruit and coffee in the lobby in the morning.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Wayne Batz","date":"2015-11-08 07:52:26 +0300"},{"content":"The Chic and Basic Atocha has everything for the economic traveller that wants amenities. The rooms were comfortable, well laid out with fantasic a/c (to battle the Madrid heat). Check-in was easy and the staff was amazing and helpful. They solved handled inquiries well and solved issues quickly with no excuses. The front lobby included complimentary fresh fruits /cookies to nibble on, an ice machine with cold water to cool you down from the Madrid heat, and latte/cappuccino/espresso to wake you up in the morning! Chic and Basic Atocha was perfect with easy access to the metro and art museum. Most downtown locations were no more than a twenty minute walk away. The street noise can be a nuisance (but you're going to run into that problem with any hotel in Madrid) but comfortable beds with light blocking drapes made it easy to fall into a deep sleep. I would highly recommend Chic and Basic Atocha!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Matilde Kovacek","date":"2012-12-29 23:10:34 +0300"},{"content":"We stayed here in November 2009 and I think it was a relatively new hotel. Everything was very clean. No frills in this hotel, but it has all the basics. There is a nice beverage area in the small lobby with complimentary water and a great cappuccino machine. There is also a laptop with internet connection for the guest's use. We had a good experience with the staff, for the most part, they were helpful. Our room was all white, with the exception of the bright lime green walls in the bathroom. Just a heads up that the sink and shower are in a small open space (no door). The bathroom area was quite tight, but we were fine with it, especially considering the great rate (we booked a special for $45/night). This also included a breakfast bag that the staff drops off at your door (includes juice, breakfast bar and fruit). The location was very central, within walking distance to Prado and Sofia museums. Very good value. We would definitely stay here again!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Kenneth Cronin","date":"2013-09-12 18:31:41 +0300"},{"content":"We are from NYC n loved it ...this is a really nice modern hotel ..... The staff was very nice a helpful all of them down to the cleaning lady was nice ..... the check in was easy .... They give you a booklet of things to do while your there a map so you know were things are which was helpful all most everything is close to the hotel and if its not its 2 are 3 stops on the train.the most....my room was really nice it was 3 of was my 1 friend payed a guest fee cause she didn't book with us but the put in a bed for her....we stayed 7 days n not 1 thing was bad they helped Us look for clubs even called some of them for me 1 night hotel foodwas good ...I would stay in this hotel and tell others to also .......we had a blast in Italy Rome in the u n a .... Stay here ...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jon Gibson","date":"2015-09-20 05:51:33 +0300"},{"content":"This iis the second time staying in this hotel for business. The room rates were reasonable considering the hotel,I got a room upgrade for a nominal fee and did not pay for wifi. I am writing the review on the wifi right now:-) Very happy here, you know what to expect. Looking around I see a lot of places for not much less that I suspect might be a big dissapointment. I walked all over the place and found it central and well connected to the Leonardo service from the airport and the Metro. Staff were friendly.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Ophelia Little","date":"2014-02-02 02:31:02 +0300"},{"content":"I've stayed at this hotel a couple times that I was passing through Rome. I love the location close to Termini (literally a block away) and I think is a great clean, well built new hotel. The room are ultra modern, the beds a great pleasure. This past stay was largely the same, except for a rather bad end to the visit. My complaints are otherwise very limited. First, the TV's 500 channels could afford to have one or two more English channels than CNN and BBC. They started me in an absolutely tiny room overlooking the block with a tram line, and all night the tram kept me up everytime it passed. The staff graciously found me a much more spacious inner room which was marvelously quiet. Even without having any sort of view, I was quite happy with the change. One complaint I have with this hotel is the bath/shower. There are no handholds, and you have to step WAY up and over the edge of the tub to get into to the rather slick surface to take a shower - still no handholds. They are a very serious accident (plus subsequent lawsuit) away from having new hotel owners, as getting around inside the tub is a very treacherous experience particularly getting out. I found the safest way to do it was slither out like a snake. My real disappointment came from the non-working phone system through which they were supposed to have given me a wakeup call. No ringing phone, I slept happily two hours longer than I wanted resulting in a 50 euro cab ride to the airport rather than a much cheaper train ride. When I asked the manager to help with the cab fare, she shrugged and said \"no, we can't do that\". Very disappointing. Would I stay there again? Probably. Although I certainly won't rely on them for a wakeup call.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Zechariah Renner","date":"2012-02-28 14:22:10 +0300"}],"public_likes":["Dolores Wiegand"],"vacancy":true,"description":"Neat and tidy 2-star hotel less than 5 minutes walk from Earls Court tube station. They have a 24-hour front desk. Double rooms with bathroom from around £60 (summer pricing) with basic breakfast included. The rooms are nicer than many of the double rooms in the hostels along Earls Court Rd, for much the same price, although there is no wi-fi internet.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}