{"title":"London/South Kensington-Chelsea","name":"Ambassadors Hotel","address":"16 Collingham Rd, SW5 OLX","directions":"tube: Gloucester Road","phone":"+44 1480 212898","tollfree":null,"email":null,"fax":"+44 1480 353145","url":"http://www.ambassadors-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4938,"lon":-0.1882,"accuracy":"APPROXIMATE"},"type":"hotel","id":16437,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"It must be a terrible place to work! Stayed there from Dec 26/06 to Jan 2/07. I have been to Punta Cana once before at an excellent resort, and my wife has been to several resorts in Punta Cana and Puerto Plata, as well as Acapulco, Mexico, etc. I regret that there is a lot of negativity in this review, I still had a great time in spite of the resort (thanks to the weather, the beautiful beach and my 16-mo. old daughter's laughter).First the good stuff:I liked the rooms, the resort grounds are beautiful, the food at the steakhouse was very good and the New Year's Eve dinner was also very good. None of us got sick, although my daughter had a mild bout of diarrhea before we switched her to rice, pasta, water, bananas and some fruit. The staff was pretty good at raking up the seaweed from the beach, but they missed a day here and there. Weather was fantastic, poured like $@!#% most nights and gorgeous breezy days.But...We had all kinds of negative experiences with the service. The staff at the reception desk lied to us without blinking an eye, first about when the rooms would be ready and again about finding a crib for our daughter. In my opinion, it appears they are trained to tell you whatever you want to hear so you will go away and stop bothering them. While the clerk I was speaking with insisted she never said to come back for our room keys at 2:30, that check-in time is 3, the clerk beside her was having a similar conversation, insisting with a smile that he told my fellow traveller that keys would be ready at 3:30. This made my clerk a little uncomfortable, since they were both telling different stories. Others from our flight (arrived in PC at 10.30am) didn't get their room keys until 5.30pm.On check-in (1pm) we asked a crib for my 16 mo. old daughter. At 8.30pm when we didn't have one yet, I went to the front desk to ask for one, and was told we would have one in 20 minutes. 90 minutes later I went back to the front desk and asked where it was, could we go to housekeeping and find one. The same person behind the desk explained to me that a crib wasn't part of our reservation. I lost it. I realize now that their blank stares were indications that they simply didn't understand what I was asking. Eventually they said they would try and locate one, and the manager (? - could have been anybody since he didn't identify himself) said he would call us in the room to make sure we got one. He never called. An hour later I found one in a hallway and carried it to our room. When we related our frustration to the Sunwing tour rep, he went and talked to the front desk, returned and apologized on the behalf of Natura. He also said they would make it up to us with some sort of detail - a bottle of rum or something. Nada, never heard from them again. All this on our first day.Language barriers abounded; I fully appreciate that Spanish is the native tongue, but keep in mind I wasn't backpacking in the Dominican - this is an all-inclusive and, to some degree, you rely on the staff to make the effort to help you have a good time. I had no such problems at my last resort (Bavaro Princess). Nada from this resort. I did the best I could with Spanish, but when I had to rely on English to try and ask/explain something, I didn't get anywhere with anyone.Bellhops, waiters, bus staff, bartenders, some housekeepers - nobody wanted to do more than the bare minimum. There was even some rudeness. We gave up asking for cutlery/napkins/coffee refills: it was so much easier to wander around La Cana (the main buffet rest.) until you found it yourself. Twice I had to go hunting for towels because the housekeeper forgot us. On one of those occasions, I called the front desk, tried to explain that we had no towels, they said they would take care of it. An hour later a maintenance guy showed up to fix the door. (--?!) Thankfully, he had a key to the housekeeping linen closet and brought us two bath towels. The wind frequently blew debris into the pool from the beach restaurant. As the day went on, I was surprised that no staff came along to clean it up. Paper napkins, bits of food, dirt, etc. accumulated at the two ramps leading into the pool (The ramps are great for toddlers!). The foot-washing showers to remove sand were broken. Lots of sand in the pool. I developed a sinus infection and my daughter a mild eye infection. Hard to say if it was from the pool, but I don't know where else either one of us would have picked it up.A friend we met on the plane to Punta Cana got violently ill - food poisoning - on his last meal before getting on the plane home. Poor guy spent the entire trip locked in the bathroom, paramedics waiting for him at the airport.There are better resorts for the same money. I'm willing to bet there are better resorts for less money. If you are desperate enough to get away and have to go here, then I hope you have no issues on your trip, otherwise you will be challenged to get any help: expect to fall between the cracks. Everyone else that I met (Canadians, French, Polish, Czech, German, Italian) all told the same familiar story. They said they wouldn't go back either. Sunwing will be my last choice for future trips.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":3.0,"Location":4.0},"author":"Ruthie Kovacek","date":"2012-11-07 20:38:35 +0300"},{"content":"Engaged on the beach! What a great vacation! And for the price... you just can't beat it! My boyfriend and I went to Natura Park from January 20-27 of 2006. He soon became my fiance... because he proposed to me on the beach on our very first night! The resort is beautiful, full of plants and flowers and wildlife. The beach is beautiful too- I had heard that people were turned off by the seaweed, but there really was very little seaweed in the water. There are maintenance staff who sweep it off the beach- I did not think it was a problem at all. The pool was very clean and very large! We really enjoyed getting pina coladas at the swim-up bar! There are not a lot of kids there, which is something that we wanted. It was 95% adults, very few children. For us, that was a good thing. The food was very good... but it is not americanized at all. So chinese food is not exactly what you're used to... but if you have an open mind, I think you'll enjoy it. We had dinner at all three restaurants, steakhouse, Italian, and seafood- and they were all great! My favorite was the seafood. We had a great week, got very tan, ate good food, enjoyed pina coladas and bahama mamas... relaxed a lot... exactly what we wanted. We took an excursion to the capital of the DR, Santo Domingo, and that was really interesting and fun. It was neat to see the city and the culture of the residents. We really had a great week, and...we liked it so much that we are thinking of going back this fall for our honeymoon! If you are looking for very relaxing, mellow vacation... this is for you. If you want a crazy spring break/nightlife vacation, this would not be it. We loved it, hope you do too!","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":-1.0},"author":"Mitchel Beatty","date":"2012-12-28 19:58:53 +0300"},{"content":"Heaven on Earth This was my first time to the Dominican, and I believe that I found heaven on earth. This resort has stunning landscaping and scenary anywhere you go. The ocean is breath taking and the walk down the beach to the left of the resort is unforgetable. The steakhouse was one of the best meals of my life. Although the other 2 speciality restaurents where medicore, I was not dissappointed with the resort. This country has some of the happiest people going about their busniess, asking Don't you just love our country? When will you come back again???When I try to compare the Dominican to Mexico, The Domincan WINS. I shed a tear as my taxi pulled away from the resort. My only warning to furture travelers is don't eat the lobster, and don't use the mini-bar. If you can afford go on the tours sold by the vacation providers or have fun bartering at the markets!!! I highly recommend the Nurse Shark/Bob Marley tour, it is a very fun filled day","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":4.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":-1.0},"author":"Gonzalo Kassulke","date":"2012-12-30 07:25:18 +0300"},{"content":"Beautiful Beach If you are planning to go to Punta Cana, Dominican Rep., I can recommend the beautiful resort, Natura Park Eco Resort. In this resort, you can find a beautiful natural environment, wild birds , very quiet and clean rooms, great and friendly people (even though not all staff speak English, however, all of them are willing to make your vacation enjoyable). The beach is beautiful with white sand and you can walk forever. There are no vendors harassing guests on the beach. The water is clear and the beach is well maintained with plenty of lounge chairs. There were the usual resort activities: volleyball, water polo, some meringue lessons.On the other hand, in our experience there are many things that the management could improve and make this a 5 star Resort. For example: If you like alcoholic beverages be prepared to drink a lot because in my opinion the bottles are diluted with something, but I am not sure. Some wine was poured from a large white plastic bleach container!If you purchased all inclusive package you have the right to have a la carte dinners in each of the 3 restaurants, my advice; if you drink wine (red or white) purchase your own at the Duty Free because the Spanish house wine that they serve with the meals is terrible! The food was better than the buffet, but in this resort, food and drink is not the highlight.Talking about the buffet, in my personal opinion, in general its ok. Some of the meals in the buffet were very greasy, and very salty, and the seafood is not great as I expected. We were a little sick after eating seafood but we are not sure if the seafood was the cause. However, be prepared and take a big bottle of Pepto Bismol with you (helps). Another good piece of advice is; bring small bills in American dollars because it is very difficult to change large bills for small ones. Tip your room maid the first day and you will get plenty of water, coffee, beer extra towels and changed linens when you want. There is a spa on site, (extra charge) the mud massage (called fango) was great. 3 clay tennis available. After spending a week in Natura Park, I found our time was enjoyable, we had a good time in a beautiful place, and people were very hospitable. However, I won鈥檛 come back there, I will try another resort in the Caribbean next time.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Bert Murazik","date":"2014-10-01 07:25:49 +0300"}],"public_likes":["Marcella Hansen","Glenna Mosciski","Rudy Jaskolski","Abner Mraz"],"vacancy":false,"description":"Popular three star hotel situated on Collingham Road between Earls Court and Kensington. The hotel offers 140 en-suite rooms, all with modern amenities. Book direct for best rates and low prices.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}