{"title":"Paris/1st arrondissement","name":"Hotel de Rouen","address":"42, rue Croix des Petits Champs","directions":"Métro: Louvre","phone":"+33 1 42 61 38 21","tollfree":null,"email":"reservation@hotelderouen.net","fax":null,"url":"http://www.hotelderouen.net/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.86451,"lon":2.34054,"accuracy":"ROOFTOP"},"type":"hotel","id":21724,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"As a diamond HHonors member we were upgraded to a top floor ocean view room. We were staying on points and free night vouchers. The Grand Wailea is on a nice beach. In Sept. it never seemed crowded at the beach or pools. I really thought the pools and beach were nicer than other Wailea properties nearby. The property, common areas, spa, were all very nice. The grounds were lovely and while we were there it was obvious that a lot of care and attention goes into keeping it that way. Lucky I read another review where the couple found a coupon in the in room magazine for the spa....around $150 for an hour in the baths (which there are several, shower of different kinds, sauna), a 50 min. massage, and lunch at Bistro Molokini. With tip, tax, and a t-shirt with the spa logo it came to around $200. Without the coupon it would have started at around $200. I really did enjoy the baths, massage and lunch. My spouse couldn't justify the expense so to each his or her own. Our room was very comfortable and the view was gorgeous. It was quite a hike to the self park from our room on the other side of the resort, but that was fine. Other than Bistro Molokini, which is a bar and cafe out by the pools, we ate on property at the cafe located in the shops at Grand Wailea for lunch ( note is has strange hours and not open every day). We rented a refrigerator for $7 a day, which saved us quite a bit on breakfasts. We found provisions at the natural foods grocery, Mana Foods in Paia. I liked that little town. Has some nice shopping and restaurants like the Paia Fish Market (casual cafe on the corner...Ono burger was great) and good art galleries. Drove the road to Hana, went north to Lahaina, and up Haleakala Mountain (about a 10K elevation gain and great views). Really liked Maui and the Grand Wailea.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Asha Wolff","date":"2012-09-25 04:23:07 +0300"}],"public_likes":["Edwina VonRueden","Maude Mills","Kailey Langworth","Christina Gottlieb"],"vacancy":false,"description":"3 min walk from the Louvre.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}