{"title":"Stornoway","name":"Caladh Inn","address":"James Street, HS1 2QN","directions":null,"phone":"+44 1851 702740","tollfree":null,"email":null,"fax":null,"url":"http://www.caladhinn.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":58.20816,"lon":-6.3816,"accuracy":"ROOFTOP"},"type":"hotel","id":28656,"country":"United Kingdom","city":"Stornoway","state":null,"reviews":[{"content":"If you are sound sensitive this is not the place for you, if you dont mind the noise its not a bad place, could do better , could do worrse. I checked in and asked for a quiet room was pleased to get an end room with a nice view, but it was right above very loud road construction and later had to endure very noisey drunks in bar on mezzanine right below me, I was told they would quiet down at 7pm, than 730 than maybe 930..was offered different rooms but all of the rooms had a very very noisey HVAC system that had a constant hummmm that was very annoying. I know from previous stays in nearby hotels the airplane noise is worse at other end Also was expecting a nice balcony but in reality it is only maybe 18\" wide, just enough to stand there. The good: Very good front desk, especially the women on 2nd shift (Silver?) decent bathroom, good bed, nice view, quick shuttle to the strip, room was fresh and not too heavy on air freshener like some places. The bad: Road traffic noise, road construction noise, airplane noise, noisey hum in room from hvac, noisey bar patrons in atrium, food and service in restaurant need some improvement, plates for breakfast buffet dirty, fitness center disapointing, two long black hairs in bathroom sink that were not mine, slight cigarette odor coming from bathroom vent","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":4.0,"Location":2.0},"author":"Miss Helmer Wisozk","date":"2013-12-17 23:31:25 +0300"},{"content":"We don't normally like to stay in Las Vegas but since it is half way to our destination we chose to stay there. We are not into the Las Vegas scene at all so wanted a hotel without a casino. We have 5 children and were looking for something affordable. We came across Embassy Suites on Priceline and for a family of seven it worked great. The room had a living room/sm. kitchenette area and then a separate bedroom. The room would sleep 6 and we put the baby in his own playpen and also had the staff bring up a portable single bed. The kids loved the pool and their favorite part (and mine) was the made to order breakfast in the morning that was included in the price of the room. That kind of breakfast would have easily cost us $40 at a restaurant. We were cozy in the place but it certainly worked for the one night we stayed and was clean and comfortable and the staff was helpful and the hotel was very nice. The kids loved the glass elevators as well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Jordane Medhurst","date":"2012-09-27 21:02:01 +0300"},{"content":"I was a little disappointed with this hotel. The rooms very outdated and look dirty. It's hard to tell if anything is clean as the decor is so dark. Our bedding had holes. No free WiFi, no flat screen tv's. It was okay for a night, but I would hate to spend a vacation at this hotel.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Location":2.0,"Rooms":2.0},"author":"Albina Kiehn","date":"2013-12-23 23:12:19 +0300"},{"content":"This hotel is off the strip and offers the sensitive traveler a quiet respite. Check in was impeccable and swift, the room was clean and comfortable. Breakfast was delicious. The only disappointment was my call to the Front Desk for more towels was either forgotten or ignored. The hotel is located behind the Wynn and it's about a mile walk to the Wynn entrance. There is a Las Vegas Monorail station a 5 minute walk away.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":2.0,"Value":4.0,"Rooms":5.0,"Location":4.0},"author":"Geo Boehm","date":"2015-03-21 23:51:15 +0300"}],"public_likes":[],"vacancy":false,"description":"Handy for the ferry and the bus station.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}