{"title":"Inverness","name":"Bught caravan and camping site","address":null,"directions":null,"phone":"+44 1463 236920","tollfree":null,"email":null,"fax":null,"url":"http://www.invernesscaravanpark.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":57.46508,"lon":-4.23868,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12238,"country":"United Kingdom","city":"Inverness","state":null,"reviews":[{"content":"After a HORRIBLE experience at the Wyndham Orlando (see review), we drove all the way to US 192 to find a hotel. I spoke with a lovely woman named Susan to see it they had vacancies and we were pleased to hear that they did. Upon arrival, we stopped at a guardhouse with security who immediately asked if we had reservations at the hotel. We told him that we had spoken with Susan minutes ago, and he showed us the way to registration. We proceeded to registered, all of our information was ready to go and we went to our room. Grant it, I asked for one king size bed in the room but we got 2 queens. We were so tired from all the running around that we just decided to stay in the room. Included in our $59/day price was an awesome breakfast buffet with omelet station, all kinds of fruits, danish, breads, scrambled eggs, grits, sausages/bacon, oatmeal, cereal, pancakes...it's a long list of items. Our server, JON, was an absolute pleasure to deal with. He was extremely nice and accommodating. LOUISE was also a very nice person and I can say that everyone in the hotel we encountered was very nice and treated us like family. We will DEFINITELY stay there again, and we highly recommend this hotel!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ethelyn Reinger","date":"2012-02-12 16:50:35 +0300"},{"content":"I was so anxious about how the rooms would be against so many reviews. I wanted to give it the benefit of the doubt and claim the bad reveiws as isolated events. Well, that did not happen to me. For a Ramada it was a motel and NOT a hotel. The carpets were filthy! We stayed for a week during spring break. After a few days I discovered bites on my body which I attributed to the 7 mosquitos in our room. (Which is no fault of the Ramada, since my husband left the door open. We killed them all.) But it was the bites that showed up in places that were not exposed outside the blankets that puzzles me. Bed bug bites! If you remove the linen and look at the corner crevaces of the mattress, you can see the signs. The staff was nice, but not helpful with information about the hotel. The beds were comfortable but a very noisy hotel. Also to use the internet you have to pay 25 cents a minute! You do get what you pay for, but since this is a Disney Good Neighbor Hotel, I was very disappointed in the hotel presentation. The pictures are deceiving!","ratings":{"Overall":3.0},"author":"Katrina Kerluke","date":"2014-01-12 17:30:00 +0300"},{"content":"This is actually our second and last stay here. The room itself was not too bad, clean, enough space, etc.. It was more the noise and the shower. We were in the room near the courtyard so we heard the bumping sounds of wheeled luggage at all hours of the morning, were awakened by the sound of a fire alarm at 6 am..really?? and not to mention the horrible loud nightly karaoke. But the shower took the cake, it hung off the wall, there was no hook you could put it in. WTH? So we had to pick it up, wash our hair, put it down, etc etc... I have never seen anything like it. We never had enough coffee for the mornings. We had to find the maid cart to get some. So lessened learned, to save a few bucks staying off Disney property was not worth it.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Walter Schimmel","date":"2012-11-27 00:53:44 +0300"},{"content":"At the Ramada Gateway, the first impression was nice. The pool area was gorgeous and serene. The dining area and the bar was nice as well. But once you got in the room, you could see it needed new caulking around the floor and the tub in the bathroom. The carpet should be replaced in the room. The food was good and blah. Lunch was lunchmeat and salads on both days for a buffet. Breakfast was the best buffet. The Ramada Inn in Kissimee room was alot nicer. The outside pool area was not as nice at the one in Ft. Lauderdale. The variety of food on the buffets were better as well. If I could combine the two hotels, I would place the buffet staff and design of the dining area, outside pool, jaccuzi, bar, and theater from Ft.Lauderdale with the Kissimee's rooms, indoor pool, talent show stage together to make a better Ramada Inn in both towns.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":2.0},"author":"Rocio Baumbach","date":"2014-02-17 15:53:49 +0300"},{"content":"I was a bit worried after reading some reviews but I needn't have been. We had asked in advance for a quiet room as we were going to be there for 2 weeks and so we were towards the back of the hotel, facing inwards from the car lot. So we didn't get the noise from other people coming and going, or from the pool. It looks like they put most people near the entrance to the hotel so perhaps these rooms are a bit worn but we were further down so much quieter. The room was great, 2 double beds, fridge, tea/coffee machine, iron and ironing board if you need it, and was very clean - no mould or damp. Only downside was no nets on the windows so curtains had to stay closed so quite dark. But the the price-great! Great position, 1 stop down to entrance to Disney and close to I4 for Universal. We had a late check out at 1pm with no charge !! All in all we had a great time ! Also we got to see Harry Potter and my son was chosen by the wand keeper - excellent. The Forbidden Journey is brilliant. Just need to save up now to go back. Would return to this hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Carmelo Connelly","date":"2015-03-08 17:45:23 +0300"},{"content":"awesome hotel,awesome staff,everything exceeded my expectations. only gripe,if i had 2 point 1 out would be wireless internet refused to work properly in my room.was a very small inconvienience to go to the lobby to use my laptop. other than that,ramada inn is recomended to all","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Whitney Morissette","date":"2012-06-29 16:54:17 +0300"},{"content":"My husband and I stayed two nights for an anniversary getaway and we had a wonderful time. The room was beautiful with a gorgeous view and most importanly it was CLEAN! The employees were kind and courteous and the buffet downstairs was excellent. We were very close to all area attractions making it easy to plan our days and maximize our time there. We would totally recommend this hotel to friends and family...you won't be sorry!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Francesco Daniel","date":"2014-11-26 11:57:25 +0300"},{"content":"just returned from our two week stay here at the ramada plaza gateway inn. i booked it fairly last minute and after reading the reviews was failry worried. i had nothing to worry about. we had a car park view (nothing special but quieter than been at the pool) it had a fridge that was small but perfectly fine, two double beds and a tv with 16 channels on. it was cleaned dailly with 4 clean towels replaced along with soaps/shampoos and coffee for the coffee machine. it also had a ice machine around the corner from our room. for the price you pay what more can you want. it was clean and perfectly located to disney and food places for evening and morning meals. also noted that rooms where getting carpets relaced for those that did complain that they were dirty. the pools were clean and fresh clean towels provided at the poolside too. our only complaint was that they turned the water off for a few hours during the day and didnt inform us but that really wasnt a major thing. we didnt get hassled by the timeshare either as we avoided eye contact and told them we were students...seemed to work. all in all would recommend this to anyone and would stay there again.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":3.0},"author":"Julie Spencer","date":"2013-02-17 11:23:04 +0300"}],"public_likes":["Lance Strosin","Mervin Hermann DDS","Albert Gerhold","Amos Mosciski","Eldon Balistreri","Aracely Cormier","Madisyn Murray"],"vacancy":false,"description":"Bught Lane, Inverness, IV3 5SR, is just off the main road out to Loch Ness and Fort William. Open March to November, it is situated conveniently for a very pleasant 20 minute walk along the river into the city centre.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}