{"title":"Benllech","name":"Ty Newydd Leisure Park","address":"Llanbedrgoch","directions":null,"phone":"+44 1248 450677","tollfree":null,"email":null,"fax":null,"url":"http://www.tynewydd.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.306775,"lon":-4.240301,"accuracy":"APPROXIMATE"},"type":"hotel","id":40178,"country":"United Kingdom","city":"Isle of Anglesey","state":null,"reviews":[{"content":"Stayed at the Travelodge Euston for 3 nights on a London break with wife and teenage daughter. There has been loads of reports on here about check in staff being dis-interested but the girl who checked us in was very polite & helpful. We had a room on the lower ground floor (basement basically) which had advantages and dis-advantages. The advantage was there was no traffic noise at all which many reiewers on T.A. complained of. The disadvantage was the window was sealed so therefore it became very stuffy, there was aircon which obviously wasn't working properly. The hotel location was great. Literally across the road from Euston Station which is only 4 stops from Leicester Square on the tube. Also, outside the station there are various eateries / coffee shops etc and a tip for the blokes - the Doric Arch pub in the station shows the Ashes on large LCD tellies which is where I sloped off to when the women were getting ready for the evening! There is a bar in the hotel which opened til around 11pm which was quite convenient. If anyone needs any info, please feel free to ask & I will glady answer as best I can.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Gladyce Larkin","date":"2013-12-12 16:47:20 +0300"},{"content":"Was part of a group of friends who were travelling on via Eurostar the next morning. We booked 3 family rooms, which could have slept 3 people easily for an average of £40 per room. For such a central location this represents great value. The hotel is fairly new so still is clean and fresh, something that Travelodges sometimes fail on. It is situated right next to Euston station so is very handy. The area remains fairly noisy all night with plenty of street noise so this can lead to a broken nights sleep. If you are looking for budget accomodation in Central London then this is a really good bet.","ratings":{"Service":2.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Lessie Collier","date":"2012-04-15 11:00:11 +0300"},{"content":"Stayed here for a couple of nights and had to change room 4 times before finding a room with working heating!! the rooms were like fridges and some were very noisy due to the 24hr bus route outside which shakes your room. Rooms were quite small but ok. bathroom had a nice shower but annoying curtain which was useless and resulted in the batroom floor being flooded each time. Breakfast was ok and staff were very nice, location in terms of seeing london is great and only 5 mins walk from Eurostar terminal","ratings":{"Overall":2.0},"author":"Jaunita Veum","date":"2015-12-04 11:26:26 +0300"},{"content":"The hotel was clean and new and not too far for us to walk to from Kings Cross. Got the room for £49 on a super saver deal luckily. We also found it annoying that they have nowhere to hold luggage and charged us £10 to check in early to room that was ready anyway! We had a quiet room although the windown did not open and has a horrible frosted screen over it to stop you being able to see out of it! I wouldn't want to pay full price for a room there but for £45 it was bearable Why do travelodges always have those nasty thin pillows though!!!","ratings":{"Service":2.0,"Cleanliness":4.0,"Check in / front desk":2.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Kaia Gulgowski DDS","date":"2012-06-09 21:24:08 +0300"},{"content":"My husband and I stayed here for one night as a stop-over through Miami. We got a great price on the room through the hotel's website. The hotel has plenty of free parking, a friendly, competent staff, the room was immaculate and nicely decorated, comfortable bed, on-site breakfast buffet (we were able to get a reduced price by asking when we checked in), free wireless internet. We definitely would recommend this hotel. As for \"be aware\" items - it is located very close to the airport, so we did occasionally hear a plane, but not to the point of it being a disturbance. Also the bathroom has a walk-in shower (no tub), which was fine for us. My over-6-ft-tall husband appreciated that the showerhead was mounted high up on the wall, so the water didn't hit him mid-chest (you tall people will know what I'm talking about!!). We would definitely stay here again if we needed a room in Miami.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mckenzie Nicolas","date":"2015-06-25 23:51:56 +0300"},{"content":"This hotel was clean, the service was great; however, the bed was terrible. It was like sleeping on concrete, my boy friend I checked out two days earlier and checked into a different hotel","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":2.0,"Rooms":4.0},"author":"Marquis Hansen","date":"2012-05-05 00:59:01 +0300"},{"content":"Although we stayed for only 1 night, we enjoyed our stay and would stay again. Hotel was clean and rooms were quite large. Staff was helpful. Breakfast was not included.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Ernesto Erdman","date":"2012-11-02 13:38:07 +0300"}],"public_likes":["Kallie Marks","Oleta Turcotte","Demario Labadie","Christine Franecki","Darien Windler MD","Gerhard DuBuque","Oma Marks"],"vacancy":true,"description":"family run caravan park","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}