{"title":"Avignon","name":"Hotel d 'Europe","address":"12 Place Crillon, F84000 -AVIGNON","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hotelsoftheworld.com/france/in-europe-avignon/in-hotel2.htm","checkin":null,"checkout":null,"price":"€350","geo":{"lat":43.95034694330067,"lon":4.803439378738403,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":1363,"country":"France","city":"Avignon","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"I found the staff here very helpful and friendly...one of the nicest I came across in so many hotels i stayed elsewhere. The location of this hotel is great...right smack in the middle of old town city and lots of resturants along the street. My only dissapointment would be that while it has the stated facilities, it is not as just not as Grand and Premier as one would expect of a typical 5 star hotel , but to be fair to the hotel, I read that the '5 star standard' in Istanbul varies from elsewhere. Don't expect a typical 5 star style Suite and Spa Hotel. I would give it 3.5 - 4 stars with great location and very helpful staff so if you consider this as a 3.5 - 4 star hotel when booking and you are happy with the room rates, then you certainly won't be dissapointed.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Demond Stehr","date":"2013-03-07 16:43:09 +0300"},{"content":"Great hotel, with very friendly & helpful staff. The taxi driver had no idea where to find it, so printing out a map might be a good idea. Easy walking distance to the top tourist sites.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Cecilia Carroll","date":"2012-11-14 13:05:36 +0300"},{"content":"Ä° have stayed in hotels all over the world and can not remember being looked after as well as Ä° have been at thÄ±s hotel. The staff are really friendly and courteous nothing was too much trouble Ä° was so relaxed Ä° stayed another 5 days! The rooms are clean and exceptionally comfortabe to accomodate my needs they gave me a executive suÄ±te which was more than enough room for one or two persons. I must also mention the staff; on reception Guven, PÄ±nar and Yuksel are aways helpful and Ä±nformative. The chef prepared me special meals, Necati, AlÄ± and PÄ±nar 2 (breakfast) always very attentive to my needs. Ä° am writiing this after spendÄ±ng the afternoon Ä±n the spa, having had a turkish bath, oÄ±l massage and 1 hours snooze!! I recommend anyone wishing to enjoy a holiday in Ä°stanbul to stay with Hasan and Ali hotel. Philip Edwards from UK. .","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Leila Turcotte","date":"2014-04-14 15:51:09 +0300"},{"content":"We just returned from a wonderful 10-day trip to Turkey, and stayed at some wonderful hotels everywhere. But the best hotel for us was the Best Western Premier Regency Suites, and that's high praise since we really enjoyed the other hotels we stayed at. We stayed here for 4 nights. The location is fabulous - it's on Akbiyik Caddesi, which is a street full of cafes, lovely restaurants offering street-side tables in summer, and boutique hotels. It's a five minute walk to Aya Sofya and the Blue Mosque, seven minutes to the Topkapi Saray, and just round the corner from the Arasta Bazar, which is a smaller, less frenzied, and less confusing version of the Grand Bazar, and no pressure from any of the shopkeepers. The waterfront is five minutes away by cab, and Taksim about 20 minutes away. The hotel is small - 16 rooms - but has all the conveniences you would expect, like an elevator, ground floor restaurant serving meals all day long, and even its own hammam and spa! The rooms are great - we had three rooms (401, 403 and 404) on the fourth floor - and are huge, particularly by Istanbul standards. The fittings and furnishings are of very high quality - super comfortable beds, sofas and sitting area, two desks, LCD TV mounted on the wall, room safe, minibar, etc. Perfect to come home to after a long day's sightseeing! Free wi-fi was a bonus, also there is a laptop guests can use, plus a printer downstairs. There's a beautiful rooftop on the fifth floor with views of the Marmara Sea on one side and the Blue Mosque on the other. By the way, some other reviewers had commented on the noise from the call to prayer. Our rooms faced the street, and we had no noise issues at all - the windows are double glazed, and the most we heard was a light murmur one night. Considering it's such a lively street, it was amazingly quiet. The hotel staff was so kind and caring - any requests we had were attended to promptly. The girl at the front desk even told us not to exchange money at the hotel as we could get a better rate outside! Whenever we took a taxi, they would come outside and give the address to the driver in Turkish, and one time when we were taking a cab back to the hotel and the driver was trying to overcharge us when we reached, she actually came outside and yelled at him, and voila! that was the end of his overcharging attempts! Breakfast every day was very good - huge selection of fruits, yogurt, cheeses and eggs cooked to order. Overall, we felt it was one of the best hotels we have ever stayed at, and can highly recommend it. We are planning to return to Turkey next year, and will stay here again for sure. For large, well appointed rooms, personalized service and great location, you can't do any better!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Hilton Goldner","date":"2013-12-25 20:44:26 +0300"},{"content":"This is a great hotel for a visit to Istanbul! Location could not be better right in the center of Sultanahmet--two minute walk to AyaSofia and the Blue Mosque. The size is perfect with only 16 units it allows for personal care by the staff who are all super friendly and helpful. All the units are very comfortable providing for very good sleep, and of course very clean. We particularly like the heated bathroom floors! Very nice restaurant too--great breakfast with lots of choices. We needed to keep exercising and it offers a very nice gym with modern machines that you can access at any time. We also had some work to do and the staff could not have been more helpful adjusting to our needs of working US hours, printing, coffee to saty away. We stayed here for two weeks ... we missed them!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Cary Koelpin","date":"2012-10-16 17:33:05 +0300"},{"content":"We stayed at the Regency Suites for 4 nights over the Eid holiday in September with 2 young children. The hotel staff were wonderfully friendly and helpful. The room was spottlesly clean and had extra beds for both our children and the location is perfect for visiting the main sights of Istanbul. However, a couple of warnings. First, a suite in Turkey doesn't mean multiple rooms, merely a single bedroom with ensuite bathroom. Secondly, the deluxe suites (I don't think they have a standard class, the alternative is an executive suite) offer a view of a brick wall just over a metre from the windows. Not that we were there to sit looking out the window, but you couldn't even tell if it was cloudy or sunny without craning your neck out the window. Warning's out the way, we thoroughly enjoyed our stay and would highly recommend the hotel - just be aware what you're booking.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Zaria Rau","date":"2014-11-09 01:17:56 +0300"}],"public_likes":["Julian Schamberger","Lamar Witting","Ewell Deckow","Leanne Leannon MD"],"vacancy":true,"description":"5-star","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}