{"title":"Hadrian's Wall","name":"Tantallon House B&B","address":"Gilsland, CA8 7DA","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.tantallonhouse.co.uk/","checkin":null,"checkout":null,"price":"From £44 (no cards)","geo":{"lat":54.99304,"lon":-2.58142,"accuracy":"ROOFTOP"},"type":"hotel","id":10851,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"Myself and a mate stayed here the last week of April 2010. On arrival were were told that the travel agent booked us a king bed and not a double room as we requested when booking and made sure it was a double, as 2 blokes. the guy on reception was not moving on it, he said there will be a double room available on the tuesday, this was sunday when we came. he also advised us that it will be an extra 20 dollars per night in the double room. in fairness we were not impressed with his attitude and inflexibility. nothing we could do so we jst grinned and beared it. then to make things worse, our room was in the basement, beside the breakfeast room and the ice machines and vending machines. Pure pissed off afer paying 500euro each for this $@!#%. The room was serioulsy small, no room for our suitcases, a major squash round the king bed. pure noisy the following morning frm the machines outside our room, this should not be a room it should be a storage room, so not impressed. After one night in that room we asked the girl on reception if ther is any chance we could change room to a double, she checked and said yes, one is available and they are jst cleaning it and after that we can change room. Obviously the guy on reception the day b4 jst cudnt be bothered informing us of this. After we chaged rooms it was fine, room was ok for ny, not alot of space to move about, have stayed in better ones in ny. had no problem after we changed rooms, the girl on reception was very nice and helpful, she let me do check my online banking on her pc and let us use the phone when we neede to, at no cost, she couldnt be more nice. Love ny, done all the usual haunts and sites, grand location, great italian restaurant a few mins walk away, great food, and u get a discount when u mention u are staying in the gem hotel, the girl on reception gave us a card for the restaruant. What more can i say, the hotel was fine after the inital ignorance, our stay was more pleasant chatting away to the nice girl on reception, whos name i cant remember lol, long culry dark hair ha ha.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":4.0},"author":"Walton Wolf","date":"2014-06-07 03:54:50 +0300"},{"content":"My first trip to new york city was a disaster because of this hotel. My wedding is only 2 months away and my fiance and I have bed bug bites all over our body. (30+ bites each) I'm hoping the 6 welts on my face won't scar before our wedding day. The guy that was working there that night helped us find a different hotel. He was really kind. But who wants to stay at a staff friendly bed bug infested hotel? I should have known better to not book a room that's $114 a night. Do yourself and your family a favor and do NOT go to this hotel no matter what cheap rate they offer.","ratings":{"Service":5.0,"Cleanliness":1.0,"Overall":1.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Catharine Funk","date":"2012-01-02 21:29:27 +0300"},{"content":"This was my second time to stay at this hotel. Although my stay was for only two days, I felt very comfortable there. More like an exclusive appartment than a hotel. The flat was small but extreamly adequate. I enjoyed my stay whilst saving BIG money. My next business trip to NYC I will definately stay there.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Tavares Denesik","date":"2014-03-27 18:11:46 +0300"},{"content":"SUMMARY - Although the GEM Hotel is associated with the Choice Hotels chain (Quality, Comfort, Econo, etc.) this is the first time I've heard of this particular branding. They are billed as a \"Botique Hotel\" and certainly fit the bill as much as a chain can be considered a \"Botique\". The place is very bare bones and minimal, yet very stylish and modern. They just give you the very basics of what you need and not much else, but the price reflects that. So it's hard to complain. There are 10 floors and approximately 4 small rooms/floor. It's not the kind of place I'd spend a whole week because it's rather small, has limited storage, and very few of the \"extras\" you'd need for an extended stay. But for staying a night or two in NYC when you just need a place to sleep and shower it does just fine. I forgot to take photos this time, but as of today the photos the hotel has provided on various travel websites are fairly accurate. You just have to take a close look at them to see how small the space really is and understand that the photos really show the WHOLE room. There's not much cropped out! BATHROOM: Clean, basic, and modern. It was pretty much a standard hotel sized bathroom, even though the main room was small. BEDS: Two double beds. Very comfortable, leaning towards the soft side of hotel beds. Sheets were clean and more modern/stylish than you'd find in most chain hotels. BILLING: Reserved via choicehotels.com only a few days ahead of time. The front desk had no problems getting us checked in, and the taxes/surcharges only added up to another 16% of the cost of the room itself. BREAKFAST: There is free coffee/tea in the room, but i never looked for a continental breakfast. There were vending machines in the basement with the ice/water machine. CLEANING: The room was as clean as it gets. While the building is obviously old, it seems that the entire interior is brand new. CLIMATE CONTROL: There was a brand new heater/air conditioning unit that was very quiet and easily adjustable. ELEVATORS: One main, new looking elevator in the lobby. It worked just fine and was fairly large. FRONT DESK: The front desk was helpful and competent. We had to wait about 15-20 minutes for a room to be cleaned. They may have had the smallest, most basic lobby i've ever seen in my life. But if you're looking for water fountains and gold trim you're not going to get it in a hotel with sub-$200 rates! GYM: None. HOT TUB: None. INTERNET: Didn't try it. I was too busy enjoying the city. LOCATION: On the west-side on 36th very close to the corner of 10th. It's a much more sparsely populated and quiet area than most of Manhattan, as it borders on more of an industrial zone. However, it's only a few blocks to Times Square, Penn Station, and Madison Square Garden. It's a block from the entrace to the Lincoln Tunnel. It was nice to be so close to everything, yet just off the \"beaten path\" in a calmer area. There's a gas station on the corner (one of the few in Manhattan) and a few other random bodegas and restaurants nearby. NOISE: It's NYC, there's always going to be some noise, but there was nothing excessive. Lots of trucks roll down 10th avenue at night, but they mostly just blended into the background. PARKING: None. It's best to find a park & ride outside the city and take a train in. Penn Station is just 2 short blocks and then 2 long blocks away. POOL: None. RECREATION: None. RESTAURANT: None, but it's New York. I'm sure you can find something to eat. For the less adventurous, I did notice a McDonald's on 10th, just a short walk from the hotel. ROOM: The room was small and there wasn't much room around the beds. I'll admit, for 3 people, it was a bit cramped. If you like your space I'd limit occupancy to 2 or find another, bigger, hotel. There was limited storage, just one small wardrobe with 2 drawers underneath, a small nightstand, alarm clock/ipod player, desk, desk chair, and flat screen TV. Again, the decor was very modern. SHUTTLE: None. STORE: None on site, a gas station on the corner, several bodegas nearby. SUPPLIES: Standard Soap, Shampoo, Conditioner, Mouthwash & Towels. ===== ===== ===== RATING NOTE: My ratings are generally based on value vs money. Thus, sometimes a simple hotel will receive a 4 or 5, while a fancy hotel can rank a 1 or 2 if I don't feel it was worth the cost. Also, a hotel can do everything right and still only rank as a 4, unless there's something really exceptional about it. 5 = Hotel gets everything right, and goes above and beyond. 4 = Hotel gets everything right. 3 = Hotel is acceptable value for money spent. 2 = Hotel isn't worth the money spent. 1 = Hotel should pay ME to stay there.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":4.0},"author":"Lucy Graham","date":"2014-09-30 09:41:30 +0300"}],"public_likes":["Victor Russel"],"vacancy":false,"description":"Tantallon House offers accommodation around 10 minutes walk from the National Trail. It also has a holiday cottage.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}