{"title":"San Diego/Old Town-Mission Valley","name":"Town and Country","address":"500 Hotel Circle North","directions":null,"phone":"+1 619 291-7131","tollfree":"+1-800-772-8527","email":null,"fax":null,"url":"http://www.towncountry.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.76187,"lon":-117.16846,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25304,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"i loved that hotel. I would recommend it to all my friends, they were very friendly and helpful.","ratings":{"Cleanliness":5.0,"Overall":5.0},"author":"Dr. Bianka Miller","date":"2012-02-03 19:51:29 +0300"},{"content":"We visited San Diego to do the usual - Sea World, Zoo and Wild Animal Park. We stayed at this hotel because of its proximity to Sea World and the Zoo and because its a Doubletree The hotel is very nice, convenient to get to and the staff are friendly and helpful. It is close to attractions and also to Fashion Valley Mall, the largest Mall in San Diego. You have a wide choice of places to eat, from fast food to fancy within a 5 - 7 minute drive. Their concierge and bell desk are just about the best I've seen anywhere - always willing to help and with great local information. We were 8 people in 2 rooms and were driving a 12 passenger van, we stayed 4 days. They not only found a place to park it for us (it wouldnt fit in their underground garage) but they even honoured our free parking deal which was really meant for a standard car or SUV. The rooms are fabulous - spacious and very comfortable for 4. The hotel offers free high speed internet, on site washer dryer, an indoor and outdoor pool and best of all, offer Starbucks Coffee on site (a full Starbucks is only a 3 minute walk)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Kathryne Hills","date":"2015-09-04 06:22:24 +0300"},{"content":"I read some of the previous reviews with trepidation. I'm a former San Diego native who was back in town to visit friends so I knew exactly where the hotel sits. The hotel is in a great location to downtown, zoo, sea world, old town and the beaches. The staff is friendly, the room I had was clean, large enough for family with a nice suite set up. The bed was as comfortable as home. The pool and jacuzzi is great for family time after a day of excursions. By the way...I stay in hotels for at least 20 business trips per year so I see 2 to 4 star hotels constantly. I also like that I can get a large cup of Starbucks coffee for free next to the restaurant. I recommend this place for families on vacation. The only drawback is paying for parking.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Marcella Sanford","date":"2012-03-07 01:25:50 +0300"},{"content":"This was a disaster from the beginning of check in to check out. I am a diamond hilton honors member and when I checked in the front desk told me if I could wait 1 hour then she would put me in a nicer, bigger room. We agreed because we thought we would get a bite to eat then come back. The room wasn't ready in an hour. Nor was it on the right side of the hotel as told. I opened the door and it was like being on the shoulder of the freeway. You coud really hear the traffic. I went back down to complain and it was a new person behind the desk who put me in the room that I refused an hour and a half ago. My profile states that I do not want a room near the elevator. It was the first room from the elevator and Mark Rincon from the front desk said that was the only room available. They were sold out and the original room that I was supposed to get was already given to someone else. He comped us breakfast that next morning. I don't normally do the breakfasts for two reasons: they aren't healthy or good. I have on my profile that I want the reward points. So since that was given to us, we went upstairs to the breakfast on the executive floor just for some decaf and bananas for the road. There were eggs but that was it. The fruit platter was empty. There was a bagel on a platter and there was no decaf. When you pumped the coffee container grounds spit out at you. I took my cup downstairs when I checked out and was told someone would bring us two cups of decaf from the gift shop. Well after waiting my husband went to the gift shop and the woman behind the counter told him he could pump his two complimentary cups. What a waste of time both days. I didn't sleep well from the people getting off the elevator and going down the hallway talking. I made a complaint and got a really unsincere apology from Mark. I highly recommend the HIlton Gaslamp for your stay in San Diego. I tried this hotel because that one was sold out and it was a huge mistake. It really did ruin our day in CA.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Elsie Hintz","date":"2015-05-28 11:28:41 +0300"},{"content":"We selected this hotel through priceline.com. It was great to be greeted with a warm cookie at check-in and the staff was incredibly friendly. There is a charge to park at the hotel but there is free parking available in the adjacent neighborhood. The rooms were clean and the beds comfortable. The lobby was nothing spectacular but the friendliness of the staff made the hotel stand out. The hotel was convenient to dining and downtown San Diego.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Chanel Watsica","date":"2015-09-18 01:25:00 +0300"},{"content":"We stayed here for the holiday weekend, we wanted somewhere that was fairly central. Our main concern when booking was that it was clean, easy to get to attractions, and fairly cheap, as the only time we would be spending here was to sleep. Although the hotel was busy and there was a wedding taking place the staff were polite and helpful. The rooms were a good size, and spotlessly clean. Even though we were so close to the freeway there was little noise. The hotel matched our requirements perfectly and I would definatley stay again.","ratings":{"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Location":5.0,"Value":5.0},"author":"Deshawn Hammes","date":"2012-09-13 23:02:23 +0300"}],"public_likes":["Christelle Pagac","Arden Jaskolski"],"vacancy":false,"description":"Resort with swimming pools, restaurants, spa facilities, golf, and beautiful gardens.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}