{"title":"Rum","name":"Kinloch Village Campsite","address":null,"directions":"Next to the old pier","phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"£6 per adult per night","geo":{"lat":57.01098,"lon":-6.27724,"accuracy":"ROOFTOP"},"type":"hotel","id":24607,"country":"United Kingdom","city":"Highland","state":null,"reviews":[{"content":"Definitely the best part of the Stratosphere was the pool area, pretty live action just about all day. Otherwise the hotel is very average. It is on the north end of south, actually not a very nice neighborhood so we did not really walk outside. Getting to the strip you need a car or transportation, too far to walk. Getting to see Vegas from the tower is a very good experience. We did not like the restaurants on the hotel and tower, overpriced for our taste. It is a very large hotel, we got our room on the opposite side from the poolarea and parking carage, so we had to walk daily a lot just to get to the car or the pool, Rooms are good size and well kept and clean. No special in the hotel, but enjoyed our stay there mainly because of the nice pool area there.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":2.0},"author":"Theo Collier","date":"2014-05-04 18:40:16 +0300"},{"content":"Nice hotel, good rooms, free wi-fi. Just a shame about the location!","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":2.0},"author":"Vena Schaden","date":"2015-05-21 19:54:14 +0300"},{"content":"We stayed here for 1 night because the price was very good and the room rate included tower admission. Checked in close to 1am after a late flight from Hawaii. Unfortunately missed tower admission for the night time view through no fault of the hotel staff who checked us in very fast. Rooms were good for price - had 2 double beds which was not that helpful for man and wife but each was big and comfy. View from room was non-existant really but a plus is that they have recently upgraded the hotels so it looks nice and fresh. This hotel is quite a way from the strip so is best served for staying to go up the tower or to be close to Glitter Gulch or just for a nice affordable stay in a decent hotel with all the amenities of the strip hotels. Great value for money is the key selling point.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Dr. Estelle Schultz","date":"2014-03-23 23:34:15 +0300"},{"content":"Enjoyed an excellent room, clean and comfortable. Fun going to the top of the tower to see the bungee jumpers and roller coaster. Very professional. The room service and buffet were outstanding: Prime Rib perfectly cooked, excellent breakfast with fast service for getting seated and having the first cup of joe. Bed was comfortable with lots of pillows. There was folks to help you with navigating the hotel, bell men were friendly, and the 24 fitness room was spacious, clean, and had a lot of equipment. The elevator to the top of the tower gives probably the best view of Vegas. Especially nice as night to see the lights of the Vegas county. Enjoyed a 4 day stay very much, will be back next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Kaycee Batz","date":"2012-11-04 20:09:46 +0300"},{"content":"Large, clean and nice room, for which we paid very little. No noise disturbance at all, so we slept very well. At check-in we fell for their up-grade offer that we for \"just 20 dollars per night\" could upgrade to a room with jacuzzi, in retrospect not worth the money just for the jacuzzi. The hotel has a nice pool area, and when staying at the hotel you can go up in the tower for free. A tip is to take the elevator to the lounge on level 107 and then continue to the viewing platforms instead to stay in line to go directly to the viewing platforms. The location is at the end of the strip, but there are plenty of taxis to take you around to other places. There is free parking in a garage connected to the hotel, or valet parking for a cost, which is probably not worth it since it looked like there was quite a wait to get the car from the valet parking.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":2.0},"author":"Oswald Bailey","date":"2015-10-18 05:32:25 +0300"},{"content":"I have stayed and played at the Stratosphere many times and just recently returned from another trip. I won't be going back. The rooms are now 3-4 years old and showing their age. To get a renovated room it's another $15-20 per night. The last times I have been at the Stratosphere, I was considered in the highest level of VIP status in their rewards program. Despite my past spending and status, I was told that because I had not been recently, that I no longer had any member perks, rewards, or even a free buffet. It's the rewards program that always took me back to the Stratosphere. With this expiration of member benefits, I'd just as soon choose a nicer hotel located closer to the center of the strip. To have been treated so personably before because of my VIP status, and the money I\"ve spent at this hotel and casino, I was really offended with their 'you're a nobody now' attitude.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":1.0},"author":"Lionel Reynolds","date":"2014-08-20 22:15:30 +0300"}],"public_likes":["Francisca Labadie"],"vacancy":true,"description":"A small campsite on the shore of Loch Scresort, with basic facilities including fresh water, washing up basins, toilets, hot showers and wooden shelters.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}