{"title":"San Francisco/Golden Gate","name":"Marina Motel","address":"2576 Lombard St","directions":"between Broderick St and Divisadero St","phone":"+1 415 921-9406","tollfree":null,"email":"marinamotel@value.net","fax":"+1 415 921-0364","url":"http://www.marinamotel.com/","checkin":"3PM-11:30PM","checkout":"11AM","price":"$85-$135","geo":{"lat":37.7991,"lon":-122.4438,"accuracy":"ROOFTOP"},"type":"hotel","id":25807,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Arrived late at night and were shown to our room which appeared to overlook the town, judging by the lights below; come the morning we realised that the lights were on the fishing boats and we overlooked the sea, wow! The Hotel is situated in a slightly shabby area and the 10 minute walk to the main street for trams etc is steep and quite hazardous with some steps, in poor repair, and watch out for open holes leading to shops in cellars! I wouldn't advise walking down there in the dark, if only for that reason. The hotel is very clean and our room was completely new, we were the first occupants. The bathroom had an all singing, all dancing shower cubicle, spa and massage features etc. Our only criticism, it was a bit small, perhaps should have been a single rather than a double and whilst being next to the dining room has some advantages, the noise from it is not one of them. Breakfast is reasonable and the restaurant serves good, inexpensive food if you don't want to venture out at night. The sound of the Muezzin calling the faithful to prayer on the first morning was a bit eerie but you do get used to it and Istanbul is amazing. Go there!!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Mac Daniel","date":"2012-05-25 08:33:32 +0300"},{"content":"Stayed here for 8 nights leaving on the 3rd December 2008. Taxi from SabihaGorken Airport took one hour twenty minutes at 7 pm, had booked taxi via easyjet which was suberb and cost 62.50 Sterling. On arrival staff met us at entrance and helped with luggage into lobby. Was then ofered various tours ad trips and ways of booking them, all these trips can be negotiated cheaper outside hotel.Was also offered to use there basement health spa for turkish bath and massage again cheaper outside. Room was clean with 2 beds and very comfortable with air con heating etc.Hotel is right next to a smal local mosque so expect to be woken at 05:50 for first call to prayer. Location is superb ie walk up the (VERY) steep hill to trams into sultanhamet and sites of historic interest. Would rate hotel as 3 star and agree with 2 previous reviews and found them very useful.Complimentary breakfast was chese olives boiled egg stewed tea. The fresh bread and jam was very good though.For the money this rates as excellent.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":3.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Skyla Marks PhD","date":"2014-02-03 20:07:47 +0300"},{"content":"This was a mixed bag. The location is 15 min from the French Quarter. First room\"s bath smelled like a sewer. Was told they had only 1 other room, but the parking lot was deserted. Changed rooms and found the 2nd room to be OK. It was clean and quite. The coffee shop is to be avoided. It has just changed management/ownership? and was deserted, but the service was very slow and it was expensive for what it served. Certainly not up to New Orleans standards for quality. Also got the sewer smell a couple of times in the lobby and even out front. I understand this area was flooded with Katrina. This hotel was repaired, but many structures sit in ruins. If you go here, don't plan to eat in the area because there is nothing and the neighborhood is a little scary. There is nothing not even a drug store nearby. Needed gas and stopped at a station, but the pump did not work and I didn't want to go inside due to the clientele. People were drunk in the parking lot.","ratings":{"Overall":3.0},"author":"Silas Hilll","date":"2012-09-28 15:20:34 +0300"},{"content":"I have stayed at the Avalon Hotel a few times over the last year, and I have always been relatively happy with my experience. It's a Best Western, so I wasn't expecting above average service, but I was usually impressed with the staff. The property is nice, but it does have some deficiencies. I got lower rates through Priceline, and I got accommodations I was expecting. I stayed there 2 weeks ago, and found out from the room attendant that the hotel had changed Ownership and Management just that week. During the stay my accommodations were fine, but the service was a bit spotty. The staff was a bit \"hectic\". I will give them another chance the next time I am in New Orleans and see if they keep the level of service I expect, or if I will have to find other accommodations.","ratings":{"Service":4.0,"Cleanliness":3.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":2.0},"author":"Payton Quitzon","date":"2015-04-01 16:47:54 +0300"}],"public_likes":["Maurice Hilll","Armani Turner","Ashley Hand","Sigurd Hickle","Miss Marco Russel","Scot Stehr"],"vacancy":true,"description":"Classic motor inn with a Mediterranean flavor &mdash; flower boxes fragrance the quaint European style rooms. They offer free wi-fi, free parking, and complimentary in room coffee.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}