{"title":"San Francisco/Twin Peaks-Lake Merced","name":"Robert's-at-the-Beach-Motel","address":"2828 Sloat Blvd","directions":"at 46th Ave","phone":"+1 415 564-2610","tollfree":null,"email":null,"fax":"+1 415 681-1376","url":null,"checkin":null,"checkout":null,"price":"$65 & up","geo":{"lat":37.7359,"lon":-122.5047,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":26169,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Pros: Friendly staff, good location, room (evolution room) in excellent condition. Cons: none. Verdict: Very good hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Matteo Haley","date":"2015-12-16 16:58:40 +0300"},{"content":"BAD: Make sure you request a room that is not above the nightclub downstairs on Peter St. We were on the 17th floor & we could still hear all the music, even with our windows shut. Thought we were safe so high up, but it was still noisy. Can't imagine if you're on the lower floors!! GOOD: Location is awesome!!! You can pretty much walk everywhere in downtown. We found the best street to walk - Queen Street & it's just a few short blocks from the hotel. Tons of little restaurants, small shops (not big retail stores), kind of an artsy feel. Also, tons of bars everywhere!!! The hotel's restaurants was actually good too!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":5.0,"Location":4.0},"author":"Deon Armstrong","date":"2012-01-11 14:01:04 +0300"},{"content":"Location was fantastic. Walking distance to CN Tower and other major attractions. Club district for clubbers out there. Shopping district for shoppers out there. Close to subway line and easy subway transportation. Loved our room. Whirlpool tub next to the bed with a fireplace. Breakfast was super. Parking rates are high as you will find in all major cities around the world. Will definitely stay there again when visiting Toronto.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ramona Mitchell","date":"2012-05-16 13:15:43 +0300"},{"content":"I think we got one of the best value in Toronto. The room-rate of this hotel was much less expensive than others and we had a perfect stay. The descriptions of the neighborhood other reviewers made in the past are correct: there are some questionable-looking people, but that is just one of the elements of any big city.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Ofelia Ratke","date":"2012-10-07 00:28:41 +0300"}],"public_likes":["Dr. Beulah Halvorson"],"vacancy":true,"description":"A dive motel, but if you're desperate for a cheap place to stay, it's across the street from the zoo and right next to the MUNI Metro line.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}