{"title":"London/South Kensington-Chelsea","name":"Kensington House Hotel","address":"15/16 Prince of Wales Ter, W8 5PQ","directions":"tube: High Street Kensington","phone":"+44 20 7937-2345","tollfree":null,"email":"reservations@kenhouse.com","fax":"+44 20 7368-6700","url":"http://www.kenhouse.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.5012,"lon":-0.1859,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16448,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"After my first stay last year, i decided to go back due to this hotel's standard and location. Overall, cleanliness (my top priority) is commendable. everything in the room works as it should. The only unpleasant incident was receiving a call at 10.30am on Sunday from the front desk telling us that we have been given the WRONG room type. Unless it was an absolute emergency, please train your staff that it is absolutely NOT RIGHT and rude to call (over an issue which was your staff's fault) your guest at such hour. Why can you just slip a note through the door? P/s : please find a way to install hangers in the shower room though!","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Kristopher Johnston Jr.","date":"2012-01-13 07:13:26 +0300"},{"content":"Stayed here twice, first time for 4 nights in the cheapest room with a window, second time for one night in room without window. Pretty cheap by Singapore standards, small swimming pool is included with the price and was quite nice. Staff is helpful enough. Rooms are small but clean, beds and bedsheets are comfortable and look new. Location is not the best, but Singapore is small and you can easily get around by metro and (tip!) bus. Bus station is right outside and busses from there go just about anywhere.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Dustin Ziemann","date":"2013-04-22 10:02:09 +0300"},{"content":"We stayed here for a week in July and found the hotel very comfortable. Comparable to a Travelodge or Premier Inn. The hotel is new, very clean, well run and cheap for Singapore. The location is just 10 mins walk from the nearest metro station, in a central but quiet part of Singapore, only a couple of stops from the main shopping area (taxis are also easy to find and the area is safe to walk around late at night). We didn't have any of our meals at the hotel but there are several \"hawker\" centres around the hotel where you can get tasty local food for a few dollars (the Chicken Rice outlet near Novena MRT station was excellent). We only really used the hotel as a base to sleep, although the pool on the roof was nice for a morning swim. We also got free Wifi, although it was a bit of a hassle requesting a new code every day. Bathroom is compact, so does get a little wet after a shower but this is not really an issue. The rooms are quite small so don't expect much storage space - not a problem if you don't mind living out of your suitcase for a few days. Staff were helpful and allowed us to keep our bags in storage at the hotel at no cost for a 5 day period between our stays. Overall, an excellent option for those wanting a reliable, clean and economic stay in an easily accessible location.","ratings":{"Overall":4.0},"author":"Terrell Leuschke","date":"2015-04-03 13:35:33 +0300"},{"content":"Small box like room with view of building site and window didn't open. Quite clean and reasonable value. Not central so public transport is a must. Staff not very helpful or friendly. We'll try elsewhere on our return to Singapore.","ratings":{"Cleanliness":3.0,"Sleep Quality":4.0,"Overall":3.0,"Value":4.0,"Service":2.0},"author":"Tyrique Bogan","date":"2014-04-24 08:43:48 +0300"},{"content":"I stayed at the Thomson for two nights between the 15th & 17th of April. We took the shuttle from the airport to the hotel, which cost 9 SGD a person and took about 40 minutes. The hotel is situated a little outside the centre of the city, but this isn't a problem as the Novena MRT station is only a 10-15 minute walk away. There are several local cheap Chinese restaurants on the right-hand side as you walk to the MRT. I would recommend trying them. The hotel is new and in good condition - there is a nice swimming pool on the 7th floor. The room was very small - especially with a young child - but it was new and clean. It was fine for our needs as you don't come to Singapore to spend time in your room. The only complaint I had was that the walls are fairly thin - we could hear next-door's television and people talking in the corridor. The staff were helpful and efficient when you asked them anything. The things I like most about the hotel is that it's cheap, clean, has a nice swimming pool and is in a good location for restaurants and the MRT. It would have been nice if there was breakfast included, but this is fairly uncommon for a budget hotel in Singapore.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Haven Hegmann","date":"2012-10-08 09:43:15 +0300"},{"content":"Stayed in this hotel for a week and had a good experience all throughout. Didn't have high expectations though given its price but was not disappointed at all. Room was small but clean. Bed was comfy and clean linens. Surprised they provided a duvet (other budget hotels I stayed at only offered a thin sheet as blanket). Has hairdryer, coffee/tea making facility, tiny cabinet as closet. No mini bar / personal ref. No free wifi (you can request but is chargeable). Bathroom was small and had no divider between the shower and sink / toilet area. Saw some green mold between the tiles that needed scrubbing. Other than that, it looked okay. Staff were nice. Very accomodating and attentive for a budget hotel. There are several bus stops infront and across the hotel. If you have a bus card, take a 3-min walk to Thomson Rd bus stop and you'll find several buses that'll take you to the nearest mrt station (novena) and to Orchard Rd. By bus, Orchard is only a couple of stops away (10-15 mins). Highly recommended for travelers who are looking for a no-frills hotel. Quite a good price for Singapore price range and it's only a few years old. Price range: $119-139/ night","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Jillian Roob","date":"2014-05-07 10:51:42 +0300"},{"content":"Excellent value for money. We stayed here 3 nights between christmas and NY and it was a great hotel for us. Clean, cheap and modern. The rooms are very small, in fact they are not overally small you just don't get anything other than the bed a toliet room with doubles up to your shower The only downside the walls are paper thin so you can here noise The swimming pool is good and the gym is a very small space with 1 runner and 1 bike The staff were friendly and helpful but no wifi there is internet in the room but you do have to pay for it If you are backpacking or travellers its really good value for money","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Mayra Johns","date":"2015-07-01 08:12:28 +0300"},{"content":"While the staff were pleasent, and the room modern and tidy, that's all this hotel has to offer. The rooms are very small. There is no bar fridge or safe in the room. The toilet and shower are one in the same. That is when you shower the toilet and entire small bathroom gets wet. Breakfast was not included except, they said it's only $10.00 each at the adjoining restaurant. However if your not a local there is nothing that will satisfiy your taste. With rooms being so small you could hear all the going on's of people throughout the day and night, sleep was poor. Ending on a good note the pool was quite nice. If it's for 1 night all o.k","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":2.0},"author":"Savion Wisozk","date":"2015-12-29 09:25:48 +0300"}],"public_likes":["Carmel Torp"],"vacancy":false,"description":"Boutique townhouse rooms and accommodation just off Kensington High Street.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}