{"title":"San Francisco/Union Square-Financial District","name":"Sir Francis Drake Hotel","address":"450 Powell St","directions":null,"phone":"+1 415 392-7755","tollfree":null,"email":null,"fax":"+1 415 391-8719","url":"http://www.sirfrancisdrake.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.789,"lon":-122.4083,"accuracy":"ROOFTOP"},"type":"hotel","id":26235,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Hotel's loacation is in the heart of antique (historical) Istanbul. If you are looking for how was the cultural side of the Ottoman Empire and their fascinating buildings, lifestyles... This is the loacation that u should go to see and feel it. Also, different transportation types are linked you to current downtown. You can easily go and see skyscrapers and huge buildings with 1 or 2 buses... Hotel is really clean, and the staffs are really helpful to customers (at least to us :) ) And the last thing what about the hotel i loved is its design... It is totally awesome, very unique and different for us like from foreign countries...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Una Grant","date":"2015-03-30 01:01:54 +0300"},{"content":"I don't recommend this place after staying here in May 2009. If you reserve a room with the French Balcony, you will get a room without windows. It's not worth the aggravation. Stay somewhere else.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":1.0},"author":"August Willms","date":"2013-12-22 20:20:13 +0300"},{"content":"I enjoyed very much staying in Hotel Evsen during my visit in Istanbul therefore I would like to thank you to all the staff once again. I will definetly stay at Hotel Evsen ,every time I visit the city. Stayed for three nights in this lovely & excellent hotel in February 2009. This beautiful hotel is located only five minutes away from all the historical places (like Topkapi Palace, Hagia Sophia, amazing Blue Mosque and many others). The room was clean and very comfortable, very vell presented with quality interiors and with all the useful facilities as well. I must also point out that all the staff were very polite, friendly and most important very helpful. I was able to use my laptop in anywhere in this fantastic hotel, because of wireless internet facilitiy, which was great. Another good thing was beatufilly served open buffet breakfast,I strongly recommend to try turkish style breakfast to those who wants to visit this magnificent city. Overall, I would highly recommend this perfect hotel who wants to be staying close by to all historical places in a picturesque location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Isaiah Kunde","date":"2012-04-21 03:28:51 +0300"},{"content":"Believe it or not during my time in Italy over the last 12 days, thi shotel has been my favourite and it is only a self catering 1 or 2 star rated residence up a side street a stones throw from Sain Marks square. The room is spacious well presente dan very clean and fresh. Basic but it has ll the tools you l need. Th eair con is ubber powerful and remains on when you leave the room. We were slpa bang in the middle of one of italys most expansive cities and this little number is that little black dress your wife keeps a secret because its a gem! You have your room only and thats it. The location is amazing right in designer central heaven. Travel to and from the mainland is very simple and easy to and not far from our lodgings. Decent hotel manager and clean place!","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jennyfer Hickle","date":"2014-01-23 03:10:34 +0300"},{"content":"4 persons appartement... Fully aquiped.... Great area... Where wifi Works!! Not at all!!!","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":1.0},"author":"Ebony Swift","date":"2012-06-05 07:34:44 +0300"},{"content":"I didn't expect too much from the motel since we were looking for the cheapest option available, but even the price we payed is not cheap enough for this hole. The room we had was tiny. We barely managed to find place for our bags. There is no closet. The bathroom was also very small and the door closed only from the outside. Sheets were old, smelly and with lots of stains. The TV was old and had a bad picture. The AC was to loud. Breakfast was served in an office next to the motel and there is no place to seat and eat, but if you are fan of the cheapest cereal you can take it to your room. There is a Wi-Fi network but it didn't work and the receptionist couldn't help us since he barely spoke English. The only good thing is the location, it's a 2 minute walk from the Chinese Theater and the walk of fame.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":4.0},"author":"Arden Robel","date":"2014-05-09 02:33:24 +0300"}],"public_likes":["Barney Gusikowski","Elizabeth Veum","Elyse Dach","Olaf Durgan"],"vacancy":false,"description":"A historic (built in 1928) and rather lavish hotel a block up the street from Union Square.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}