{"title":"Dumbarton","name":"Dumbuck Hotel","address":"Glasgow Road, Dumbarton","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.dumbuckhousehotel.com/","checkin":null,"checkout":null,"price":"fom £40","geo":{"lat":55.93964,"lon":-4.54485,"accuracy":"ROOFTOP"},"type":"hotel","id":8340,"country":"United Kingdom","city":"Dumbarton","state":null,"reviews":[{"content":"My husband and I were in Istanbul for a Pshycology Conference in July and we stayed in this awesome hotel. The hotel was cosy and clean with a very nice buffet breakfast every morning. The staff were very friendly and helpfull and helped us to organise day trips. etc. It was a bit noisy in the evenings, but you are part of the busiest street in Istanbul and this makes you part of the vibe!! The hotel was very central and we walked everywhere. It is surrounded by good restaurants and shops and Istanbul is a shoppers paradise!! We will definitely stay there again if we would ever have the oppertunity to visit Istanbul again! Thank you!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Morgan O'Keefe","date":"2015-10-12 05:00:01 +0300"},{"content":"The best thing about this hotel apartment is that you will find it difficult to find a better price with its standard and location. The Emirates Mall is only 5 minutes by walk and Burj Al Arab is 20 minutes by taxi. The rooms are clean and comfortable. The staff were friendly but could have been more helpful. At one time we needed a taxi there and then but they couldnt help us out because their commissioned taxi company was busy. If you dont book your taxi at least a day before, better go and wait for one in the taxi queue at the mall","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Jeremie Frami","date":"2013-12-20 02:58:20 +0300"}],"public_likes":["Frieda Buckridge","Christop Pfeffer","Zoe Gusikowski","Kurt Towne","Ms. Marquise Jerde","Efrain Bruen","Leanne Prohaska","Amiya Goodwin"],"vacancy":true,"description":"16 room hotel in an 18th century mansion house","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}