{"title":"Bakewell","name":"The Rutland Arms Hotel","address":"The Square","directions":null,"phone":"+44 1629 812812","tollfree":null,"email":null,"fax":null,"url":"http://www.rutlandarmsbakewell.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.21294,"lon":-1.675921,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":1506,"country":"United Kingdom","city":"Bakewell","state":null,"reviews":[{"content":"Fantastic hotel really quick walk through mall to Vegas strip. Always ask for room away from railway track because the train does blow its horn very loud. We were on 40th floor facing side of strip was really quiet . Suite was super bathroom to dream for with spa big enough for 2. Went to nearby wallgreens next to Venitian Hotel and stocked up food for breakfast so could have breakfast in room each day.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Miss Marlen Hamill","date":"2014-02-11 23:43:59 +0300"},{"content":"Stayed for one night and booked with iprefer 139 per nite. Hotel is just off the strip and has a complimentary shuttle to the wynn and caesars. Fashion mall is literally a stone's throw from the lobby. NO CASINO which is a plus if you don't gamble and hate smoke. Pool is small and well maintained and not very crowded. Snack area is nice. Note that there is very little shade on the deck unless you want to splurge for a private cabana 200 for the day. Rooms are spacious and immaculate. Furnishing are modern and elegant. Kitchenette is a nice plus with stove top microwave and subzero mini fridge. I wouldn't hesitate to stay here again. Only stayed at the hotel for approx 12 to 15 hours and found service acceptable but was hoping for that WOW factor in customer service. The service at chicago trump tower seemed more impressive. I would certainly return to this fine establishment.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Zoe Buckridge MD","date":"2014-07-21 15:44:53 +0300"},{"content":"Although, I can be very skeptical, this was a great hotel! The staff was very kind and friendly! Everyone that I spoke with was a joy! They provide a very welcoming environment. The only draw back here was the \"valet\" OMG! One time they forget about me and I waited 20 minutes, UGH! Although, they apologized this was quite the pain. Nice and convenient location off the strip and no casino, so you don't have to walk through the \"smokey\" environment! Very nice workout room and overall just a beautiful hotel. One of the best experiences I have had in Vegas and I have been many times! Very Comparable to the Wynn.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Fiona Murray","date":"2013-06-07 07:09:56 +0300"},{"content":"amazing room, corner suite view down strip from bathroom.. wow what a suite! Fantastic, son had comfortable sofa bed in sitting area, our bedroom was great. Staff fantastic, pool ok, nice non smoking hotel.. shops across road, good location. Felt safe. Great start to my trip. Nothing can beat views of Vegas from my jacuzzi bath!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Turner Ankunding","date":"2015-06-21 00:28:42 +0300"},{"content":"Let me get the bad out of the way first... the train noise is TERRIBLE (or was, at least, in our room - #5423). Perhaps we were put in a room directly above the train crossing/intersection because we booked via Priceline but, regardless, be SURE to request a room away from the train tracks!! I was awoken at 2:30 am, 3:30 am, 5 am, 6:30 am.... I called the front desk tearfully requesting ear plugs & they said they had none but that the gift shop did. My next question: \"is the gift shop open now\" -- answer: \"no\" which meant/translation \"you are S.O.L.\". I am not joking when I say I considered sleeping on the bathroom floor to get some quiet rest. The friendly & helpful staff did, however, move our room the next afternoon & I purchased ear plugs & then slept fine (but you don't really anticipate having to wear ear plugs in a 5 star hotel). Anyhow, the train noise is bad. You have been warned. Otherwise, this is a fine hotel. I breathed a sigh of relief (literally) at it being smoke-free. I thought the hotel being casino-free might be a bit of a bummer but it wasn't. Trump offers shuttle service to Wynn & Cesar's throughout the day so if you need to get your gambling fix in it's just an air-conditioned van ride away. The rooms are big & comfortable with great views. They include a microwave, toaster, coffee maker, mini-fridge & flat-screen TV as well as two wardrobes (great for us as we were 2 friends traveling together). The bathroom was HUGE with granite & marble & a large soaker tub. The staff was incredibly friendly & they even do this nice touch of coming around the desk to hand you your check-in receipt & walk you toward the elevator. Very thoughtful when they were clearly busy & had other folks waiting to be helped. The on-site restaurant was fine. Pretty good food but expensive (breakfast buffet is $20 & $5 for a cappuccino or fresh-squeezed orange juice). Trump International is, literally, right across the street from the Fashion Show Mall so it was fun to do four hours of shopping & then stumble back to the hotel. All in all, this is a very good hotel with an exceptionally friendly, courteous & helpful staff. I'd recommend it for others but being that i'm an extremely light sleeper & have battled insomnia I don't think I'd stay there again- the train noise was just too much for me.","ratings":{"Cleanliness":4.0,"Sleep Quality":2.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Dr. Alberta Johns","date":"2012-10-04 10:47:20 +0300"},{"content":"Having read some reviews prior to booking here about the train noise, I booked our stay here regardless, and I\"m glad I did. This is one terrific hotel, with beautiful rooms, non smoking, non casino. You won't find the \"20\" something crowd staying here which was perfect. The pool although smallish by Vegas standards is quite nice, no blaring music. The staff during our stay was very helpful and nice. The only downside to our stay was room service, which for whatever reason we had trouble getting through to, and had to phone the front desk in order to place an order, definitely something they should look into., but once the order was in, the food was fast, and service good. I'll definitely stay here again for my next trip.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":3.0},"author":"Betty Rogahn","date":"2012-06-11 08:17:07 +0300"},{"content":"Simply amazing. Beds and linens are the most comfortable I have ever slept in. Hotel was immaculate. When visiting Vegas, we were leery about staying in a hotel with no casino. But the service provided erased any skepticism we has. Check in: extremely fast. From drop off to being in my room took about 10 minutes. This is a no smoking hotel, but the idiots in the next room must have not got the message. When I made a quick call, I was immediately moved to another room. Room: This hotel was originally built as a condo complex, but was converted to a hotel. Room was spacious ( I had a one bedroom suite) with a nice wet bar fridge and microwave. Bath room was luxurious with a Jacuzzi tub, double sinks, and tv in the vanity mirror. Soaps were from the Trump spa and smell wonderful. Robe provided was very soft. Room TV was a 38\"or larger HD screen with a great picture. Location: For me I am fine with the location. Those who want an on strip may not care for the location. This hotel is at the north end a bit off the strip. They provide free shuttle service to the Wynn and Caesars palace. So you can get to just about anywhere you want to go and never move your car. The shuttle leaves about every 10 minutes. The front door of the hotel faces the Nordstrom entrance of the Fashion Show mall. Other that was provided at no charge: Wireless internet had an extremely strong signal. Newspapers delivered every morning. Bottled water placed in room daily. Gym has top notch equipment. I only saw the pool but did not use. It looked very nice but small. Food: All food and beverage we experiences was very good a little pricey, but not over the top. Overall: we loved the lobby that smelled clean and smoke free. Also appreciated not having to maneuver through a casino to get around the hotel. The ease of getting to a casino outside the hotel was enough for our casino needs. Only downside: There were a few of us staying at the hotel on various floors. The elevators are in banks, so to get from a floor in the 40's to a floor in the 60's you had to go down to to up. Elevators were extremely fast, so I almost hesitate to mention this hiccup.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Pierce Boyer","date":"2013-08-12 10:14:52 +0300"},{"content":"the rooms where great!!50 square metres room!!super clean and ith all confort!! Only think..it's not on the strip(main road in Las vegas, just 5 minutes walk off) If you want to be in a thematic hotel..do not choose this one.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Daphne Runte","date":"2014-07-17 10:32:38 +0300"},{"content":"arrived after 10hour flight from UK and was put in a high city view room as requested , was very impressed , jaccuzi , his n her sinks , seperate shower and separate toilet , plenty of storage , kitchenette with fridge , big bed and seating area . imagine my horror as a freight train pulling 30 plus wagons of coal ,sounding its ear pearcing horn as it crossed a level crossing less than 0.5 miles away . This we could have put up with considering the time of day (4.30pm) but this continued through the night and for the 7 nights that we were there. We were moved twice and even given a strip view room upgrade for free but could still hear the train. dont get me wrong this is a great hotel but be aware of the train or take ear plugs !","ratings":{"Cleanliness":4.0,"Sleep Quality":1.0,"Overall":3.0,"Value":4.0,"Service":4.0},"author":"King Ortiz","date":"2014-06-03 10:28:25 +0300"}],"public_likes":["Carlos Roob","Jay Turner","Margie Krajcik","Tyrique Gutkowski","Eliseo Goyette","Ruben Deckow","Dovie Hackett","Miss Tanner Medhurst","Lenora Wisozk DVM"],"vacancy":true,"description":"Serves food","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}