{"title":"Ambleside","name":"Waterhead","address":"Lake Road","directions":null,"phone":"+44 15394 32566","tollfree":null,"email":null,"fax":null,"url":"http://englishlakes.co.uk/hotels/lake-district-hotels/ambleside-hotels/waterhead-hotel/","checkin":"3:00pm","checkout":"11:00am","price":"£56.50-£113 pppn","geo":{"lat":54.420524,"lon":-2.961805,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":635,"country":"United Kingdom","city":"Cumbria","state":null,"reviews":[{"content":"The Edgewater Hotel in Seattle is actually misnamed; it sits not only on the water but over it. Thus, if you pay for a waterside room (which are expensive), you could actually fish out your room window. We splurged for a waterside room with a tub, which is one of the most expensive rooms listed. The room was decorated in a rustic style but had a modern flat-screen television, an up-to-date bathroom, and a great gas fireplace in the corner, which also provides heating on cold nights. Everything was comfortable and well-appointed and the housekeeping was prompt and efficient. The lobby was quite large and pleasant with great views of the water and wonderful places for reading or simply observing the passing of boats. The bar and restaurant also featured great water views. You can eat the full restaurant menu in the bar and the food was excellent--fresh, well-prepared Seattle-style fare. Breakfast was equally excellent. Because the hotel is an overnight stop for cruise passengers either arriving or leaving Seattle for Alaska, it can be quite crowded on the weekends when the ships are in port. Book early to get the room you want. The hotel is also in a great location within easy walking distance to Pike Place Market or the outdoor sculpture garden, as well as other downtown attractions. It is our go-to place to stay in downtown Seattle. The only downside was that we had a first-floor room and could clearly hear any footsteps in the room above us, but as we carry a noise canceling device with us while traveling, the footsteps did not disturb our sleep.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Litzy Tromp","date":"2013-04-18 13:45:57 +0300"},{"content":"The Edgewater Hotel sits over Puget Sound on piers. It's so relaxing to open your window to the see the water all around you. And nothing's better than having a cocktail while watching the sun set of the Olympic Mountains. The rooms are super nice with fireplace and modern bathrooms. My only complaint is that the hallway is dark - but you don't care once you're in your room. I've also hosted professional workshops at this hotel and this chef makes the BEST conference food of anywhere I've ever been. Delicious!!","ratings":{"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Johnathon Mayer","date":"2013-06-13 16:01:49 +0300"}],"public_likes":["Laney Ernser","Emilie Padberg V","Carroll Rolfson"],"vacancy":true,"description":"4 stat town house boutique hotel.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}