{"title":"Gower Peninsula","name":"Hill House Holiday Cottage","address":"Llanrhidian, Swansea, SA3 1ER","directions":"20 minutes drive from M4 junction 47","phone":"+44 1792 391333","tollfree":null,"email":"owner@hillhousellanrhidian.co.uk","fax":null,"url":"http://www.hillhousellanrhidian.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.6094,"lon":-4.1734,"accuracy":"ROOFTOP"},"type":"hotel","id":10290,"country":"United Kingdom","city":"Llanrhidian","state":null,"reviews":[{"content":"Let's face it. Airport hotels exist primarily for overnight transients. They are not dolled up for the tourist trade...unless, of course, the airport is also near the touristy areas of the city. That is certainly not the case with Boston's Logan airport. But the Logan Hilton was a fabulous surprise. From its lovely towering lobby to its spacious, well appointed rooms and it's pleasant staff, the only downside it that this is not a downtown hotel. Hotel excellence is all about attention to detail...and these guys get all the details right! One note... Careful before dining in the Publick House restaurant. While the food was decent, the prices were outrageous. It would be cheaper to take a taxi downtown and eat in a nice restaurant!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"William Wuckert Sr.","date":"2014-07-20 02:45:23 +0300"},{"content":"We had an early flight out of Logan and so this hotel is in an ideal location as you can walk to and from 2 of the terminals and the others are only a short distance away by shuttle. It's a typical Hilton in that you could be anywhere in the world with the usual Hilton professionalism. Front desk polite and friendly. Good availablity on internet to check-in for the next day. The restaurant was fine - good plain American food served quickly with friendly service. You can't hear the planes even though you are in the airport so for a late arrival or an early departure ikt's ideal.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Otha O'Conner","date":"2012-10-09 20:12:33 +0300"},{"content":"This Hilton is a nice airport hotel with lots of meeting space. Stayed here 3 days for a conference. Easy to walk to from Logan. Has an executive lounge for Hilton elite members. Room was spacious, and I didn't lose sleep from the sound of airplanes. Staff was very gracious and helpful.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Verda Koss","date":"2012-06-16 16:48:14 +0300"},{"content":"Very confortable bed, clean, and spacious. Great shuttle bus service from hotel to the train station. Great experience!","ratings":{"Location":5.0,"Overall":4.0,"Value":3.0,"Service":4.0,"Rooms":4.0},"author":"Omari Cartwright IV","date":"2014-08-10 03:26:11 +0300"},{"content":"On Saturday, August 27th, I made an online reservation for an incoming student of mine from the DRC who was supposedly put on a Paris-Boston flight because all Paris-NYC flights that day had been canceled due to Irene. This student--whose English is poor-- had left me a text message about her flight change. I had no idea what time she was coming but I knew I had to get a room in Boston for her fast due to the weather. Well by 8 pm that night, I found out she was not coming to Boston. I panicked because I had used my personal credit card to make this reservation and I was four hours past the cutoff to cancel. I called reservations at the hotel and the man I spoke with couldn't have been nicer. He told me that there was no problem and that all fees due to my late cancellation would be waived because of Hurricane Irene. I apologized profusely but he insisted it was no problem. He then thanked me for being patient while he did all that was necessary to get me free of this charge. At the end, he even told me to stay safe in NYC. This man is absolutely lovely and if he is indicative of the quality of this hotel, then I say you won't go wrong here! Thank you, kind customer service rep!!!","ratings":{"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Gilbert Orn II","date":"2015-12-25 20:51:35 +0300"},{"content":"Stayed here twice, on arrival at Logan and before leaving again three weeks later. Both rooms the same, reasonable size, walls a bit thin but no noise at all from the airport. The decor is bland, but clean. There is a smallish bathroom with a shallow bath, shower over and lots of surface area for stuff, and a nifty low level light for night visits. Lots of power points for charging stuff, including in bedside lamps: excellent. Big comfy bed, and great views over the airport and Boston. There was a wait in line to check in at 10:30 at night, but no wait at all second time around at about 5pm. We booked an Executive Room, but the lounge got so busy on the Sunday night that we took our snacks back to the room. Ate in Connolly's Publik (sic) House - fish & chips plus beef burger were both good, but the bar isn't very nice. The Fitness Room is well equipped, with free access via lobby. The staff are very friendly, especially the bellboys & reception. Only about a 10-15 minute walk to the airport, which is very convenient for an early flight.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":3.0,"Value":5.0,"Service":4.0},"author":"Casimir Cremin","date":"2015-04-18 12:15:20 +0300"},{"content":"Great hotel for airport convenience. The rooms were modern and spacious enough. Quiet rooms, comfortable beds, nice TVs, nice bathrooms with good water pressure. The hotel has an indoor pool, jacuzzi, sauna, and a gym with cardio equipment. There is an outdoor area if you want to layout in the sun. The restaurant has a decent menu, but everything is pretty much airport prices. Breakfast buffet was OK offering standard breakfast options (breads, fruits, cereals, bacon, eggs, cheeses, etc). Overall, a nice stay!","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":3.0,"Service":5.0},"author":"Dejon Turcotte","date":"2015-09-16 16:39:11 +0300"},{"content":"There's a skywalk that connects this hotel with the terminal, which means you can sleep somewhat later than usual before catching an early plane. I stayed at this hotel on a nice day in May, but I can see how it would be terrific in bad weather for avoiding taking a cab (or rental car) into snarled highway/airport traffic. This place is expensive, though, with a base rate (before taxes) of $319 for the lowest-priced room.","ratings":{"Overall":4.0},"author":"Camylle Cruickshank","date":"2015-09-11 17:36:56 +0300"}],"public_likes":["Alvah Berge","Ms. Ruth Cruickshank","Mackenzie Fritsch","Dana Pfeffer","Helene Hauck","Dr. Davin Smitham","Albert Reilly","Pietro Glover","Owen Pagac"],"vacancy":true,"description":"Tranquil village location with rural and estuary views. Sleeps 9 + cot in four bedrooms. Good for large family holidays. Pets welcome.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}