{"title":"Paris/17th arrondissement","name":"Hotel Eldorado","address":"18, rue des Dames","directions":"Métro Place de Clichy","phone":"+33 1 45 22 35 21","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"€23-79","geo":{"lat":48.88501,"lon":2.32492,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21668,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"I agree with all the previous 5 reviews, it's worth the $35 a nite but not much more with the Golden Nugget accross the street. At check in the clerk told me there was no in room internet - and I believed her until on day 2 I searched for available wireless internet connections and there is one called citywide wireless, they seem to cover the entire city but don't pay a cut to the hotels - excellent signal strength and connection - $9.99 a day","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Terrance O'Keefe","date":"2014-03-14 14:45:38 +0300"},{"content":"We checked in late and the desk clerk was lovely, we were upgraded to a suite because there was no more non smoking rooms. The room was nice and clean but I have now stayed twice at this hotel and the air conditioner is a little weak making the room stuffy.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Ashton Larkin","date":"2013-04-27 19:33:38 +0300"},{"content":"My husband and I along with another couple stayed at the Fremont the first week of November. We had a very enjoyable time. The rooms are small but who goes to Vegas to stay in the room. The housekeeping staff do a fantastic job our room was cleaned and restocked everyday. Also our room was very quiet and comfortable. The casino and hotel staff were always very friendly and helpful. Would stay here again on future trips. Center of all the action at Fremont Street. The buffet was very good and had a great choice of menu items. Be sure to get your players card and take advantage of comps and discounts.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Hayden Jast","date":"2015-03-01 20:00:48 +0300"},{"content":"This was my 5th trip to Vegas and first time staying down on Fremont Street. I would stay at the Golden Nugget next time.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":3.0,"Rooms":3.0},"author":"Jamel Rau","date":"2015-07-28 16:59:54 +0300"},{"content":"They have really cleaned up the downtown area in recent years. We have never stayed downtown before, but were very impressed with the value. The fremont does not offer self-parking but does have a valet service that was always friendly and fast. The rooms were recently renovated with good taste, and everything was clean and well-kept. The downside to our room was that we had a view of the air conditioner unit, but we couldn't really complain since we only paid $30 CAD a night (which included friday night!). We didn't have the chance to eat at the fremont as they close their buffet for several weeks in december (dec 12ish - jan). The casino is a little bit smokier than others, but was chock full of people at all hours (mostly hawaiians). The front desk staff were very friendly. I would recommend renting a car and staying here, its a better value than strip hotels. Also, try the main street station buffett, its really fantastic (especially for the price!! $7.77 for lunch!).","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Dr. Jarrett Hartmann","date":"2013-10-04 16:19:15 +0300"},{"content":"I booked the hotel based on the recommendations from other travelers in this site. I got what I expected. The review before mine indicated the hotel had no ice bucket or ice machine but at least on the 7th floor where I stayed there was one next to the stairs. Also Im 5'11'' and had plenty of room while sitting in the toilet. The rooms seemed to be newly remodeled and clean. Like old Vegas hotel/casinos the rooms at the Fremont were designed as a place to crash between gambling binges and not a room to hang out or conduct business. The TV had CNN (plus 9 other channels) and pay per view movies and I thought it was sufficient. This is the first time I stayed Downtown and I think Im coming back. If you want to visit other casinos within walking distance and cheap prices on booze and food the Fremont is the place.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Orlando Abshire","date":"2014-12-28 01:01:08 +0300"},{"content":"The room was average, but the staff was friendly and the casino was great. We would stay here again.","ratings":{"Service":4.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Noel Padberg","date":"2015-04-07 15:07:02 +0300"},{"content":"Stayed at the \"Fremont for the second time. Not a negative thing to say. Hotel staff very accomadating. We asked for a king non smoking room. It was small but very nice. Comfortable bed and nice linens. We were asked what part of the hotel we would like. I asked for a room away from the Fremont exxperience where it would be quiet. That was not a problem. Never heard any noise. The room attendent was very good. We have no problem with the Fremont and would stay there again. Love downtown. It is very fun and cozy. The strip is fun for us to visit, but not to swtay there.","ratings":{"Overall":5.0},"author":"Scarlett Moore","date":"2013-11-09 17:45:53 +0300"}],"public_likes":["Carter Boyle","Nico Torphy","Mae Greenfelder","Nathanial Lockman","Dexter Bahringer DVM","Cordelia Champlin","Aletha Bartell","Esperanza Kessler PhD","Gaetano Mann"],"vacancy":true,"description":"A former ''maison de rendez-vous'', a home to the kept women of the 19th century bourgeois. Now a very cute ''no'' star hotel, its charm more than makes up for what it lacks in amenities (who needs a TV in Paris anyway?). The staff is super friendly, the decor is garage sale chic, and there's a lovely courtyard that fills with neighbourhood hipsters on warm evenings. It also has a very good location & you can easily avoid the noise of Pigalle or Montmartre's high prices, but they're within stumble distance if you decide to explore. For early risers breakfast (€5, until 10ː00) is served in the attached restaurant/bar. Some English spoken, especially for those who pet the cat sprawled across the reception desk.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}