{"title":"Birmingham (England)","name":"ibis Birmingham Bordesley","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47239,"lon":-1.87302,"accuracy":"ROOFTOP"},"type":"hotel","id":3613,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"I must say I was very surprised how good this hotel is. Located in the heart of Chicago's Loop, right across the street from Marshall Field's flagship store (soon to be Macy's), one block from the theater district and two blocks to Millennium Park. Service was unbelievable. The room was immaculate (but on the small size) and was decorated in a late '90's plush whimsical style. There is a Sony CD player in the room along with an honor bar (not those obnoxious electronic mini-bars in big hotels that charge you just for looking). The rooms also feature tall ceilings and huge windows with great views of the city. Also supplied with the rooms are a terrific selection of bath amenities, two plush bath robes and the thing that impressed me the most...a dimmer switch for the bathroom lights. Genius! Complimentary wine is served in the lobby in the evening and Starbucks coffee and teas are set up in the mornings. I didn’t get a chance to check out the hotel restaurant, but I have heard that the food is outstanding. This is a boutique hotel that is a wonderful alternative to the huge convention hotels that populate the Loop and Michigan Avenue areas. I would highly recommend the Hotel Burnham.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Augusta Reinger","date":"2012-02-09 02:57:13 +0300"},{"content":"What is most impressive about this hotel is its quality in virtually all areas for a restored, historic building in the heart of downtown. Note - if you want to be very handy to the Mag Mile (N. Michigan Ave) or the Convention Center, this is not the place. But it's good to see a vibrant downtown all around you, with transportation readily available. For transportation, the subway (Red line) is across the street, the El is a block or two away, and taxis and buses can handle the rest. Leave your car (parking is expensive, but this is downtown, and any major cities have comparable high prices downtown), unless you need to drive a distance - parking in the city in any desired destination is usually difficult. Yes - it's pricey, but it offers excellent furnishings and very good service. The concierge desk was helpful. The only glitch in service was maid service one day, when some things in the room were missed. It was reported, and didn't happen again. Lobby staff (front desk, doormen, bellmen) were excellent. The in-house restaurant (Atwood Cafe) receives very good reviews. Room service is from there. We ate there one lunch - it was good, but crowded (tables too close), service only fair, and not worth the money. There are very good restaurants in the Loop, even in walking distance. (Trattoria #10 around the corner, the Berghoff, the Russian Tea Time, for example) Other restaurants (we like Greek restaurants in Greektown and mideastern on the north side) are a taxi ride away. A tip - the Corner Bakery is a chain all over town - ask for directions to the nearest one(s). They have good pastries, sandwiches, at reasonable prices. A bottled juice from the Walgreens next door, a pastry, and coffee made in the room was a fine breakfast. Contrary to what was on the Kimpton website, this is not on the Mag Mile (that's a mile away), and Millenium Park is not across the street (it's 2 blocks to the east). There's some interesting shopping on State Street (not as glitzy and huge as Mag Mile). The views from the room (we had a corner, with views up State Street, and over to the lake) are fantastic. If you like being in the heart of a bustling city, this is a good choice. It's small enough to feel personalized, and always felt safe. (Admittedly, we were not out real late at night.) We were there as tourists (had lived near Chicago many years ago). The Culture Center (with a good bookstore and noon concerts) is a block away. Took an easy busride to Museum Campus (Field Museum - the best). Recommended - the boat tour on the river, guided by the Chicago Architecture Foundation.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Maymie Emmerich","date":"2015-06-17 00:10:23 +0300"},{"content":"Eschewing a budget option for the recent England football trip to Chicago a choice was made based on the tripadvisor reviews. Not cheap but centrally located on the edge of the Loop. If you want shopping fall out of bed and you are in Marshall Fields , a little walk and you are on Michigan Avenue or on the river doing a sightseeing trip. Big tip- the blue line CTA from O Hare airport stops yards from the hotel, great if you have loads of luggage but only want to spend $1.75 on transport! I read that the rooms were cramped. I wasnt in a suite yet the space was fine and the view unbelievable. When we were there we had a prime view of the Memorial Day parade down State Street from our room. The room surroundings and fittings were reminiscent of a golden area, based on Art Deco. The toiletries are Aveda and, its true, there is a turndown service with chocolates left on the bed on your return (except on the last night!!). And.......you also get free Starbucks from 6-9am in the lobby so you can take a cup back to your room. When I went down the night shift concierge was very friendly and helpful. There is also a free wine reception in the evening. The Attwood Cafe is rated but we didnt try it. Instead we tried deep dish pizzas at Guardinos chain (you will have a job to finish one!), Pot Belly sandwiches and had breakfast in Johnny Rockets, just like a 50's diner. So... its not too small, great views from the room, great location, free Starbucks and turndown service. It doesnt get much better. Only gripe generally was that there is a free trolley service to most central places but it wasn't advertised anywhere in the city that I could see. Most stop near the hotel.","ratings":{"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Kari Hauck","date":"2015-08-03 14:12:35 +0300"}],"public_likes":["Virgil Reynolds","Candice Wisozk","Albert Powlowski","Mr. Toney Krajcik","Krystal McDermott","Brielle Altenwerth","Ebba Feest DDS","Mrs. Harmony Ledner"],"vacancy":true,"description":"The slightly out-of-town ibis is more of an option for motorists, situated at a large roundabout of the A45 circling the city. It is one of the older ibis hotels in the UK.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}