{"title":"Wick (Scotland)","name":"Wick Caravan And Camping Site","address":"Riverside Drive, KW1 5SP","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.ukcampsite.co.uk/sites/details.asp?revid=6335","checkin":null,"checkout":null,"price":null,"geo":{"lat":58.44295,"lon":-3.10644,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33348,"country":"United Kingdom","city":"Wick","state":null,"reviews":[{"content":"My husband and I stayed at the resort for our awards trip and had a wonderful time. This is a beautiful facility. More importantly is the hospitality of the staff. I became sick during our trip and the convention manager went out of her way to make sure I was taken care of. She took me to her personal doctor, who then got me into a specialist. All of this was done with out me even having to ask. Thanks to her help, I was treated and started feeling immediately better.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Olin Wilderman","date":"2014-10-06 20:57:58 +0300"},{"content":"We stayed in two hotels during our trip to Puerto Rico. The El Conquistador is HUGE. It is beautiful with wonderful views, very clean and everyone is very nice. The rooms are quite large and very clean. Sleeping was a challenge for us due to the birds and frogs that get really noisy in the wee hours of the morning but there is not much they can do about it. There are multiple levels to the hotel so it can take a while to get from one place to another. There is no beach at the hotel so you take a 10 minute boat ride to Palomino Island to get to the beach. The island is pretty, but the water is very shallow and you have to go out a long way in order to really swim or snorkel. The Iguana Cafe on the island was the best meal we had on the resort. The food on the resort is VERY expensive, but if you don't need anything fancy, turn right out of the resort and you can have a great, inexpensive meal on a porch with parrots and some local people. The resort is a great place to stay, but this end of the island does not have much to do outside of the resort other than snorkeling. The best day of our trip was our day of snorkeling on the Erin Go Bragh III. It's about a 15 minute drive from the hotel and was by far the best day of our entire trip but you do need to book ahead.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Angie Zieme","date":"2012-05-24 08:11:49 +0300"}],"public_likes":["Brycen Hartmann","Dr. Delilah Wiegand","Adele Schultz","Miss Alvis Willms","Ofelia Cassin"],"vacancy":false,"description":"There is a nice camp in Wick, by the river, 5 minutes walk from the train station.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}