{"title":"San Diego/Old Town-Mission Valley","name":"Americas Best Value Padre Trail Inn","address":"4200 Taylor St","directions":null,"phone":"+1 619 297-3291","tollfree":null,"email":null,"fax":null,"url":"http://www.americasbestvalueinn.com/bestv.cfm?idp=619&rcode=gpl","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.75839,"lon":-117.19781,"accuracy":"ROOFTOP"},"type":"hotel","id":25301,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Not as nice as expected. Hard to find room/cottage - terrible directions from staff, did not help me with my bags. Roaches in bathroom - I know its the desert, but yuck!","ratings":{"Overall":2.0},"author":"Clementina Wuckert","date":"2015-04-22 20:28:02 +0300"},{"content":"the only review i would give of this total dump is to warn anyone thinking of staying there to GO ELSEWHERE....and the guy on the reception who likes to throw his rubbish and aim it at the bin on the other side of the room whilst talking to you...says it all really...oh not forgetting the down and outs who stay there..no disrespect to people who are on social security but it was bloody awful....there was a problem with my booking so i went elsewhere ....i wouldnt have stayed there anyway....i have complained to my travel agent about it....the only reason i gave it a rating was so i could post this review....","ratings":{"Overall":1.0},"author":"Reanna Lind","date":"2012-04-20 13:21:45 +0300"},{"content":"I stayed at this \"hotel\" for my first ever trip to New York, and although I loved New York I did not love this hotel. When we arrived there was a stuff up with the room we booked, apparently the heating was not working in the room we had booked. So we were given a room with a shared bathroom which is not what I had paid for. I had booked a room with a private bathroom the room with the shared bathroom was freezing and we had to wear our clothes to bed (first time I've ever worn a beanie to bed) and to go to the bathroom during the night my boyfriend said to wake him so I would not go alone. The next day we were moved to our \"booked\" room with a private bathroom. The Bathroom right off the bat was filthy, scum all around the shower and sink I had to stand on a plastic bag to shower as I did not have any thongs ($@!#% slops) with me as it was winter and snowing when we visited New York. The new room was also freezing and we had to stuff a towel around the air conditioner as we had cold air blowing in. The maid service that brought towels and changed the bed linen would come around and even though we requested privacy and told her we did not need new linen the maid would open the door whilst we were mid getting dressed! I felt unsafe staying at this hotel as the lock on the door was very flimsy, but because we had already paid to stay there my boyfriend talked me into staying and he slept on the side closest to the door. Not to mention the elevator was ancient. I would never stay here again the price for this place is ridiculous for what you get. Oh and one day when we arrived back to the room the wall was painted blue...","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Vaughn Lowe I","date":"2013-06-19 09:17:04 +0300"},{"content":"If you are looking for a swanky hotel room the Royal Park is not for you but if you want a reasonably priced room which is clean and in a very convenient location (i.e. if you want to save your spending money for other things other than a hotel room) this hotel would probably work for you...A friend of mine and I stayed here for the New York marathon..yes, I was worried about bed bugs,etc since the price was so low but, fortunately, my worries were unfounded...We stayed in the room directly off the \"lobby\".It was very large especially by new york standards with 2 ddble beds, clean, nice shower but no tub, no phone (but with cell phones who needs one), no fridge or microwave but excellent and friendly personnel who were a pleasure to have around..I was worried about noise during the night since we were right off the lobby and on the street but it was quiet and the bed was comfortable...a non pretentious, practical place to stay...save your money for shopping!!!!!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Miss Arely Powlowski","date":"2015-05-06 12:57:16 +0300"},{"content":"I stayed here for one night and that was enough. Given the price ,75 dollars, for a double room, I had low expectations. The positives were the place was clean, the room was ready, and the staff was friendly. The negatives were the room was quite shabby and depressing looking. The shared bath was even more dilapidated. No way that I would use the shower. Given that one bathroom is shared by 16 people, it was looking pretty nasty by 9AM. Again, I didn't expect much but a mirror, hangers and a chair in the room, as well as an electric outlet in the bathroom would have been nice and worth an additional $10 dollars a night.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":2.0,"Value":3.0,"Location":4.0,"Rooms":1.0},"author":"Karlee Rowe","date":"2012-09-05 09:59:43 +0300"},{"content":"I love this hotel. It's in a great location, plus, it's clean, the staff is friendly and they give you warm chocolate chip cookies. Will continue to come back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Cleora Eichmann","date":"2013-04-22 23:27:08 +0300"},{"content":"Great room and good staff. My king room on the 8th floor was large for most USA hotel rooms. Great hotel to stay at if you need to visit Sharp hospital. Not great for most turist stops.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Ludie Howell","date":"2012-01-23 00:16:06 +0300"},{"content":"Was there for Thanksgiving weekend. Good deal, friendly staff. Very nice comfortbale room. Parking was $16 which was more than most places in Mission Valley.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Miss Jon Crist","date":"2014-02-27 22:36:38 +0300"}],"public_likes":["Melody Skiles V","Ariane Reynolds"],"vacancy":false,"description":"100-room hotel.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}