{"title":"San Francisco/Civic Center-Tenderloin","name":"The Phoenix Hotel","address":"601 Eddy St","directions":"at Larkin St","phone":"+1 415 776-1380","tollfree":null,"email":"phoenixhotel@jdvhotels.com","fax":"+1 415 885-3109","url":"http://www.jdvhospitality.com/hotels/hotel/12","checkin":"3PM","checkout":"noon","price":"$119-$169","geo":{"lat":37.783,"lon":-122.4181,"accuracy":"ROOFTOP"},"type":"hotel","id":25599,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I have used Trip Advisor as a guide to the motels I stay at and it has not let me down yet! My husband and I stayed at The Chancellor June 2007 for one night and I wish we could have stayed longer! We purchased our room with a parking pass and a twenty five dollar bar or food coupon. It was well worth the extra money! We were able to use our coupon at the bar and during happy hour too! The Bartender (wish I got her name) was very knowledgeable with directions for us and friendly too. The room was clean, bright and comfortable. The candy dish and the rubber duck were a nice touch. The Chancellor is downtown right where all the shopping and good eating is. My husband and I will return to San Francisco and will stay here again, only longer. One day IS NOT ENOUGH of San Francisco!","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Zora Kautzer","date":"2012-05-27 03:31:17 +0300"},{"content":"This was a great choice for our San Francisco vacation. The location can't be beat if you want to be near a lot of attractions. Coming from the airport, BART drops you off a quick few blocks walk away at Powell/Market (slightly uphill, so I wouldn't want to walk it with lots of luggage); Union Square is across the street with great shopping and some good restaurants nearby; the cable cars run by the front door (although it is not easy to get ON the cars at this location) and Chinatown and Market Street are an easy walk as well. We like to walk the city so we actually walked from the hotel to Fisherman's Wharf on two occasions, and also to and from the Embarcadero, North Beach and locations in SOMA without much difficulty as long as you choose your hills carefully. The room was clean and quiet. We were on the back side of the hotel on an upper floor so we got very little street noise. Considering there is no AC and the windows are were consequently open, we were pleasantly surprised. The rooms are a bit small by US standards but quite comparable to better European accomodations. There are about 9 rooms per floor and they all seemed to be very well maintained. The staff was very friendly and helpful, and the cookies at the front desk are a nice touch. Complimentary coffee and tea is also available near the two elevators. All in all, an excellent value and location. I would absolutely stay here on my next visit.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Julien Cremin","date":"2014-09-27 01:02:26 +0300"},{"content":"Our stay at the Chancellor Hotel was May 5 - 9, 2007. We were in room 1003 which faces east on to Powell Street with a view of Union Square to the right if you are close to the large window. The room was clean and fresh, linens crisp and bathroom spotless upon our arrival. The bed was extremely comfortable. Although this hotel gives a extensive menu of pillow options for its guests to select, the \"standard\" pillows worked great for us.There's plenty of room for 2 guests in this room. In addition to the bed, there were 2 nightstands, a desk area, chair & table, dresser and TV. The walk in closet was spacious and has a safe for storage of valuables. The water pressure in the shower was awesome. 1003 is a corner room and we did not hear any hotel noise or other guests during our stay. We do like the fresh air and the sounds of the city, so we opted to keep our window (and bathroom window) open during our time there. Seemed to us that unwanted noise would not have been a problem no matter what room we had been in. The few questions we did have about getting to our various destinations within the city were answered by the staff in a prompt, accurate and courteous manner. The staff has a very positive and helpful attitude. For us, the convenient location,comfortable & clean rooms, value and attentiveness of the staff make this the ONLY place to stay in San Francisco. Looking forward to returning again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Betty Feil","date":"2013-11-10 00:10:42 +0300"},{"content":"I just returned from my first trip to San Francisco this past week. I just want to say that my stay at the Chancellor was the best. I booked my room thru Expedia and got a fantastic rate. As a single woman traveling alone it is very important to me to be located in a central area and also feel safe and secure. After doing research on the internet I felt like the Chancellor was the hotel for me. The location is the best - right on the cable car line and right in the middle of great shopping and restaurants. Yes, the rooms are on the small size but I didn't come to San Francisco to stay iin my room. I was usually out and on the go by 8:00 each morning and did't get back to late in the evening. I did not have any trouble with the walls being too thin. The beds were very comfortable and the large bathtub was great. I did not eat in the hotel restaurant but did enjoy the cookies and coffee in the lobby. Everytime I had a question about the city I found the front desk to be very courteous and helpful. I had a wonderful time in SF and if I go there again, I will stay at the Chancellor without a doubt.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Katelyn Waters","date":"2013-06-10 11:18:15 +0300"},{"content":"We think the Chancellor Hotel is great value for money in an unbeatable location. The rooms were clean and although other reviews complain that the rooms are too small - we had four large suitcases and found the size of the room perfectly acceptable. The lady who gave tourist in formation in the lobby of the Chancellor spoke poor English and wasn't very friendly or informative although the reception staff were friendly and helpful. I would have no hesitation in recommending this hotel and would definitely stay there again next time we visit San Francisco.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Olaf Feil MD","date":"2015-01-28 13:09:39 +0300"},{"content":"We stayed at this hotel for three nights in March 2007 after reading reviews by others on Trip Advisor. The hotel was really good value and in a superb location just minutes away from Union Square. The staff were friendly and helpful and the room was small but decor was good, bed very comfortable and bathroom fine. A 'walk-in' cupboard was useful for stashing cases and had a safe, ironing board and iron and a portable heater for chilly nights. Just a few yards away was Lori's Diner which was fun and inexpensive and the Sears restaurant with the 'world famous l8 pancake breakfast'! Great shopping in the area and the new mall Westfield had an elegant Nordstrum store with a curving escalator right up to the lounge beneath the dome on the 4th floor with comfy seats for a rest between shopping. For those with less to spend try Ross a few stores along for real bargains - also Kaplans govt. surplus store which sells genuine Levi 501's for $27. Don't miss a short walk to Maiden Lane to see a fabulous Frank Lloyd Wright building, and a walk around Chinatown - choose the 'gift supermarket' to buy your souvenirs at rock bottom prices with nobody hassling you. Keep a few dollars available for the homeless beggars who sell the newsheet on the streets in this area.","ratings":{"Overall":5.0},"author":"Jovanny Kautzer","date":"2014-11-12 07:19:10 +0300"}],"public_likes":["Ms. Joshua Zulauf","Ms. Kendra VonRueden","Casimir Kuvalis DVM","Mrs. Betsy Rohan","Elroy Brekke"],"vacancy":false,"description":"A boutique hotel, favored by musicians of all stripes, with free parking and breakfast.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}