{"title":"Liverpool","name":"Radisson Blu","address":"107 Old Hall St","directions":null,"phone":"+44 151 966-1500","tollfree":null,"email":null,"fax":null,"url":"http://www.radissonblu.co.uk/hotel-liverpool","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.41069,"lon":-2.99649,"accuracy":"ROOFTOP"},"type":"hotel","id":15917,"country":"United Kingdom","city":"Liverpool","state":null,"reviews":[{"content":"My husband and I visited in mid-June for our honeymoon. I chose the Intercontinental over several hotels in the same area, and we are so glad we did! We were upgraded to an ocean view room upon arrival. The ocean view is SPECTACULAR! You can see the neat, tropical pool area too. We were offered early check-in, pretty much as soon as we arrived from the airport. The room was the perfect size for a couple, chicly decorated, and although they did miss a day or two of cleaning it, housekeeping responded promptly to all of our requests. Pluses: Beautiful hotel, very clean, wonderful service from bell boys to housekeeping to concierge, several on-site restaurants and bars, great TVs in rooms, near a couple cute places like Lupis down the street, and fun/large pool area Minuses: Sub-par food at all the restaurants including room service food, WAY OVERPRICED food and drink (just don't plan to eat and drink within the hotel unless you like $15 made-from-frozen hamburgers and $10 vodka-cranberries), not the most glamorous or convenient location (cost us $22 minimum to take a cab anywhere we wanted to go - there just isn't much to do in this part of San Juan) Overall we had a romantic, lovely time, felt like we got a relatively good deal (paid $2300 total for the two of us for 4 nights/5 days - included airfare, hotel, food/drink while there, cab rides, and a kayaking trip), and would return!","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Location":3.0},"author":"Clara Schumm","date":"2014-10-15 07:01:29 +0300"},{"content":"I enjoyed my stay at the hotel. The pool very nice and the beach was ok. The tide was a little ruff. The cafe was small but the food was excellent. Fair prices considering your at a resort. The waitresses and waiters was all friendly and courteous. The Pina Colada's were excellent.......Waleska made the best. The hotel was a little to quite for me and the casino was small and had out dated slot machines. We stayed in a suite which was nice and clean, but small compared to many suites I have seen. There was no tub, which in my opinion is not a suite. All the suites only had a city view with a very small balcony not big enogh for a small table or chair. And with having a city view suite there is not much privacy because you are on the front entrance side of the hotel and there is alot of traffic in and out of the hotel. There are plenty of places outside the resort to get food at a great price. Not sure of the exact name but I believe it's called Misa Casa ( great food /great price) which is in th shopping center across the street from resort. There is also a nice small sushi bar about a block up the street that served excellent sushi and the miso soup was to die for. I visited a few other hotels in the immediate area and found the El San Juan was the place to be to hang out on the weekends. All in all it was a good stay, I will return to Puerto Rico but probably will choose another hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":3.0,"Value":4.0,"Rooms":2.0,"Location":3.0},"author":"Bobbie Wehner","date":"2014-10-16 20:12:06 +0300"},{"content":"My wife and I stayed at the InterContinental from 4/1/08 to 4/6/08 and had the best time. We got a room on the 5th floor facing the pool and it was great. We were not too concerned about the room location since we were not planning on staying in the room all day. We arrived at the hotel around 1:30pm and were checked in right away even though check-in is usually at 4pm. The bell boy brought up the bags promptly and we were off to the beach and pool almost immediately. The pool and beach is excellent at this hotel. You have to get a wrist band in order to get towels & pillows and it also identifies you as a guest of the hotel when on the beach. The pool area has tents with chairs that can be reserved a day earlier or taken on a first come first serve basis. All the hotel staff was very courteous and helpful throughout our stay and we had no complaints at all. The concierge at the hotel was very helpful in providing us with directions and recommendations during our stay there. The restaurants on site were expensive and so was room service. Prior to visiting Puerto Rico my wife and I decided to only consume local cuisine so we didn’t ever eat at the hotel. The hotel itself has a Steak House, an Italian Restaurant & a Japanese Restaurant. The pool side bar and the beach front cafe were also pretty expensive. Please note that the beach front cafe is cheaper than the pool side bar even though they are only a few feet away from each other. I basically went to the small supermarket directly in front of the hotel and grabbed some Medalla Light (local) beer and brought it to the room and put it in the fridge. I then took it down to the pool and beach in a plastic cup. The same beer 10oz costs $4 at the hotel while the super market sells it for $1.25. The security at the hotel was very good and the pool and beach guard (Mike) is very friendly. We rented a car for our stay from Alamo and I chose to use the self parking option. Since parking is scarce in the area, all hotels charge for parking. At the InterContinental they charge $16 for self parking and $22 for valet. The self parking lot is across the street from the hotel but it’s not a problem at all to use. Some people have mentioned concern about crossing the street. We live in the NJ/NY area and crossing the streets in our areas is pretty similar so it wasn’t a big deal for us. If you want to have some local fare walk over to Mi Casita directly in front of the hotel. It’s a small place with a small menu but the food is excellent. Another restaurant in walking distance is Metropol. They have Puerto Rican and Cuban food and is excellent as well. We went to Metropol twice during our stay. We went to Old San Juan a few times (for meals and sightseeing). It was convenient to have a car. I used my blackberry and Google maps (gps) to help me with the directions. All road signs are in Spanish so a GPS will really help. Some restaurants that we tried in Old San Juan are, Tantra (Indo-Latino fusion), Dragonfly (Latino-Asian Fusion) and Cafeteria Mallorca (located on Calle San Francisco in Old San Juan) typical local restaurant - they have some really good rice dishes and a chicken soup that local crave for. Another must visit restaurant is Ajili Mojili (1006, Ashford Avenue San Juan, PR 00907 Puerto Rico). It’s located in Condado (between Isle Verde and Old San Juan). They have the best Mofongo and Asapao (local delicacies). Day trips we did: El Yunque Rain Forest - I even took a dip under the water fall after the 30 min hike. ATV tours at Hacienda Carabali - Ask the concierge for the directions to this place. We did the 2 hour ATV tour and it was awesome. They even stopped at a river and we were able to jump in. They are located between the El Yunque Rain Forest and Luquillo Beach. Luquillo Beach - One of the best beaches in PR. It’s located a miles past the road to the El Yunque Rain Forest towards Fajardo. Try out some local food at the Luquillo Beach food kiosks. If you are going to the above mentioned 3 places I recommend that you take the 187 road. This is the most scenic way towards Fajardo. You will also pass some unique local kiosks with food and drinks (try some coco - coconut water). Old San Juan - Takes about a full day to view the whole town and all the fortresses, etc. We will definitely go back to PR and stay at the InterContinental San Juan Resort, Spa & Casino. Have fun!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Emilie Nicolas","date":"2015-03-28 16:40:09 +0300"},{"content":"My stay and interaction with the Intercontinental was one of business. I had the task of researching for a place to hold my company's convention. I found the Intercontinental. I was flown down there, all expenses paid, for 3 nights to take a look at the property. I then also stayed there for another 3 nights during our convention. I was there on business for the first trip so I was treated like royalty. Meals prepared from the Head Chef, one of their nicer rooms, a private dinner on the beach along the boardwalk, complimentary trips off the property, meeting with management etc... Everyone there was beyond nice and professional. Now I know this is not the treatment most people will get, but it is certainly a reflection on how they treat their customers and the pride that they take in their property. Top notch employees all around. My room on this trip was in the \"club\" house. It overlooked the pool area (which was still a good view cause the pool is awesome). The room was great. The marbled bathroom, the large fluffy bed, the sitting area, the deck. This area also has a private dining space for the club members. Breakfast is served here as well as appetizers from 5pm-7pm. My second stay was more normal with no special treatment. My room was a regular room in the hotel. I did get beach views, which was gorgeous. The room itself is your standard hotel room. It is very clean however. The property is amazing. It sits right on the beach. The beach is public, but they do have people that make sure not just anybody wanders onto the property. The pool area is great too. Palm trees, and a swim up bar, another regular bar, a huge hot tub. There is a \"rock wall\" type thing in the pool with a waterfall coming down. It definately sets that tropical feel and makes your stay all the more relaxing. The staff for the pool area are also awesome and extremely nice. The steps out of the hotel leading to the pool are a grand staircase that makes you feel like you are Scarlet O'Hara at the beach making your grand entrance. I am not much for gambling and didn't spend tons of time in the casino. I can't really compare it to any other casino cause I have never really been! But it had slot machines, black jack, poker tables etc... and all the bright, flashing lights you would expect. The whole hotel is very nice. Marble everywhere. It just has presence. There are several hotels on the property including a Ruth Chris, an Italian restaurant that just opened when I was there. It was a top notch high end restaurant. We met the Chef as her personally came out to our table. A great meal. One of the best I have ever had. The also have a Japanese restaurant on the premise. All of them are pretty expensive, but the food reflects that price. If your company is planning a convention or retreat I would highly recommend this location. I would also recommend it for your next PR vacation.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Mireille Pollich","date":"2012-11-13 21:38:39 +0300"},{"content":"overall a great hotel. the location was great, physical property is in good shape and the staff was great. the beach was nice and pool area equally good. its a solid 4 star hotel that we would not only reccommend, but stay at again for sure.","ratings":{"Overall":4.0},"author":"Carlos Price PhD","date":"2012-01-02 17:49:06 +0300"},{"content":"My stay at the Intercontinental Hotel San Juan was for 2 nights on September 14, 2007, for a pre-cruise stay. I arrrived into San Juan in the late afternoon, took the fixed rate taxi to the hotel, and was greeted warmly by the bell staff as they did each and every time I entered or departed the hotel. I was effeciently and pleasantly checked into my room #1123 by the front desk clerk. This very nice service is what I had remembered from a previous stay at another San Juan hotel, but, unfortunately this is where the friendly service ended at the Intercontinental San Juan. My room, although small, was cheerfully decorated and the bed was fluffy and comfortable with the bottom sheet completely covering the matress. The small balcony overlooked the street area and airport landing traffic (no problem with noise). I immediately noticed that the room contained nice bathroom amenities and plenty of towels, but, none of the usual Room Service Menu/Service Directory/Writing Paper portfolio. The room also had an ironing board but no iron. In calling for these items, I was told that the iron would be sent up but I would have to call the Business Center for the portfolio. Okay fine. Business Center says call Housekeeping, each time being asked, \"Anything else I can do for you?\" To me, this is the most frustrating situation with Customer Service. If you haven't been able to fullfill my request, don't ask if you can do anything else. I decided it was not that important to get the portfolio. As it turned out the iron was broken, but, was replaced quickly the next day. After a very long trip, I went to bed early but was awakened by loud voices in the hallway, mistaken phone calls and knocking at the door. After falling asleep again, I was awakened again by the 3 false fire alarms mentioned by a previous review. The next night did go much better with no alarms! My room was made up the second day very promptly after leaving for lunch and the Housekeeping department was quiet and unobtrusive. As mentioned in previous reviews,the beach at the Intercontinental is very nice and the hotel has great service for guests who wish to be served while in the sun. The pool is also very nice and security is tight, making it difficult for anyone who is not a regestered guess to be admitted. The gym is well-equipped, adequately air conditioned,and has a nice view of the beach, and is open 24-hours. The ice machine on my floor worked well and always had plenty of ice. As I stay in hotels about 12 nights a month, I have to say that the young lady at check out gets the award for the worst in the world. She was curt, rude, and did not even offer to show me a list of my charges prior to charging my card. She had no change in cash to accommodate my request for small bills acting as if this was a strange request for a hotel cashier. No thank you's or offers of assistance with bags from her. All of this after waiting 5 minutes for other clerk on duty to finish her personal conversation with a co-worker. All in all, this hotel is quite a blast from the past. I fully expected to see Lucy, Ethel, Fred and Ricky pass through the lobby while on their \"Puerto Rican Adventure.\" Truely a place where my Mom and Dad would have spent their honeymoon. Not a bad thing if staff could be brought up-to-date on current standards of service in the hotel industry.","ratings":{"Service":2.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":1.0,"Overall":2.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Abigail Keeling","date":"2013-10-04 08:29:27 +0300"}],"public_likes":["Soledad Pfannerstill","Mrs. Isabel Jerde"],"vacancy":true,"description":"On the old St. Paul's Eye Hospital site in the business district of the city. A small part of the original building has been retained and incorporated into the hotel.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}