{"title":"Castle Douglas","name":"Lochside Caravan and Camping Site","address":"Lochside Park, DG7 1EZ","directions":"At the north end of Carlingshaw Loch.","phone":"+44 1556 503806","tollfree":null,"email":null,"fax":null,"url":"http://www.dumgal.gov.uk/index.aspx?articleid=3753","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.93651,"lon":-3.93027,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5193,"country":"United Kingdom","city":"Castle Douglas","state":null,"reviews":[{"content":"We had 3 nights at Hotel Rex at the start of a 3 week touring holiday. Great location- took BART from airport to Powell and walked the 5 blocks up hill to Sutter. Pleasant friendly greeting at Reception. Our room on 7th floor was warm and welcoming. Very comfortable bed and large bathroom. The combination lock on my suitcase wouldn't open - a very helpful guy (a janitor) took my husband and the case down to the basement and prised it open!! We ate breakfast in the hotel dining room on 2 mornings. Altogether I would recommend the hotel for business or leisure with its friendly staff and great location (2-3 blocks to Union Square and downtown.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Bo Kuhic","date":"2014-12-11 06:31:59 +0300"},{"content":"We stayed at the Rex for four nights and found it a great base to see San Francisco. It's close to Union Square and the cable cars, and a fairly easy walk up to Chinatown and North Beach. The staff were very helpful, giving us us good dinner suggestions and directions to various sights. The free class of wine in the evening is also a bonus, as is the free WiFi in all the rooms. It's very good value, we paid for three nights and got the fourth free. The only minor complaint I would have is that the room was very hot, and the air con was very loud to leave on during the night.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Douglas Eichmann","date":"2014-02-18 16:58:40 +0300"},{"content":"We stayed here during our honeymoon and found this a fantastic hotel- clean, comfortable and excellent value for money. We arrived very stressed after arriving by car and dealing with an awful man at the car hire place- the hotel staff made us at ease immediately, giving us a room upgrade and glasses of champagne when they found out it was our honeymoon. We had a lovely room with an enormous bed. We loved the bar area and the wine hour and happy hour. Service at the bar was excellent- a great place to end our honeymmon- thank you!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Matteo Cronin","date":"2015-12-24 10:56:40 +0300"},{"content":"The hotel is decorated in warm, rich colors and instantly makes you feel at home. The rooms are large by European standards and small by American Standards. I had a Queen room, which was perfect for one person - it might be too tight for two people, though. The room comes equipped with a mini-fridge, which is handy for snacks & beverages, excellent toiletries and (my favorite) a bathrobe. The location on Sutter, between Powell & Mason, is ideal for cable cars, BART, and buses that will take you anywhere you want to go in the city. It is also two blocks from Union Square. I enjoyed breakfast & dinner at the adjacent restaurant, Café Andrée, and the meals were good and comparably priced to other restaurants in the area. I was fortunate to run into Max, the Pug - the hotel mascot. He is adorable & sweet!! I highly recommend this hotel for any traveler who wants a warm and cozy hotel located in the middle of Union Square.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Sanford Goodwin","date":"2015-06-16 15:55:35 +0300"}],"public_likes":["Lurline Green","Maximus Rogahn"],"vacancy":true,"description":"108 caravan stances, 73 of which are on hard standing with a separate camping site for 53 tents.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}