{"title":"Llangefni","name":"Tre-Ysgawen Hall, Country House Hotel and Spa","address":"Capel Coch,","directions":null,"phone":"+44 1248 750750","tollfree":null,"email":null,"fax":null,"url":"http://www.treysgawen-hall.co.uk/","checkin":null,"checkout":null,"price":"£120-190","geo":{"lat":53.303698,"lon":-4.32705,"accuracy":"APPROXIMATE"},"type":"hotel","id":40000,"country":"United Kingdom","city":"Isle of Anglesey","state":null,"reviews":[{"content":"The rooms were very beautiful and very clean. The bed was so comfortable, i slept amazing! The breakfast up on the gorgeous roof was a great way to start the day. The staff was so friendly, polite, and helpful. I have never recieved that great of service at a hotel. Staff helped me with anything from directions to handing me an umbrrella when it was raining. It was a great place to stay! :)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Mr. Kurtis Lang","date":"2012-04-10 09:42:20 +0300"},{"content":"Stayed for a long weekend with my 2 sons we found the room very clean ,tidy and very quiet but is some way from the train stations and the west end ,there is a bus service 113 from the hotel into the west end 'The hotel is on a very busy highway,as is not near any shops or pubs ,so if you like a drink you will have a good walk,but for the price you pay its good value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Jazlyn Berge Sr.","date":"2013-10-30 19:36:02 +0300"},{"content":"They are putting money into this hotel. The rooms were 89Â£ (pounds). They had redone the lobby, they were doing the brick driveway, and the room I stayed in 217 looked brand new. The breakfast was included and was standard english breakfast. It was quiet. Parking is a bit tight, but at no additional charge. It is outside the city, but half the city cost or less. I would recommend it.","ratings":{"Cleanliness":5.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Raphael Cormier","date":"2014-02-08 16:14:44 +0300"},{"content":"The extremely loud music from a celebration carried on till 3.30am. We were informed by other very bleary-eyed breakfast guests that they had also suffered the noise the previous night! Complaining at Reception we were informed music should have stopped at Midnight. Reading previous reviews on this Hotel it is obvious they do not read thier customers reviews and they do not care. No wonder they want the fees paid in advance...","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":3.0},"author":"Jimmie Thiel","date":"2013-11-17 22:24:50 +0300"},{"content":"Couldn't have asked for better service. We didn't have a car and were offered free shuttle to any restaurant we chose!! Delightful, clean nice outdoor pool! Like!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Mae Rosenbaum","date":"2013-11-25 20:52:40 +0300"},{"content":"Have stayed at this hotel five times and it has been a pleasure every time. Decent breakfast and they have a free dinner Mon-Thurs (menu posted in the frig). Rooms are large and have the full kitchen setup. If you have to make a left turn when leaving the hotel (NW 74th to NW 36th st) I suggest taking the street behind the hotel (Herman St also know as NW 25th Terrace) to Milam Dairy Rd then left to NW 36th St. This will save you time during peak traffic hrs. Intenet was free for me but was bogged down by heavy usage.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Ms. Isadore Fritsch","date":"2014-12-01 01:59:49 +0300"}],"public_likes":["Ansley Skiles","Alessandra Yost PhD","Allene Ernser"],"vacancy":true,"description":"29 rooms","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}