{"title":"San Francisco/Chinatown-North Beach","name":"Hotel Boheme","address":"444 Columbus Ave","directions":"between Vallejo St and Green St","phone":"+1 415 433-9111","tollfree":null,"email":"info@hotelboheme.com","fax":"+1 415 362-6292","url":"http://www.hotelboheme.com","checkin":"2PM","checkout":"12PM","price":"$174-$194","geo":{"lat":37.79918,"lon":-122.40826,"accuracy":"ROOFTOP"},"type":"hotel","id":25507,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Location, location, location!! The Chancellor Hotel is located conveniently in midst of Union Square with easy access to shopping, dining and transportation. Hopping on a cable car nearly in front of the hotel was not only a fun event for the kids, but the perfect way to reach Fisherman's Wharf, Pier 33 to Alcatraz, Ghirardelli, China Town and so much more. The staff was always friendly and extraordinarily helpful (particularly the bellman!), and yes the cookies were in the lobby and they were warm. No, there is no air conditioning, but a nice ceiling fan made up for that along with windows that open wide to the street below, plus August is usually cool with foggy days and evening. While I enjoyed the sounds of the city late into the evening, my husband was frustrated with the noise and had trouble sleeping. I've read that a request for a high floor on the back of the hotel may eliminate this problem. The room was appealing with a comfortable bed, and the candy dish made the kids smile. The hotel is lined with old fashioned fire escapes and I was heard to quickly proclaim \"NO!\" as my 12 year old daughter asked \"Is that our balcony and can I go out there??\" Luques was marginal... pricey for Dennys-like fare, I would not return. My recommendation is to try Honey Honey Crepery just down the street and around the corner. Charming hotel at a wonderful price in a very desirable location. My hotel of choice for trips to SF! To read more visit: http://livlifetoo.blogspot.com/2011/08/san-francisco-tourist-union-square.html","ratings":{"Cleanliness":5.0,"Sleep Quality":3.0,"Overall":4.0,"Value":5.0,"Service":5.0},"author":"Wendell Feil IV","date":"2015-03-15 08:08:22 +0300"},{"content":"We spent two nights in San Francisco as part of our honeymoon. The Chancellor was a solid contender. The rooms were clean and quiet, the staff friendly and the location wonderful. We walked to Fishermans wharf to the Financial District and back (there are trams for those not inclined to tackle San Frans hills : ) ) Happy hour was good value, drinks were well made and the complementary popcorn a bonus. As it was our honeymoon there was champagne and chocolates on our arrival which was a lovely gesture. Would definitely stay here again.","ratings":{"Cleanliness":4.0,"Sleep Quality":3.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Sterling Pollich","date":"2014-10-21 00:45:24 +0300"},{"content":"We just returned from our honeymoon, 4 nights of which was spent in SF at the Chancellor Hotel. Our impressions are very like a recent, previous review - upon checking in, we were informed that we were upgraded tot he best suite in the hotel - room 1502, on the top floor, with amazing views over union square. We had a sitting room, 2 full bathrooms, 2 TVs (not that we used them!), fridge and coffee making facilities, a pillow menu, and an awesome fire escape that we could sit out on in the evenings and just listen to the music drifting up from union square, admiring the views. We were given a free bottle of champagne and a picture frame as a special honeymoon present, which was a lovely touch. All staff we met were extremely friendly and helpful (special mention to Matt - you were great, always anticipating needs and so helpful - thanks :) But really, everyone was great. We had breakfast a few times in the dining room, and enjoyed that each time, and also enjoyed the bar for a drink before heading out each evening. The location is perfect, right on union square, right beside a cable car stop, and just down the street from a major transport hub, with MUNI bus, BAST and street cars very plentiful. All in all, this part of our honeymoon was our favorite, due to the fact that SF is such an amazing city, but especially because of how great the Chancellor is. Thank you for making our honeymoon so memorable; we will definitely be back!!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Judge Bechtelar","date":"2012-04-02 06:02:06 +0300"}],"public_likes":["Mertie Bergstrom","Gilda Bogisich","Skylar Kilback","Russ Anderson","Garrison Hessel","Etha Buckridge","Matilde Kuphal","Keara Muller"],"vacancy":false,"description":"Hotel Boheme is located in a popular Italian neighborhood with decorations that pay tribute to San Francisco's Beat Generation.  The building may be hard to find, with only a single innocuous doorway covered by a small awning.  You have to buzz at the door to enter but you get a key for this door on check in. Past the door is a steep and narrow staircase leading up to the next floor. On the second floor to the right of the landing is the hotel office. A bottle of Sherry surrounded by cordial glasses is set out for guests on the landing sideboard each night. Hotel staff are always friendly, helpful and knowledgeable about everything San Francisco.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}