{"title":"Carrizo Plain National Monument","name":"KCL Campground","address":null,"directions":"located on the Soda Lake Rd. about halfway between highways 58 and 33","phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":35.09058,"lon":-119.73489,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5119,"country":"United States","city":"Santa Margarita","state":"California","reviews":[{"content":"Aussies love Becks We had many recommendations from friends who had stayed at Becks. Don't expect 5 star luxury, they said, but do expect an INTERESTING experience right at the edge of the wonderful Castro village. Most of our 1950-1960 motor lodges in our cities have gone on to become something else. It's only out on the open road that a few still survive in their original form - love it or hate it! To have a Becks located where it is makes a holiday a little bit more INTERESTING - just as our friends said.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Nicola Wiza","date":"2012-05-28 00:52:42 +0300"},{"content":"Good location--near to the major attractions Friendly staff Free Internet, TV, parking Beds were not bad, bath room was clean Too noisy all day and night...","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Alene Jewess","date":"2014-02-13 09:34:58 +0300"},{"content":"I stayed here with my family. It is very affordable and you get what you pay for. From our window, we could see the Golden Gate Bridge, (although through dense fog, as is endemic of San Francisco) although it was very far away, but it was nice to see it. The hotel is in a nice location, within a short walking distance of Fisherman's Wharf and Alkatraz. There are some very cheep places to get breakfast nearby, and a nice little cafe next door that do gorgeous pancakes. :)","ratings":{"Location":4.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":3.0},"author":"Elody Wyman","date":"2012-03-02 09:17:51 +0300"},{"content":"Stayed here a few weeks ago for a couple nights. Asked for no maid service as did not want to be disturbed. The next day after we checked in got a call from housekeeping, stating they MUST get into our room as we had been there too long. Tried to explain they were mistaken. When we told front desk about the mix up they said that was their policy to make sure we didn't want maid service. When a complaint was made they did not want to hear it. Apparently the housekeepers are more important than the guests. Later asked for a listing of TV channels as there was no info in the room. Front desk gave us a sheet of paper with channels and numbers and they told us it was not accurate. So each guest needs to go through all channels to see what was on what number channel. Meanwhile there are a number of people 'working' behind the front desk, some just sitting there or talking and laughing with each other. You would think one of them could take time to make a TV channel listing that is accurate, so each guest does not have to do this themselves. In all, the service was very lazy and the staff is not helpful to guests. Also the day we checked in our room was not ready on time so we went to restaurant for bite to eat. Came back an hour and a half later and room was still not ready for us. When we checked out the front desk person did not ask how our stay was did not seem to care.","ratings":{"Cleanliness":2.0,"Sleep Quality":2.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Liana Treutel","date":"2012-01-19 11:18:02 +0300"},{"content":"In North America's most beautiful city, good rooms in great locations will be quite pricey for the budget traveler. But the Cow Hollow San Francisco was a wonderful exception. Our large, clean room with all the standard amenities was $98, including easy (and free) parking, and very helpful and knowledgeable staff. Cow Hollow is in a great area - short walk to marina, then along waterfront to the cable car turnaround, Fisherman's Wharf, Pier 39, Coit tower, Chinatown, crooked Lombard Street; and the other direction to the base of the bridge at Fort Point; all with the best views of this great city . Within 2 blocks were dozens of restaurants of every stripe, bakeries, bars, bagel shops, diners, bus stops,and many shopping options. We can't wait to return. Ralph Danielsen","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaylen Jerde","date":"2013-09-15 18:51:21 +0300"},{"content":"Allowed us to check in 3 hours early, and staff was helpful and friendly throughout stay. Free Parking!!! Very large room with the basics. Everything was super clean, though there was an odd smell in the hallway just outside of our room. If you plan to wander around, grab one of the little maps from the front desk. We lived by it! If you like to walk, as we do, Fisherman's Wharf and the launch for Alcatraz are within reasonable distance. Bus service is only a block away. Plenty of restaurants and shops within a couple of blocks. Mel's Diner across the street was perfect for a quick breakfast or lunch, and late-night Hot Chocolate with Whipped Cream was fabulous!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Terrance Beer","date":"2012-06-19 20:57:08 +0300"},{"content":"I always stay at this hotel when I go to SF - I have for years. It has parking underneath which is great - you can go in and out anytime and your car is secure, too. No extra parking charges. The rooms are defintely no frills - a bit dated, but clean and spacious. ask for an interior room if traffic noise bothers you. Some of the back rooms have nice views of the Golden Gate Bridge. But the best thing about this hotel is the location - just steps from 25+ restaurants on Steiner St., Chestnut St. and Union St. Also, great shopping - Williams Sonoma, Pottery Barn, The Gap, all within a block of this hotel. Many cute little gifts shops too. And the staff is very helpful and courteous.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Coralie Bogan DDS","date":"2014-10-10 14:58:06 +0300"}],"public_likes":["Austin Huel","Elna Mraz","Justus Wolf"],"vacancy":true,"description":"The campground has a gravel road, pit toilets, corrals and water for livestock. There are some well established shade trees and the facilities have just been renovated to include new fire rings with BBQ grates, lantern poles, and gravel roads and tent platforms.  Tenters, and small to medium sized campers will find the KCL a good fit.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}