{"title":"Betws y Coed","name":"Ty Uchaf","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.landmarktrust.org.uk/our-landmarks/properties/ty-uchaf-12807","checkin":null,"checkout":null,"price":"4 nights from £121","geo":{"lat":53.0865,"lon":-3.8404,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3378,"country":"United Kingdom","city":"Conwy","state":null,"reviews":[{"content":"Just returned from a short jaunt to Boston. We had two rooms located on the 10th floor. The set up of the hotel is odd, but nice. The valet parking ($43) is ridiculous and much more than other hotels located only blocks away. Rooms were nice but very tired looking, exception given to the beds which were extremely comfortable. The furniture and the bathroom are showing their age. Most noticeable was the carpet. This is not, of course,. something to ruin a stay, but noticeable in what's known as a 4 star hotel. Views were great as was the location of the hotel; walking distance to most spots or a quick jaunt on the T. Pool was okay. Small, but fine for a city hotel. Definitely about half the size of the photos. Service was okay. I jokingly asked the woman in \"gift shop\" what the markup on the gatorade was (@ $4/bottle) and she was extemely vicious in her reply. I truly was just kidding but she apparently didn't think it was funny. We were given connecting king rooms which obviously doesn't work with 2 adults and four children. This took quite some time to get resolved and the front desk person was not too helpful. The concierge was always helpful and gave us pretty good recommendations. The biggest plus is the location. Comparing the hotel to other Hyatt properties, the Boston prpoerty doesn't come close. They really do need to refresh the rooms.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Lyda Langworth","date":"2014-04-11 15:21:32 +0300"},{"content":"We flew to Boston for the weekend just for relaxation and to see the historical sights. We arrived at the Hyatt by taxi from the airport. The Doorman was extremely friendly and wanted to help us right away. The front desk checked us in very quickly and we went up to the 19th floor to our room. Our room was comfortable and cozy. We had a wonderful view of the city of Boston. The king bed was outstanding and probably the most comfortable bed that I have ever slept in. The decor of the room looked new and modern. There was a small chair in the room that I used a lot to read my Boston maps in. It was very comfortable for the size of that chair. We used the concierge several times while we were in Boston to find restaurants and trolley stops and tours. The concierge told us about a restaurant called \"Kennedys.\" We ate at the restaurant and we loved the food and the service was great! My husband used the workout room about 4 times while we were there and he said it was the best one that he had seen in any hotel. One thing that we found convenient while we were at the Hyatt was that you could enter Macy's store and walk through it to get to our hotel. It was 26 degrees outside and we were thrilled to be able to stay inside instead of braving the cold wind. My husband had left his gloves at home so he bought a pair at that Macy's. All of the people working at the Hyatt went out of their way to be helpful and friendly! Our floor was very quiet and we never heard any noises outside our door in the hallway. This hotel was a real joy to stay in and I would love to stay there again on our next visit. One last thing, we loved the fact that Christmas carols were playing all of the time by the elevators which put us in a festive mood. Thank you for that!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Twila Sauer","date":"2015-02-11 06:45:33 +0300"},{"content":"We were in town for the Parents Weekend at Berklee. The hotel lobby is not great, but the location is good (near Boston Commons and the start of the Freedom Trail). The concierge was very helpful. The pool and workout area are very good for a hotel. I found the pool temp great, but I used it for swimming laps. We had a drink in the bar each night after returning from dinner. Not a very exciting lobby bar, but lots of good places closeby. The room was clean, bed too soft for my taste. All in all, I would stay here again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":4.0,"Rooms":4.0},"author":"Carey Runolfsson","date":"2015-12-28 21:45:40 +0300"},{"content":"Very nice Hyatt. Great location - close to Commons, T, museums and historical sites. Used points for the room. The room was comfortable but with 2 kids it got a little crowded. We spent most of the time sightseeing. The pool and workout facilities were excellent.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Dr. Kristopher Kub","date":"2012-08-28 17:43:01 +0300"},{"content":"If you can get a deal on Priceline, then this is a great hotel to stay in. It's not a 4-star hotel by any means, but the fitness center and pool are top notch. Rooms are clean, service is nice and the entire place smells like gardenia (which got to be disconcerting after 3 days). Here's the biggest complaint - the elevators. You have to take two different elevators to get to your room. There's the one that gets you to the lobby, then the one that takes you to the rooms. When it's dinner time and everyone's trying to make their reservations in time, it's quite annoying trying to escape the hotel!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":3.0},"author":"Dakota Wisozk","date":"2014-04-13 14:03:14 +0300"},{"content":"It was the conference hotel, so I stayed there. The layout of the function rooms and lobby and elevators was confusing -- it was hard to find my way around the hotel. The restaurant in the hotel was expensive and a little iffy. We had to send seafood back because it was spoiled. There were weird lags in service in the restaurant. But there are plenty of restaurants in Boston; there's no need to eat at theirs. Wifi is $10/day. Beds and room were comfortable; bathroom was nice; everything was clean and well-organized; personnel were pleasant. Overall decor is soothing and stylish.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Kirsten Fadel","date":"2015-10-26 11:16:38 +0300"},{"content":"This hotel was great. The location is great for the theatre district and downtown crossing. It's very centrally located for touring the rest of Boston as well. Very convenient to the T (trains) at Downtown Crossing and Park Street. It's a little bit dated in the elevators and public spaces, but the rooms are very nice, recently updated. One annoyance is that there is no outside entrance into the lobby of the hotel. From the street level, you have to take one set of elevators to the lobby, then cross the lobby and take another set of elevators to the room. The elevators are slow, so this can be annoying if you just want to get back to the room quickly. The staff was very friendly and helpful. They even gave us early check-in on Friday at noon, and a late checkout on Sunday (2pm) which is much later than most hotels allow. The bed was great...one of the more comfortable I've slept in. My only complaint is that housekeeping didn't refill the coffee supplies for us, which isn't much to complain about. Also...a parking tip. Parking at the hotel is very expensive. Post Office Square, nearby, has a weekend special, check the prices here: http://www.posquare.com/","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Shawna Pfannerstill","date":"2013-05-05 13:50:55 +0300"},{"content":"My husband and I were looking for a quick, one-night stay in Boston. Priceline provided a great price for the Hyatt Regency, one block from the Boston Common. We had an above-average experience,at a great price for the location. The block that the hotel is on isn't terribly picturesque, situated at the end of Downtown Crossing, but it's within walking distance of most major spots -- including the theater district, Back Bay, Boston Common and the Public Gardens. Front desk staff was courteous, check in was easy. Our room was small but looked as though it had been recently upgraded, and was attractively furnished. King bed was incredibly comfortable. Anthony, the concierge, was helpful and friendly. There are certainly more luxurious accomodations in Boston, but probably none more attractively priced in such a central location. I'd definitely stay there again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Piper Konopelski","date":"2013-11-16 23:35:51 +0300"},{"content":"We were able to get this hotel for only $99 through hotwire, so needless to say that this hotel was worth every penny. We stayed one night during the wine festival, and though it wasn't close to the Trade Center, it was only a short taxi ride away. The Hyatt looks like it may be an older hotel from the outside, but the rooms are totally updated with a modern touch to them. There was a nice atrium when we arrived on our floor, which gave the hotel a comfortable feel to it. The staff was friendly, and the location is wonderful (just a block from Boston Common area). The room is a fair size, with a very comfortable bed and very clean. The bathroom is average size, but very well appointed to. One downfall was the lack of a hotel safe. I haven't been to a \"4\" star hotel lately that did not include a safe. But other than that, we had an excellent stay at this hotel, especially because of the price we booked it at.","ratings":{"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Brielle Bayer","date":"2015-04-27 10:08:29 +0300"}],"public_likes":["Ahmed Emard","Abe Effertz","Owen Lesch","Mr. Jaida Schmeler","Sheldon Emard","Kathleen Stracke","Mrs. Cary Bosco"],"vacancy":true,"description":"The oldest of the three properties, a 17th-century single-storey white-painted cottage. Sleeps 2.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}