{"title":"Coronado","name":"Hotel del Coronado","address":"1500 Orange Avenue","directions":null,"phone":"+1 619 435-6611","tollfree":null,"email":null,"fax":null,"url":"http://www.hoteldel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.68092,"lon":-117.17833,"accuracy":"APPROXIMATE"},"type":"hotel","id":6931,"country":"United States","city":"Coronado","state":"California","reviews":[{"content":"The moment we stepped inside Harrah's we were greeted with open arms and there was not a long wait for registering for the room. We had a view of the north end facing the Mirage and Ceasar's Palace which looks great in the evening and at night. Word of advice make you you get your total rewards card the day you arrive since it has a lot of discounts on the shows and restaurants. We stayed at Harrah's for 3 nights the weather was hot as usual but I liked it. On the first day we walk north on the strip stopping at the Venetian which was spectacular inside with sky looking like it was real. All the shops and restaurants were beautiful and this was just the first one of many. I would recommend going to Ceasar's Palace to see the moving statues which plays about every hour and there is a huge fish tank there as well. As for the shows we seen Pen and Teller at Rio and they put on a awesome show . There was so many shows to see and not enough time what ever show you see it will be good. If you want to tour more areas of the strip you best off buying a 2 day tram ticket for $12.00 depending on who long your stay is of course. In all it was a very good trip just not enough time to see everything in 3 days.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":5.0,"Value":4.0,"Service":4.0},"author":"Peggie Leffler","date":"2015-07-12 11:29:18 +0300"}],"public_likes":["Rachel Smith","Jan Stanton"],"vacancy":false,"description":"A massive luxury hotel; the architecture is remarkable, the lodgings less so.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}