{"title":"Swansea","name":"Hurst Dene Guest House","address":"10 Sketty Road, Uplands, Swansea, SA2 0LJ","directions":null,"phone":"+44 1792 280920","tollfree":null,"email":"hurstdenehotel@yahoo.co.uk","fax":"+44 1792 280920","url":"http://www.hurstdene.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.620442,"lon":-3.946629,"accuracy":"APPROXIMATE"},"type":"hotel","id":28959,"country":"United Kingdom","city":"Swansea","state":null,"reviews":[{"content":"We used Hotels to find a newyorkcity hotel. when we arrived it was like a bowery flop house! I had my children with me and we had to get two rooms and they werent even next to each other. There were broken bottles in the hall and pubic hairs in the bed. this was the broadwaymanhattan hotel. we were going to see a show and wanted to walk in the theater district. I couldnt stay there with my family, so we had to get another room at the hilton, which cost us 400. for the night, plus the 200 that was non refundable from the other place! We contacted Hotels that we booked through and they took no responsibility and wouldnt even discuss what we had found at this hotel that gets 2 stars on their site! Beware of the catchy Hotels commercials, we learned the hard way.","ratings":{"Overall":1.0},"author":"Celestine Keeling","date":"2013-10-20 00:40:19 +0300"},{"content":"I would not stay here even if they pay me. The WORST hotel at which I've ever stayed. It's 10 times worse than what you can possibly imagine of a bad hotel. It's so very nasty. I couldn't stand it even with my eyes closed.","ratings":{"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Service":1.0,"Rooms":1.0},"author":"Mrs. Yolanda Emmerich","date":"2012-10-10 05:45:43 +0300"},{"content":"My friend, her parents and I wanted to be able to go to New York and have a good time, but when we all saw this hotel, we knew what a dump it was. Just that the fact that there is a piece of paper taped to the door to tell you that this is a hotel should give you an idea about how bad it really is...No room, screws for sink handles, clogged bathtub drain. The TV didn't work, there was no VCR, you could hear everything that was going on in the rooms around you. The elevator smelled horrible and the curtains didn't even keep out the light. Lastly, there were no dressers, just hangers and hooks, that's it! Yes, the hotel IS located close to times square but is it worth it to stay somewhere that is totally disgusting just to be close to times square?","ratings":{"Overall":1.0},"author":"Mrs. Ellsworth VonRueden","date":"2012-05-23 12:47:27 +0300"},{"content":"I took my daughter and three of her friends here for a girls weekend. The room and bathroom were very clean and the staff was very helpful. The only problem (and to five females it was a big one) and surprise was that we saw several cockroaches!! I was very surprised as it all looked very clean. I think the attached restaraunt (a small chinese diner style place) is the culprit here. We all had trouble sleeping because of this, thank god we were only there for two nights and were not in the room except to sleep and shower. Ths day staff was great and we had plenty of heat once we asked for it. I have to say if it weren't for the bugs I would recommend this hotel but I will never go back, I hate bugs!!!!!","ratings":{"Overall":2.0},"author":"Ms. Thaddeus McDermott","date":"2013-01-05 05:52:45 +0300"},{"content":"stayed for a week, older hotel, but clean rooms and very friendly staff, breakfast included in price and was very good. very good value for the money. staff was very helpful in getting our truck in the parkade, which was a close fit. beds were comfy. will definately be staying here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Jackson Stark","date":"2013-11-30 14:02:00 +0300"},{"content":"We stayed at the Quality Inn for one night precruise. Our room was small but clean,and the beds were very comfortable with nice linens. Ice machines are on alternate floors. I would like to recognize Jacob at the front desk for providing excellent service. He gave us directions to the Aquabus to Granville Island,and also arranged a taxi at a specified time for our group to the cruise port. I see from other reviews that there were complaints about the restaurant in the hotel. We did not avail ourselves of the hotel restaurant. We ate dinner that night and breakfast the next morning at the White Spot restaurant,which is one block east of the Quality Inn(see review).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Dr. Hortense Ebert","date":"2013-05-03 18:08:31 +0300"}],"public_likes":[],"vacancy":false,"description":"Hurst Dene is located in the leafy suburb of Uplands just off Uplands Square on the main road to the heart of the Gower peninsula. They offer guest rooms and self-catering apartments at affordable prices.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}