{"title":"San Francisco/Golden Gate","name":"Union Street Inn","address":"2299 Union St","directions":"at Steiner St","phone":"+1 415 346-0424","tollfree":null,"email":null,"fax":"+1 415 922-8046","url":"http://www.unionstreetinn.com/index.html","checkin":"2PM-7PM or by special arrangement","checkout":"noon","price":"$190-$330","geo":{"lat":37.7969,"lon":-122.436,"accuracy":"APPROXIMATE"},"type":"hotel","id":25813,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Overall, we enjoyed our stay at this condo. Let's get one thing out-of-the-way first. Yes, this is a timeshare. If you come here and accept discounts or other free products, you may be subjected to an annoying and potentially pressure packed timeshare presentation. If that's not for you, then don't accept the perk. But I have little empathy for people that accept the perk and then complain about the presentation after-the-fact. The location of this condo is pretty good. While it is located just one block off the strip, blocks in Vegas are huge. It is behind Imperial Palace but will take approximately 15 minutes to walk to the strip. Because of the bend in the strip near this location if you are attending a conference at the Sands convention Center then this is a really nice location. You can walk to the Sands convention Center in a little over 10 minutes. The grounds are very nice and maintained well. You walk around on the interior of the complex which consists of multiple buildings that are three stories in height. The grass and shrubs are well-maintained and we found the paths to be well lit. There are nicely done pools as well as areas to grill. Our unit had an exterior patio with tables and chairs as well. Parking seemed abundant though it did appear that the resort was lightly I can pied when we were here. Every parking space is covered with an overhead sun shield structure which was a nice touch to keep the hot desert sun off the interior of your cars during the summer months. The complex is surrounded by fencing with only one way in and out and that path has 24-hour guard service. There is free Wi-Fi on the complex and we found the signal inside our unit to be very strong and very fast. We did not use a lot of the resort amenities or any of the activities so we can't comment on those. Now onto the unit itself. We found the unit to be well-equipped, in good working condition, and very nicely furnished. You walk immediately into a small living room that has a sofa and a single chair. There is a large flatscreen TV on the wall above a gas fireplace. In the same area, there is a small four-person kitchen table with a few extra chairs as well as two barstools at an L-shaped kitchen bar that also serves as part of the kitchen countertops. There are two bedrooms, both of which also have large flatscreen TVs mounted to the wall as well as large walk-in closets for both. This was a nice feature to keep all of your luggage completely out-of-the-way and to hang up all of your clothes. Our only disappointment was that the second bedroom had a single queen size bed in it instead of two separate twin beds as is common at many timeshares. This means that a family with two kids will either have to try to get the two kids to sleep in the same bed or put one on the sleeper sofa in the living room. The master bathroom is not separated from the master bedroom it is part of the same large room except for the toilet which is in a separate small space behind door. The master bath tub is massive. It is literally approximately 7' x 4' in size and you step into the tub to take a shower from the single showerhead. If you and your partner in the master bedroom happen to have different schedules then the lights from the bathroom sink will shine directly on the bed where the other partner is attempting to sleep. The bathtub is completely impractical after you get over your initial wow moment of seeing the size of it. The problem is that the water heater is not even close to being adequately sized to fill the tub. After a long day on the strip we thought it would be great to relax in the tub. After sitting in it and turning on the hot water we could get water only to the height of about halfway up our leg before we ran out of hot water. This is a completely ridiculous design. The second bath has a shower only, no tub. All things considered, we enjoyed out stay here and would return.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Olin Waelchi","date":"2012-12-07 01:07:48 +0300"}],"public_likes":["Timothy Gerhold"],"vacancy":true,"description":"Edwardian home with spacious airy rooms and a quaint cottage garden in the back.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}