{"title":"San Francisco/Golden Gate","name":"Redwood Inn","address":"1530 Lombard St","directions":"between Franklin St and Gough St","phone":"+1 415 776-3800","tollfree":null,"email":"info@sfredwoodinn.com","fax":"+1 415 928-1934","url":"http://www.sfredwoodinn.com/","checkin":"2PM","checkout":"11AM","price":"$75-$90","geo":{"lat":37.8012,"lon":-122.4268,"accuracy":"APPROXIMATE"},"type":"hotel","id":25797,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Excellent, quiet location between the Guggenheim and the Punta della dogana, only a short gondola ride to the San Marco area. Having breakfast on the terrace on the grand canal was wonderful. Reception desk and dining room personnel were kind and helpful. While the room itself was ok, the room service was not: bins not emptied several days in a row, shampoo / shower gel bottles not replaced, a leaking sink... Sloppy! Certainly not what you are entitled to expect in a 5*L hotel.","ratings":{"Location":5.0,"Overall":3.0,"Value":3.0,"Service":2.0,"Rooms":3.0},"author":"Marcelina Rath","date":"2012-11-18 07:42:11 +0300"},{"content":"Arriving in Venice mid July - not realising just how popular a time of year it would prove to be tourist wise - we were relieved to check into the serene, calm and very indulgent Centurion Palace. Positioned right on the Grand Canal with fabulous views, the main entrance is hidden down a gorgeous walkway ....one minute from a very regularly serviced waterbus terminal. We must have commented at least five times a day how grateful we were for the hotels location ... away from the crowds yet in the most perfect location. Our room (110) could not have been better. We were a little dissapointed not to have scored a canal view but in hindsight were grateful for the cool, quiet courtyard view in the end. High ceilings, stunning interior design, gorgeous linens, outstanding housekeeping and all the little touches you expect from a five star hotel. Whilst the architecture of the building, luxurious interiors, commanding position and AMAZING breakfast buffet (with terrace tables right on the canal) are worth mentioning, the real difference is the staff. How refreshing to see the same faces everyday. Be remembered, warmly welcomed 'home' after a long hot day and given your room key without having to mention the room number or never having to sign for anything. Its little touches like that which make this truly five star ...including the prompt delivery of a chilled glass of milk at 11pm when I coudlnt sleep! Did I mention the chocolate dipped strawberries and prosecco on arrival? All this indulgence, three nights (including breakfast) for a very reasonable 800 Euro. We're well travelled and rely heavily on Tripadvisor for recommendations. If this hotel (check out their special deals via SLH website and register as a member) is in your price range ....book yourself in. You will NOT regret it!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Jay Powlowski","date":"2012-07-12 03:11:07 +0300"}],"public_likes":["Maudie Herzog","Miss Daisy Glover","Darius Bruen","Maynard Lehner","Damon Bayer","Paxton Davis IV","Alayna Hansen IV"],"vacancy":true,"description":"Standard but clean budget motel which is just one block away from Van Ness Ave, so it’s convenient for public transportation and for getting to other areas like [[San Francisco/Fisherman's Wharf|Fisherman's Wharf]].","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}