{"title":"Paris/La Défense","name":"Adagio La Défense Esplanade","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":48.88847,"lon":2.24776,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21871,"country":"France","city":"Puteaux","state":"Île-de-France","reviews":[{"content":"For someone traveling in their early 20's was great! I woke up to a beautiful sunrise and fell asleep to a spectacular sunset. Rooms are big enough for 1-2 people. The beach is okay, I went there when it was windy, but I got a good tan! Food was delicious and cheap and the staff was very friendly.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Mr. Juliana Hintz","date":"2013-12-18 22:29:40 +0300"},{"content":"Stayed in June 2008, nice property but its the wrong place and time of year if you're looking for a quiet and relaxing hotel. Great place if you have children. Beach area is nice but it's shared with a host of other hotels, you really can't see that from their web cam, so its pretty packed with little ones playing in water. Forget grabbing a nap in during the day in the summer months. Use the public access beach behind the property which can be accessed via the parking lot. Early mornings and late evenings on the beach are nice as was the ocean view from the room. Had to move rooms, first one was behind the hot tub in the main building and it got loud at night . The staff was extremely nice and helpful. Earlier reviews of their restaurant are correct, quite pricey for what you get.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":4.0},"author":"Ray Pagac","date":"2015-06-15 03:48:58 +0300"},{"content":"The Napili Kai has an incredible setting on Napili Bay ... a beach with incredible fun for the family .... body surfing, snorkeling and sea turtles to name a few. Last year we came to stay in Lani 2 and it was a vacation of a lifetime. We came back this year with high expectations but were placed in the Puna Point Buildings. Puna Point has a fabulous, unobstructed ocean view but these units are older, have a musty smell and bug problems. Little ants were all over the counter. There was a pesticide under the counter for us to spray if we wished; however, we didn't really want the residue of the spray on our food so we put up with the ants. We could have asked to change rooms but decided to stay put because of the wonderful view. The staff were professional but not as friendly as I remembered from last year. Housekeeping was hit or miss, depending on which cleaner we got. One was exceptional, the other (in the afternoon) left garbage under the sink and did not appear a happy camper. Overall, we enjoyed our stay but were also ready to move on at the end. Napili is a good location for fun and proximity to lots of excellent sight seeing and activities. The Napili Kai, as we have experienced, has the potential to be excellent. If they renovated the older rooms and upped their level of service, we would definitely want to try it again; however, next time we come back, we will likely try somewhere new.","ratings":{"Service":3.0,"Cleanliness":2.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":2.0,"Location":5.0},"author":"Marietta Kuhic","date":"2014-07-02 06:16:51 +0300"},{"content":"Our stay at the Napili Kai Beach Resort concluded on Saturday September 29, a four night stay. The first incident occured when my wife was harrassed on the beach and accused of not being a patron of the hotel by one of the employees working in the Makai Hale because we had not signed up for a beach towel which would have identified as patrons, allowing us to use the resorts chairs on the beach. We had our own towels and chairs were not items signed out for. By the way the verb harrass was used by the employee to describe her behavior, not a description we stamped this individual with. We then asked the employee to find out about the Honeymoon package which we were identified under(we were honeymooners) in hopes of getting the sparkling wine, food certificates....etc... included with this service (as advertised and stated in our itinerary). Upon returning the towel and snorkeling equipment the employee proceeded to tell me she spoke to my wife and the resort would be taking care of this for us. Nothing was ever done and we left the resort with a sour tatse in our mouths.","ratings":{"Service":1.0,"Cleanliness":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":3.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":2.0},"author":"Elwin Wilderman","date":"2014-09-05 08:27:53 +0300"},{"content":"Returned from Maui the last week of February. Stayed a week with my son (8) and husband. Direct flight from LAX, United, @ approx. $2800 for the three of us (air, hotel, rental). Hotel grounds very beautiful. Beach awesome. Oceanview studio, very cozy, spacious no complaints at all. We ate breakfast at the hotel once. Food absolutely delicious, but way overpriced for the portions. The plan was to shop for groceries and prepare our own meals, but we soon realized it would be cheaper to just eat out, after browsing the lanes at the grocery store. A carton of OJ was 6 bucks! The weather was nice. About 80 degrees, with sporadic showers and gusts of wind. The week we were there, the crowd was mostly 50+ (it seemed) and families. If you're looking for a slow paced, quiet type of environment, Napili Kai is it. FYI: I have more pics to show of the room, but they are very large files and I do not feel like shrinking them. If you want to see them, I'll be happy to email them to you.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Coty Hills","date":"2015-01-09 07:20:27 +0300"},{"content":"Wanted to stay somewhere very special for our 20 aniversary, well we found just the place. Napili Kai had everything that we wanted. If you want an ocean front room spend the extra $ and stay in Puna 11. We had room 231 and the view was worth evey penny. The beach lacked not a thing. Snorkling right off the beach was fantastic. We did not see any turtle here, but just around the point we had no problem finding them. We put 700 miles on our rental car wanting to see all of Maui, but we could have just as well stayed right here too! Very romantic setting but also great for the family. We will be back!!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Boris Kuhlman","date":"2015-11-21 15:43:33 +0300"},{"content":"I saw the reviews for Napili on trip advisor and decided to go there when I got a room over $100 lower than the Kapalua Bay PLUS had additional savings with free snorkel equipment, free parking, AND free beach chairs (all charged for at the Kapalua). I loved it. I stayed in one of the hotel rooms since it had air conditioning. the room was lovely with japanese style screens instead of curtains, a balcony, and jacuzzi bathtub. High speed wireless internet is not in the room, but can be accesses in the open air lobby. Unlike the Kapalua Bay, the hotel is RIGHT on the beach and beach is wonderful. (You can walk to the Kapulua Bay Beach in about 4 minutes if you really want to see that beach - but I thought this beach was nicer). I had great snorkeling right there - I even saw a sea turtle! The beach was a little crowded at times and loud with some kids - but still nice. I liked the free iced tea and fruit every morning on the beach. I would go there again in an instant.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Jaeden Hauck","date":"2014-08-05 20:52:31 +0300"},{"content":"Everything is good at the hotel except the location... We were there mid march .. The weather was raining and cloudy for over 10 days.. One needs to know that 10 miles away in lahaina .. Weather was perfect... Kapalua is at an elevation.. Causing it to be very windy and cloudy with rain... Lahaina is protected by mountains and much better weather... Nothing against the hotel.. But someone picked the wrong place to build it","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":1.0,"Value":2.0,"Location":1.0,"Rooms":5.0},"author":"Howell Doyle","date":"2013-12-12 22:54:30 +0300"},{"content":"We just returned from our fourth trip in three years to the Ritz-Carlton Kapalua. Leslie and her staff in the Club Level are phenomenal and operate at the highest levels of excellence. Everyone in there has a passion for customer service and bring incredible value to this hotel. We much prefer this location to Wailea, and will be back for years to come!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rossie Cruickshank","date":"2014-04-22 19:24:54 +0300"}],"public_likes":["Ubaldo Harber"],"vacancy":true,"description":"Accor's mid-range aparthotel is right off the Esplanade, next door to Sofitel .","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}