{"title":"St Davids","name":"Treginnis Cottages","address":"Treginnis Uchaf","directions":null,"phone":"+44 1437 720234","tollfree":null,"email":"stay@treginnis.co.uk","fax":null,"url":"http://www.treginnis.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.87228,"lon":-5.29966,"accuracy":"ROOFTOP"},"type":"hotel","id":28259,"country":"United Kingdom","city":"Saint David's","state":null,"reviews":[{"content":"Just spent 2 nights here and I have mixed reviews. The check-in and front desk staff were very nice and helpful - we were off to a good start. The room is eclectically decorated - fun and colorful and was reasonably comfortable. But we were disappointed that on 2 separate occasions when we called housekeeping to request a couple of items, 2 hours passed and we had to call again. Although the room looked clean - the carpets needed a good shampooing. The location of the hotel is excellent and parking was so easy. But at the rates charged for this hotel I would have expected clean carpets, a notebook in the room with the hotels internal numbers to call, local services and restaurants and an extra set of glasses for the bathroom. Overall the stay was fine - but I don't think I would stay here again considering the other hotel options in the area..","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Lizzie Kerluke","date":"2012-06-25 05:09:10 +0300"},{"content":"We stayed at the Pier 5 Hotel and booked the Waterfront Invasion package for 3 nights that included the VIP Aquarium tickets, VIP Science Center admission and $25.00 gift certificate which we used at Ruth Chris for dinner. Our experience was wonderful. I really liked the happy hour crabby appetizers they held at our hotel. Jill our assistant hotel manager made wonderful crab dip on Thursday than crab crepes on Friday and they had beer and wine also complementary. She made the happy hour fun and we got to see hands on cooking while enjoying cocktails. Saturday was the fun Chocolate extravaganza with fun dessert to dip into chocolate. After we enjoyed our day at the harbor we came back and enjoyed the view from our balcony of the harbor and people watching. Even though we live in Catonsville, it was a fun weekend being a tourist in Baltimore. Thanks!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Dexter Thompson","date":"2014-10-27 07:59:06 +0300"},{"content":"I got married at this hotel in June 2005 and have stayed here several times since for weekend getaways with my husband. We just love the place. The service is always wonderful and they always remember us. We've even received gifts in our room at times. We love the funky difference of this hotel, it isn't like your average place and the location is perfect. The decor is art deco and the smaller size makes it feel more comfortable. One of the most memorable things to me is how clean the rooms always smell. So fresh, I want to know what they use to clean or wash sheets with because it smells so good I instantly relax. I've heard alot about the noise in the hotel and I can't honestly remember ever being bothered by it, however, it does have 2 event spaces for weddings and other party events so I can understand the noise. It won't stop me from visiting again and again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Queenie Gerlach","date":"2012-11-24 17:09:21 +0300"},{"content":"My husband and I had a wonderful stay at the Pier 5 Hotel. We booked through Priceline for $90 a night and felt it was well worth the price. The location was excellent - right on the Inner Harbor and close to the Baltimore Aquarium, Camden Yards, and the local areas of interest (Little Italy, Fells Point). The room was nice and quiet. They even had a complimentary 'crabby hour' each night where a snack was made and wine/beer was provided. My only complaint was the $9.95 activity fee that was charged for each night stayed. I wasn't aware of the fee before we checked in. Overall great stay.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Daisy Robel","date":"2013-03-30 07:53:58 +0300"},{"content":"we spent a weekend at this hotel. our VALET parked car was broken into. this fine hotel pushed us to the parking lot company for answers. the good part about this is paying $31.00 a day for valet parking and not knowing someone else has your car. our car was parked in a gated parking lot with 24 hour guards and after the $1700.00 break in occurred we received a letter stating that since this was a premediated act they were not responsible for anything. i will let as many people as i can know about this customer care policy. thanks pier 5 hotel, baltimore inner harbor, wfoster","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":1.0},"author":"Virginia Breitenberg","date":"2012-12-20 03:42:09 +0300"},{"content":"My husband and I decided to getaway mid week to go to Baltimore and see a concert at Rams Head Live in mid-July. We splurged and stayed at the Pier 5 Hotel. The hotel is absolutly gorgeous! The staff were extremely friendly. The room was AMAZING! It was so very modern, the color sceme in our room was gold and purple, and even the bathroom was gorgeous -much different than your typical hotel bathroom. The bed was very, very comfortable as were the couch and chair. I wanted to take the chair home with us! Avoid eating at the hotel's cafe. The breakfast there was awful. Don't bother purchasing a package deal either with the hotel. It's not worth the extra money and I found the breakfast coupons to be a total waste of money since no food was really offered with them. If you want to splurge stay here. We probably won't stay there again because it was very expensive for our means, but worth the night we spent.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Service":5.0,"Rooms":5.0},"author":"Wilber Quitzon","date":"2015-11-10 13:18:20 +0300"},{"content":"Pretty much what I expected for the cost and location. I would stay here again if there were a bigger room. We spent most of our time at my family's timeshare rental and came back here at nights to walk the boardwalk and crash. This is all you need at the beach, nothing more. Generally, the room we stayed I was clean. Toiletries are minimal and so are the furnishings. Management isn't really visible regularly, but we never needed them.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Brody Lubowitz","date":"2013-04-18 17:11:19 +0300"}],"public_likes":["Dixie Roob","Morton Kris"],"vacancy":true,"description":"Ty Mortimer cottage situated on Treginnis Uchaf Farm, west of St Davids. 10 minute walk to the coastal path and Porthllisky beach. Or Y Nyth cottage in a quiet location near the centre of St Davids, shops & cathedral with easy car access to local beaches. Good for couples and families. Off road parking. Sleeps up to 5. Free Wi-Fi.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}