{"title":"Peak District","name":"The Barn at Ivy House Farm","address":"Warslow, Buxton","directions":"9 miles from Buxton","phone":"+44 1298 687006","tollfree":null,"email":null,"fax":null,"url":"http://www.ivyhousefarm.com/","checkin":"15:00","checkout":"10:00","price":"from £300","geo":{"lat":53.1223,"lon":-1.8733,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21985,"country":"United Kingdom","city":"Staffordshire","state":null,"reviews":[{"content":"We just returned from Maui where we spent 6 days at The Westin. Our experience was mixed. This is a very large, very busy, high rise hotel. The common areas are bustling and crowded at all hours of the day and night. My opinion is that the infrastructure is not adequate to keep up with the number of rooms (meaning guests) in the hotel. For example, the self parking lot fills up and you have to valet park your car. This service is free if self parking is full, but then you are forced to wait for the valets to get your car for you - not an easy task considering the cars are stacked to maximize the number of cars in the lot. The wait can be up to 20 minutes during prime time - definitely call for your car a half hour before you want it. The line at the coffee bar is 15 minutes long in the morning. And by the way, I paid $50 for 2 bagels, a yogurt, a banana, a bottle of OJ, a muffin, and precut fruit one morning. We waited for elevators all the time. The worst part, however, is the pool area. The Westin has done a good job of cramming a pool lounge into every possible nook or cranny of the large and lovely pool area. Even so, there was not a chair to be had between the hours of 8AM and 4PM every day of my stay. And unless you are willing to get up with the sun, forget about a chair under an umbrella. These are reserved by resourceful early risers by 6:15AM, despite the hotel's policy against it. Being on east coast time, I watched from my balcony as guests dropped towels, books, and pool toys on rows of chairs at 6AM then walked back into the hotel. It was very disappointing as my kids wanted to spend more time at the pool, but there was no place to sit! Other reviewers have written about the rooms. The rooms are small, but clean, comfortable, and laid out well. I had no trouble storing 4 suitcases full of stuff into the dresser/armoire. So while the rooms aren't spacious, they are clean and comfortable. The service was good, especially considering the density of the hotel. My recommendation is that if you are looking for a romantic, quiet, restful property, look elsewhere. But if you want a nice beach, a fun pool, and a location convenient to food and shopping, The Westin will meet your needs.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Angelita Pfannerstill","date":"2012-11-19 19:16:18 +0300"}],"public_likes":["Jada Ortiz","Samir Lemke","Donato Osinski I","Dr. Carroll Parisian","Rosa Sauer","Rylee Lehner","Evan Nader PhD"],"vacancy":true,"description":"Luxury Peak District cottage sleeping 6 in three bedrooms with three bathrooms. Contemporary style open plan barn on a quiet no-through road with walks from the door.","alias":"Peak District Cottages","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}