{"title":"San Francisco/Nob Hill-Russian Hill","name":"Golden Gate Hotel","address":"775 Bush Street","directions":"between Mason and Powell","phone":"+1 415 392-3702","tollfree":null,"email":"info@goldengatehotel.com","fax":"+1 415 392-6202","url":"http://www.goldengatehotel.com/","checkin":null,"checkout":null,"price":"$95–$150","geo":{"lat":37.7898,"lon":-122.4099,"accuracy":"APPROXIMATE"},"type":"hotel","id":25961,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My husband, 2 year old daughter, 3 month old son, husband's parents and I stayed at the Hale Mauka-Makai “Mountain-Ocean House” for one week in October 2009. We had a fantastic time and I would recommend this place to a friend. Service: Zack was professional, organized, friendly and prompt from my original booking on through the follow-up after we returned home. It is a self-service rental, but they were quick with supplying snorkle gear, kayak paddles and sand toys for my daughter. The grounds are well maintained--the trimmed lawn, plentiful foliage, and comfortable hot-tub. We didn't mind paying for laundry, I guess because we knew that was part of the deal. Ammenities: Our group was mixed on the lack of AC. My mother-in-law (coming from the Texas heat) loved the fresh air and sound of the ocean with the windows and patio open (which we had to watch like hawks as we have a curious two year old). I (coming from chilly San Francisco) wished I could have escaped the humidity just for a bit. Mostly the lack of AC creates a problem for the owner's--wear and tear on the building exterior due to sea salt, new ceiling fans already inoperable, etc. The kitchen was nicely updated with plently of utensils, some nice peices of furniture. The couches were dated, worn and covered with slip covers that loved to collect sand. Not really a problem for us, but not exactly luxurious if that is what you are looking for. The top floor was empty while we were there, so that wasn't really a problem. Parking was no problem either. You do have to be careful backing out, but it wasn't that big of a deal. The biggest problem for my husband was the WiFi never worked (I actually liked being disconnected from the rest of the world!) Location: Excellent! A nice big lanai, lawn with picnic table and chairs, retaining wall and a short drop to the beach! No, it is not a wading beach, but that didn't really bother us since our children are still a bit young--we loved just playing in the sand. My husband and I did snorkle right off the back--it can be done! The visibility was not great, but we did see sea turtles which was neat. My father in law took the kayak out and enjoyed that. Near-by: We loved hiking the Hauula Loop, there is a grocery store just up the street. We never went, but the Polynesian Cultural center is just five minutes. We enjoyed some nice dinners out at Turtle Bay Resort, Waimea Joe's at Haiku Gardens and The Crouching Lion Inn--all not that far of a drive away. We found a playground about 15 minutes south with a great snowcone/breakfast/lunch place across the street. We enjoyed day trips to the Northshore where there is a great spot to watch the sea turtle bask in the sun, a beautiful protected reef for snorkling and a shopping/dining district. We also enjoyed Kualoa Park and hiking up to Diamond Head. We never went into Waikiki or Honolulu. Oahu is a small island and it is possible to do quite a lot in a week (or not a lot if that is what you prefer). We were perfectly happy to be in the small village of Hauula--it was just what we wanted. Value: We feel this is a great value. It is not high-end, but laid-back and perfect for families--especially if you have a large group you could rent out several of the properties! It was a hassle free experience (and that means a lot considering we were traveling with two small children!). It is a gorgeous setting--exactly what we had in mind when we booked it.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ramona Metz Jr.","date":"2014-08-24 19:59:45 +0300"},{"content":"First things first: Keep in mind that this is a hostal and not a five-star-hotel. If you want a big breakfast, conference rooms and a pool, this is not for you. If you want a comfortable room in a very central location to relax from your excursions through lively Madrid, it is 100% perfect. LOCATION Could it be any more central? I don’t think so! You are right on Gran Vía, with a 10 minutes’ walk to Puerta del Sol and all kinds of shops and amenities near by. I actually felt like I fell out of my cozy room right into the middle of things – in a good way! Madrid is a very compact city, but it’s still nice to be in the center’s center ;-) THE WAY FROM THE AIRPORT No need for a taxi, just take the metro for Euro 2,50 and you’ll be there in about 30 minutes. Personally, I would take the option that makes you change just once and get out at Plaza España (the hotel website offers three possible connections). The Santo Domingo stop may be right in front of the hotel and Plaza España a short walk up Gran Vía, but I found the latter more comfortable because for Santo Domingo, you have to change lines twice – more complicated and takes a little longer. THE HOSTAL You will find it on the 8th floor of a nice old building. There are two elevators, one to be used for your luggage (it’s fairly small) and one used by hotel guests and people living in the appartments on the other seven floors. The hostal has a reception area (you pay when checking in) and a big and airy common room with a TV. Everything is set in white and dark grey, so it looks more like a design hotel than a hostal. I also happened to see the bathroom for the rooms without a bath; it looked new and shiny, all black and white. The staff was very nice and welcoming - I liked the fact that there was always somebody at the reception desk when I returned at night, made me feel extra safe. THE ROOM I had a single room (nr. 16) and was positively surprised by its layout (about 9m²) and cleanliness. It had one of the most comfortable beds I have ever slept in! The bathroom is small (about 2m²) but totally adequate, the water pressure and temperature in the shower was very good all day. There was a small table and chair, a build-in wardrobe, AC, a TV and free (and fast!) W-LAN (get the code at the reception). My room did not have a view, which I did not mind, because it meant there was no noise from Gran Vía to be heard. As is the case with many Spanish flats and their rather thin walls, you might hear some noise from other rooms though, so if you are a light sleeper, make sure to bring some ear plugs. OVERALL VERDICT I am sure I will stay at Hostal Besaya again, because it offers excellent budget accomodation. Madrid is an amazing place for going out and shopping, so I prefer to spend more on retail therapy than on accomodation :-) Hostal Besaya offers great value for money - see you again in 2012!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Zelda Towne","date":"2012-12-18 02:49:53 +0300"}],"public_likes":["Uriel Friesen","Daren Kozey","Cristal Bahringer","Milford Brown","Alize Hackett DVM","Ms. Bertram Wuckert","Grace Fritsch DVM","Dr. Darrion Kutch","Marcella Oga"],"vacancy":true,"description":"A charming budget hotel in an old Victorian.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}