{"title":"Annan","name":"Firth Hotel","address":"41 Scotts Street, Annan DG12 6JE","directions":"on B721 to east of town centre","phone":"+44 1461 202302","tollfree":null,"email":"thefirthhotel@gmail.com","fax":null,"url":"http://www.firth-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":54.98667,"lon":-3.25332,"accuracy":"APPROXIMATE"},"type":"hotel","id":37340,"country":"United Kingdom","city":"Annan","state":null,"reviews":[{"content":"Iberostar Quetzal was an AMAZING time! All the workers there were incredibly nice and went out of thier way to make your trip better. Good entertainment every night at the show, and of course later in the night you have to go to the club, Mascara. The only thing that was even close to bad about the trip was the weather..it rained the first 2 days we were there..but after that it was great. Theres even wildlife running around in a jungle in the middle of the resort, but none of them woke me up early like some frinds told me would happen. It was by far my best trip ever and everyone in my group agreed. GO THERE!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Daija Kirlin","date":"2015-11-21 22:29:00 +0300"},{"content":"My husband & myself & 2 daughters, aged 11 & 13, stayed at the Quetzal in April with 3 other families and had a wonderful vacation!! The weather was perfect, the pool was clean and lovely (there's really just one large pool and an adult swim-up/bar pool), the staff was very attentive and polite, the rooms were spartan but clean and the food was wonderful. The beds are not as hard as other reviews may claim. My only complaint about the rooms is that there is construction going on at the hotel next door and I really didn't want to hear that kind of noise on my vacation. Go to Walmart or Target and buy inexpensive floats for the pool. You can then leave them for another family. As far as the restaurants are concerned, the three we went to were great. The Japanese is a Benihana style restaurant, which was fun and delicious. The Mexican was okay-it was nice to be served dinner instead of going to the buffet, but the kids decided they'd prefer the buffet over the menu choices. Food was so-so. The Steak House restaurant was very good. The buffet was always excellent for breakfast and dinner. The poolside restaurant is great for a very casual lunch (wear your swimsuit). The \"Star Friends\" are the on-site group of performers who put on a different show every night. They even have a children's performance every night, and our little friends we were vacationing with (aged 4, 6 & 7) were in a couple of the performances. The Star Friends come around the pool and beach during the day and encourage the children to come rehearse for an hour and then are in a cute show that night. After this portion of the show, there is an audience participation segment and then a different themed show performed by the Star Friends. It gets long but is fun. My husband & I went to Tuluum for an excursion. (No one else in our party was interested). It was about a 40 minute ride each way, and well worth it to see Mayan ruins. We booked this trip in the hotel lobby, and had to walk about 5 minutes up the street to Playacar to catch our Tour bus. It was very organized and worth the trip. Our friends went swimming with the dolphins & loved it. The 4 adult men in our party went deep sea fishing and caught a big one! Our family went on a snorkelling excursion, also booked through the hotel lobby. We went to two places for 45 minutes each to snorkel - a shallow spot where we barely saw any fish, and to deep water, where we felt like we were in \"Finding Nemo\". The boat crew was polite and helpful, and at the end of the trip we sat in an a covered outdoor restaurant where we had complimentary beer and soft drinks and a mariacchi band serenaded us. The beach at the Quetzal was beautiful. If you walked down the beach a bit there was a huge water trampoline which cost $10 per day. The catamarans at the Quetzal were a blast, and do not cost extra. Be careful if it's too windy, though. Parasailing and banana boat rides were available for a fee. Walk to Playacar (5 min away) to shop. Taxi ($4)to Playa del Carmen for hairbraiding & additional shopping.","ratings":{"Overall":5.0},"author":"Rey Sporer","date":"2014-06-24 12:07:07 +0300"},{"content":"I run travel agency business out of my home. As a travel agent I traveled a lot. So far I did not find a better place to relax by the sea under the sun than this hotel. Hotel has all amenities of exquzite chain hotels with coziness of small privately owned places. Hotel architecture with water falls, natural trails in rain forest environment will create an impression that you are in wild area safari. Rooms are large, all with balconies, all air-conditioned. All services, food, nightly entertainment are of excellent qualities. Service personal are extremely friendly and ready to help. Unfortunately I can not say that this property is a hidden treasure because many people already know this place but I wanted to right down my experience to support that fact. When my family and my clientele wants to relax under the sun by the sea I can not recommend any better place and most of my clientele including myself are repeated guests at this property. I just hope that prices for its all inclusive packages stay as competitive and affordable as others in this area of Cancun. Discounts International Travel St. Louis, MO USA Owner","ratings":{"Overall":5.0},"author":"Josephine Tremblay","date":"2014-06-26 02:55:55 +0300"},{"content":"Just got back from the IB Quetzal and I wish I were still there! I go to many wonderful restaurants and have traveled quite a bit. I thought the food was fantastic. I never had one thing I really didnt like. The have quite the variety - mexican of course at most meals...some the same and some different each time. Always lots of bread, pastries to die for. I loved the fresh donuts with filling and the kids loved the powdered rolls. I became attached to the Chiquiles at breakfast (like a mexican lasagna only with corn tortilla instead of noodles) and the bananna milk! The hostess kindly told me how they are made so I can try it at home. Several kinds of eggs every morning and always french toast- that was great, pancakes and waffles. Omelets made special for you. The wait staff were friendly and excellent. We usually ate lunch by the pool. The paella party was great, they always had hot dogs and burgers as well as a whole line of other buffet items. There was always some place to eat or snack open. We ate at the steakhouse which was great. We also ate at the Bonsai Japanese, which was good too, it does take a while and they were somewhat disorganized but it was good. Our seafood night we had shirmp not lobster, but these shrimp were HUGE and the best I have had, sweet and I thought they were about as close to lobster as you could get. The rooms were nice, and the only time we spent there was to sleep. Which brings me to mention, the beds, they are firm but I thought they were comfortable. I was so tired each night I could have slept on the tile floor. Maids did a great job, cute towel art. I left 2.00/day plus a gift of make-up etc. I heard they liked that. The resort was spotless, there were friendly folks working constantly to keep it nice. We loved the jungle, the animals. One day we had 8 monkeys above us in the trees. Very neat to watch. The resort peole bring the Parrots and the Iguanas around to the pool and beach and take photos and sell them in the photo shop. Those are my favoriye photos even if they were 7.00/ea. We enjoyed the drinks and ice cream at the pool bar, there was always something going on if you wanted to join. The kids club caters to younger kids....Id say between 4 and 7 were the majority. My kids are 8 and 12. The 8 yr old did go several times and participated in the play Grease. It was the cutest thing!!! He had a blast. They played tennis, never had a problem getting a court, basketball, air rifle contest, ping pong. They met kids from all over. Had a wonderful time / we were there from dec 13-19. It was not crowded until the last 2 days. Then the holiday crowd showed up. The weather was great, just right low 80s and a nice breeze. We had 2 red-flag days where there were no water sports. I would recommend if you want to do watersports, you do them the first chance you get because you never know if the next day will be a red flag day. We signed up for parasail/reef snorkel/bananna boat at the white kiosk on the far left side of the property. (red and white sign) We only paid 58.00 pp for a parasail/snorkel/bananna boat combo. Which was cheaper than other offers. Parasail was awesome. SNorkel would have been but it got rough while we were out there and visability wasnt good. They kindly let me trade bananna boat for paddle boat so I could let my youngest enjoy as well. If you want to catamaran on property, if you dont have experience you must take a lesson for 38.00 then you can do it for 1 hr per day each day. I recommend you take the class at the beginning of the week then you can take advantage of your time to use the boat. Pool water was cool, hot tub same temp as pool. Ocean water was warmer than pool. It rained a few times for a short while but nothing bothersome. We took a cab into Playa twice. 4USD each way. There are also shops 5 min walk away. We ate ice and drank on the property all week, NO PROBLEM with tummy aches!!! I definitely recommend this for families. Not really for honeymooners as much . I wouldnt recommend high heels as they may get stuck in the teakwood walkways. I dont wear them, just a bit of advice. I really enjoyed this. It was my first experience with all inclusive. Its the only way to go escpecially w kids!!! I would go back in a minute. I think as far as the resort property the next place I go will seem like the Super 8!!! If you ahve any questions, feel free to ask.","ratings":{"Overall":5.0},"author":"Garth Kub MD","date":"2012-09-11 18:42:00 +0300"},{"content":"We first visited the hotel in 2002 and since it was out silver wedding anniversary this year could not think of a better place to return, this time accompanied by our 3 children aged 22,21,16 plus various girlfriends, friends etc. We were not disapointed, as we checked in we were given refreshing drinks served by clemintine who we had met on our previous visit, and he remembered us and greet us like old friends. In response to the people who complained about the food always being the same in the buffet resturants, when there is just about everything you could wish for in the resturant, how can you want varity, you could eat there every night for your entire holiday and not eat the same meal twice. The best excursion we went on was the jungle crossing, (booked thru the hotel shop) you swim in underground caves on a mayan ranch, where you also eat a traditional mexican lunch (delicious).Then taken to the most beautiful deserted beach to kayak and snorkel around a coral reef. and enjoy fresh fruit and cold drinks on the beach on our return We had a wicked guide called Nachos and shared the day with an American family who had children of similar ages, what lovely people, all I can say is it was the most perfect day and we will remember it for ever, a word of warning though, the army jeep ride once on the ranch is NOT for the faint hearted nor those with a queasy stomach but what fun if you have the chance this is a day not to be missed We all really enjoyed the holiday and would go back to this hotel again tomorrow, the people are lovely always smiling especially rosario in the tucan lobby bar, the food is great we all came home fatter then when we went and the place is spotless Nothing is too much trouble If there is one down side its the music in the disco its either really naf 70,s (grease lightening and the bee gee's staying alive ) or trance so please mr deejay lighten up some current dance tunes would be good.","ratings":{"Overall":5.0},"author":"Vidal Ankunding","date":"2013-03-01 11:06:57 +0300"},{"content":"My husband and I visited the Quetzal the first week in June, 2004 with our children who are 12 and 15 years of age. We have visited 10 different all-inclusive resorts in Mexico over the years and this one by far had the best food. The evening buffet was much better than I expected after reading the reviews. The presentation was great, flavor was delicious and the variety great as well. The dinner buffet was uncomfortably warm since there was no breeze coming through, but that was our only complaint with the food or dining areas. The resort was very crowded, both on the beach and by the pool and we didn't find the staff all that friendly. Although there were plenty of activities ongoing, my kids would not go participate on their own. We were there for 7 days and saw plenty of \"star friends\" walk by us all day long, but only once did they speak to my children. At other resorts we have stayed at we always end up making friends with at least one of the resort hosts. The bartenders gave good, fast service, but once again were not overly friendly. The resort was packed with Europeans and most of them extremely rude! There were also many topless women on the beach as well. At one time from where we were sitting on the beach we could see 6 topless women. The room was clean but small for four of us. We asked for an upgrade to a Jr. Suite when we checked in and they could not accomodate us. There are only a handful of Jr. Suites and they are the only rooms that have full beach views. Although the resort, jungle and beach were beautiful, we would not stay here again. We were actually homesick by about the 4th day, something I have never experienced while on vacation before.","ratings":{"Overall":3.0},"author":"Alfonzo Streich","date":"2015-04-17 17:39:10 +0300"},{"content":"My husband and I stayed at the beautiful Iberostar Quetzal May 4th-May 11th. We are in our upper 30's. We have only stayed at one other AI resort in the same area. We have also traveled to Maui. We enjoyed the IQ very much. It was a lovely resort. The service we received was always excellent and with a smile. On Tuesday, the day we arrived we had our first meal at the main buffet. It was OK. The food on Wednesday was also OK. On Thursday, and throughout the week the food was excellent. Did they have better cooks the rest of the week? We made our dinner reservations at the Italian and the Steak restaurants. They were both very good meals. We both enjoyed the steak restaurant more. We felt the drinks were always excellent. The rooms were always cleaned early in the morning. I did request a room in building 21 on the 2nd or 3rd floor, with a king size bed. All of my request were met. I liked building 21 because it was close to the pool and beach. The only complaint I have about our room was the refrigerator was not very cold. They stocked our drinks daily. We did not leave the resort often. We enjoyed the resort so much, we did not want to venture out. We did one excursion with Alltournative Tours. We did their jungle tour. It was a wonderful adventure. We both enjoyed it very much. I believe Alltournative Tours is a reputable company but I did have one problem that occured. I had done a lot of research before our vacation, I had read a trip review or a travel forum, I don't remember, someone had booked a tour with Alltournative on their web. When the date arrived for their tour, they raised the rates on them. I booked my tour on line and made sure and printed the itinerary and the price along with save 10% if reserve on line. 24 hours before our excursion I went to our Lomas rep. to see if they would call for us to confirm our reservations, the lomas rep tried to tell me it was $20 more per person, than my printed copy. I don't know if Lomas or Alltournative was trying to get an extra $40.00 from us. I was greatful I had read that information before we left for our trip. I could have been in the same predicament as the previous traveler, but because I made a copy of the price, they had to honor it. The Iberostar Quetzal has a wonderful beach and a beautiful pool. I found the guests and staff to all be friendly. It was a terrific vacation. I would definitely stay there again.","ratings":{"Overall":4.0},"author":"Agustina McLaughlin","date":"2013-01-15 13:51:15 +0300"}],"public_likes":["Mrs. Jaqueline Dare"],"vacancy":false,"description":"Family run B&B and licensed bar.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}