{"title":"San Diego/Mission Beach-Pacific Beach","name":"Beach Hut Bed & Breakfast","address":"3761 Riviera Drive","directions":null,"phone":"+1 858 272-6131","tollfree":null,"email":null,"fax":null,"url":"http://www.beachhutbb.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":32.78764,"lon":-117.2398,"accuracy":"APPROXIMATE"},"type":"hotel","id":25240,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"Just returned from a business meeting that was held at the Biltmore. We upgraded to the Ocatillo, which in my opnion is worth the extra if you actually use the lounge. Here is what's included in the lounge: - Cont. Breakfast (mainly pastries, wonderful fresh fruit and yogurts). My only compaint was there was no real protein in the mornings. But excellent coffee. - Apps / light dinner: quite amazing food, really. Included things like mini quiches, wings, fresh veggies, mini cheeseburgers (yum) and plenty of nuts/snakcs - Desserts: fair assortment of rich but bite size goodies - Free wine/beer: this is bar far the best part. If you drink in the bars at the Biltmore, prepare to spend $12 - $15 / drink! They are amazing, but really? SO to grab a couple glasses of wine each night here really made more sense. The room we got was an ADA one (which I always seem to get). It was quite possibly the largest room (square foot size) i have ever been in. The walk-in closet could sleep 2 people alone! But they were missing a couple things: no floor length mirror anywhere; the bathroom light switch was outside the bathroom itself; very poor lighting in a large room. Good things included a nice shared patio that looks out onto the pool. A note about the pool: the bar here was never staffed. If you wanted service, you needed to go to the main pool or call room service. If staying at the Biltmore be prepared to walk a ways. The grounds are spread out but lovely! Also, I really enjoyed the yoga and highly recommend taking a class if you have the chance.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Hassan Labadie","date":"2012-11-13 23:15:48 +0300"},{"content":"We stayed at the Biltmore for a conference and it was really fantastic. I have to say if I had been paying the rates we paid with my own money I might have thought it was pretty pricey but all in all it was a very cool place. It was our second time there in the past 10 years and it is worth multiple visits. Fantastic grounds, pool, spa, golf course, tennis. Great areas for walks, bike rides, runs, etc. Location was good and overall a nice place. Try to stay outside the Inn part out on the grounds. Rooms were really just average but if you can get a patio to sit on you will be fine! Too nice to be inside anyway (at least in the winter months).","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Noah West","date":"2012-05-29 12:11:01 +0300"},{"content":"Three day stay as part of a business trip. Stay was five start in all respects. Particularly memorable was reception outdoors. Food was fantastic - service to match.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Juana Dickens","date":"2013-09-27 00:41:31 +0300"}],"public_likes":["Mr. Alejandrin Pouros","Guadalupe Torp Jr.","Santiago Shields","Rebecca McDermott","Broderick Metz","Jenifer Farrell","Iliana Pacocha","Weldon Lebsack"],"vacancy":true,"description":"Offering free on-site reserved parking, free Wi-Fi, landscaped pool/patio, queen beds, flat screened TV/cable, faux fireplaces.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}