{"title":"Yosemite National Park","name":"White Wolf","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$14 per night","geo":{"lat":37.870204,"lon":-119.648664,"accuracy":"APPROXIMATE"},"type":"hotel","id":33901,"country":"United States","city":"Tuolumne County","state":"California","reviews":[{"content":"Way Better Then Expected After reading several reviews on this site prior to going, I had my doubts about the selection. We went from 4-21 to 4-27. To start with, we have been to all-inclusives in Jamaica, Aruba, Turks and Caicos, and the Bahamas. The paradisus was one of the best my family has visited. I'll be honest, the resort seemed half filled, so I could see how service might be a problem for those who want it NOW. The Carribean move an their own time and the DR is no exception. Here are some points to consider:Airport Customs - A breeze, 20 minutes tops with luggage. Van ride to resort - They supplied our own van direct to Paradisus. Check In - 15 minutes. Room - Spacious suite and in fact the staf moved furniture so 2 beds coud be added so my kids had their own. It was cleaned dail and the free (well all included) mini bar was replenished daily with soft drinks and bottled water. ( You could ask for beer in the mini bar). Did not see one bug in the room in 6 days. Food - Above average at the Japanese, Sea food, Il Romantica and the Brazilian, below average in the Italian. The buffets? Hey they are buffets. What do you expect. There was 24 hour room service, so ffod was never and issue. You are not going to get big city gourmet here, but you should be able to find something. Bars - Top shelf premium booze ( Stoli, Absolute, Grand Marnier, Drambuie, to name a few) and a pretty nice group of bartenders, especially at the swimup bar. Nightlife - Some shows but not great, but ok. Beach - Best we have seen in the Caribbean. Clean with waves, big enough to boogie board. Plenty of beach toys to try. Pool - Large and was like bath water around noon, a negative was after the happy hour lots of empty plastic cups. Too bad the slobs can't pick up after themselves. Service - Yep they don't speak much English here, but the last I checked the DR wasn't an English speaking country. The staff, however tried to help you, if they didn't understand, they tried to get someone who did both on the phone or at your table or bar. Golf at Cocotal - Good course not too hard. We played 3 times and it was good. Note: a $33.00 per person cart fee is charged. The run a shuttle bus that takes 15 minutes including speed bumps. Kid's Activites - Not much compared to Beaches ( We stayed there 3 times). In fact pretty poor. Note that there was plenty of shaded areas around the pool and beache so you could get out of the sun. Overall - To each his own but we would stay here again no problem. We were treated well beyond what we thought based on the reviews here. Good Luck","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Domenick Yost","date":"2013-10-27 20:34:35 +0300"},{"content":"Beautiful resort for Europeans..... What a beautiful resort. I have never seen a better place. I want all Americans to understand a few things that are not entirely negative but surprising. One out of three workers speaks no english. One out of three speak a little. We were there 6 days and met 3 Americans and 3 Canadians who spoke english. The dinner food at the 10 restaraunts was incredible. Take long pants guys or you can't eat at the restaraunts!!! The Hibiscus buffet for breakfast and lunch was not great. Nothing was labeled on most days, and most food was odd to america. (tomato soup with squid and mussels) etc. Food safety is not known there. The grill cook gave me a fillet off the grill with tongs he just used to put raw fish, chicken and beef onto the grill. I put the meat back. We had money taken out of our zipped carry on. We reported it and were told it was our fault for not locking it up. Our bags and personal items were looked through daily. After the theft I did little things to see if they opened the bags and they did. The hotel manager never apologized. Bavaro splash was awesome but they sold a DVD of us snorkeling for $40 and when we got home it was not us. I think they need to update the staff before I would return to Paradisus.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Adalberto Koch V","date":"2014-10-08 03:42:38 +0300"},{"content":"Super!!! January 25, 2004What can I say that would pay justice to the Paradisus Punta Cana? Great rooms, pleasant staff, good food and premium liquors all included in the price. Its quite a large complex, but trams run continually and even more frequently during the rush hours. Most of the restaurants are located within a small area. Since we are American and used to eating around 7:30, and the Europeans eat later, we were able to walk into any restaurant we desired without waiting. There are so many good places to eat that it is difficult to rate one higher than the other. Ah, and then there is the golf course. Really nice by Caribbean standards. Three nine hole courses that are well kept and managed with precision. Playing the white and red nines from the white tees account for 6875 fun filled yards. Some holes are quite open and then on the other handsome are kind of tight. The workers will sell you all the balls you want for fifty cents each. The refreshment cart tends to only come around once in 18 holes so fill up when he comes by. We always made a sandwich at breakfast and took it with us to the course. Sounds silly, but it really hit the spot on the turn. Book your tee times before leaving home or you are liable to find yourself playing very early or very late. The shuttle from the hotel is always on time. It is a twenty-minute trip to the course over some roads that give new meaning to the word bumpy. You can store your clubs at the course for $5.00 for the entire length of your stay, which is the only way to go. The only down side is that it costs $66.00 to rent the cart each time you play. Well you didnt come here to save money did you? Tipping is OK, but no one has their hand out. We normally gave the kid who took care of the clubs a dollar a bag to clean them and he was always most grateful. As I say no one had his or her hand out.The casino at the hotel is nice, but the slots seemed a little tight. Video Poker took separate tokens and were fifty cents a pop. Black Jack started at $5.00 and moved up. Crowds were moderate and we didnt feel cramped. Only American money is accepted. Cigars were free, but they were not just lying around. You had to ask and then it took a minute as they had to into a vault, I think, but the wait is worth it. Very good, hand made cigars.We flew out of Windsor, Ont. And saved real dollars.We are going back next year!L.N. Detroit","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":5.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Rylee Green","date":"2012-03-31 02:35:20 +0300"}],"public_likes":["Rudy Abernathy I"],"vacancy":true,"description":"White Wolf is open only from July through early September and is located along the Tioga Pass Road.  The 74 sites are first-come, first-served for tents and small RVs up to 27' in length only.  Water and flush toilets are available.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}