{"title":"Barmouth","name":"Llwyndu Farmhouse","address":"Llanaber, Barmouth, Gwynedd LL42 1RR","directions":null,"phone":"+44 (0)1341 280144","tollfree":null,"email":"intouch@llwyndu-farmhouse.co.uk","fax":null,"url":"http://www.llwyndu-farmhouse.co.uk","checkin":null,"checkout":null,"price":"£45-65 pppn","geo":{"lat":52.7454,"lon":-4.0765,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":2484,"country":"United Kingdom","city":"Gwynedd","state":null,"reviews":[{"content":"I booked this hotel as a secret hotel on last minute.com. the description said it was 4 star - it was more like a backpackers. The room they gave me stank, it was dark, and so old and dated it felt dirty. I went shopping and was so upset with the booking that I immediately booked myself into the Sofitel Wentworth..not much more than I paid at the Pacific but soooo much better. Stay here if you are happy with dirty backpaker accomodation.","ratings":{"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Service":2.0,"Rooms":1.0},"author":"Ryan Powlowski","date":"2012-01-23 11:45:26 +0300"},{"content":"Hotel itself is ok. Easy location if you have to stay at the airport overnight. You can hear the planes come in and out but considering you are in between two runways it's really quite quiet. For the price they charge it's over the top. This is the only hotel really close to the airport so the price is hiked as no airport competition for prices. Charging for the internet is a joke. $S35 for 24 hours connection is also daylight robbery, especially when you have paid so much for your stay already. Staff were really unhelpful when we complained about this. They suggested my heavily pregnant wife should walk into the terminal to find free wifi. The rooms are only hard wired too even if you do have to pay the over the top charge. I believe the lobby area is wifi connected but didn't cave in to paying. Would not look at this hotel again when we have an overnight stop in Singapore. Would probably stay in one of the hotels out of the airport and travel in given the price they charge and what you get for your money. We got a night at a better hotel on Orchard Road, all meals included, free stocked mini bar, limousine collection etc for less than this place charges for a room for one night at the start of our trip, plus the hotel on Orchard had helpful staff. Not to mention the free and very fast wifi in all of the hotel! Crowne Plaza at the airport needs some nearby competition from another hotel. Overcharging big time for what they offer.","ratings":{"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Kraig Kihn","date":"2013-04-02 10:36:52 +0300"},{"content":"I had a day stopover and decided to stay here for a night. The hotel is literally next to the airport after you exited the arrival lounge. Checking in was straight forward. The hotel has a very nice designed unlike any hotels. I was upgraded to the suite which overlooked the pool. The pool area has very nice palm trees surrounding it which gives it a nice feel. The corridor leading to rooms are open and on lower floors there are water features along the corridor which gives it a nice atmosphere. The gym is of good size. I had a nice room with separate lounge and large work station to do my work. Wifi is included which is good. The bed is big and very comfortable. Bathroom is of the same size too with big bath, separate toilet and shower and his and hers tap. Overally I am very impressed with this hotel and the design. Very contemporary and even though it's near the airport you don't really hear the planes. I would recommend it!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Darryl Conn","date":"2015-01-17 08:04:05 +0300"},{"content":"We stayed last night and everything about this hotel just works. It was easy to find when you have just got off an 11+ hour flight, it was spotlessly clean and staff were polite, helpful and charming. We gave it 5 stars, but one small niggle was the tiny number of coffee/tea sachets in the room, I know they want you to pay and drink their tea in a cafe etc, but sometimes you need a bit of peace and a quiet cuppa, more would be helpful. All in all, would recommend this hotel to anyone on a stopover.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Madie Barrows","date":"2012-07-12 04:20:15 +0300"},{"content":"Had to stay here as we missed our connecting flight to Phuket. Rooms were very clean and tidy and roomy. Bed was a little hard though. Air conditioning awesome which we thoroughly needed when realizing how humid Singapore was. Food was average in the hotel though. Buffet style where we ate. Pool looked excellent, unfortunately our stay wasn't long enough to swim. Great hotel for an airport hotel.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Lacey Conroy","date":"2012-08-31 14:44:42 +0300"},{"content":"It's location on the airport is great for early flights. Rooms are wonderful, Staff is polite and helpful. I can't really think of anything that wasn't exactly the way it's supposed to be. It might be a little on the expensive side, especially when you consider that neither internet nor breakfast is included. Speaking of breakfast - it's expensive, but unusually nice with a nice asian twist to it. All inn all - if you can afford the 3-400 SGD per night, you will enjoy this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Carmella Goyette","date":"2012-03-16 16:32:36 +0300"},{"content":"I am regular visitor to Singapore my country of birth. For the past 2 years or so I have been staying 1-3 nights at the Crowne Plaza Changi (Airport) on each of my trips to the island nation. My last stay was from 26/1/12 to 29/1/12. I would like to share my experience of it with fellow travellers here. The CPC is located at Terminal 3 of the Singapore Internation Airport. That makes it a very convenient place to stay for traveller in transit for a few (1-4) days. It's makes checking in to the CPC on arrival and checking in for departure flight a breeze. The ambience of the whole place is one of quiet and relaxed pleasantness. The rooms are generously spacious well laid out and contemporarily furnished. It has a beautifully landscaped pool with a in-pool tropical palm treed garden. It's a great pool to spend a hot Singapore afternoon in be it for a leisurely dip or swim laps. It's principal restuarant The Azur serves lovely food with friendly staff service. Most importantly the CPC has fantastic staff team that is the backbone of its operation. They are not just polite but are friendly, engaging and endevour to develop a rapport with their guests. The guest relation team in their Club Lounge is like their A-Team in guests relation. The CPC staff hospitality is the single most important reason for my loyalty to it. The subway station (Singapore Mass Rapid Transit system) is directly below the hotel amd provide easy access to the main shopping district and all parts of Singapore. But if one does not want to wonder far for some light shopping there is a new shopping mall (completed end 2011) just one subway station away. It's call the Changi Point Mall. Also all the 3 terminals of the airport interlinked by unmanned light rails are good for very light shopping and food experiences. There are foodcourts (great for local tastes and MUST TRY), cafes and restuarants. In summary I have no reservation at all in recommending the Crowne Plaza Changi in Singapore to all who visit the island nation. Be it for business and or leisure. Eng Soh Sydney Australia","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Wilton Kerluke","date":"2014-01-23 22:07:20 +0300"},{"content":"This hotel is attached to Changi airport. Unfortunately it's only attached to Terminal 3 so you might need to push bags and trolleys around for a while if you arrive at any other terminal - not the hotel's fault. Guests are mostly passengers in transit and airline crew between shifts. The room we had was OK but the hotel does not provide free wireless broadband - an anomaly in a city where wireless access is ubiquitous. If you do want free wireless just wander into the airport building. Other reviews seemed most approving of breakfast - our impression was different. There was 1 coffee machine which spat out a very small amount of coffee and had a digital screen telling guests that there was no milk and staff which we would expect to be there to help in this situation were not visible except at the entrance. Evidently more importance is attached to your right to have breakfast rather than the breakfast itself - fried eggs prepared some time before you ask for one and therefore having the consistency of rubber - toast machines set so low that you get warm bread instead of toast -even asian breakfasts were very poor as there was no decent rice porridge nor any tasty noodle dishes. We can't believe the favourable reviews for breakfast here. Maybe we were just unlucky. The check-in desk for Singapore/Silk air was a definite advantage but it is not available before 10:00 am. Like many others, we chose this hotel because we were travelling elsewhere and near airport accommodation seemed more convenient. It's a pity the breakfast was so poor.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Sylvan Lemke","date":"2012-02-08 19:29:17 +0300"}],"public_likes":[],"vacancy":false,"description":"A traditional farmhouse B&B, with the main building dating back to 1581. Its elevated position boasts fabulous views of Cardigan Bay and Lleyn Peninsular. The farmhouse accommodation comprises of three double en-suites and The Granary has two family rooms, a double and twin (all en-suite). Evening meals served. Accolades include; Visit Wales 4* Guest Accommodation, Trip Adviser Certificate of Excellence 4.5 points, AA Diner Award 2014 and Best British Cheeseboard.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}