{"title":"Bala","name":"Ty Newydd Bala B&B","address":"12a Cae Gadlas, Bala, LL23 7AT","directions":null,"phone":"+44  1678 520964","tollfree":null,"email":null,"fax":null,"url":"http://www.tynewydd-bala.co.uk","checkin":"16:00","checkout":"10:00","price":"£68-70","geo":{"lat":52.911184,"lon":-3.604194,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":1573,"country":"United Kingdom","city":"Bala","state":null,"reviews":[{"content":"I truly loved the Trump in Las Vegas. When we first came in to the lobby we could smell lilies, see crystals and chandeliers everywhere. When we reached the desk the Trump staff offerd us an uppgrade for 50 dollar per night and we are SO HAPPY that we accepteded it. We lived on the 55 floor with a great Strip view, worth every penny! We had two bathrooms, a great kichen, 3 tv:s, and a jauzzi. Because you must pay a resort fee you can access a heated pool even in winter time, a workout place and free SPA at the TRUMP. There is no casino in the TRUMP witch was very relaxing for us. Just across the street there is the fashion show mall with great shops and if you want to eat breakfast just go over to Wynn they have THE BEST BREAKFAST IN VEGAS, 20dollars for one person but it is worth it! The resort fee in TRUMP does not include the Internet witch is the only bad thing about this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Fermin Champlin","date":"2015-10-29 11:53:46 +0300"},{"content":"The front desk staff made me feel like I was lying. I booked a trip through Travelocity which included a $50 credit for the spa and a 4pm check out. However, I had to prove it in writing to the clerk. Secondly, the city view suite was awful. All I heard all night was the freight train going by. The showerhead had some filthy white stuff on it. Overall experience was awful.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Location":3.0,"Rooms":3.0},"author":"Imelda Green","date":"2014-09-15 01:39:05 +0300"},{"content":"Brought the wifey here for a surprise trip in August. She is very particular and likes to be pampered in a very clean and luxurious environment. This place was just right for what I was looking for. Property: No casino. It is what it is. If you want one, you can go to one. If you must have one in your hotel, well then, stay elsewhere. Didn't try any of the restaurants. Prices at the spa are obscene, even with our included spa credit, unfathomable. The gym was somewhat small, but decent...didn't use it. The pool was alright, rooftop style about half way up the building, but it was only about 4 feet at its deepest point. DJ kinda sucked, but it was def the club/party type scene with beautiful people getting good and toasty. Room: OMG, this is what it's about. You get a fridge, microwave, ipod dock, and best of all a hot tub! Fit both of us, I am big, she is not. The in mirror TV was alright, but hard to see from the tub. The bed was amazing comfy and the robes almost came home with us. They do this private entrance thing with a foyer for two adjacent rooms. It was pretty cool and probably reduced some hall noise. So clean, elegant, and perfect! Service: Well you pay $15/day for it, so I guess it was pretty good. We didn't have any problems, so I guess that is cool. There is only a valet option, so I guess it all balances out with the complimentary valet service. They did bring out free shots for the people at the pool though and it seemed like everyone got them except for us. They just kept skipping around us. Location: Well, its a bit off the strip. There is not much immediately by there. The Wynn is down the street as well as the mall with some decent looking restaurants. There are some liquor stores and pharmacies a few VERY long blocks away, but nothing too close. Although it was easy enough to just drive down to the casinos, park for free and walk around, it was kind of a pain to deal with traffic and parking every time we wanted to go somewhere and there is not much at the hotel itself. If you are drinking, you will have to take a lot of very expensive cabs around because there is not much to do there. Value: This place was perfect for us and really served our purposes. Considering its a 5 star, we got a ridiculous deal online for just about $79/night. When you factor in the $15/day though, it could be less of a good deal at times. The rooms were just too good to be true though. I absolutely would stay at this place again, especially if I could get it for less than $100/night before the resort fee. Definitely worth the driving for the luxury you receive in return.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Max Fadel","date":"2012-06-27 22:31:32 +0300"},{"content":"summary: while the rooms/lobby were top-notch, the service cannot be considered five-star especially compared with truly five-star hotels like the four seasons. i give this hotel 4-stars while my wife gives this 3.5-stars. especially the train noise would be a deal-breaker for many including us. pros: nice spacious room. comfortable bed. clean. kichinette is a nice plus. my wife thought the spa was nice....small but had all the necessary amenities. good deep tissue massage. friendly staff restaurant food was decent. decent cocktails. relatively inexpensive room rate. con: slow service.....faucet handle was broken and it took almost an hour and a second phone call before this was resolved. we were on 34th floor and yet can hear train horn in the middle of the night which was loud enough to wake me up. (may be you would hear the train noise if you booked a strip-view room instead of a city-view) location is not really on the strip although it is close to the strip. i didn't like that there was no option for self-parking....i don't mind valet service if the parking staff can retrieve cars fast but i can see how this can be a problem when there are so many people who want their cars at the same time.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":2.0,"Rooms":4.0},"author":"Thurman Kihn","date":"2015-02-16 01:16:40 +0300"},{"content":"My wife and I decided to extend our trip by one night and when I contacted the Bellagio about extending our reservation they were near capacity and it was going to be over $400 for the most basic room. As we were flying in late at night it was more important to us just to have a good night's sleep in a nice place. The Trump Tower was the perfect answer- easy to check in- attentive valet service- beautiful room and a ridiculously low price. The bed was amazing and it was especially quiet in the hotel. There is no casino and it's actually just off of the strip so there is less noise. If the casino scene isn't to your liking but you still want to be close to everything, this is a great place to stay. Our room had a seating area and a kitchenette. The bathroom was huge with one of the larger jetted tubs I have seen in a hotel. This hotel has all of the extras that you expect in a 5 star hotel- high equality linens, TV in the bathroom mirror, beautiful lobby, etc. The next day we checked into the Bellagio for 5 days, but lamented that as much as we love the Bellagio- the beds didn't compare to the Trump!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Deangelo Rosenbaum","date":"2013-07-13 21:09:41 +0300"},{"content":"We stayed in Trump hotel Las Vegas for 5 nights and we were blown away with the quality of this hotel. We knew before we went about the resort fee as everybody booking this hotel knows and found this to be o.k for the service we got which was outstanding. The rooms were the best I have seen and I have been all over the world. The Staff were friendly and professional. We will definitely stay there again. What a property.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Eino Towne DDS","date":"2013-01-19 04:17:11 +0300"},{"content":"we stayed here a couple of weeks back. the hotel was nice not bad. but they only have 1 bed per suite ( wtf) what about people who have kids who dont want to sleep on the couch? it was no big deal. i was traveling with my mother and it was our vacation i asked the hotel for 2 doubles but they said they didnt have any but the sofa i said fine. we went up to the room it was wonderfully furnished and there was even a kitchenette there with utensils and fridge LOVE THAT! and a microwave! and coffee maker!! excellent!! anyhow only complaint was the sofa and since i got it on priceline it was even cheaper! but my fave is still the venetian! btw no casino in the hotel which i found refreshing and not noisey. it is pretty close to the wynn so we liked that","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Jaylan Strosin","date":"2013-10-12 18:40:32 +0300"}],"public_likes":["Jaime Bode","Layne Nolan","Maryjane Kovacek","Beaulah Heaney","Katharina Prosacco","Lillie Boehm","Mikel Jast","Ted Lang"],"vacancy":true,"description":"Offering two double rooms, one with en-suite and one with its own private bathroom. Decorated to a high standard all rooms have a colour TV, wireless internet access with tea and coffee available on request. Off street parking is also available. Ty Newydd has a no smoking policy throughout.","alias":"Ty Newydd Bed and Breakfast Bala","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}