{"title":"Llangollen","name":"Geufron Hall B&B","address":"Geufron Hall, LL20 8DY","directions":"Please see website for directions","phone":"+44 1978 860676","tollfree":null,"email":"enquiries@geufronhall.co.uk","fax":null,"url":"http://www.geufronhall.co.uk","checkin":null,"checkout":null,"price":"£50-130","geo":{"lat":52.9768,"lon":-3.1633,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15965,"country":"United Kingdom","city":"Llangollen","state":null,"reviews":[{"content":"We arrived on Saturday around 430p. There were only a few people ahead of us in line, but I believe we arrived after the crowd. Our luggage was sent up to our room in the next elevator after us. We stayed one night prior to a Carnival cruise and chose this hotel only because we could walk our bags across to the port. You are only able to walk to the Carnival port, if I was taking another cruise line, I would stay elsewhere and cab it. The staff was friendly and as accomidating as they could be. Rooms were clean and ours didn't have a view, but than again we didn't pay for one. I feel they do upgrade you and are nicer when they are less crowded. It seems at times they don't have enough staff working to accomidate the crowds and a lot of tension comes from that. Also, they only have 2 elevators so it takes a lot of time to get to and from your room and we happened to be on the 9th floor, so taking the stars each time was not always an option. We had them hold our bags after we checked out and it did take about 30 minutes for them to bring them to us. The hotel was a mad house sunday from about 1030A and it still was when we left at 1230p. I'm use to paying alot for drinks, I live in Chicago, however the drinks in the Burger place were outrageous and most of what we had were the local beer.","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":3.0,"Location":4.0},"author":"Ceasar Kuphal","date":"2012-03-10 22:26:03 +0300"},{"content":"The Sheraton Old San Juan exceeded my expectations in most areas. We arrived mid-day on a Friday. Check in was a little disorganized due to simultaneous, convoluted problems with two group check-ins. However, our king suite was exactly as billed and our Starwood points were properly credited. We were on the 4th floor and had a great view of the bay and any cruise ships that came in. I would note that the balconies that come with the rooms are tiny. One or two people can stand outside the doors; otherwise you need to leave doors open if you want to have a chair in the balcony area. Our suite was spacious and very clean, with the usual Sheraton bed and amenities. We set out to hit the town right away, and discovered the biggest drawback of the hotel - - the elevators. The one on the right only worked intermittently, and they both were pretty slow. We tried to use the stairs with mixed results. One stairway led us to the street; another required us to exit through the restaurant's kitchen. The Sheraton's location can't be beat. We were a half block from Senior Frog's. Given the strength of the drinks there, that is the maximum you should try to walk afterwards. P.S., while Senor Frog's makes a lot of of drinks with a specific purpose in mind (incapacitating the customers), I got a great 1800/Grand Marnier tequila there, and thoroughly enjoyed the antics. A lot of locals go there, and I noticed most of them wisely stick to beer. Some of the best restaurants, Parrot Club, Aquaviva, and Dragonfly, are only a couple of blocks away, and we walked virtually everywhere in Old San Juan, including the El Morrow Fort. There is also a nice brew pub/steak house (Old Harbor) that is only a few blocks away. Cafe El Bombenara was an amazing old school place, with fantastic cafe con leche and great malloracs. We stayed here three days and I can't imagine a better place to stay to explore this area. There are also taxis aplenty, so commuting to other areas is easy as well. I enjoyed the Sheraton's Casino a lot. The drinks are free and they have abundant and vibrant live entertainment at night. Also, there are a lot of locals who come here and the scene is great. I just played slots and found them to be pretty fair. The pool is small, but it's located on the roof and has great views. It is a fun area during the day, and you pick up on the excitement of people waiting to go on cruises and get advice from those who just came back. Our favorite nightspot was the Parrot Club, which had the best drinks in town (we put this matter to the test). The signature Parrot Punch was very good, but the mojitos were beyond compare. Our bartender, Anthony, could well be dubbed the Ambassador for Puerto Rico. My wife and I have never met a friendlier person in all our travels, and he made fantastic drinks and guided us through the menu with aplomb. His insights on both the area and country were much appreciated. We loved the food at Aquaviva. This is a great seafood place with an intimate atmosphere and good vibe. Check out was a breeze, and our bill was accurate. Enjoy this place. I have tried to accurately convey the details, but really the overall experience was great. If you want to stay at the Ritz and lounge on a beach; stay at the Ritz If you want to see Old San Juan or take a cruise, the Sheraton can't be beat for its location.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Shanel Fisher","date":"2012-04-17 07:52:56 +0300"},{"content":"This hotel is pretty mid-level. Although our stay included some hotel related injuries, the location is prime. We picked the hotel because of its close proximity to the pier (as we were taking a cruise). The location is perfect if you plan to take a cruise sailing out of old San Juan, as it is literally steps away from the pier. This was highly convenient. The bar and gill attached to the hotel and casino is great. They have great drinks, but the service is slow. Its a nice place to read a book or lounge around and people watch (when you aren't in a hurry). We actually ended up spending about 3 or 4 hours there after we checked out of our room (and we didn't want to wait in line to get on our cruise). While the wait staff is on the slow side, they make up for it with unexpected attentiveness- i.e. going out of their way to light your cigarette for you. The casino was sub-par. Not very interesting and I was nearly accosted by an over-zealous security guard who wanted to check my ID. He kept saying \"ID! ID!\" and then when I said I was staying in the hotel and started to look through my handbag for my ID and room key, he \"Puh!\"-ed me away and shoo-ed me. The gaming is just not worth it at this casino. The picture of the roof top pool are pretty deceptive. Its TINY, but has a good view. As always, with a hotel, watch out for the hot tub. My party and I went up all geared up for a soak, only to find a nasty couple making out in there and god knows what else yuk- so we didn't go in. BEWARE OF DOOR STOPS OUTSIDE THE BATHROOMS! Two people in my party were injured (one VERY badly). The door stops outside of the bathrooms were placed WAY too far out from the wall. We had to put the ice bucket over it since everyone kept tripping over the stupid thing. The rooms were just Meh. We had a wonderful view of a parking garage from our window. The room was clean, but nothing special at all, just your run of the mill bland, exactly what you expect from an airport hotel. The front desk staff was very friendly and helpful. Also we enjoyed the bell boys, they were very friendly and gave lots of good advice.... Also if you stay in this hotel, you MUST MUST MUST eat dinner at Aquaviva (a few blocks behind the hotel). One of the best meals of my life!","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":5.0},"author":"Kraig Volkman","date":"2015-11-14 23:31:15 +0300"}],"public_likes":["Garrett Koch"],"vacancy":true,"description":"Geufron Hall is a five-star contemporary country house B&B situated high above Llangollen, nestling in the shadow of Castell Dinas Bran. There are four ensuite bedrooms offering free internet access, a sitting room, dining room and the use of the paved terraces and access to the extensive gardens. Geufron Hall has been featured in Tatler, Country Living, The Week, and many other regional and national magazines and newspapers.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}