{"title":"Paris/15th arrondissement","name":"Pullman Paris Tour Eiffel","address":"18 avenue de Suffren","directions":"entrance is from 22 rue Jean Rey","phone":"+33 1-44385600","tollfree":null,"email":"h7229@accor.com","fax":"+331-44385610","url":"http://www.pullmanhotels.com/gb/hotel-7229-pullman-paris-tour-eiffel/index.shtml","checkin":null,"checkout":null,"price":"Room-only rates starting from €205, breakfast is €25 per person","geo":{"lat":48.85549,"lon":2.29264,"accuracy":"ROOFTOP"},"type":"hotel","id":21657,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"If you want a nice room with no frills stay here. The prices are very good. The only complaint i had was a 100 dollar charge that was put on my credit card by mistake. I couldnt get in touch with a manager to fix this problem and they wouldnt return my calls. Took them a week to fix this but its done now..Thank You! I did stay at the Gold Spike last year and the El Cortez beats them hands down...I wouldnt send my dog to the Gold Spike.....Do yourself and your wallet a favor and stay at the El Cortez. ....SEE YOU NEXT YEAR !!","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":1.0,"Rooms":5.0,"Location":2.0},"author":"Eldridge Schimmel","date":"2015-09-22 11:14:34 +0300"},{"content":"I accidentally left cash in my room after checkout (I know that was my fault) but I realized it before the room was cleaned. When I called and explained to the front desk, they said I needed to speak with housekeeping. However, I was given the run around. By the time someone finally connected me with housekeeping (hours later), they claimed there was no money found. The person I initially spoke with should have sent someone (or gone themself) to the room immediately to retrieve the money. But, it seems like they saw this as an opportunity and they really didn't care that I had left it. Also, hotel's kind of old and decrepit and out of the way; didn't feel like a safe area.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":1.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":2.0},"author":"Rylee Heathcote","date":"2014-04-22 12:12:13 +0300"},{"content":"Book online for very cheap rates. Rooms were spacious and clean.With safebox. Located right on Fremont Experience, downtown Las Vegas. No frills, clean and relaxing hotel with casino. Our room had a great view of Vegas and the Strip. Staff were friendly and helpful.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Ardith Ankunding","date":"2014-09-08 17:49:26 +0300"},{"content":"Stayed three days at the El Cortez and absolutely loved it. Did a walk thru over fifteen years ago, and boy has it changed! Stayed at their Pavillion across the streeet from their main casino/hotel and would highly recommend it. Was a bit leary about being at the end of the Freemont St. action and across the street from the casino/hotel, but my fears were set aside by the fact that a security guard was posted outside the Pavillion and another male figure directly inside the first entry door. You must also use your room pass card to access the building. Room had 42\" flat screen, pillow top bed with three king size pillows, mini fridge, coffee maker and deluxe super huge shower, wow. My first ten minutes in the casino I hit on the Double Diamond quarter machine, fity cent bet got me two hundred dollars in quarters. Fun! Their loose slots were mesmerizing. HIt again at the last minute when I had to leave the hotel on their free shuttle to the airport. I was pleasantly surprized to find that shuttle was a comfy Lincoln and not a busted up passenger van. Any problems with my room were remedied ASAP. Employees were cheerful and very accommodating. Service in 24 hour cafe was quick and sweet. I would recommend this hotel/casino to everyone, including solo older females like myself. Give it a twirl.","ratings":{"Overall":4.0},"author":"Terrell Gutkowski","date":"2013-12-27 06:58:25 +0300"},{"content":"I would definately stay at the El Cortez and I would gamble there. Its old school Vegas and 80% of the clientele are locals. Two thumbs up for the Double Attack Black Jack.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":2.0},"author":"Barbara Schmitt","date":"2014-04-19 04:45:25 +0300"},{"content":"We found this hotel while searching for a cheap place to stay during our trip to Las Vegas. The hotel is located in the Las Vegas UpTown and the main strip is very accessible from here via public transport. Staying here have us the opportunity to explore the Las Vegas uptown, which many travellers skip. The hotel is very cost effective and the rooms are also fine for the dollars paid. The staff is very courteous and helpful as well. The staff even arranged for a free drop to airport at the end of our trip.","ratings":{"Service":4.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Greyson Boehm","date":"2013-04-05 16:41:12 +0300"},{"content":"Just returned from a two night stay at the El Cortez on a comp I received in the mail. We had a Queen Double in the Tower - Room 614 at the end of a hall. The room was huge! It was nicely appointed and very clean. The bathroom is very small, so if you need a big bathroom, don't stay here. It was quite adequate for the 3 of us tho. We ate a Cafe Cortez for breakfast twice and dinner once. We thought the food was very good, with a very good selection. Service was a bit slow at times, but everyone that worked there was very helpful and friendly. The casino is quite big and spread out. They have the usual table games, with Black Jack at $5 a hand. They have loads of new penny machines and video poker machines in all denominations. Their dollar and quarter slots are very, very old and there is almost NO selection in the quarter range. They really need to get these updated! Many of the older machines were very, very dirty. Maybe there are plans to get new machines and this might be why there is no upkeep on them, I'm not sure? I basically just played video poker, but really would have liked to play some quarter slots. All in all, we had an excellent time! I certainly would stay there again and look forward to doing so on my next trip.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Humberto Metz","date":"2012-12-19 11:01:18 +0300"},{"content":"Pretty good, cheep price. Things were clean and I can't say I have any real complaints per-say. I went, just to say I spent the night here. This was Mob owned back in the late 1940's. Saw the Rat Pack is Back show down the street, drove around town, ate, lost 40 buck in under 2 mins. on the strip. Good times.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Location":4.0,"Rooms":3.0},"author":"Carmella King","date":"2012-07-09 13:24:37 +0300"},{"content":"This was my first stay Downtown and I decided to book the El Cortez on the word of other TA Members who had stayed there. I had no idea what to expect. When I got to my room, I was pleasantly surprised. I thought the room was big and liked the layout. I had a one bed tower room that had a great view of the Strip and mountains in the distance. The only thing I could see someone having a problem with is the height of the shower. I'm short, so it was OK, but a tall person might find it annoying. Everyone I met during my stay was friendly and the casino had a \"homey\" feel unlike the huge Strip casinos. I never felt that it was unsafe in the area outside of the casino. For anyone who really likes all the glitz of the Strip, this may not be the place for you. It's not \"glitzy\" at all. I would stay there again.","ratings":{"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Jermey Reilly","date":"2015-04-15 03:07:49 +0300"}],"public_likes":["Barbara Metz","Brando Ortiz"],"vacancy":true,"description":"The former Hilton was taken over by Accor's upscale business hotel brand Pullman and underwent extensive renovation to its rooms and public spaces. It continues to offer close-up views of the Eiffel Tower from the balconies of its relatively spacious for Paris Deluxe (32 sqm) and Superior (26 sqm) rooms, while the Classic rooms (26 sqm) face the courtyard.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}