{"title":"Lymm","name":"Mere Court Hotel","address":"Warrington Road, Mere, Knutsford, WA16 0RW","directions":"Leave M6 at junction 19 and follow the signs for the A556 towards Manchester (M56). After approximately 1 mile, turn left at the cross-roads onto the A50 towards Warrington. Mere Court Hotel is situated about a mile along the right hand side.","phone":"+44 1565 831000","tollfree":null,"email":"reservations@merecourt.co.uk","fax":null,"url":"http://www.merecourt.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.34397,"lon":-2.43,"accuracy":"ROOFTOP"},"type":"hotel","id":37318,"country":"United Kingdom","city":"Cheshire East","state":null,"reviews":[{"content":"Nice hotel. We loved our room. It was on the 3rd floor with a nice balcony. We were in bldg 26 and faced the center of the resort. Lots of privacy. The animals were entertaining. We watched the monkeys walk along the cover walk's roof line before climbing into the trees. There were loud but only a few calls in the morning. The flamingos weren't that bad where we were either. The annoying noise was from the entertainment that went past 11pm. It was very loud even with our patio door closed. We didn't attend any of the shows and from the sound carried to our room we didn't miss much. Food was good. There was a wide enough variety that we had plenty to choose from and ate well. We spent most of our time at the beach which like other posts have said it has eroded. It looked different each day we were there. There were attempts to pump sand back up to the beach to keep it in place. Some of the resorts along the beach faired far worse for beach erosion than this one.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Alexis Bruen","date":"2012-04-03 17:59:01 +0300"},{"content":"we stayed at iberostar quetzal in july 2007 and our stay was ok. the rooms are sensored so when your not in the room the aircondition turns off. and please do not feed any of the animals because u will have early morning wake up calls without asking for them. the hotel staff was excellent. the hotel club was nice and airconditioned which is a plus. star friends are amazing and there are plenty of activities all day everyday. the spa is very relaxing and beach is beautiful. plenty of alcohol all of the time and the swim up bar is very cold which is a plus since everything else with water is warm. the food is ok. it gets to be annoying eating the exact same thing over and over again. the specialty restaurants are not that great. except the fact that your eating in an airconditioned restaurant. which is awesome. the only excursion that i did was taking the ferry to cozumel and taking a snorkeling trip directly from iberostar cozumel. what a disaster the boat broke down, plenty of diesel fumes for everyone.. people pewking on the side of boat. (including people from our own group) the throw us in the water and tell us to swim to reef to fish 45 minutes and we are still swimming and now exhausted and we are still not there. we ask for a boat to take us back to the shore and we are still on our diesel smelling boat but now a larger boat is tugging us to shore while they are making fun of us. god aweful experience......","ratings":{"Service":5.0,"Cleanliness":3.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":3.0,"Value":5.0,"Rooms":2.0,"Location":5.0},"author":"Frances Mante","date":"2014-05-18 20:00:31 +0300"},{"content":"hi just returned from the ib it was gr8 they made our stay very enjoyable and relaxing no problem 2 small. when we arrived we did not like our room so we called the front desk a bell boy was sent out moved our luggage 2 another room very pleased. the buffet is ok however no matter how good it can b it still gets old so here r a few restaurants for u el fogon is a gr8 authentic mexican place 30th and 6th street , maccroni is also a gr8 italian 6th street and fusion is a relaxing place 2 eat right on the beach. all 5usd from hotel. dnt pay more!!!!!! the guys at the dive school r gr8, really no playa del carmen so if u get board ask them for a few ideas. the beach is amazing and the pool is gr8 2. watch out for the deep sea fishing of the beach it is awfull. the grounds r brilliant real sence of being somewhere really special. the trips r awsome u have 2 c the mayan ruins i will let u decide witch 1's tho tulum and chichen itza r well recomended. the drinks r gr8 b sure 2 ask for the real deal tho otherwise u will gwt the house brands tht will not make u feel 2 good in the morning. we arebooking 2 go back shortly.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Alexander Boehm","date":"2013-09-11 23:38:43 +0300"},{"content":"Most of the reviews I have read on here are pretty accurate. The people that gave this hotel low marks were probably comparing it to a 4 or 5 star hotel which doesn't make a lot of sense. I'll just touch the highlights of what we liked and didn't like. We stayed at the Quetzal from 10/7 to 10/12 and overall we had a great time. My wife and I brought our three year old with us and met another couple there with there three year old. Ok so here are main points: * Restaurants and food were great. Don't know what some people were talking about about the food being bad. The two pool restaurants did have lower quality food and a smaller selection than the bigger buffet and sit down restaurants though and we did get tired of eating there. The hours were kind of weird though. They are kind of set up more like cruise line with regards to having set hours for meals. Got to the restaurants other than the pool ones and you can't go wrong. * Drinks--This one was a biggie for me. One of the reasons you pay for all-inclusive is to get your drinks and not have to worry about getting nickled and dimed to death. Three things I did not like about the drinks: 1) They were VERY watered down. You could ask for more liquor but it was a pain and hit and miss. Very annoying and obvious. 2) The drinks were poorly mixed and inconsistent. Depending upon which bar you went to and which bartender you got could mean the difference between a lemon icee and a mediocre Margarita. 3) You usually had to get your own drinks. Other resorts I have stayed at (4 or 5 star) constantly had people walking around asking you if you wanted another drink--you never even had to get up. Here you spent a good deal of time waiting in line for poorly mixed drinks. * Service was impeccable. These people really go out of there way to help wherever they can. If you throw them a few extra bucks for tips (especially you chambermaid) it goes a long way towards added service. * Grounds were awesome with all the animals and they were neatly manicured. Great pool and beach. The hotels next to us which were a higher class had their beaches destroyed by the last hurricane and hadn't taken time to rebuild them. The Quetzal beach was well kept to say the least. * Clientele was largely European. Many of them are heavy smokers and in my opinion, rude and inconsiderate. We were hanging out at the childrens' show and all these Europeans were puffing away with all these little kids around. Not to mention the topless women on the beach (many of whom should not have been, in my opinion). It really made pictures with my daughter challenging to make sure some of these people were not in the background. Thankfully they were not allowed to go topless at the pool. * The beds--This deserves its own section. These things were more than just firm. Basically a super firm mattress on a block of concrete and really small uncomfortable pillows. If you stay here I would suggest you bring your own pillow. We requested an egg crate but they were out and gave us another blanket which did not help enough. I know I stated a lot of negatives here, but for a three star hotel we were pretty happy. Mostly just the drink thing irked me. Overall I would recommend this place for families and couples.","ratings":{"Service":4.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Corene Berge V","date":"2015-08-09 15:06:07 +0300"},{"content":"Family of 7 ages 18-50,arrived on Friday 8/17-8/24. Hurricane Dean tried to ruin it for us, but we stayed through it all and were only inconvenienced 1 day, glad we stayed.Quite exciting to be part of that whole ordeal. We all thoroughly enjoyed everything about Iberostar. The food was great. I must say after reading complaints about the buffet, we found no problems with the huge variety. Our fav's were the Italian and the Mexican restaurants. The rooms were always clean, and fridge restocked, if you want great service try tipping these hard working folks. It's worth a few $ each day to show your appreciation. It seems like the drinks were a bit weak but you could drink beer and wine for the full effect. The bar on the beach and the one in the hotel lobby were the most accommodating. The shows in the evening were a bit on the corny side, but fun to watch. The beach was awesome and the pool was great. Get up early to reserve chairs at both. Nearby, Xel Ha was a disappointment for snorkeling. Ruins: Tulum ok, take the time to visit Chichen Itxa. We'll be going back next spring for sure!","ratings":{"Overall":5.0},"author":"Enoch Kiehn","date":"2013-10-06 06:10:16 +0300"},{"content":"This was our fifth trip to Playa Del Carmen, but our first with our son who is 1 year old. And, I have to say, unfortunately, the first time we have been to a resort in Playa which we were unhappy with. After much research, we decided to stay at the IB Quetzal, mainly because it has the reputation of being such a family friendly resort. Travelling with such a young child, we wanted to be sure they had areas and pools just for small children. We were not impressed. The pools are hot and almost unbearable at times (this was especially true for the kiddie pool), and unless you get up early and reserve a lounge chair by the pool or beach (which it technically not allowed) you will probably spend most of your day with no where to sit. I have never had this problem at a 4 or 5 star resort in Playa or anywhere else for that matter. Next is the food. Now, I am a picky eater. However, on our previous trips to Mexico (9 total) I have never had this much trouble finding something that seemed edible. My husband is not a picky eater at all, and he found a few things he liked, and ate the same things all week. Their breakfast and lunch buffets are the same daily, so don't expect a change. There were a couple of evenings when dinner was good. Other than that, we spent our time on 5th avenue for dinner. The rooms are large and spacious, however the beds are the hardest I have ever felt. We called and requested an egg crate pad, and truly don't think we could've made it through the week without it! It was like sleeping on a concrete bench! One more note...our power went out in our room 3 times!!!! Twice early in the morning, and once when we were getting ready for dinner. Luckily we had friends a few doors down, and we finished getting ready in their room. There is just no excuse for this at this type of resort. The only explanation I received was \"sorry\". While the property is beautiful and well maintained, it leaves much to be desired. In our experience it just isn't up to Iberostar standards, and with so many choices in the Playa/Playacar area we won't be going back here again. I know many people love this place, it just wasn't for us!","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":3.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Ora Steuber","date":"2015-03-24 07:48:49 +0300"},{"content":"We just got back from the Iberostar Quetzel with our three teenagers, ages 16, 17, and 19 on June 6th. Everyone had a great time and loved the Quetzal. The beach was great, plenty of chairs and palapas, and if you could not get a palapa, you could easily get an umbrella from the towel hut with no problem. We LOVED the jungle part of the hotel! It was nice to walk by it every day and see all the animals - monkeys, peacocks, Swans, Peking ducks, flamingoes, etc - in fact, that is why I booked this hotel because it was so different. The people that work here are such hard-working people - you never saw any of the help just sitting around, and it showed, because the hotel was very clean. The rooms were comfortable, the beds were very hard, but I'm used to it at home, so it wasn't a problem. We always came back from the beach with a very clean room and with towel art on the bed and flower petals etc. It was a nice touch. My husband and I went to the Riviera Maya for the first time in February and stayed at another hotel. The Iberostar is a MUCH better choice all around. The food was much better too. We ate at the Japanese restaurant and the Steakhouse. Both were good choices. Our kids, who are not adventurous eaters, had to be convinced that there would be more than just Sushi at the Japanese restaurant. They were pleasantly surprised. In fact, it was their favorite restaurant. Breakfast was the best at Cozumel, we thought, so we ate there every day. The buffets by the pool were OK, still better than the other hotel we stayed at, and some of the selections changed every day, which was nice. We went outside the hotel on a few 1/2 day excursions. We did the jet ski/snorkeling trip one day (my favorite), and the speedboat/ATV another day (my teenagers' favorite). My husband and daughter played beach volleyball, and we took a Catamaran out one day with a guide. (Renting a Catamaran is free unless you have a guide come with you, which we did and were glad we did.) The Star Friends are an amazing group of kids - they were always doing something or trying to get a volleyball or horseshoes game going, or exercise, yoga or dance. If you're bored at this place, it's your own fault! One more thing I liked about staying in the Riviera Maya is that there are so many Europeans that visit this area and we enjoyed meeting so many of them! They were from the Netherlands, Ireland, Germany, England etc. It's nice to meet other people from other countries. All in all it was a wonderful trip and I would definitely stay there again, especially if I take my family.","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Ivy Skiles","date":"2015-08-07 07:49:10 +0300"},{"content":"After having researched a few different hotels in the area of Playacar we settled on the Iberostar Quetzal based on the reviews I had read from Trip Advisor. Let me say that we made a very good choice based on the group we were travelling with. We stayed at the resort from April 9-16 we a group of 6 people (2 grandparents, myself and my husband and our 2 year old and my brother and sister-in-law (who is seven months pregnant). The check in was good and the resort is really nice for families and especially younger children. My son loved the peacocks that roamed the resort and the different variety of other birds. We also saw several monkeys hanging from the trees on many occasions. The rooms were not as luxurious as some other resorts we have stayed at when it was just me and my husband, but overall were very clean and large enough for everyone. We lucked out having actually received a true king size bed in our room that comfortably slept the 2 of us and our son. We did ask for a mattres pad however, since we did find the bed quite hard. This helped a little bit. I wouldn't recommend using their cribs if you have little ones, only because the mattress they use in them is literally paper thin with just a wood bottom. I imagine this would be very uncomfortable for a young child. Pools: the large pool that was for everyone was very nice. My son played at the entry to the pool and had a great time. There is a kiddie wading pool, but it didn't seem that clean and they have used these very slippery tiles to build it, which is pretty to look at but very slippery for small feet. There was never usually an issue to find shaded areas and loungers around the pool side, but we always had a spot picked by early morning. Also, the resort did not appear to be full this week. Beach: was absolutely great. I have been to seven mile beach in Negril in 2002 and this was the closest I have seen any other beach compare to it. It was white sand, quite large and went down to clear turquoise waters. Shaded loungers and palapas were hard to find in the afternoon, but go in the morning and no problem. The waves were quite strong on a few of the days that we were there, but were great fun for the adults to play in. My son also enjoyed the water on a couple of calmer days. This was the reason we picked this resort and were not disappointed. The beaches to all of the other resorts to our left, RIU Palace Mexico, RIU Palace Playacar, and all of the rest have literally no beaches left. It appears that when they built these resorts they made man-made beaches but ocean has taken back the land. Food: Buffet was just so-so, about what I had expected from everyone else's reviews. They had a large selection, but none of it was very impressive or tasty. We dined in all of the a la carte restaurants though and found that this food did taste better. I would definitely recommend the steak house. It's not as good as a typical steak house such as the Keg, but all in all there are many choices and it tasted pretty good. One thing that bothered us about the reservation system though was that they would only seat half of the restaurant. We were able to book all of our spots on the first day that we arrived, but on the second evening we were told that there were no reservations. We asked if we could go to one of them and wait the 15 min to see if another group did not show up (they tell you your spot will only be held for 15mins when you make a reservation) but the guest services told us \"Well you can try but I dobut they will seat you anyways.\" It seems like they don't want to staff these restaurants and force you to eat in buffet. I realize they have different seatings 6:30 or 7:00 and then 8:30 or 9:00 but I am saying that even when these seatings had passed you could walk in to any a la carte place and they would be less than 1/2 full. The night that we were at the steak house the maitre'd told us we could come any night and basically as long as we tipped him, we could have a seat at any time of the night. Word of caution, they charge high rates to use the phones in your room and even at the pay phone they want to charge you $5.00 US to make a call with a calling card that you purchase locally. Internet access is the same way. I would definitely recommend walking down the street 5 minutes to the little shopping plaza and buying a phone card there. It will work on any of the public phones there. Also, there are stores with internet access which charge about $1.50 for 15 minutes of internet use. Also, this resort is in a gated community which is very safe. We would take walks down to the shopping centre at night after dinner with my little one and felt completely secure. You can actually walk into Playa del Carmen if you want to, it would take about 20 mins at a leisurely pace. The shows were OK and the drinks were good too. You could always have your daiquiris made with back shelf rums. The ice cream parlour at the beach was good too. I used room service a couple of times when my son was napping and the food is basic, (hamburgers, pizza, chicken nuggets) but arrived quickly and hot. Would I stay here again? With my family probably, as a couple no. There are too many other beautiful places to try out.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Declan Bahringer","date":"2014-06-12 21:12:02 +0300"}],"public_likes":["Mr. Emma Schneider","Mavis Corkery"],"vacancy":true,"description":"Hotel & Conference Centre","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}