{"title":"Los Angeles/Wilshire","name":"Beverly Laurel Motor Hotel","address":"8018 Beverly Blvd","directions":null,"phone":"+1 323 651-2441","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":34.075802,"lon":-118.364444,"accuracy":"ROOFTOP"},"type":"hotel","id":16708,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"The staff was rude, had to wait over an hour past the check in time for an available room, no valet parking was available so i had to drive 4 blocks to find a location, was told to check back the second day for parking (but there wasn't any then either so i ended up returning the rental car mid trip) wi-fi doesn't work in the room, was told that someone would fix it and 24 hours later the problem still exists, no phone in the room so i have to go to the lobby to speak to anyone, only one elevator works in the 10 story building, the carpet is rolling and stained (very large spots) in multiple locations, there's no mattress pad under the sheets, the mattresses are decades old and very squishy, the trim is falling off the wall, the windows are stated to open but don't, the windows are filthy so you can't enjoy the view of the ocean, (I can go on but these are the first few items that came to mind...)","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Reagan Armstrong","date":"2012-03-28 09:19:01 +0300"},{"content":"Our mediocre experience started right when checking in. Basically they gave us a room with two single beds instead of the king-size we booked. The only explanation they gave was that the hotel was full and that they run out of king-size bed rooms. In other words, they gave our room to someone else. So we get to our rooms, expecting to get something at least similar to what we saw in the website and so happened that the hotel is undergoing renovations and not all the rooms were fixed. The room we got was worse than what you would get at a cheap motel: Dirty and humid carpets , strong mildew smell, old furniture, no safe box, ornamental phone (didnt even work), the so called \"lagoon view\" was actually a view to a piece of lagoon across the street through a very dirty window. Sleep quality was awful. The sheets were humid to the point of being sticky. The noises coming from the street (honks and loud car stereo) made it impossible to sleep unless you used earplugs. Bottom line: - Poor overall cleanliness. Hallways and room smell to mildew. - Noisy if you get a room with \"lagoon view\" - No breakfast - The hotel has a good location and friendly staff, however, I do not recommend this hotel.","ratings":{"Service":4.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":5.0},"author":"Cathy Deckow","date":"2013-02-04 17:17:03 +0300"},{"content":"I'm from Puerto Rico and I used to hanout in the Isla Verde Area. When I saw a hotel in Isla Verde by the \"Ventana\" for $89, I knew it wasn't going to be a 5 star hotel, I knew is a beach front property but there is no beach (hotel is sitting in front of the rocky area of the beach) you need to walk a couple minutes to find a good spot is the beach. I picked the hotel because of the location and price. The lobby is real nice it was remodeled and the view is awesome. They have a nice small pool but is a little bit deep for small kids. They have a valet service - $18 dollar daily. If you are a young guy and just want to be in the middle of the night life, walking distance to clubs, restaurants, the real Isla Verde beach and don't mind a motel room. This is the place to stay. If you are looking for a family hotel, with nice rooms and a nice beach go somewhere else.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":5.0},"author":"Shanelle Hermiston","date":"2012-11-15 05:32:38 +0300"},{"content":"do not stay here!! it is not worth saving a few dollars, as one of the other reviews read!,... my girls and i stayed here the first night we arrived to puerto rico, we figured we'd stay in pr for one night prior to going on our cruise. the experience at this hotel was a terrible way to start our vacation!... the bathroom was terrible, the bath tub was disgusting, there was no knob to turn the shower on, the hallways smelled like mold, the carpet was stained and looked as if there were layers of dirt. the beds were not well made and the comforter looked as if it had not been washed. there was no bed skirt on the bed, so you were able to see the box-spring and the mattress was disgusting!! you were also able to see the frame of the bed and the wheels were bending, so i was afraid that with any lil' move, the bed would collapse. i had read the previous reviews, but i had already booked the room, .. and i figured what the heck, i'll give it the benefit of the doubt... sure enough my girl-friends and i were totally disgusted!!!... mold everywhere, and according to the receptionist, the hotel is being \"remodeled\". i did some research and its been awhile that this hotel is supposedly being \"remodeled\". seriously this hotel should be shut down!... luckily we only had to stay there one night. we slept all covered up, on top of our towels, on top of the comforter and still, you could feel the dam wires of the mattress poking your back!... we definetly didn't want to un do the bed, cause who knows what the heck would be under the comforters. check out the photos of the bathroom!... SICK!!!","ratings":{"Service":3.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Arjun Koss","date":"2012-02-08 13:27:42 +0300"},{"content":"Booked with Expedia, desk clerk took confirmation info, then hotel double billed after I left. Expedia trying to help, their accountant said they would fix it. It has almost been a month and still not resolved. Next call is to BBB and police. No wash rags, still under construction, loud gay parties at the bar, never warned about that one. Absolute misery, would not have my enemy stay there.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":2.0,"Rooms":1.0},"author":"Justina Dietrich","date":"2012-04-07 09:55:07 +0300"},{"content":"this was my first and will be my last visit to Puerto Rico!!!!...the hotel was unkept overall. the initial room we had was not \"secure\" so we switched, the second was not any better..the shower curtain in the bathroom had mildew and mold (which we requested to be replaced) the hotel floor had a musty smell...my girlfriends clothes remained \"wet\" and clammy from the humidity in the room...I slept on top of the sheets because i was scared i might get bed bug!! The hotel towels were not white at all....I was so relieved to go back home just to get a good night rest and take a nice shower!!! they should have shut down the hotel until it is fully renovated, but i'm not sure they meant the rooms were part of the deal....Unfortunately i will not return due to this experience..I would be ashamed to recommend this place to anyone McKinney, Texas","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":1.0},"author":"Justice O'Kon","date":"2012-12-12 03:57:37 +0300"},{"content":"This hotel was a grossly misrepresented on the website, overpriced for the quality, and the epitome of a roach motel. When we first arrived, we entered our rooms, to find the overwhelming stench of mold and mildew slap us in the face. We decided to tough out the first night as it was very late and we were exhausted. As we layed in our beds, the smell of the sheets, pillows, and mattress was nauseating. I could only compare it to leaving your clothes in the washer for a month -wet. Then, I decided to take a shower and took my first step into a slimy, tub with a black bottom and mildew and mold stains. Showering in $@!#% flops would not resolve this issue as the shower would not drain. The second stay - we complained about the room, believing that they would clean the sheets, tub, etc, and we would be able to finish the remainder of our stay at this hotel. Instead, we returned to find the same stench in the beds, and dirty bath. Then, we realized that there was living mold and mildew on the ceiling and walls. See photos attached. We then informed the hotel manger that we would like to check out and would not be staying for the remainder of our visit, but they refused to give us our money back. We decided to check out anyway, as this hotel was a health violation and obviously no cleaning guidelines are enforced. I don't recommend this hotel at all. There isn't really a beach view either. Stay in a Motel 6 before here - Please.","ratings":{"Service":1.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":1.0},"author":"Anjali Mante","date":"2015-07-20 10:49:20 +0300"},{"content":"Don't check in! This hotel is dirty, smelly and not worth your hard earned money! The beach is there, but you can't use it, the renovations are ongoing causing it to be very loud. You can't charge drinks to your room account, but must pay separately on demand. The beds are most uncomfortable and the bathrooms leave much to be desired. We were to say the very least very, very disappointed in this place. Cindy, Portland, ME","ratings":{"Service":2.0,"Cleanliness":1.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":2.0},"author":"Rita Walter","date":"2012-12-21 00:07:48 +0300"},{"content":"I would not stay here again, particularly for the price we paid which included a 9% 'Hotel Service Charge' above and beyond the 9% gov't tax and $5pp/night municipal fee. When we asked about the Hotel Service Charge we were told it was another tax. In that situation we figured, what can we do? I took a look at the Holiday Inn Express website and their San Juan hotel right down the street (also in Condado) does not have this service fee. We took a look at the HI Express while we were in town and the pool is smaller than the SJB's, but that seemed to be the only drawback. And the SJB's pool got cloudier by the day, as they seemed to not be caring for it at all. We had to switch rooms after the 1st night because our TV didn't work and you couldn't adjust the temperature on the bathroom faucet. Our new room was only marginally better. And there was one day we came back to no room cleaning after being out of the room the entire day (9-5). At that point we just asked for clean towels for our shower when they offered to clean it for us then. The only food available in the hotel was a continental breakfast for a ridiculous $7+tax. The spread wasn't impressive from the looks of it and I could just grab a better breakfast from a local place for much cheaper. All in all, if I went to San Juan again I would NOT stay at the San Juan Beach. I feel it was way overpriced for the service/amenities.","ratings":{"Service":3.0,"Cleanliness":1.0,"Check in / front desk":2.0,"Overall":2.0,"Value":1.0,"Rooms":1.0,"Location":4.0},"author":"Erwin Lakin","date":"2013-01-23 12:23:14 +0300"}],"public_likes":["Kip Stehr","Rocky Bartell","Rebeka Lindgren","Felipe Kunze","Ova Daugherty"],"vacancy":true,"description":"A popular hotel, next door to Swingers.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}