{"title":"Joshua Tree National Park","name":"Black Rock Campground","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$15 per night","geo":{"lat":34.0726,"lon":-116.39006,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":12923,"country":"United States","city":"Yucca Valley","state":"California","reviews":[{"content":"We visit California twice a year and start and finish each trip in this motel. We stayed there now about 10 times over the past 5 years and we love the place. We don't know what the critics of this place are talking about! The staff is friendly and very helpful. The motel is rather old, the room could do some remodeling, but they are very clean and quiet. Good value for the money. The guests are friendly and social, for a friendly talk or more if you want. Much less attitude than usually in gay hotels. Parking is free and easy. If you are looking for a gay, cruizy, safe, clean and affordable place to stay in Hollywood, this is the place.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Ken Koepp","date":"2012-02-24 17:19:41 +0300"},{"content":"A very old hotel, very private with two stories of rooms around a central courtyard with pool, and above ground spa. I was looking for budget accommodations and $69 a night fit the bill. The room had a king bed, comfortable, small refrigerator, nice size shower (water fluctuated in temperature), and a small bathroom. It was all I needed, and the room was very clean, even thought it was very old in style (think 1950's The Honeymooers decor). Guys walk around with towels around their waist (ala bathhouse), and at night many leave their doors open for fresh air, ETC. It was quiet, yet cruizy. I got a good nights sleep, once I got to bed, and slept well. Coffee (all day) and donuts/croissants in the morning. The spa was very warm. It was October so i didn't try the pool. Dry sauna was old, large, but very cozy. One gay channel on TV 24 hours. The front desk guys were very friendly. The doors from the lobby to the rooms is secured (they buzz you in), and any guests you may have visit are charged $10 and must show picture ID at the desk before they are allowed in to the rooms. I will stay again; i liked the atmosphere, friendly desk people, \"eye candy,\" and the comfortable bed. If you don't mind old, enjoy a cruizy gay environment, you might want to try this place.","ratings":{"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Service":3.0,"Rooms":2.0},"author":"Judge Boyle","date":"2015-05-04 06:26:19 +0300"},{"content":"We were not originally booked to stay in this hotel but due to electrical issues at Casa Martini Hotel we were transferred here for one night (both hotels have the same owner). The hotel is in a typical Venetian house and area. It was not difficult to find, the area (Cannaregio) was very safe and lively with good shops and restaurants as well as the only McDonalds in Venice nearby (if that's your thing). Our room was nicely furnished but not as luxurious as it seems on the web site (it photographs deceivingly well). We had an in room safe with an outlet for a notebook computer but the outlet did not work. The TV was nice but had no English channels (same at Casa Martini). Not a big deal. The bed is two single beds pushed together, pretty typical for a European hotel. My one complaint about the room was that it was not well cleaned. The floors were dirty, as well as table surfaces. Bathroom was adequate but had that annoying shower head that does not set into the wall so had to be held the entire time. Two towels and two hand towels were provided but no bath mat or face cloths. Water pressure and temperature were fine. Our room overlooked the street below as well as the private courtyard of one of the superior rooms. Air conditioning worked great and windows were large and bright. The hotel itself has a small interior courtyard which was plain and had filing cabinets and other miscellaneous materials stored in it (not very luxurious looking). The room where breakfast was served was comfortable. Breakfast was hot drinks, juices (dispensed), cereal, croissants, biscuits, cured meat, sliced cheese, yogurt, canned pineapple, dates, etc. Unfortunately when we arrived for breakfast (8:30 am) there were no clean dishes left so we had to eat our food on napkins. Breakfast should have been better organized. We had a similar problem at Casa Martini - except that there were no dishes left and no food left at 9 am. Staff were fine to deal with (don't except anything too friendly, this is Europe after all, and that's part of the charm!) Spoke fairly good English. Keys had to be left in a bowl at reception but this is fairly normal for European hotels and we found it to be fine. There is no 24 hour reception at this hotel so you must buzz at the front door to gain access after reception hours. Again, fairly normal. Overall, using trendy furnishings and a nice web site does not make a hotel luxurious. This hotel is probably not worth the price (in high season). If you're going to stay in Venice do it right - its a beautiful city and where you stay does impact your overall impression of your vacation in the end. If you are looking for an average hotel this one is fine.","ratings":{"Cleanliness":1.0,"Sleep Quality":2.0,"Overall":3.0,"Value":2.0,"Service":3.0},"author":"Orion Moen","date":"2013-11-15 15:56:45 +0300"},{"content":"We were very impressed with this \"boutique\" style hotel. Nothing flash but very modern, clean and well appointed. Staff were very obliging. The location, at the end of the Strada Nova was ideal for Rialto and gondola ferry to \"the other side.\"","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Horace Raynor","date":"2013-12-13 18:51:43 +0300"},{"content":"be careful. You think you booked a room in this hotel and when you arrived no room is available. if you pay in advance you have no solution except to accept a prestation which doesn't correspond at what you want. On my mind forget it","ratings":{"Overall":1.0},"author":"Jennings Koss","date":"2015-11-20 16:47:41 +0300"},{"content":"Napa was our first stop on our honeymoon and Avia was a perfect choice! We loved how modern the room was and the bathroom was awesome. One of the best perks was the free parking behind the hotel, which was surprising to us. The hotel staff was great and was very friendly. We enjoyed being downtown Napa and being within walking distance to many resturants. When we arrived we asked the councierge for recommendations and she gave us an envelope full of tickets for free tastings around downtown and deals on dinners or apps at various resturants. I recommend asking for suggestions and the coupons, it was a great help. The room was a little small but it was perfect for the 2 of us and our bags for just 2 nights.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Tyler Walsh","date":"2014-10-02 00:14:33 +0300"},{"content":"This beautifully decorated hotel is situated in the center of downtown Napa. The rooms are spacious, well appointed and modern. The mattresses and pillows are soft, very comfortable for those who prefer that. The oversized soaking tubs are great when paired with a room upgraded with fireplace. The door to the bathroom slides closed and therefore is not much privacy. A couple of complaints about the large open shower, the overhead rain shower is a nice plus but it cannot be operated at the same time as the regular directional shower head. Additionally, on a Saturday morning around 9 to 10 am, there was no hot water. There is a restaurant in the lobby, but we experienced poor service, and extremely overpriced food. Our party of 4 waited 45minutes for food, while the waitress kept apologizing but doing nothing to help. Overpriced because for 2, 2 egg breakfasts with 2 lattes was $50. While opting for convience we were actually delayed, gobbled our food in a rush, and made late to our appointment with Far Niente. Overall, great hotel, but avoid the restaurant. Many great restaurants around the area. Also, an issue with noise late night noise from terrace with firepit on the 2nd floor, which is great for casual gatherings. The 2nd floor rooms facing the terrace can hear and see everything, there needs to be a reasonable closing time for its use. At midnight, we heard a very inebriated group of people shouting on the terrace for about 45 minutes.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Orlo Batz","date":"2015-11-21 01:54:20 +0300"}],"public_likes":["Dorris Hyatt","Nola Bernier","Bill Bins","Hosea Denesik","Alexis Glover","Myra Grady","Jameson Funk","Cletus Carroll"],"vacancy":false,"description":"Located in the northwest corner of the park, this campground is not accessible from the main park roads.  100 sites, water and flush toilets available.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}