{"title":"Birmingham (England)","name":"Bloc Hotel","address":"Caroline Street","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.48613,"lon":-1.9079,"accuracy":"ROOFTOP"},"type":"hotel","id":3627,"country":"United Kingdom","city":null,"state":null,"reviews":[{"content":"What can I say? Each time I stay at the Omni Chicago, I think to myself, \"WOW, it can't get any better than this.\" And it DOES! We celebrated our 31st wedding anniversary at the Hotel. When the staff found out, they sent up some very, very nice surprises for us. We were just spoiled rotten the whole time we were there. We were treated like royalty. We stayed in one of the Governor's Suites. It was very spacious, very clean, and tastefully decorated. All rooms are suites with a TV in the living room, and one in the bedroom. The Omni is right on Michigan Avenue where you are just steps away from shopping and restaurants. As a Select Guest Member, my husband and I received a pot of coffee, juice and newspaper each morning, at the time chosen by us. If you choose to stay at the Omni, you might want to consider joining their Select Guest Program. It is free and there are so many amenities included. You get your choice of high floor/low floor, near the elevator/away from the elevator, and so much more.When I joined I received a 50% off coupon for a weekend stay. I also received another coupon for an upgrade. And, of course you receive the coffee, juice and newspaper delivered to your door in the morning at no charge. I want to thank the whole staff at the Omni Chicago for making our stay so perfect! You're the best!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Fay Stamm","date":"2015-04-25 16:36:56 +0300"},{"content":"Location is perfect. Spacious. Very clean. Great view from 18th floor. There was a construction site right next door to the hotel but we never heard it. You really had to strain to look down to see it. Loved having two televisions so I did not have to watch sports highlights all morning with hubby;-) Free WiFi with select guest was priceless in helping to navigate our daily activities. Each morning we got two complimentary beverages and a newspaper of our choice. The king bed was really comfy. The bathroom was well equipped. Lots of toiletries, the extra towels we requested and great water pressure. Chairs were comfortable. Did not use the wet bar or mini bar but if we needed to it was well equipped. There were two sets of elevators to get to our room but we never had to wait more than one minute for an elevator. It felt like extra security. Staff was attentive but not smothering. Only complaint I have is that the temperature was difficult to regulate. In order for the room to stay cool the way we like it, we had to leave the fan on. The auto setting did not seem to work, or at least I couldn't work it. It is a minor complaint and is way over-shadowed by all the wonderful things. Would definately stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Favian Kessler","date":"2013-11-20 04:45:31 +0300"},{"content":"The Omni Chicago really delivers on all fronts, from the spaciousness of the rooms to the helpful staff to the prized location on Michigan Avenue. While this address in Chicago requires a high level of quality, the Omni delivers. Check in for myself and a whole group of people with me was under 3 minutes, the staff had plentiful recommendations for dining and events, and the rooms are some of the largest you'll find at this price range in Chicago. Even the \"standard\" room has a separate living area and work desk. The fitness center has free weights, weight machines, and two rows of cardio equipment. I shared the room with 7 others and did not feel cramped in any way! All in all, a great property!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Mrs. Hosea Lueilwitz","date":"2014-05-19 05:05:44 +0300"},{"content":"Very nice hotel in a perfect location (corner of Michigan Ave and Huron). The rooms are spotless and have a separate sitting area. Room service for breakfast was quick. Our only glitch was the 30 minute delay in getting our room (they offered us a different room on the 5th floor, but there was too much chlorine smell from the pool). We went up a floor to the lounge to wait and Jennifer A. of the concierge staff tracked us down and gave us some food vouchers for our trouble. This is the type of quality service that I have always experienced at Omni's.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Gianni D'Amore","date":"2014-01-15 01:04:08 +0300"},{"content":"Loved it, located on Magnificent Mile, would definately stay here again. Nice pool, hot tub, and deck.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Johnathan Bradtke","date":"2015-05-24 13:13:26 +0300"},{"content":"As others have written previously, the Omni Chicago is a great hotel. We stayed about a week. I was tagging along on a business trip my boyfriend had. He checked in the night before I arrived. He left my name at the desk and I had no problem obtaining a key. The room is very comfortable and having the two rooms makes it nice when one person is a nightowl or gets up early to go to work. TVs in both rooms. DVD player in the living area (and a Blockbuster is about a block away). Bed was super comfy with high quality linens. We had a corner room (1717) and looked north and west. Not a great view but good light. We did have the mini bar key and used that refrig to store small things in. (There's a Trader Joe's three blocks away.) The entire staff was pleasant, efficient and professional. The concierge gave us some great ideas for dining and made reservations for us. The location is great, just off Michigan Ave. across from the Apple Store. The red line train is 3 blocks away at State and Chicago. We got a good rate: $159 during the week and $171 over the weekend nights. Good value for the quality. Sign up for their loyalty program and get free wifi and delivered coffee and juice in the morning. But skip their restaurant. It's nothing special and there's lots in the area. Also the business center charged $6.95 per 15 minutes to use the internet (although you could print airline boarding passes for free). I just waited until BF got back with his laptop. Finally, sign up for a Chicago Greeter. I had a great 4 hour walkabout and saw things and explored neighborhoods I'd never been to before.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Sandy Rice","date":"2013-01-08 14:16:57 +0300"},{"content":"We stayed at this hotel in December of '07 via an American Express promotion for a great price. We like to get away during Christmas. While not too far from our home, Chicago around christmas is always nice to get away too. The hotel is beautiful. The rooms are very modern and very spacious. I believe they are all suites. It is also right on Michigan Ave where all the shopping is. Parking was very steep in price. A tip, we parked a couple blocks down the road in a public garage for about half the price. It was a little bit of a walk but we saved some money. Flat panel TV's, nicer restaurant, great place. If this is good enough for Oprah's people, it's good enough for most of us. May not be quite as nice as the Four Seasons (never been there) but perfect location meant a very nice time.","ratings":{"Service":4.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Gennaro Lakin","date":"2014-09-13 15:58:27 +0300"},{"content":"We have stayed at several high end places in Chicago and this is still our favorite. Location is superb, staff are particularly gracious and welcoming without being cloying. Cornell, at the front desk, is unfailingly helpful as is the concierge. We love the extra room that a suite provides and if you join the frequent guest program, high speed internet is gratis, as is a breakfast beverage delivered along with the newspaper each morning at the time of your choosing. Bedding is of excellent quality and they offer truly amazing blackout curtains! We have never had a bad stay at this hotel.","ratings":{"Overall":5.0},"author":"Ignatius Altenwerth","date":"2015-08-31 08:05:47 +0300"}],"public_likes":["Kareem Hackett IV"],"vacancy":false,"description":"The Bloc Hotel offers ultrasmall rooms (10 sqm) all wrapped in minimalistic, modern decor, which can appeal to design enthusiasts.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}