{"title":"Sandhurst","name":"Premier Inn","address":"221 Yorktown Road, Sandhurst","directions":null,"phone":"+44 871 527 8958","tollfree":null,"email":null,"fax":null,"url":"http://www.premierinn.com/en/hotel/CAMRAC/sandhurst","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.34523,"lon":-0.785868,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":41215,"country":"United Kingdom","city":"College Town","state":null,"reviews":[{"content":"I loved the location of the hotel; the comfort of the beds and the overall atmosphere. The breakfast was really good--not just your average continental breakfast. The rooms were small but comfortable--it was an older hotel that had been redone very nicely. The location couldn't have been any better; right across the street from Union Station and the Old Red Courthouse on the other corner; close to West End and all the great restaurants.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":4.0},"author":"Cayla Gutkowski","date":"2015-04-03 12:59:48 +0300"},{"content":"I stayed here with my husband for one night. We were just in town to see the JFK sites and so the downtown location was perfect for us and we could walk to where we wanted to go. (Only a couple of blocks to the Dealey Plaza and the 6th floor museum). When we were there it was Memorial Day and the hotel and downtown area were very very quiet. I got the impression the hotel is mainly used by business guests (there was a large desk in our room). The room was very nice. Both the bedroom and bathroom were clean. The staff were very friendly and helpful in answering our questions. The self-serve breakfast was one of the best I have ever seen in terms of its variety and lay-out. There was also milk and cookies in the lobby at about 9pm, which I thought was a lovely touch. I'd heard that downtown was an unsafe location after 7pm. The area was deserted when we went out at about 8pm to get photos of the city skyline but as there was no-one around, we obviously didn't have any problems. The hotel has a shuttle service dropping people off to various locations (restaurants etc) within a 3mile radius - so if you do stay here, want to get out and explore, and don't have a car (or are worried about your safety) you could use this. Overall I would recommend this hotel and would stay here again if I needed to be in the downtown Dallas area.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":5.0},"author":"Ruby Runolfsson","date":"2012-01-02 17:50:22 +0300"},{"content":"My Husband & I stayed at the Hotel Lawrence in December 2007 before flying out of state for the Holidays. The warm cookies and cold milk in the lobby were definitely a plus! Our room was very nice, the bed comfortable and we slept soundly. One plus, the hotel is directly across from the restored train station and within site of Dealy Plaza for those Kennedy fans! Would definitely stay again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":3.0},"author":"Nayeli Auer","date":"2015-12-05 14:47:36 +0300"},{"content":"If you are looking for a less expensive hotel in the West End, this is a great choice. Yes it is an older building that has had some updates, and yes the rooms are small. We stayed on the 3rd floor and didn't hear any noise during the night and we were very comfortable. The continental breakfast buffet that is included is above average. I parked across the street at Union Station for $5 - no problems (it's a little tricky to find as it is a small lot directly behind Union Station). The fitness room is very small - 2 treadmills, and a couple of other pieces of cardio equipment. The Texas Club fitness center is 2 blocks away though if you need a good gym. Stay at this hotel if you are looking for a less expensive place and an older building does not bother you. (P.S. - the drains work fine if you make sure you pull up the plug on the bottom of the tub!).","ratings":{"Overall":4.0},"author":"Megane Reynolds II","date":"2013-07-14 23:16:52 +0300"},{"content":"The Hotel Lawrence was really nice. We took our 2 year old to Dallas on a train ride because she loves trains, and chose the Lawrence because it is directly across from the Amrak station and other west end activities. We chose right. The staff was great. They took us on the hotel shuttle to the aquarium and zoo at no charge. They even came to pick us up and were super friendly about it. If youve ever pushed a tired toddler in a stroller up hill, you know how nice a shuttle service is - however most west end activities would be in walking distance. Theyre just a few blocks over. The hotel was classy, but small. It seemed like everything was a mini version. It was well maintained though. We were skeptical of only having a queen size bed over a king, but it worked out for the best. It gave much needed snuggle time. :) All in all, you cant beat the price and service. It would have been nice to have more space in the lobby, rooms and breakfast areas, but I guess nothing is ever perfect. It was a nice trip, and we will stay here again for sure.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Antoinette Jenkins","date":"2014-06-28 23:05:54 +0300"},{"content":"I had a meeting up in Dallas, and stayed here because the hotel that was closer was booked. I really enjoyed this place. They had complimentary happy hour and a breakfast buffet. Although the breakfast buffet was subpar. The room was clean and large. The bathroom had a high quality glass shower, which was a nice change of pace compared to most hotels. I really enjoyed my experience. The only down point was chasing a cockroach out of the room, which was honestly entertaining.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Trey Spencer","date":"2014-09-10 01:59:14 +0300"},{"content":"I hold small meetings with this property several times a year. The staff is always a delight to work with, not to mention very accommodating. It's also very convenient to the airport.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Location":5.0},"author":"Keanu Casper","date":"2015-04-18 05:13:29 +0300"}],"public_likes":["Martin Weber","Aniya Nienow","Muriel Sanford","Ryann Oberbrunner","Rosina McGlynn","Kristy Herman","Everett Mills","Juliana Schmeler DVM","Ewald Pollich"],"vacancy":true,"description":"Reasonable sized rooms, standard basic furnishings but large TV. Stairs a little annoying. Good all you can eat cold buffet or fresh cooked breakfast at the attached Beefeater restaurant.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}