{"title":"Santa Monica","name":"Shangri-la Hotel","address":"1301 Ocean Ave","directions":null,"phone":"+1 310 394-2791","tollfree":null,"email":null,"fax":null,"url":"http://www.shangrila-hotel.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":34.01532,"lon":-118.49939,"accuracy":"APPROXIMATE"},"type":"hotel","id":26500,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"The staff at the Westin Lax were terrific. They were very helpful when needed and professional. The rooms were delightful & very clean. If you need a place to stay in LAX this is the place to stay!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":2.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Myah Bosco","date":"2015-06-28 22:10:00 +0300"},{"content":"I had a 12 day stay at the westin LAX with my wife and 1 year old, from the moment I walked in to the moment I left the staff were allways smiling and happy to help, special praise has to be given to the superb Daniela Hiles who I cannot thank enough for the help and support she gave me after a problem with the car rental company I was using, Daniela is truly one of the best senior members of staff I have had the pleasure of ever meeting, also I have to give more praise to Raul on the concierge desk who was allways willing to help and give us ideas of things to do he also got allot of details for me like addresses and opening times, to all the staff at the westin LAX thankyou for a very enjoyable stay and special thanks again to Daniela and Raul - best wishes Nick A","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Wilburn Lindgren","date":"2014-09-17 17:31:42 +0300"},{"content":"We just wanted a good night's sleep after a long trans-Pacific flight, so I thought that checking into the Westin LAX would be a safe choice. I am sad to report that this hotel is getting run down and bordering on seedy. The first room I was given was tattered and dirty. There were stains on the pillow case and coffee grounds on the floor. The walls were scratched up and the desk top was water stained. Plus the stewardesses in the next room were having a party. I went back to the front desk and got a second room on a different floor, but the interior was similarly tattered. After complaining to the manager on duty, I was \"upgraded\" to an executive level room on the Starwood Preferred Members floor. This room was cleaner, but still looked worn out. If this is what the repeat customers are treated to, why would anyone want to join the club? I predict that this property will be sold soon and turned into a two-star chain, if they can find anyone to buy it.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":2.0,"Location":3.0},"author":"Allene Dickens","date":"2012-09-20 11:52:39 +0300"},{"content":"I must congratulate the team under The Director Of Front Office Daniela Hiles and Front Desk Manager Savonna Cadle for giving us all the assistance required during our stay in The Westin 24th of MAR till the 27th of MAR.Your team's hospitality and service rendered during our stay is without doubt one of the best or should I say the best I have ever experience. To The WESTIN L.A this team of yours has made the\" DIFFERENCE\". Kudos!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Jaren Green","date":"2013-12-30 20:35:22 +0300"},{"content":"My wife and i stayed here for the weekend of the 12th through the 14th. My first impression of the hotel was absolutley above and beyond. We were greeted by Jusol, I believe he was a valet manager. He was friendly, very attentive and did a GREAT job with helping us with our lugagge. This was our first time in Los Angeles so I asked Jusol for any suggestions on where to go for the weekend. He suggested many great restaurants and night clubs in Hollywood. When we return and we sure will, we will have noone else check us in but Mr. Jusol. Overall our stay was awesome at The Westin! I also found my new favorite steakhouse thanks to Jusol...Lawry's the Prime Rib in Beverly Hills!!","ratings":{"Service":5.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":1.0},"author":"Dr. Nicola Hoppe","date":"2012-03-25 08:51:43 +0300"},{"content":"I had what I thought was minor problems with having an extra key that wouldn't work. Natasha worked extremely hard to get the problem resolved. She worked her magic with her Alabama Customer Service to achieve satisfactiion. Something I was not prepared for was the $22/day parking fee. That was more than my daily car rental! The room and housekeeping service was top-notch. We asked for an extra blanket and received quickly.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":3.0},"author":"Dr. Alanna Robel","date":"2013-01-06 17:46:20 +0300"},{"content":"Since 2002 I have been hosting an annual conference of 150-200 attendees at the LAX Westin. The facility, which has a unique auditorium and an ideal location, has consistently provided an attentive and effective staff for the organization and the attendees. The staff's work was integrated and thorough. Room rates were reasonable. The audiovisual equipment was good and AV personel performed well.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Norma Funk","date":"2013-10-31 08:13:18 +0300"},{"content":"After paying for 2 nights, pre-paid non-refundable non-changeable, \"Shavonna\" at the front desk, went to work on my behalf and refunded one nite due to weather conditions which made it impossible for me to get there the first nite... Thank you so much for this consideration !! Since it was a business trip, I was on a tight budget and this helped so much.... can't thank you enough... Kathleen \"Kat\" Ray","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Zoey Ledner","date":"2014-01-10 16:19:42 +0300"}],"public_likes":["Macey Mante","Katharina Von","Liana Dach","Kory Schultz"],"vacancy":true,"description":"The Shangri-la Hotel has huge rooms, ocean views, and free parking for guests.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}