{"title":"Los Angeles/South Central","name":"The Vagabond Inn USC Hotel","address":"3101 S Figueroa St","directions":null,"phone":"+1 213 746-1531","tollfree":"+1 800 522-1555","email":null,"fax":"+1 213 746-9106","url":"http://www.vagabondinn-los-angeles-hotel.com","checkin":null,"checkout":null,"price":"$85+","geo":{"lat":34.024543,"lon":-118.279128,"accuracy":"ROOFTOP"},"type":"hotel","id":16648,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"Stay Jan 23-27, 2005 For the price of $105 per night this hotel offers a tremendous bargain. It is similar to the Fairfield Inns on the mainland but a bit more upscale. Clean but smallish rooms and bathrooms. Outdoor pool is extremely private but small with no jacuzzi. One of my customers from the area said the Italian restaurant on the 10th floor is his favorite on the Island. The $20-$30 entree fees are typical for this area. There is plenty of fast food nearby for those looking to scrimp. The internet cafe (35 minutes for $5) was less than 5 minutes away. Several nice casinos are no more than 10 minutes walk. If you want a plush pool next to the ocean stay at the Marriot Courtyard but expect to pay $235 per night this time of year.","ratings":{"Overall":4.0},"author":"Chelsey McGlynn","date":"2015-01-10 21:19:55 +0300"},{"content":"I took my sister to Puerto Rico for a girls getaway and we stayed at the Hotel Villa de Sol. We chose the hotel because it was affordable and the pictures of the rooms and bright yellow Spanish style building won us over. We were EXTREMELY disappointed! Let me first say that... IT LOOKS NOTHING LIKE THE PICTURES advertised on the internet. The bar and restaurant were closed the entire time we were there. When we got to our room it was hot and muggy because the a/c had not been turned on as a courtesy and the room reeked of some sort of perfume/disinfectant. The table and chairs on our balcony were covered in mildew. The headboards and frames on our beds were not secured, the pillows were flat, the bed was terribly uncomfortable and we woke up our first morning there with bites on our legs, arms and torso! OMG!... The iron was broken, the ironing board cover was covered in stains and don't even think about asking for extra towels or pillows! They acted as if I were asking for their first born! It was two of us and only one small hand towel. I love my sister but neither of us desired to share the same washcloth. Our room didn't get cleaned until late in the afternoon, and again two people, one washcloth. It was close to the airport so we knew we'd hear airplanes go by... but nothing could have prepared us for what we heard. We could have sworn that the planes literally taking off on the same street! We paid $109 a night, but it was worth every bit of $50 bucks a night. I'm a flight attendant and I'm usually in and out of hotels up to 20 times a month and this was by far THE WORST PLACE EVER!!!","ratings":{"Cleanliness":1.0,"Sleep Quality":1.0,"Overall":2.0,"Value":1.0,"Service":1.0},"author":"Jazlyn Ryan","date":"2014-04-19 07:53:32 +0300"},{"content":"My family and I stayed here from July 12-15. We had 3 rooms booked. One that slept 6 and the other 2 that were double rooms. The room we originally were given had water stains on the ceiling and a very musky smell. Upon entering the room I went to the bathroom to wash my daughters face and realized there was very little water pressure. By very little I mean a trickle. There was no way someone could bathe (much less 6 people). I immediately went to the desk and explaiend the problem. They seemed aware of it but the gist of our conversation was there was no way it would be fixed before our stay was over. I requested another room and was offered one on the first floor that only had 2 beds in it with the promise of 2 cots. The room was next to the bar and extremely noisy. Under normal circumstances this would not have bothered me but with all the other issues this just added to my displeasure here. I called the owner and complained. She was not in any way apologetic and when I threatened to leave she said they would charge me for the 3 nights. The other two rooms were musky and generally in poor condition. I travel to Puerto Rico about 4-5 times a year and have stayed at many hotels both budget and higher end resorts. I wanted to try this place as the website made it look very decent. Basic accomodations are never a problem for me as long as the hotel is clean and the service is adequate. Here neither is the case.This was, quite possibly, the worst service I have ever received. The front desk staff was rude and unresponsive, the manager was just as bad, and the owner was indifferent. I was embarrassed as I was travelling with people that had never been to the island and they were left with a bad impression of the service provided in hotels. If this is your budget then stay at the Coral Princess in Condado. Same prices and much better service.","ratings":{"Service":1.0,"Cleanliness":3.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":1.0,"Rooms":1.0,"Location":3.0},"author":"Ava Stark","date":"2012-01-10 21:37:25 +0300"},{"content":"My boyfriend and I loved our stay (5 nights) at Hotel Villa Del Sol. We didn't have a prior reservation, but they managed to accommodate us and give us excellent rates. When I walked in, I asked one of the employees regarding their amenities; she included the employees as one. At the time, I was a bit skeptical due to our interaction with other hotel employees, but she was absolutely right. We were treated wonderfully. Don’t forget to try Annette’s margaritas and Carmen’s Pina Colladas (?). Villa Del Sol is cute, clean and affordable. This place has a lot of character. You will definitely enjoy your stay. FYI, the car rental guy, Carlos (he is not one of their employees), was the only unpleasant person we dealt with at the hotel. You might want to stay away from him.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":4.0},"author":"Otto Thompson","date":"2015-10-10 16:16:50 +0300"},{"content":"This was a great hotel for the price located in the center of town and convenient to all. The hotel was quaint and charming, the rooms were very comfortable and clean, staff very helpful and courteous, convenient parking and included a very nice continental breakfast. I only stayed 1 night so I couldn't enjoy the pool or relaxing atmosphere, but I would go back and recommend it to friends.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ollie Lebsack","date":"2015-11-27 15:17:02 +0300"},{"content":"I wish that I could have seen this hotel in its heyday- the lobby is the best-looking part of it today. Still, the bed was comfy (perhaps a little too soft) & the rooftop dining area was nice on a sunny day (even if the view faces away from the square & is somewhat obscured by buildings). We didn't linger & would recommend this for no more than one night. If you're just passing through Ponce like us then why not save a couple of bucks? Downers included mosquitos in our room & the fact that the staff didn't tell us about the parking lot out back until we checked out the next morning. Still, there was only 1 other group besides us at breakfast- more toast or juice anyone?","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Macey Rosenbaum","date":"2013-11-12 07:51:01 +0300"}],"public_likes":["Gladyce Bartell","Janice Thiel","Tad Ratke"],"vacancy":true,"description":"Close to the campus of USC.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":false}