{"title":"Vittel","name":"Club Med","address":"Vittel Le Parc","directions":null,"phone":"+33 329081880","tollfree":null,"email":null,"fax":null,"url":"http://www.clubmed.co.uk/cm/resort-vittel-le-parc-france_p-341-l-EN-v-VLPC-ac-vh.html","checkin":null,"checkout":null,"price":"€120-200/night, 3 nights minimum","geo":{"lat":48.20642,"lon":5.94081,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":40662,"country":"France","city":"Vittel","state":null,"reviews":[{"content":"My stay was ok considering they could not get my radio to work in my room. Such high teck equipment that it became work to figure it all out. The pool area was fabulous but no jaccuzzi. The non alcohol drinks they offered in the lounge were new and amazing. Freash squeezed blue-berry juice, soda and lavender. You died and went to heaven and God gave you a welcome drink! The menu for food and drinks at this hotel are more advanced and futuristic than anything I have experienced in LA 5 star hotels. The Bentley driver Jim was my fav as he drove us to dinner and other places. Nice touch with the hotel car. But then again it is supposed to be a 5 star. It is worth a stay and the staff were wonderful. Very friendly as apposed to the stuck up ( God only knows why) Canadians that were at the hotel, all New Yorking on everyone, with their noses in the air. Mostly women. Maybe they were uptight because there are never any good looking men in Vancouver. I was born and raised in vancouver so I know of what I speak. Any hoo, go and stay there if you get the chance, it's worth the experience, and if you are a nice looking gentleman you can probably have your pick of the beautiful stuck up Canadian women. Me included!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Maverick Gerlach V","date":"2013-10-05 09:06:43 +0300"},{"content":"The bridegroom chose this hotel. It was absolutely superb, from the decor, facilities and comfort levels to the friendliness and superb service from the staff. We have no hesitation in giving an unqualified recommendation for our stay","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eryn Schowalter","date":"2014-02-07 14:25:33 +0300"},{"content":"Absolutely incredible. This is the hotel Vancouver was missing. More like Toronto's Hazelton than the Loden. Attention to detail and decorating excellence like the Peninsula in Beverly Hills back when it was brand new. This is the new benchmark.. Toss the Fairmont Pac Rim (I've stayed in the Pacific Rim's Chaiman's suite for a week and liked this place head and shoulders better). Unfortunately the Loden and Opus are out - Poor Locations. Toss the Sutton.. (wayy in need of updates) Toss the Bayshore.. old and routine with just a few great rooms.. Toss the Four Seasons.. It's right across the street and this place pput's it to jawdropping shame. There is not another hotel in the city of Vancouver, not one that you want to hang your hat at after you've stayed here. I would come back to Vancouver JUST for this hotel. THAT's how you know when you've found the best - It just completely and unequivocally blows your hair back. I've stayed in more hotels in my life than I care to remember and I predict that this place will have waiting lists within a year. Note to management: Take the yoga room that nobody is using and put some freeweights and a bench in there.. The gym had no free weights.. That's the only fault.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Emmanuelle Beer","date":"2014-10-10 13:26:55 +0300"},{"content":"The rooms were commodious. The staff was accommodating beyond belief. The Bentley sedan and driver (Jim) were a pleasant surprise and very much appreciated. I definitely would recommend this hotel to anyone.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Guillermo Legros","date":"2013-01-29 02:14:52 +0300"},{"content":"We stayed at the Rosewood Hotel Georgia in Vancouver for three nights in September,2011. The Hotel was originally built in 1927. The Rosewood group completed a four year construction project in July, 2011. It is a great hotel with quality staff from check-in, concierge, bell captain, valet parking and a Bentley car, with driver, for less than 5 Kms from hotel. Our room was good sized with a sitting area, large flat screen TV, ample closet space with a great bathroom with two sinks, great overhead shower as well as a bath tub. The electrical lighting system was great throughout the hotel room. The Hotel has a great restaurant called the Hawksworth, on site as well as two bars/cocktail areas in the hotel. We would without doubt stay at the Rosewood on our next trip to Vancouver.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Karli Block","date":"2014-08-27 15:35:50 +0300"},{"content":"Having stayed at the Rosewood Hotel Georgia 2.5 weeks after a grand opening from a massive gutting and renovation of this landmark Vancouver property, and a rebranding to the Rosewood name, I found this property to be pure classic luxury with the highest standards to offer their guests. The entire staff are outstanding, most welcoming, hospitable, and takes great interest in your stay at their property. The entire staff are very proud to be at the Rosewood Hotel Georgia and their enthusiasm definitely shines through. The hotel itself is absolutely beautiful while very relaxing. I did not get that stuffy feeling you can get staying at a top luxury hotel. The hotel exudes a welcoming, sit down and relax feeling. The furnishings in the lobby are gorgeous and fits the decor perfectly. The room I had was on the 6th floor overlooking Howe Street. The room windows do open wide - how refreshing it was to find this. I could hear no noise at all, street level or outside the room. The room itself is luxury. The furnishings, color coordination, bed and bedding (the best ever) (sorry Frette) and lighting are perfection. I might also add very, very, comfortable, beautiful, and of the best craftsmanship. Touch lighting is utilized throughout the room. A computer keyboard in the desk drawer is available for use anytime and set up through the television system - and free of charge. A very nice touch and was used. I also liked the Seiko alarm clock that was stylish yet very simple to set an alarm. We know how hotels have gotten with trying to set an alarm on a clock. The bathroom - possibly the best I have encountered, Huge is not the word. You could live in the bathroom it is so big and beautiful. Everything is well thought out even down to the heated floor. You could have a party in the rainforest shower it is that big or possibly a smaller gathering in the soaking tub. All the amenities are there that one would expect at a luxury hotel and of the very highest quality. The fitness center/spa/pool are amazing. The fitness center has all the newest and latest equipment available in a wonderful and airy room to work out in. Again, all the nice touches one would look for at a hotel of the caliber are available. The pool area in my opinion is the second best feature of this hotel. Stunning, breathtaking, unbelievable are just a few words to describe this indoor pool area. Chairs, chaise lounges, couches, towels - again no expense spared in having the absolute best for this hotel. I actually felt like I was in some kind of Roman bath. You must stay if for anything the pool area. I did have breakfast at Hawksworth Restaurant. Decor, service, and food were excellent and price point was what is expected of a dining establishment of this high caliber. Absolutely no complaints for breakfast at Hawksworth. I utilized the business center and was very surprised to see two brand new Mac computers, the top of the line Mac computers for complimentary use. Being Mac illiterate, the hotel staff was most helpful in getting me started. The 1927 lobby bar was very nice, the drink was excellent, service outstanding, and pleasant, and overall a very relaxing time spent. Definitely have a drink or two there. The staff of the Rosewood Hotel Georgia is the #1 best feature of this property. Of the staff, the concierge staff I had multiple dealings with, Heather and Rob are the shining stars of the Hotel Georgia. Both are Members, Les Clefs d'Or Canada as well as the other team member of the concierge staff and one will be attaining membership into this prestigious organization in November, making the Rosewood Hotel Georgia the only hotel in Canada to have four Members Les Clefs d'Or Canada. This staff, again, particularly Heather and Rob know the city of Vancouver nside and out, all recommendations were right on, and some unusual requests were handled professionally, timely, and always with the result I the guest was looking for. My many interactions with this team certainly made me feel like I was their only guest. Heather and Rob are very special people and take pride in their work and pride in their hotel. I cannot highly recommend enough using their knowledge and services offered. As I said at the beginning of this review, all staff members are enthusiastic, proud of their job, and proud to be of any service to their guests to make the stay a very memorable on. I was fortunate to be able to utilize the Bentley car and driver, Jim, to the Pacific Central Station. What can I say, I will never forget the ride, the car, nor Jim. Jim is a pleasure to talk to, always smiling, cheerful, and cares so much about the guest. He is such an asset to this organization and someone I shall not forget. Professional and caring at all times -- what more can you ask for in an employee or a person. I actually had wished he could have hopped on the train with me so we could continue our discussions on various topics. I apologize for this lengthy report, however, I really wanted to give future guests a clear picture of this property. Remember please, the Rosewood Hotel Georgia had only been open 2.5 weeks, so there were some issues and definite oversights I saw during my stay. I will say every staff member took their time to listen to my suggestions, ideas, and thoughts and I believe took them to heart. I did not hesitate to let them know too, in a nice way. To give you a good idea, the following was what I found. I was skipped one night for turn-down service. Was offered a very sincere apology from the Front Desk Manager regarding this oversight that should have never happened. My room was rather small. Not the huge rooms I have encountered at other luxury hotels. Very little space for clothing. This in my opinion was the weakest and most disappointing part of the hotel. Actually had to have housekeeping come and get the extra pillows and blanket just to give myself more space in the closet. The business center with its new computers,etc., had absolutely no supplies to utilize that is readily available unless it was all hiding. The spa/fitness center/pool area - as absolutely beautiful as it is, offered none of the touches you will find at a luxury property's spa/fitness center/pool, i.e., lockers, (there were only 2), places to sit and change, and all the toiletries that are offered that take it a step higher. No footwear to use while in this area nor were there robes to put on. Also, there was no place to put the wet swimsuit but this issue has been addressed and there will be a suit dryer installed as soon as the equipment gets in. I was very disappointed and surprised to see how lacking this area was in comparison to a Ritz Carlton, Four Seasons, Shangri-La, Pan-Pacific, and Fairmont properties fitness center/pool area. However, Lenny, Spa Receptionist was outstanding, proactive in tackling my dilemma, and solved my problem. She is definitely the kind of member you want on your team to take you to the top. Again, this was an outstanding stay, all the comforts one could want or ask for. The staff unsurpassed on their duties. The strongest asset of this hotel. However. to reach that pinnacle of being \"the best Vancouver hotel\" it is the small attention to details that separate properties as they are all in the general price range. This is where the Rosewood Hotel Georgia still needs improvement. It will be the little things that take it to the top and a 5-star rating. I will be back and cannot wait to see and notice the changes and the evolving nuances that take place to achieve this hospitality ranking as #1 place to stay in Vancouver. It can happen.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Winifred Hettinger V","date":"2013-12-16 05:33:10 +0300"}],"public_likes":["Markus Dietrich","Layne Rowe","Miss Eusebio Davis","Adell Botsford","Forest Morar","Newell Koelpin","Johathan Hansen"],"vacancy":false,"description":"An all-inclusive resort with many luxuries.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}