{"title":"Barmouth","name":"Nant Hafod, Self-catering Bungalow","address":"47 Ffordd Pentre Mynach","directions":null,"phone":"+44 1341 280540","tollfree":null,"email":"stay@barmouth-breaks.co.uk/","fax":null,"url":"http://www.barmouth-breaks.co.uk/","checkin":null,"checkout":null,"price":"£225 to £610 per week","geo":{"lat":52.7331,"lon":-4.0628,"accuracy":"APPROXIMATE"},"type":"hotel","id":2481,"country":"United Kingdom","city":"Barmouth","state":null,"reviews":[{"content":"This is a wonderful motel situated in the perfect place, on Shepard of the Hills Drive. We saw 4 fantastic shows without having to travel along the congested main thoroughfare. The people were friendly and helpful. As a matter of fact, we were resting and got a call from the office. They had tickets for the Andy Williams theater which they were going to give us for free. We already had tickets for the evening but what a kind gesture. Vacationing at Amazinn was a great experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jasper Kassulke","date":"2012-05-30 07:26:49 +0300"},{"content":"Room smelled like ther was mold in it, they claim to have Wi-Fi...could never get connected...even tho my Lap Top worked at the other two hotels we stayed at. One clerk was a racist, whenever we would tell her something was not done right with our room...soap, room make up etc...she always said \"it's those foreigners who we have working here\", The whole town for that matter was not worth the time and money we spent..we can say I guess, we done that and been there...thats about it.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":3.0,"Location":3.0,"Rooms":1.0},"author":"Grayce Kub","date":"2015-05-29 15:51:33 +0300"},{"content":"My husband and I stayed here just one night, but would stay longer if needed. The room was clean the staff was very friendly and the breakfast was a nice surprise. I booked my room with Sea Breeze Vacations travel agency .We got a great deal. $43.75 so you see I was a little worried. This is not a luxury hotel, it is a nice, clean, friendly place to stay. The name says it all, it was Amazing!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Citlalli Rau","date":"2012-04-06 03:17:49 +0300"},{"content":"Just returned from staying 3 nights at this hotel and we were very pleasantly surprised, after we had read some of the negative reviews we weren't sure what to expect. It surpassed our expectations and more ! Yes a small room with no view but extremely clean, fresh quality bedding, refilled tea/coffee, shampoo/liquid soap, clean towels every day, room always made up whenever we returned. Hardly any noise in our room and were never kept awake. Breakfast choice brilliant, you could even juice your own carrots and celery ! Plenty of cooked choices, though they needed to be a bit hotter. Evening pub grub excellent too ! Good value for money, as we are finding Australia to be very expensive ! Location great for station, Darling Harbour, markets and China Town, we walked everywhere and were always pleased to return for a rest !!","ratings":{"Overall":4.0},"author":"Dawson Weber","date":"2013-01-18 06:05:54 +0300"}],"public_likes":["Georgette Lind","Magnus Romaguera","Dr. Jeramy Miller","Colton Rath","Zoie Gutkowski","Jarrett Oga","Luisa Dare","Minerva Senger","Mrs. Merle Schneider"],"vacancy":true,"description":"4 star bungalow with 2 bedrooms, sleeps up to 4 adults. Good views over Cardigan Bay from large conservatory. Set  in quiet cul-de-sac off A496.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}