{"title":"San Francisco/Fisherman's Wharf","name":"Courtyard Fisherman's Wharf","address":"580 Beach St","directions":"between Mason St and Taylor St","phone":"+1 415 775-3800","tollfree":null,"email":null,"fax":"+1 415 441-7307","url":"http://www.marriott.com/hotels/travel/sfocf-courtyard-san-francisco-fishermans-wharf/","checkin":"3PM","checkout":"noon","price":"$210-$290","geo":{"lat":37.8071,"lon":-122.4185,"accuracy":"APPROXIMATE"},"type":"hotel","id":25667,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"The Chancellor Hotel is a wonderful hotel. Its location is fabulous - right on the Powell Street Cable Car Line and in the heart of Union Square, and its easy to get to all San Fran has to offer. The Staff are excellent and bend over backwards to help you in any way they can. The rooms are clean and nicely decorated and a pillow menu is even offered to guests!! I felt very welcolme and comfortable in the Chancellor and recommend it to everyone visiting San Fransisco.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Tessie Vandervort","date":"2015-08-21 23:42:23 +0300"},{"content":"We stayed at the Chancellors for a week in September -I'd chosen it after reading reviews on here and was NOT disappointed. The place is small - the rooms are small and there isn't much of a view, but its advertised as a boutique hotel, with small rooms and charm. It certainly has bags and bags of character. The staff can't do enough for you, especially in the bar where they showed genuine interest in our day, recommended restaurants and routes and helped us try out a few new cocktails. You can use the internet for a dollar for as long as you want if nobody else is waiting. There is coffee available all day for the jetlagged to wander down and collect at 5am if they can't sleep. The free cookies tasted fab, loved the rubber duck in the bath and the pillow menu. The foot spa rental after a day of sightseeing is inspired. In summary, don't go for luxury - its clean, functional, quirky, comfortable but, for me, the friendliness of all the staff and the ability to pop back in the afternoons for a rest and a free cuppa, plus the wonderfully central location made this a bargain gem and really made our holiday.","ratings":{"Overall":5.0},"author":"Dr. Beatrice Fadel","date":"2015-11-05 18:49:13 +0300"},{"content":"I stayed in the Chancellor for four nights in September. I really cannot say anything negative about my stay. The location was great, I was able to get to anywhere I wanted in the city with ease through public transportation or walking. The staff was friendly and it was a great value. My room was clean and comfortable, larger then what I thought it would be. If I visit the city again, I would stay at this hotel as well as recommend it to friends and family.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Mr. Pearlie Hirthe","date":"2013-09-03 15:07:20 +0300"},{"content":"I loved my experience at the Chancellor, and it'll be first on my list every time I go back to SF. How can you not love a pillow menu and a superdeep bathtub with a rubber ducky waiting for you? My only disappointment is that they're already full during my next trip!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Odie Jaskolski","date":"2012-12-24 05:40:01 +0300"},{"content":"Outstanding staff-- they really cared to please guests. Had an early flight in so got to hotel at 9:00 am thinking we'd check bags and go out until 1 or 2:00. Stopped back by after breakfast at 10:30 and they had our room ready for us! This type of attentiveness occurred repeatedly during our 3-day stay there. The room was immaculate, lots of attn. to details.","ratings":{"Overall":5.0},"author":"Pattie Lehner","date":"2012-04-01 11:35:00 +0300"},{"content":"The location really couldn't have been better. It's surrounded by good shopping and fast transportation. I was dissappointed when I discovered that there was no a/c (because their website mentioned \"climate controled\" rooms, but apparently were referring to the heater), but it wasn't a problem. A little warm in the day, but nice and cool at night. The asian woman in the lobby at the tour info. booth was a bit harsh in her answers/directions, but if you have a dry sense of humor, she's hilarious! A few suggestions for the first timer's like us: Buy a MUNI pass at the SF Visitor's Bureau right off of BART @ Powell St. With the pass, you can get anywhere in the city. You can get all kinds of brochures there too with discounts to most anything you want to see. Also, if you want to see a show, go to the TIX stand (right accross from the hotel basically) for 1/2-price same-day shows. We saw \"Hush Up...Sweet Charolette\", and it was hilarious!","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":4.0,"Rooms":3.0},"author":"Jerrold Johnston","date":"2012-09-08 21:26:55 +0300"},{"content":"We spent ages choosing a hotel in San Francisco, with the help of Trip Advisor. It was a good choice, very central. The hotel staff were really friendly and helpful (seems to be the norm in SF) and the bar was a nice place to pass some time, the bar staff were really nice and chatty, with recommendations of places to go. A really nice place to stay. There was lots of coffee (and the tea wasn't bad, anyone British)and cookies in the morning. The only thing was because it is so central, it is quite noisy,as it faces onto Union Square. It has no Air Conditioning, so even in April we had the windows open. The cable cars run till late and the garbage trucks run in the early hours of the morning. The rooms are quite small by American Standards, but we had plenty of space for our four day stay, and the bathrooms were very clean with lots of good products. Lois's diner on the corner one block down is great for breakfast, or any time, and there is another one at Ghiradelli Square. Suprisingly cheap for such a central location, like the Chancellor.","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Arvilla Hyatt","date":"2012-06-02 10:19:45 +0300"},{"content":"A big thank, we had a wonderful holiday-what ambassadors for San Francisco and America…… I feel I must write this, as we are all too quick to criticise and very rarely take the time to give praise where due. My Husband and I were visiting San Francisco from England for the first time, we stayed at the hotel on in April for 5 nights and I can only endorse all the previous comments. All of the hotel staff were very friendly and helpful. The location is superb, right in the heart of everything. The coffee, cookies and fruit in the lobby were a nice and very welcoming touch – in our busy schedule we never had chance to sample the restaurant, but I feel sure it lived up to the rest of the high standards throughout the hotel. The rooms were exceptionally clean and the little touches of the rubber duck & umbrella were much appreciated. I would certainly recommend this hotel, should we have the good fortune to visit San Francisco again - it would be our first choice.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Maddison Jerde","date":"2012-11-29 03:52:55 +0300"},{"content":"i thought the hotel was just ok. the staff was friendly, but it did take them a very long time to check us in and give us our room keys. check out was also a long process. the room was ok, but the heater seemed to never turn off so it was extremely hot at times. the location is the best part of it.","ratings":{"Overall":3.0},"author":"Cali Conroy","date":"2015-04-02 16:37:14 +0300"}],"public_likes":["Marietta Glover","Herminia Krajcik"],"vacancy":true,"description":"Part of the Marriott group, this non-smoking, four story hotel is just 2 blocks from Ghirardelli Square.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}