{"title":"Inveraray","name":"Argyll Hotel","address":"Front Street, Inveraray, PA32 8XB","directions":null,"phone":"+44 1499 302466","tollfree":null,"email":null,"fax":null,"url":"http://www.the-argyll-hotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.23171,"lon":-5.07382,"accuracy":"ROOFTOP"},"type":"hotel","id":12230,"country":"United Kingdom","city":"Argyll and Bute","state":null,"reviews":[{"content":"We arrived at 4am after a delayed flight - and the staff couldn't have been more helpful - we were shown to our room quickly and all the staff continued to be attentive and helpful throughout our stay. The room was a wee bit small - but adequate. We had a room on the second floor overlooking the pool. If you do stay here avoid room 219 as it is next to a gents toilet (not a problem in itself) but the flush is noisy and, of course, the toilet can be used at any time of the day or night. The room has free tea/coffee and the usual minibar and an internet connection (charged for). It lacks a welcome pack outlining the hotel's services and amenities - you have to ask the concierge or at reception if you want information. The views from the rooms at the front of the hotel are great - but the views from the side of the hotel are very different. It's well worth the while making sure that you do have a good view. The breakfasts are great (you may have to queue to get your eggs cooked) and there is a good choice to suit most tastes. The basics are the same each day - but there is always something different each day (I've never had curried chickpeas for breakfast before - but they were well worth trying)!!! The location of the hotel is great - just a few minutes walk from a large choice of restaurants and bars (exit the hotel and turn left then walk along the river with the river on your right). Many sights, attractions and shopping malls are within walking distance (although taxis are a cheap alternative). We had a great five days here and we will be returning.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Manley Davis","date":"2014-11-16 22:28:06 +0300"},{"content":"The hotel is really new, construction is needed to maintain the property quality and certain level of service but the job should be done after 10:00hrs as you could hear drilling / hammering from \"09:30hrs\". Room facilities, pool, gym are great in value. You can walked from Central shopping mall throught the flyover and driveway to hotel in ten minutes time. Taxi from Clarke Quay to hotel around SGN 10.00. Daily newspaper will not be provided to departure guest, it seems ridiculous. Even it was under part of operation cost but from the point of paying guest, I should get one even departure in morning / noon. For green environment, management can decide to reduce the classified or advertising column order area from the post as people stay there for leisure or business, they are not looking for job there at Singapore. \"Should be more customers oriented to upgrade the service standard to FOUR STARS category in future. No wifi internet signal in room / lobby but hotel provided complimentary computer terminals at lobby area. No complimentary bottle of water set up in room. Don't try to walk from back side of the property to hotel, the security staff was fiercely much. No matter what kind of dress code you wore, for me I wore pair of shorts, round neck T-shirt with a pair of rover shoes plus a shopping bag and back pack around 23:00hrs (19 August 2009), he walked out from his office at the side-way, to scan me until I back to the hotel lobby, it was really impolite, unfriendly and unqualified staff there to ruin the whole image of the hotel stay.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Zoila Anderson V","date":"2013-08-08 15:08:24 +0300"},{"content":"An excellent package of well-appointed room, great facilities and extremely reasonable price with free shuttle to nearby Miami International Airport. My wife and I stayed there at the end of a Caribbean cruise. Take away food and wine/beer were available from reception, ice was on tap and a comprehensive continental breakfast was included. We caught the bus to downtown Miami (and enjoyed a walk around Little Havana). We also visited restaurants across the road from the hotel. Miami hotels are not low-priced and this was one out of the box.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Meaghan Kutch","date":"2014-08-10 21:22:15 +0300"},{"content":"My husband and I booked the pre-cruise package for a one-night stay in September 2011. The hotel itself is very nice - front desk staff was very friendly and helpful, rooms and common areas were quite clean and comfortable. Even the business center was nice, with 3 computers and printing services. Several options for lunch/dinner within walking distance, and I felt safe walking around. We called from the airport to request shuttle pickup, and the shuttle arrived within 15 minutes. The included breakfast was your average hotel breakfast - though I've had better options at other Fairfield Inns around the country. The reason I'm giving this hotel a 2-star rating is because of the noise level in the room. Sure, you can hear the planes taking off - this is to be expected. The problem was that there was some kind of club/restaurant nearby that played extremely loud music until at least 2am. We were on the top floor of the hotel - where presumably the street noise would be at its quietest - and it sounded like the band was right in our room. We had to blast the A/C and keep the tv on all night at a medium volume to drown out the bass. This was on a Friday night. I know the hotel can't control what other nearby properties do, but this was ridiculous. Fair warning to those looking to book on a weekend night! The other problem we had was with the shuttle service to the port on the morning of our cruise. We had a shuttle reservation for 12pm, so we took our time getting ready that morning. The shuttle driver called our room at 10:40, begging us to switch to the 11am shuttle! He said that the original 12pm shuttle we were booked on was definitely going to be running late, and that we needed to be on the 11am shuttle to be safe. We felt very rushed and were confused about why this was happening. I'm thinking this was probably a random, one-time thing - but I wanted to report my experience. This hotel was nice, but I won't be staying here again - I book hotels because I want to sleep at them, not listen to club music all night. Poor location.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":2.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":5.0,"Location":1.0},"author":"Leslie Gleason","date":"2014-04-12 04:52:04 +0300"},{"content":"My husband and I were going on a cruise with another couple with another couple and flew into Miami early and stayed at the Fairfield Inn and Suites. We had issues at the airport and ended up in Miami even earlier than expected. The excellent staff (Mitch Betmudez & Liz) were so understanding, professional and helpful that they held onto our luggage for us (6 bags) pointed us to a local resturant for breakfast (which they were right it was a wonderful breakfast). When we returned they set us up in our rooms as early as they could, since we were all up for more than 24 hrs. Once we were all rested we had a wonderful dinner and enjoyed the hotels happy hour. The hotel is gorgeous, the art work and lobby are very modern. Our rooms were very clean and the bed was very comfortable. In the morning we enjoyed the complimentary breakfast which had a wide variety of breakfast items. We enjoyed our stay so much that we do plan on returning to see more of Miami and plan on staying there again. I truely hope this helps you in making your decision when deciding on a GREAT hotel while in Miami. I also read reviews prior to selecting the Fairfield Inn for our stay. It lived up to all that I read and so much more. A special thanks to Mitch and Liz for all that you did for us even though to you it might be a normal day. Well be back D. Jensen from California","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Crystel Monahan","date":"2014-06-08 16:43:31 +0300"}],"public_likes":["Nikki Johns","Lolita Huel III","Emmet Runolfsson"],"vacancy":true,"description":"Fabulous rooms overlooking Loch Fyne, costing £39 - 79 per person.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}