{"title":"Yosemite National Park","name":"Curry Village","address":null,"directions":null,"phone":"+1 801 559-4884","tollfree":null,"email":null,"fax":null,"url":"http://www.yosemitepark.com/Accommodations_CurryVillage.aspx","checkin":null,"checkout":null,"price":"Rates for tent cabins are from $109 per night, while cabins and motel rooms are from $115 to $190 per night","geo":{"lat":37.736944,"lon":-119.572778,"accuracy":"APPROXIMATE"},"type":"hotel","id":33884,"country":"United States","city":"Yosemite Valley","state":"California","reviews":[{"content":"We were there in early Dec for 2 weeks and we were on the southside on the 10 floor with a lake view . I would rather have this sort of view than an Magic Kingdom view as all you see is the car park and castle . At least with the lake view its relaxing to look out of and you can always see the fireworks from the 16th Floor . I recommend the southside view rather than the northside as with the southside you get to see epcot in th distance and the boats I cannot stress enough that if you book this place ...ASK for a high floor","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Location":4.0,"Rooms":4.0},"author":"Miss Fernando Bode","date":"2012-08-08 16:41:16 +0300"},{"content":"We stayed at Bay Lake Tower last month for a long weekend. We are DVC Owners and this was our first trip \"home.\" We booked a 2 bedroom villa/condo with a Bay Lake View. I had read that even numbered rooms were on the outer part of the crescent and offered partial Magic Kingdom views, so I requested just that, on a high floor. Our room request was honored - we got room #8102. It was the last room on the outer side heading left from either elevator bank. A long walk, but well worth it to only have neighbors on one side. And considering that our only neighbor liked to smoke on their balcony, this was a big plus (it's a big plus no matter what - we stay in hotels a lot and love to be at the end of the hall away from the elevators = much less hallway noise.) We had a dedicated 2 bedroom unit, which means rather than a 1 bedroom lock off combined with a studio, it was an open unit with a distinct 2nd bedroom with 2 queen beds, and no additional mini-kitchen. We specifically booked this kind of unit and were very happy with it. I took the master, my mother-in-law and son took the 2nd bedroom, and my daughter opted for the sleeper chair in the living room (she could have had the queen sofa bed but liked the cozy chair better.) It was plenty of nice private space for the 4 of us and would have easily accomodated more comfortably. We could have dealt with a 1 bedroom unit, but I didn't mind splurging on the extra points since we only stayed for 3 nights. Highlights/Pros: Easy check-in; we did the online check in and arrived at 2PM on a Thursday afternoon. There was no line at the 'express\" desk at the Contemporary Resort. Our room was not ready, but they texted us just an hour later to say it was ready, and included the room number in the text message. it was a smooth, easy process. I didn't think checking in next door at the CR was particularly complicated or difficult. Big spacious condo - I highly recommend asking for an even numbered room, as they are in the outer part of the crescent shape of the building - this makes for a wider living area because it's on the outer part of the curve. If you look at some of the other pictures in the reviews, the inner units facing the pool have straight lines - there are no barstools on the kitchen island and the living rooms are noticeably narrower. Nice modern decor - this is not everyone's cup of tea, but it suits us perfectly. We love modern, sleek hotels with clean lines. 3 wall mounted LCD TV's. 3 bathrooms in a 2 bedroom unit (and 2 bathrooms in a 1 bedroom unit.) Only one other Disney property offers this perk - Animal Kingdom Villas. The master bath is particularly nice. A separate shower with 2 shower heads (one rainfall head mounted on the ceiling.) The jacuzzi tub is adjacent to a slider wall so it can open up to the master bedroom. I didn't find this a particularly great feature, but if you had a true Magic Kingdom view you could feasibly watch the fireworks from the bathtub. I will say that the tub was a generous length - I am 5'10\" and I enjoyed using it very much - I could get my whole body underwater. Fabulous views - Bay Lake straight ahead and to the right; Magic Kingdom to the left. We did not watch the fireworks from our room, but we could have if we wanted to. Fully equipped kitchen with stainless steel appliances. Mind you, we only prepared simple breakfasts and snacks; it was perfectly functional and we could have gone a bit more elaborate with meal prep if we wanted. Great comfortable, luxurious beds - my daughter even loved the chair sleeper. Perfect location on the monorail via the CR next door. Yes, there was some walking involved but we enjoyed taking in all the scenery. Same can be said for restaurants and shopping. Honestly, it kept the resort itself more quiet and relaxing - but we could get anything we wanted next door if we needed it. Best of both worlds if you ask me. Really nice pool, hot tub, water slide and splash pad. Plenty of lounge chairs, at least when we went there. Reasonable prices at the pool bar. Access to other pools at the CR if you wanted to check them out. Lowlights/Cons: First and foremost, the neighbor who smoked on his balcony. I had the sliding door open in my master, returned to my room and as I turned the corner, thought, \"what is that smell?\" It was just wafting into to my bedroom. I shut the door and called the front desk. They said they would send security up to handle. We left the room for the evening. Returned later to relax and enjoy the balcony and he was smoking again. I called the front desk once more. I didn't have to deal with him smoking anymore, but he liked to throw his cigarette package wrapping and foil insert on my balcony - I found this twice. I think it was his subtle way of letting me know he was mad that I complained. Despite the resort only having been open for less than 2 months, the rooms were already showing some wear and tear. I also hated the way the dark laminate cabinets and furniture showed dust and fingerprints. DVC members don't get housekeeping so this was especially noticeable after the first day. One of the faucet handles in the master bathroom was broken. The A/C was not very efficient. It was hot when we checked in so I set the thermostat down to about 68. It was still hot. I couldn't even put on makeup without breaking a sweat. I turned it down to 65 (as low as it would go) waited overnight to see if it kicked in but no such luck. Called maintenance, who came up before we left to go swimming. She said it was fixed, but it really wasn't much better. Maybe a little cooler, but I left it on 65 - if I did that at home I would be freezing and it wasn't even close. If we had stayed more than 3 nights, I'd have likely complained again. Overall, I was very pleased with our stay and plan to stay here again. Since I'm a DVC member and it's our home resort, that's pretty much a given. But we really liked the decor, the layout, etc. The resort really does suit us. We also enjoyed watching the fireworks up in the lounge, which was a really nice perk of being a DVC owner here. Speaking of DVC perks, our internet access was free. As others have mentioned, there is only one HSIA port in the master bedroom - you could bring a wireless router with if this doesn't work for you. And to those who are not DVC members and complained about paying $9.95 a day for access, this is true of ALL Disney properties. There are, however, several free Wi-fi sites at the various properties if you just need occasional access. I don't think this is outrageous. Most mid to upscale hotels (Hyatt, Marriott & Sheraton to name a few, charge the same exact daily fee for internet access.) By the way, we ordered room service once - typical, adequate, slightly overpriced fare, much like any hotel. I was truly glad they offered it, but it was nothing out of the ordinary.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":5.0,"Rooms":4.0},"author":"Marianna Morissette","date":"2014-12-23 08:52:53 +0300"},{"content":"My parents, sister and I wanted a smaller hotel for our week-long visit to Rome. Villa Pinciana was an excellent choice. Located just off Via Veneto, it was very easy to walk almost anywhere in the city. The rooms were clean and well-appointed; my parents' suite had two expansive terraces with French doors and we spent several afternoons there drinking wine in the autumn sunshine. The staff was very supportive, making reservations and calling for taxis and tours. Of particular note was the excellent breakfast, everything from pastries to cheeses, with fresh juices and coffee.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Michelle Reichel","date":"2013-03-16 10:11:18 +0300"},{"content":"This Hotel is located just a 8 - 10 minute walk from the Spanish Steps and Spagna Metro Stop. The staff at this hotel was amazing, especially at the reception. They provided us with maps and all the important touristic information. The breakfast was also very nice. The bed was comfortable and the bathroom was also nice. I will stay here again if the price is right.","ratings":{"Overall":4.0},"author":"Tyrese Grimes","date":"2015-01-31 02:26:26 +0300"},{"content":"Hotel was a bit smaller than expected, but charming and our room was a good size and nicely appointed. It had a mini-refrigerator, flat screen TV. Marble bath had a tub shower with a large pan shower head. Breakfast buffet had a nice selection and was served in a lovely dining room. Reception staff was cordial and helpful. One thing to point out for future visitors - the lights in the room require you to leave your card key in a slot in the wall by the door. Presumably this is part of an effort to conserve energy, which is good. Only problem is if there is more than one person and one wants to leave and take the key, you leave the other person/people in the dark! Guess you can ask for a second key.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Vickie Friesen","date":"2014-07-23 14:46:41 +0300"},{"content":"I spent a fun-filled weekend with my sister celebrating her birthday and the Villa Pinciana Hotel in Rome certainly delivered. The staff provided kind help and assistance to our every request (even getting us onto a guest list for a packed night club). The helpfulness of the staff was really unbelievable-even down to helping us navigate the bus and subway system! The room we had was spacious and comfortable--the bathroom was quite large and the shower had amazing water pressure. We loved the \"boutique\" feeling of the hotel versus the larger \"corporate\" feeling at other 4-star venues. The hotel provided free internet access and the free breakfast each morning was especially lovely. Sitting outside in the garden with plates of cured meats and cheeses, fruit juices, cappuccinos, and pastries was just the little luxury my sister and I needed to start each day. The hotel is situated near the Borghese Park, but in walking distance to everything we wanted to see. I would certainly stay here again at our next visit!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alejandrin Ward","date":"2013-10-07 03:40:28 +0300"},{"content":"The location was great but the room was just ok. We enjoyed having a balcony, but never thought that the floor in our room or bathroom was very clean. The white walls felt a little sterile. The bed was very hard. The shower was nice although it was small. All in all, the hotel was not our style especially after stay in a very nice hotel in Barcelona.","ratings":{"Service":4.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":5.0},"author":"Ahmed Sauer","date":"2013-07-18 03:55:52 +0300"},{"content":"What a fab little budget hotel. Really quirky and thoughtful and in a great location. The staff are incredibly laid back and helpful. The public areas are appealing and witty with a laptop for customer use. Breakfast in in these areas, we didn’t encounter the rush that is described in some reviews but could see it might get crowded. The great plus is the fridge of free soft drinks so that you could take water up to your room. In fact, there are lots and lots of thoughtful and funny details like the large free shower gel labelled - the best free shower gel you will ever steal from a hotel room! The room is clean and modern, with really appealing décor. It is as spacious as some hotels at twice the price with a fab shower. The complaints about the glass wall to the bathroom are a bit silly because there is a curtain that pulls across the whole wall. It makes the room look bigger though. There was a bit of lack of storage so the cases looked a bit untidy. A simple shelf could have made all the difference to this. There was also only one bedside light, but that is pretty common in many hotels. We really really like this hotel. We like more luxury sometimes, but this really hits the mark as a place that offers ‘cheap and basic’ - it does what it says on the tin. It is also in a great area and you can walk to all the sights and eating places really quickly - it’s in the heart of things but on a quiet street.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Hayden Batz","date":"2014-07-31 05:13:53 +0300"}],"public_likes":["Dora Green"],"vacancy":true,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Located in Yosemite Valley, Curry Village offers a wide range of lodging options ranging from &quot;hotel&quot; accommodations to tent cabins.  Be aware that tent cabins and some wooden cabins are primitive and do not have private baths.  There are five bathroom buildings and one shower building in the camp. No cooking is allowed at Curry Village and tent cabins also come with a bear locker to store food. There is an outdoor pool, which is free to people lodging there and open to the public for $5.  There are two cabins, one hotel room, and six canvas tent cabins that are accessible. '''As of November 2008, one-third of the cabins are permanently off-limits due to rock slide concerns. Reserve early!'''","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}