{"title":"San Diego/Downtown","name":"Horton Grand Hotel","address":"311 Island Avenue","directions":null,"phone":"+1 619 544-1886","tollfree":null,"email":null,"fax":null,"url":"http://www.hortongrand.com/","checkin":null,"checkout":null,"price":"$175-$300","geo":{"lat":32.71024,"lon":-117.16145,"accuracy":"APPROXIMATE"},"type":"hotel","id":25162,"country":"United States","city":"San Diego","state":"California","reviews":[{"content":"i recently stayed at the chateau hotel for new years with friends. i was a little worried after some reviews that i read that were pretty bad but i was very pleasantly suprised when we arrived. the pictures i have seen are pretty much exactly what you will see when you get there and the staff was for the most part very friendly and helpful. i would recommend this hotel to anyone wanting to stay in the french quarter and that doesn't need \"high-end luxury\" to be happy. the chateau was clean and very quaint. i loved the courtyard and style of building however if i had any complaints it would be that the walls seem to be pretty thin...so if noise is an issue for you, you might not be happy here. also the bedding and just basic decor of the room was a little dull and out of date but it was clean and thats all that really matters. also if you do have a car they have on site parking which is big in new orleans...i would double check with the hotel directly about price because it was different that what the website said due to a special event.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":3.0},"author":"Kris Rempel","date":"2012-05-24 19:46:11 +0300"},{"content":"In a word, this was quite the picturesque place when I last stayed. Located in an area that is close to most things, the staff was always kind and considerate. My only complaint was the generic breakfast. It has a quaintness and nostalgia that I will never forget.","ratings":{"Service":4.0,"Cleanliness":3.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Tiffany Kihn","date":"2013-12-22 16:40:12 +0300"},{"content":"We stayed at the Chateau Hotel from July 4-7, 2006. The hotel is in a super location: three blocks from Jackson Square, two blocks from Bourbon Street and French Market. The property is old, but remember that you are in the French Quarter and call it charming instead of run-down. Our room overlooked the courtyard which has a fountain and swimming pool. The room was small, and needed a good paint job and new carpet - but who spends a lot of time in the room? The beds were heaven - actually the most comfortable hotel bed we've ever had. The staff was friendly and helpful. We come to New Orleans every year, and we will stay at the Chateau from now on.","ratings":{"Overall":4.0},"author":"Jordane Jaskolski","date":"2015-03-20 17:33:46 +0300"},{"content":"Just returned from a spring break stay at the Chateau Hotel in the french quarter located at 1001 Chartres. Reserved a two room suite for $450 a night. One room was downstairs and the other was a loft bedroom with a bathroom. Very large in size and spacious. Kitchen has refrigerator and microwave oven. Stove was not working and we were told they don't want people cooking in the room. Suite was right across the street from an irish pub. The pub had music blaring straight into our suite until 4-5am every morning. Needless to say we got no sleep. In addition, the buggies with horses carrying people trot by nonstop throughout the day and night. One of the drivers told us that this building was the first morgue in New Orleans. The floors were extremely dirty. We wore socks and they were black after five minutes walking around. The amenities were not what you would expect when paying $450 a night. The toilet paper and tissue were like sand paper. The towels were hard. The housekeeping staff didn't show up until we called. Even then we were told that they were too busy doing check outs and couldn't come until after 4pm. The contitnental breakfast that was included wasn't too great either. It's a bread item and orange juice. The danish tasted stale. The pool looks inviting but is not heated. My family froze in the pool. It's close to things in the quarter but it's extremely noisy all night long and not clean. I don't recommend this one.","ratings":{"Overall":1.0},"author":"Regan Ondricka","date":"2013-09-05 07:38:56 +0300"},{"content":"This is a pretty nice hotel. We had a one bedroom suite and it came with a full kitchen with everything you would need. The beds and pillows were comfortable and the room temps could be adjusted easily. The A/C unit was pretty noisy when it was on however. We didn't get a chance to use the pool but the weight room is amazing! I was very impressed with the amount of machines and free weights. The concierge was very friendly and helpful. We did have to call down for fresh towels one day (being a time share they don't clean your room or refresh yoru towels) and the first lady at the front desk didn't seem interested in helping us so we called back an hour later and the gentleman that answered was very helpful and even called up an hour later to make sure we got our towels. The location is very nice. The St. Charles line stops right out front and it is about 2 miles from the French Quarter and even closer to the Garden District. We did try to get a late check out (noon vs. 10am) and was informed by the front desk that they do not do late checkouts on Fridays. This was a bummer as we had to spend 4hrs at the airport but policy is policy. Overall a very nice stay.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Raina Jakubowski","date":"2015-04-23 03:11:04 +0300"},{"content":"This is a lovely resort. The beds are wonderful, the kitchen is just enough and the bathroom, though small is very efficiently set up with a large shower. The entire staff are very nice. This was our 10th visit to New Orleans and it was also our first stay in the Garden District. It was a good respite from the craziness of the French Quarter but still has plenty of grown up bars and shopping and good restaurants. This will definitely be were I will stay again when I return.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaime Kub","date":"2013-08-31 11:18:20 +0300"},{"content":"My husband and I and our two best friends just stayed here for Mardi Gras. Nearly everything from the time we arrived to the time we checked out was absolutely perfect! The entire staff was helpful and courteous, the room was clean and just as it was described online, and the balcony was the perfect location for watching the parades away from the chaos of street level. The only issue we had (and it really wasn't a huge deal) was that the resort does not have as many parking spaces as it does rooms. Since they were completely booked due to the holiday, by the time we arrived, we were not able to valet our car. Fortunately, there are ample places in the area to park. With the resort being directly on the parade routes, we were slightly concerened about the crowds on the balcony or courtyard areas. They do a good job of controlling that though with each guest being required to wear a colored wrist band (each day was a different color). Registered guests' bracelets are included in the price of the room and our visitors were able to purchase bracelets for $20 per day. This kept the crowds within the property at a reasonable level. The layout of the room was nice (studio suite) with the kitchen on one side, restroom on the other, a dining area near the large window, and a seperate space for storing luggage. We opted for two queen beds since our friends were staying with us and did not feel crowded at all. I had broken my ankle the night before our stay so was confined to a wheelchair and crutches for the duration. The staff was VERY helpful, opening doors for us, holding elevators, making sure everything was just right. The courtyard by the guest lounge is a great, quiet place to sit and enjoy coffee in the morning. I really just can't say enough positive things about this place! We will definitely be back again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Madie Goyette","date":"2015-12-15 12:50:16 +0300"},{"content":"We stayed here for a destination wedding 2 weeks ago. On the positive side, the location is great. Its just a short walk to Magazine Street. It's near the trolley and really in the center of the Zoo and the French Quarter. The rooms are nice and clean BUT the only mirror in the room was in the bathroom and could not have been larger than 24 inches. We heard some members of the wedding party had a full length mirror installed so we called and were told there were no more. We had to go out to the elevators to use the large mirrors there!!!!The other surprise to us was that there is no housekeeping service during your stay unless you want to pay 94 dollars extra per day!!! Overall, we found the room comfortable , clean and located well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Kallie Stehr","date":"2012-07-29 16:19:06 +0300"},{"content":"We stayed at the Avenue Plaza last weekend for a wedding, and received a fantastic group rate. For the price, we expected a glorified motel experience, and instead had a great nice hotel stay. The room was huge, with a large window with city views. Room 1219. King bed, kitchenette (no oven - everything else, including dishwasher and full-sized refrigerator), great bathroom and lots of space. There is a pool, gym, and easy valet parking, all right in the heart of the Garden District. The staff were friendly and efficient, the room was spotless and the bed (with six pillows) was luxurious. The shower has a sweet huge shower-head that is very nice. I highly recommend the Avenue Plaza.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Watson Daniel","date":"2014-12-26 20:37:03 +0300"}],"public_likes":[],"vacancy":true,"description":"A luxurious Victorian era hotel in the Gaslamp Quarter.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}