{"title":"Altrincham","name":"Cresta Court Hotel","address":"Church St, WA14 4DP","directions":"At junction of A560 and A56","phone":"+44 161 927-7272","tollfree":null,"email":null,"fax":null,"url":"http://www.bestwestern.co.uk/hotels/cresta-court-hotel-altrincham-83373/hotel-info/default.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.39093,"lon":-2.35009,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":593,"country":"United Kingdom","city":"Altrincham","state":null,"reviews":[{"content":"I stayed at this hotel in mid October for 5 nights. Initially I was put in a room on the Virginia Street side where there is a huge apartment building going up. The first night I was woken up at 6:45 AM due to extremely loud construction drilling, banging, trucks driving, & men at work. I asked to have my room changed immediately & the staff was accommodating. I was moved to the 4th Avenue side of the hotel & able to sleep undisturbed. The hotel location is great. The rooms were fine, but I would say that the lights were very dim. Brighter lighting would be helpful. I second some of the comments here about the mildew in bathrooms & small size of the bathrooms. However, the closets were quite large. The hotel gym was quite small & had only 1 treadmill, 1 elliptical machine & 1 stairmaster. The business center was also small-with only 2 computers, but free internet access & printing. The lobby is nice with the fireplace & Scandinavian decor. I would definitely stay here again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Tressa Kertzmann","date":"2014-07-31 08:11:08 +0300"},{"content":"I had a very pleasant 3-night stay at the Andra over Memorial Day weekend. The hotel staff was very pleasant and attentive. We had one of the larger rooms with a wet bar and walk-in closet. The beds were super-comfortable and the room was quiet! I think it was a combination of good sound-proofing and conscientious staff, because there wasn't the usual housekeeper noises at 8 a.m.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":5.0,"Location":5.0},"author":"Bart Rau DDS","date":"2015-03-04 20:51:44 +0300"},{"content":"I stayed in the Hotel Andra for 4 nights while attending a conference at the Washington State Convention and Trade Center; it was a quick 6 block walk from the hotel. The hotel was wonderful. I arrived early, and was able to check in right away. The room and bath were exceedingly neat and clean. As others have stated, the bed was so comfortable, and because I was so close to the conference, I could sleep in a bit longer in the morning and enjoy it! I had room service two times; both times the food was terrific, and arrived hot and in a reasonable amount of time. It was a bit overpriced, but there is a huge selection of restaurants in the area you can take advantage of. The only complaint was the charge for internet in the guest rooms - many cheaper hotels offer it for free. I would definitely stay at the hotel again, and would recommend it for any travelers, whether for business or leisure.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Jaydon Becker DVM","date":"2012-11-13 04:30:49 +0300"}],"public_likes":["Aniya Stoltenberg","Antonina Braun","Kathlyn Abbott","Alvena Ullrich","Carmine Donnelly","Jamar Purdy","Dr. Katlyn Bailey","Nestor Kshlerin","Buck Little"],"vacancy":false,"description":"140 bed, Best Western Hotel on the north side of the town","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}