{"title":"Monterey (California)","name":"Old Monterey Inn","address":"500 Martin St","directions":null,"phone":"+1 831 375-8284","tollfree":"+1-800-350-2344","email":"omi@oldmontereyinn.com","fax":null,"url":"http://www.oldmontereyinn.com","checkin":"3PM","checkout":"12PM","price":"$199 - $499","geo":{"lat":36.593591,"lon":-121.90052,"accuracy":"ROOFTOP"},"type":"hotel","id":18844,"country":"United States","city":"Monterey","state":"California","reviews":[{"content":"This is a nice hotel and the location is ideal as other reviewers have noted. We found the staff to be really helpful and friendly as well. And yes the rooms are tiny. We enjoyed our stay here. Do note that, however, that in an attempt to give the place a nightclub type cool ambience it is dark - real dark. Our rim was lit by just three very dim bulbs and no option for additional light. Don't plan to do a lot of reading or fine needle point work in your room!","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Makenna Crona","date":"2013-07-10 09:51:57 +0300"},{"content":"Here are the pros and cons: Pros: Convenient to harbor amenities, James Joyce Pub (excellent food) across the street, ice cream and movies next door, shopping one block behind. Clean bathroom with large shower area. Nice restaurant for breakfast inside. Housekeeping was prompt when called. Staff helpful. Valet parking. Cons: Lost water for the day (not their fault) because of a city main break, vent popped out of wall, carpet very worn in areas, beds average comfortability, vanity in bathroom is small--broke a glass that fell off when I tried to pull a towel down from rack. Not a lot of area to sit toiletries in bathroom--in fact, dryer hanging from bag on door! Lots of wasted space here. Not family friendly pool--this is a spa that everyone in the city uses--hotel guests are treated as second citizens--in fact my family was told they probably didn't have space. They make you walk past all of the exercisers to a small pool area for families and a large lap area for exercisers. It felt like the walk of shame.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Bernadette Thompson I","date":"2013-05-25 08:41:03 +0300"},{"content":"Disappointed in this location again and after 2 tries, we will not be using these facilities in B'more for any future trips. Had an issue using the Homewood Suites last year during a business conference that was very much related to housekeeping issues so this year on the advice of the person who took my reservation at the location, opted to stay at the connected Garden Inn as it is more \"hotel\" for vacationing versus HS which caters more to business travel. She offered to add in the breakfast as a comp as it was included in the Homewood Suites stay which was the same price and stated she would note this on our reservation. Upon arrival, the breakfast was not noted in the reservation record but it was quickly added without an issue. Went up to the room and the floors were very dirty. You could literally see food from a previous occupant on the carpet, huge stain of \"some sort\" on the chair, water all over the bathroom floor (puddles, not just damp!) and water dripping from the bathroom ceiling as if they had turned on the hot water, closed the door and just left it like that for quite some time. Contacted the front desk, they sent up a housekeeping super to help us move to another room and even he was taken back by the dirt and the nasty look of the stain on the chair (use your imagination!). They moved us across the hall and down a bit to a room that was larger but it too was dirty! There was literally someone's food wrapper on the floor right in front of the door before you even got into the room! Again, the carpet looked as if it hadn't even been vacuumed! Stopped on the way down to our dinner reservations and requested they properly clean the original room and move us back to the original room when we returned that night. The first room had a nice view of the water and the second overlooked an interior courtyard....no thanks! At this point I am feeling that if they don't vacuum, what else do they skimp on in terms of cleaning. We get back from dinner, move our things, room looks clean, \"stain\" on chair is either gone or they flipped the cushion...don't want to know. We go to the rooftop garden to enjoy the view for a few minutes and when we try to get back in, our passkey won't open the door! Hit the intercom button for several minutes with no response and now we are getting quite nervous. Its about 11PM, we have no cell phones, and we're stuck outside with no jackets. Someone finally answers the page and says they'll have to find someone to send up. My husband starts walking the entire park area and finally finds another door that will accept our key and we get inside...never seeing a staff member! Breakfast was definitely not up to Hilton standards and when the manager stopped by the table to say hello and ask us for suggestions to improve the food or service we suggested that they might want to at least cook the potatoes. He checked them, apologized and thanked us for the input...very nice man. The food (yes I know it was free due to the comp!) is not great. The bacon is so thin you can see through it for heaven's sake. Same thing when we were on the Homewood side last year as it is a shared kitchen. It was just very poor for a Hilton. I love love love my Hilton experiences and with two bad ones at the same location you really have to question what is going on. When we went to check out, the manager on duty said she was also the manager who was on when we were having issues the day before and that she was aware of what was going on and had addressed the issue with the staff. I suggested she might want to walk the property including the common areas and see the dirt in the hallways, the less than Hilton standards in the rooms, etc. She said she does do that and that was pretty much it. I really felt that my comments were not heard and nothing further was done. I sent Hilton Corp. my comments about this stay over 2 weeks ago and heard nothing back. This location is soooo perfect for the harbor area and Fells Point that it is sad that it doesn't live up to Hilton standards. I absolutely will still recommend Hilton to anyone who asks because there is usually a very high standard with the company but definitely not this one.","ratings":{"Service":3.0,"Cleanliness":2.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Dana Hegmann","date":"2013-06-25 20:04:57 +0300"},{"content":"Stayed here during the 4th of July. The hotel was wonderful, staff was pleasant and the bed was the best bed my husband and I had ever slept in. Super clean hotel. I would stay here again, for sure.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Adelle Dooley I","date":"2013-09-19 05:16:17 +0300"},{"content":"I just got back from a weekend at the Hilton Garden Inn at the Baltimore Inner Harbor. We are already planning a return trip! We had a pleasant room on the 10th floor. The room was clean and the bed was comfortable. The staff at the front desk were unfailingly helpful and friendly (especially Dave). They offered advice about where to eat our first evening, walking directions to attractions, and a bottle opener for our beer. I read here that some people had trouble with parking, but the valet jumped to assist us the minute we pulled up. The hotel is in a great location - an easy walk to the Inner Harbor attractions and Little Italy. The neighborhood is very nice and we felt comfortable walking at night. The James Joyce Irish Pub across the street serves yummy crab soup and reubens in a rustic atmosphere with unobtrusive live music. We tried the breakfast buffet in the hotel this morning and were pleased with the made-to-order omelettes, hot coffee and friendly service. Stay at the Hilton Garden Inn!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Aliya Smith","date":"2015-03-09 14:28:30 +0300"},{"content":"We booked this hotel through Priceline, so we weren't certain of what we were getting until the confirmation came up. Though I read reviews on Trip Advisor bashing this place, when my husband and I arrived we were definitely happy with what we found. The room was bright and clean, tastefully furnished, with nice little amenity toiletries of good quality. The bed is among the most comfortable we've ever slept on in a hotel. The staff was friendly and courteous. We did not use the gym or the breakfast room, but the attached restaurant has a fun atmosphere on a Friday night and the bartenders there make a mean mojito. We also loved this place because it is a stroll away from everything the Inner Harbor has to offer, as well as proximity to some of Baltimore's newest shopping areas. We grabbed a fresh (hot!) baguette from Whole Foods for breakfast, walked along the waterfront, and were quite impressed with our good fortune. I'd recommend the Hilton Garden Inn Inner Harbor to anyone.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Tom Kemmer","date":"2014-04-26 19:10:03 +0300"}],"public_likes":["Eldora Johnston V","Rosalind Swift","Hassie Schmeler","Fausto Mante","Vallie Bahringer"],"vacancy":false,"description":"A historic bed and breakfast featuring fabulous gardens. Breakfast included. Pet friendly rooms available.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}