{"title":"Knutsford","name":"Mere Court Hotel","address":"Warrington Road, Mere, Knutsford, WA16 0RW","directions":"Leave M6 at junction 19 and follow the signs for the A556 towards Manchester (M56). After approximately 1 mile, turn left at the cross-roads onto the A50 towards Warrington. Mere Court Hotel is situated about a mile along the right hand side.","phone":"+44 1565 831000","tollfree":null,"email":"reservations@merecourt.co.uk","fax":null,"url":"http://www.merecourt.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.34397,"lon":-2.43,"accuracy":"APPROXIMATE"},"type":"hotel","id":14226,"country":"United Kingdom","city":"Cheshire East","state":null,"reviews":[{"content":"My partner and I just spent a weekend at this great hotel, and we couldn't have chosen a better place to stay. First of all, this hip property is perfectly managed - from the check in to room service to reservations for restaurants and cabanas at the uber-fab pool, the friendly and energetic staff was right \"on it\" and got things done right away. Then, the rooms are very modern, stylish, comfortable, and well equipped, with a huge, chic, white marble bathroom. And finally, the roof-top pool, a veritble model/actor runway of LA's hip and fabulous, is a scene by itself, with Drai's, the restaurant and night club next to it, serving some of the best food in LA. Not inexpensive (as other reviewers have noted) but worth every penny if you're in for the ultimate LA experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Antwon Durgan","date":"2014-09-17 20:43:31 +0300"},{"content":"I am a Gold SPG member. Maybe if I was Platinum I would have received better service. I am a frequent business traveler. I’m very loyal to SPG and only choose SPG hotels when traveling and would drive hrs to stay at a SPG hotel. But I wouldn’t drive 5 minutes to stay at W Hollywood again. I’ve stayed at several W Hotels but W Hollywood is the worst experience I’ve had with any SPG hotel. I was very excited to stay at W Hollywood since this was my first stay. I reserved an upgrade room 1 month in advance and was very disappointed at check in. I reserved a high floor and I was placed in a downgrade room on the 2nd floor. When I asked to be placed on a higher floor I was told all rooms were committed for late check out. A little puzzled by the response since I was checking in around 4:30, I asked what time is late check? I also stated I did not mind waiting for them to check out and to place my bags in a hospitality room while waiting for a clean room. I was told this was not an option and the only room available was a Cool Corner room which is $700 a night and they don’t upgrade guest to those rooms. I asked would I have access to Drai’s. I was told no that access to Drai’s is based on a reserved list and first come first serve. They made me feel as if it was a privilege to stay at their hotel rather than making me feel like a valued guest. I do not recommend this hotel if loyalty is what you want……….","ratings":{"Cleanliness":3.0,"Sleep Quality":2.0,"Overall":1.0,"Value":2.0,"Service":1.0},"author":"Meggie Huels Sr.","date":"2012-07-25 12:03:00 +0300"}],"public_likes":["Kira Kessler","Bradford Kunde","Iva Hagenes","Dean Mills"],"vacancy":false,"description":"Hotel & Conference Centre","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":false}