{"title":"Llanfynydd","name":"Stangwrach Self-catering Cottage","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.holidaycottagewales.com/stangwrach-cottage.htm","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.92663,"lon":-4.093677,"accuracy":"ROOFTOP"},"type":"hotel","id":15957,"country":"United Kingdom","city":"Carmarthenshire","state":null,"reviews":[{"content":"Arrived at the resort late in the evening. Bell Service was good, check-in was speedy and room was a bit on the smaller side but nicely decorated and most importantly clean. The hotel appears to have gone through a rehab recently. Workout room is average size and rooftop pool has great vistas and is average size. We had a room that overlooked the water. The only complaint was a little bit of noise coming from the rooftop air conditioner from the next building.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":4.0},"author":"Cheyanne Cronin V","date":"2013-09-10 00:28:32 +0300"},{"content":"As an SPG member I was directed towards this hotel for my last night in San Juan before departing back home. I had booked a suite as quoted with a \"beautiful city view of historic old san juan.\" I was expecting a lovely view with a nice view of the city and port. I was looking forwarding to relaxing in this city in my nice suite. Instead I was given a \"suite\" that just felt like a dark gloomy basement. The \"historic city view\" was a giant parking structure 5 ft outside the window. It was by far the most misleading room description I have been given in my 100+ hotel stays this year. I gave the hotel the opportunity to rectify the matter but nothing was done. They had no rooms to move me to and could only offer a small credit towards the $319 I was originally quoted. Keep in mind they ALSO charge a $25 service fee and TAXES on top of that. The hotel is a joke with no real management. I will be filing a formal complaint with SPG corporate. Unless you are boarding a cruise ship, DO NOT STAY HERE!! Your vacation will be ruined. What pissed me off the most was the front desk who was quite aware how misleading the description was. The bellman told me they get such complaints daily. DO NOT STAY HERE!!! Its a dump!!! No better than a motel 6.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":2.0},"author":"Rasheed Grimes","date":"2013-09-13 18:15:18 +0300"},{"content":"You couldn't ask for a better location if you are doing a Carnival Cruise. This hotel is across the street from the Carnival Pier 2. It's very nice, clean. They stored our luggage since we arrived before check-in & then again after check-out before our flight departed - allowing us to explore Old San Juan. Large rooms, A/C, big flat screen TV. Their rates are expensive so we did Priceline & I was surprised they accepted our offer of $75/night. Taxi to airport was about $23 (4 bags). It's a couple minute walk to a lot of the restaurants.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Lurline Hagenes","date":"2013-08-24 03:52:54 +0300"},{"content":"We stayed here for 2 nights after a cruise. We paid $200 for two nights on Priceline, and upgraded to a suite for an extra $50 per night when we got there. Glad we did. The suite was enormous with a balcony view of the waterfront. I peeked at some of the regular rooms which appeared small, so my room rating is based upon the suite only. There is a great burger joint (Chicago Burger?) at the base of the hotel. We also had breakfast one morning in the hotel restaurant. It was pricey at $18 pp, but was good food. The pool has a pretty neat view on the top floor of the hotel, but it is small. Service was not the best - they failed to restock the in room coffee after the first night, and we didn't have any clean towels for the second day. I would recommend this hotel still for those that are staying here for a short duration, since it is central to Old San Juan, it was walking distance from the cruise ship pier, and the majority of our time was spent exploring the area and forts on foot. This is NOT a vacation destination by itself.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Carrie Torp","date":"2013-10-30 02:34:45 +0300"},{"content":"Very convient a small walk from the port don't even have to take a taxi! Everything was good, the accomadations and everything, but when it came early morning and you heard \"barking\" it wasn't pleasent being right next door. We had no idea that pets were allowed and we don't even know if they have designated rooms, just in case somebody is allergic! It would have been nice to be informed when we are paying customers. Either on their website or when you check in just a \"f.y.i\". When we asked checking out their was a \"dog show\" in town and they allow pets, no apologies were given. I thought I would mention this for those that are allergic to dog hair, or to make sure your childern's shoes are on their feet so they don't pick up stuff and bring it into the bed.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Mrs. Valentin Williamson","date":"2015-12-14 04:44:59 +0300"},{"content":"I had read the reviews and did not have high expectations, but nevertheless I was disappointed. We booked the room through the convention organizer, who got us a rack rate of $145 per night plus tax. For that I Had expected at least a larger room with a good harbor view, but we got a rather small room, no closet, and a dirty bath, with a used hairy cake of soap in the shower. The casino made the small lobby a noisy and unpleasant place. It did have a great location for cruise ships, but we were not on a cruise, but at the convention center, a few miles away. The new Sheraton opened today, and we moved to the new Sheration Convention Center. It has more room at a slightly lower price!","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":2.0,"Location":4.0,"Rooms":2.0},"author":"Christophe Johnson","date":"2014-08-14 07:38:44 +0300"},{"content":"My Family and I stayed at this hotel for just one night. We were going on a cruise the next day. From the time we checked in with Front Desk to the time we checked out, the experience was the best. For 6 rooms to checkin at once, we were checked in within 20 mins tops. We went straight to our rooms, changed clothes, and went walking the grounds of Old Dan Juan. Let me just say night time, Wonderful. From the restaurants to the shops, everything was awsome. Our rooms were on the 7th floor with a beautiful view of the water and cruise docks. I was very sad that I had to leave the next day on my 7 day cruise. But, whenever I do the cruise again, I'll definatly stay here. Rooms: Excellent! Bathroom: Clean Service: Excellent!!!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Marianna Herman","date":"2013-11-02 14:14:23 +0300"},{"content":"As an SPG Gold member, I was given a corner suite, which was quite nice. I stayed here about 5 years or so ago when it was a Wyndham, and the property has definitely been upgraded in terms of amenities, decor, and quality/comfort of furnishings. Although it was a suite, the single sink was inside the bathroom. It would have been tough for a family. The hotel is in a good location for those wishing to spend a day or two visiting old San Juan on their way to either other islands or to other parts of the island (we were pre-cruise). It's near the entrance, so the traffic isn't too horrible coming in. Some other old San Juan hotels (such as El Convento) are a bit of a nightmare to get into by car or taxi. Basically, all of old San Juan is walkable, and there are plenty of good eating places nearby. Notwithstanding one of the member pictures on this site, our cruise ship was docked a couple of miles away, by the executive airport. Our room was across from a nightclub, so I was worried it would be noisy, but it wasn't (on a Friday night). The living room of the suite was next to the ice machine, which was quite noisy, but the noise didn't carry into the bedroom. The TV's are flat-screen but not high-definition. The casino is nice and friendly, but has no craps table (one has to go to the Marriott in the Condado neighborhood for that). The pool is fairly small, but with a view--and probably the best for Old San Juan. My main complaint relates to the elevators. There are only two and they are small. They were jammed-packed and we couldn't get in them in the morning when we were checking out. We were finally able to squeeze into an elevator going up, then had to go up and down the hotel, to the glares of frustrated guests. This hotel is probably a good choice for someone who wants to spend a day exploring old San Juan prior to a cruise or to a trip elsewhere in Puerto Rico or the Caribbean. It's not a place to soak in the sun, lie by the beach (not near a beach), nor lie by the pool. And I wish they'd do something about the elevator situation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":5.0},"author":"Lucinda Littel","date":"2012-02-11 11:20:48 +0300"}],"public_likes":["Dell Bode IV"],"vacancy":false,"description":"Stone cottage c. 1756 sleeping 4+2 near both the market town of Carmarthen and the historical town of Llandeilo (7 miles), centrally heated throughout.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}