{"title":"Swansea","name":"Cwmshon Cottages","address":"Old Road, Ynysmeudwy, Pontardawe, Swansea SA8 4PL","directions":null,"phone":"+44 1792 865237, +44 7960 438961","tollfree":null,"email":"fiona@cwmshoncottageswales.co.uk","fax":null,"url":"http://www.cwmshoncottageswales.co.uk","checkin":null,"checkout":null,"price":"mid-range","geo":{"lat":51.72931,"lon":-3.83978,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":28957,"country":"United Kingdom","city":"Pontardawe","state":null,"reviews":[{"content":"My wife, 4.5 yr old daughter and I stayed for 3 nights in a 14th floor, 1 BR standard suite @ $167 per night including taxes and fees. Pluses were the full sized kitchen, very roomy BR, nice bedding, pull-out couch, a good sized bath, free Wi-Fi, and overall cleanliness. Tons of storage space and the corner suite provided amazing views of the East River and NYC. The location was within pretty easy walking distance to museums, Central Park and subway stations. The furniture, including TV weren’t new but they were very serviceable. On the down side, with all the windows and subway construction below, it was a bit noisy but you’re in NYC after all. Also, the front desk wanted to charge us $35 per night to make up the sleeper couch but we pointed out that the reservation was clearly for 3 people and that there was no mention of the extra bedding charge when the reservation was made. They agreed to waive the charge without too much squabbling. We’ve stayed at other all-suite hotels in Manhattan and this was by far the best value of the bunch. Would highly recommend it and definitely stay there again.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Daniela Frami","date":"2015-11-02 14:37:54 +0300"},{"content":"It was my first time at the Marmara Hotel. It was great like having an apartment in the city! Service was impeccable, rooms where clean and modern! Great place...","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":3.0,"Rooms":5.0},"author":"Everett Waelchi","date":"2013-06-17 16:51:31 +0300"},{"content":"This is a great place to feel like home and most of the rooms are away from the NYC sirens and traffic noise - it's the best place to feel home away from home. Their is a kitchen with many gourmet markets near by for stocking up. Easy walking area and getting to the heart of NYC","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Audra Rempel","date":"2013-08-28 07:56:05 +0300"},{"content":"My parents and I love staying at the Phillips Club. We stay there almost everytime we go up. We usually take a 1 bedroom and I sleep on the couch. We like the fact that we don't step over each other in 1 room. Also we like the fact that there are two televisions and a kitchen. It helps especially in the mornings since we don't like big breakfast.","ratings":{"Overall":5.0},"author":"Brooklyn Sauer","date":"2015-05-01 05:49:14 +0300"},{"content":"It is at good location near time square and close to subway. Price is also a good deal. Room is also clean. If I go to NY next time, i will choose to stay at Manhattan Broadway Hotel again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Elsie Kiehn","date":"2014-12-28 10:11:14 +0300"},{"content":"The hotel service is excellent! Susie is a very nice person, and dedicated customers, have to admit! And the other staff were also committed to help with any questions or problems. Another great thing was the location point: very good! 3-4 blocks from Times Square! Close to everything! I did most things on foot. Now, points of improvement: cleaning the rooms. They were always dirty because the hotel never cleaned the floor. It had a lot of dirt, and hair from previous guests. The bed linen could also improve as comforters were old and very used. I found them too many hairs from other guests. We could pass a reform, it has many good things to offer. Overall I enjoyed staying there. It was a hotel used only to sleep. In short: excellent location, very friendly attendants and willing to help. But the room cleaning, linen, and conservation of the hotel were not good. If you are looking for a hotel with great location, just to sleep and with proper care, can stay there!","ratings":{"Service":5.0,"Cleanliness":1.0,"Overall":3.0,"Value":4.0,"Sleep Quality":2.0,"Rooms":1.0,"Location":5.0},"author":"Grady Little","date":"2014-01-18 19:43:38 +0300"},{"content":"I spent two nights in this hotel with my wife visiting friends in NY. This hotel was just fine for us. The room was rather small but the bed was big and confortable; same with the bathroom, and everything looked reasonable clean. What I liked the most is the location next to 8th avenue; it is very close to times square but not overwellmed by the turists crouds, and 8 and 9th avenues have more authentic NY restaurants and bars and better prices that the times square area. My room was not facing the street and in was very quiet. I was recomended by the hotel staff (by phone) to park at the Central parking structure at 40th between 7 and 8th. !!!Be prepared to take all your luggage and things from the car as soon as you pull over, since they will park your car for you and you can not access it untill you take the car away!!!. They charged me $60 for 47 hours with a boucher I was given at the hotel desk. We had breakfast at a chinese bakery next to the hotel with real NY people. The coffee and the pastries were surprisingly good.","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":3.0,"Value":4.0,"Service":4.0},"author":"Emmanuel Ratke","date":"2012-04-29 13:14:15 +0300"}],"public_likes":["Nichole Rowe","Doyle Will","Cynthia Satterfield","Hallie Daniel","Gisselle Hessel","Beatrice Schultz","Jeffrey VonRueden","Magdalen Zemlak"],"vacancy":true,"description":"5 star Visit Wales cottages - each sleeps 6 - in quiet village location close to shops and amenities. Convenient for Gower, Mumbles, Brecon Beacons, Black Mountain. Dedicated bike storage and bike washing facilities - 20 mins to Afan Forest Mountain Bike Centre. Awards : Tripadvisor Certificate of Excellence 2014, Tourism Swansea Bay 2012 &quot;Best Self Catering Accommodation&quot;.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}