{"title":"Pitlochry","name":"Pitlochry Youth Hostel","address":"Knockard Road,PH16 5HJ, 0870 004 1145","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.syha.org.uk/hostels/highlands/pitlochry.aspx","checkin":null,"checkout":null,"price":null,"geo":{"lat":56.7049,"lon":-3.7291,"accuracy":"APPROXIMATE"},"type":"hotel","id":22461,"country":"United Kingdom","city":"Pitlochry","state":null,"reviews":[{"content":"A decent-sized room for the low $100s two stops from Times Square on the express train. If you're looking to see New York (and not spend your days at your accommodation) Hotel Newton works very well. It's a nice place, seems well kept. Had no trouble at all-- worked great as a place to sleep and keep our stuff while we touristed. It is walking distance from few things, but the location's best because you're a block and a half from the 96th st station, which will take you downtown pretty quickly on an express train.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":3.0,"Rooms":3.0},"author":"Jo Collier","date":"2014-06-11 09:35:15 +0300"},{"content":"Stay away of this hotel!! With the same price you could have hotel with better location, clean room and own bathroom. Our room was very small, awfully cold, dirty (and the cleaning lady did not clean it while on our stay) and the shared bathroom was awful. Our stay did feel like we would be in a motel. Also, this is not a three star hotel as it did say on Booking.com, this is fairly a 1 star hotel, or more like a hostel.","ratings":{"Service":2.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":1.0,"Value":2.0,"Rooms":1.0,"Location":2.0},"author":"Cornelius Brakus","date":"2012-09-05 22:33:09 +0300"},{"content":"GOOD DEAL FOR THE PRICE AND LOCATION,a friendly,helpful staff..rooms are clean,rm 502,503 view of broadway.. nothing to see but cars.. quiet ,safe area,,rite aid close by,mcdonald's for nite snacks. Sept 2008 visit, 4 adults 2 rooms,..saved 500.00-600.00 each by staying here instead of Sheraton or Park Central. The Newton hotel is ideally located on the main subway line at 96th Street. An express Brooklyn bound train takes you to the heart of Times Sqaure in just a few minutes. We would stay here again.. looked at many sites, not disappointed in the pick..","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Dorcas VonRueden","date":"2012-09-11 19:21:15 +0300"}],"public_likes":["Mr. Franco Collins","Cloyd Stark","Eliseo Herman"],"vacancy":false,"description":"Great 62 bed hostel near the town centre in a fine stone mansion.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}