{"title":"Marina del Rey","name":"Jamaica Bay Inn","address":"4175 Admiralty Way","directions":null,"phone":"+1-310-823-5333","tollfree":"+1-888-823-5333","email":null,"fax":"+1-310-823-1325","url":"http://www.jamaicabayinn.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.98315,"lon":-118.45826,"accuracy":"ROOFTOP"},"type":"hotel","id":17596,"country":"United States","city":"Marina del Rey","state":"California","reviews":[{"content":"This hotel absolutely blew me away! Everyone is exremely friendly and helpful. The rooms had very nice decor and the beds were so comfy! Also, the Monaco is perfectlly located, a 3 minute walk to Pikes Place and around 4 minute walk to the convention centre. Can't wait to go back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Anna Schneider","date":"2012-03-20 14:52:37 +0300"},{"content":"Oh, $@!#% hum, this is getting really boring. Perfect stay, perfect staff, perfect 5-6 p.m. hosted wine hour, perfect place for our lovely pooch, perfect pillows, etc., etc. The location of the Monaco is just great and, although our puppy wanted some hot toddies at 5:00 p.m., I was the only one permitted to enjoy them. And of course, they are (my favorite word) free, during the hotel's nightly cocktail hour. The next morning, in addition to fresh-brewed Starbucks coffee (yes, there's that word again, free), there was a seasonally-inspired supply of hot-chocolate, which I mixed with marshmallows and a heap of other goodies. Yes, folks, just another perfect two-day stay in a fabulously-run hotel management company, Kimpton Hotels. Would I ever stay somewhere else? Well, maybe if it was FREE!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Miss Bernhard Beier","date":"2014-12-13 06:51:23 +0300"},{"content":"Came to Seattle for a football game. Hotel was perfect location close enough to walk yet also close enough to the city center. Loved the hotel we had a pet goldfish on our room throughout the stay, the staff was very accommodating . The only downfall was the bar ran out of our type of beer one night but that was completely stocked the next day!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Arvid Grant","date":"2015-10-05 10:19:59 +0300"}],"public_likes":["Amaya Hettinger","Krystel Erdman Sr.","Ms. Jarvis Thompson"],"vacancy":true,"description":"resembles a West Indies resort complete with lush garden, lovely beachside pool and marina views.  Its restaurant features trellis-covered outdoor areas.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}