{"title":"Yosemite National Park","name":"Lower Pines","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.739496,"lon":-119.565824,"accuracy":"APPROXIMATE"},"type":"hotel","id":33891,"country":"United States","city":"YOSEMITE NATIONAL PARK","state":"California","reviews":[{"content":"Be open minded....your not in Kansas anymore!   showReview(1229360, 'full');","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Velva Hudson","date":"2013-07-23 23:47:39 +0300"},{"content":"I made my reservations at this hotel through American Express Travel, not my usual method of using the Holiday Inn website directly, so I expected problems when I checked in. There were none! The front desk staff were always professional and courteous. The breakfast was hot, fresh, and fully stocked. The decor was outstanding in the lobby and common areas and in the room appeared new! The 2 queen bed suite we reserved was plenty large enough for three adults and the cleaning crew kept it spotless. Overall, I really wish I could have found something wrong other than the road construction at the entrance to the driveway, but I can't and the hotel had no control over that. The best part, you couldn't hear a thing inside the hotel from that construction zone. I have no complaints only compliments! This hotel is in the perfect location. Close to shopping, restaurants, the airport, and right off the highway. I am going to stay there again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Keith Lesch DDS","date":"2013-10-30 18:52:42 +0300"},{"content":"I attended a local event and chose this HI Express since it was close and was brand new. The decor is stunning, both in and outside the rooms. More like a chic boutique hotel than a HI. The lobby area bathrooms revaled a trendy night club. I was very impressed! Check in was quick, the room was emmaculately clean and fresh. My bathroom had a European shower which was such a treat. The bed was comforatable and I had a great nights sleep. I got down to breakfast about 9am and there was limited if not nothing available in the hot food trays. I waited a few minutes and the attendant brough some scrambled eggs which almost disappeared once she put them in. There was no bacon or any of the cheese stuff omletes I saw other people finishing up. In all it was a ery pleasant stay and very trendy, chic hotel. I'd recommend it and the room rates are very good.","ratings":{"Overall":5.0},"author":"Emilio Gutkowski DVM","date":"2013-02-19 15:08:02 +0300"}],"public_likes":["Ciara Crona"],"vacancy":true,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Located in Yosemite Valley, this campground is open from March through October, requires reservations, and offers 60 sites for both tents and RVs up to 40' in length.  Water and flush toilets are available.  Three larger sites are also available for groups of up to 12 people for $30 per night. Campsites 7, 13, 14, 18, 20 are wheelchair accessible.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}