{"title":"San Francisco/Fisherman's Wharf","name":"Marriott Fisherman's Wharf","address":"1250 Columbus Ave","directions":"between Bay St and North Point St","phone":"+1 415 775-7555","tollfree":"+1-800-551-6433","email":null,"fax":"+1 415 474-2099","url":"http://www.marriott.com/sfofw","checkin":"4PM","checkout":"noon","price":"$200-$300","geo":{"lat":37.8057,"lon":-122.4174,"accuracy":"APPROXIMATE"},"type":"hotel","id":25675,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Our stay at Hotel Decca was Wonderful.....! We Rented two rooms and both were lovely. The service from all staff was Excellant. The Restaurant was very clean and the Food and the Sevice was warm, delicious, and inviting. We will most Definatley stay there again!!!!!P.S. the shuttle service and the Drivers were Nice and very accommadating, also very informative about Seattle.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Dr. Esperanza Yost","date":"2015-10-25 00:25:09 +0300"},{"content":"I came to Seattle on business at the Zoo and was impressed from the start at the kind, friendly attitude of the staff. The main lobby is spectacular, decked in a very tasteful art deco style. The service was very efficient and the room was clean, spacious and had a nice city view. I stayed 4 nights and was never disappointed by the food, general tidiness of the entire hotel and most of all, the extremely attentive nature of the staff. They were always polite, informative and courteous. My entire stay was very enjoyable including the food, which is served in a bar in the basement. Once again, the bar staff were courteous and pleasant. The only drawback was that the bathroom was a little small but still practical. Otherwise, a wonderful stay in a great hotel, which I will certainly return to if I am ever in Seattle again. I would have no second thoughts on recommending this hotel to any of my friends and colleagues.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ezekiel Ferry DVM","date":"2015-12-31 08:16:22 +0300"},{"content":"Stayed four nights at the Hotel Deca and found it very accommodating with friendly staff, good shuttle service and in a great location in the university district. Will definitely stay there on my next visit.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Laila Kilback","date":"2012-12-17 05:39:44 +0300"},{"content":"Just a short review of Hotel Deca in the University area of Seattle. It's a nice boutique style hotel with rooms and bedding that are comfortable. The young men at the front desk (Ben was one and can't remember the other one who helped us with our luggage) were very nice and Ben even comped our parking since it was our first time to Seattle. The first night of our stay there was a wedding party so we took a quick walk after getting some info and found several places to eat with in a 2-3 block radius. There were no noise issues in the area of our room. Bathroom was small but adequate-it's a very old building that has been nicely redone. We enjoyed our stay.","ratings":{"Location":5.0,"Overall":4.0,"Value":4.0,"Service":4.0,"Rooms":4.0},"author":"Shemar Langworth","date":"2015-01-10 08:03:01 +0300"},{"content":"This hotel is located near the University of Washington campus. It was well appointed and convenient to walk to nearby restaurants, grocery stores etc. The shuttle service took us to Pike's Market and also to the cruise pier. That is a big plus. The staff was very professional. I wouid recommend this hotel.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Marlin Klein","date":"2012-10-31 01:55:26 +0300"},{"content":"Hotel Deca's very conveniently located to the U.W. campus and within very convenient walking distance of a number of lovely sights in Seattle. The hotel itself is older (historic!) but clean and well-kept. I was there for a small conference, and spent most of my time either at my computer in the room, asleep, or at the conference. the rooms do include free wifi but expect to pay for parking (the fee is reasonable). there is a tiny business center downstairs (two computers connected to a single printer, all in plain view of the front desk) that guests can use free of charge. i didn't notice any noise issues and thought the service was decent. the hotel was pricey but i think that's normal for that part of seattle (and still less expensive than downtown seattle, where my next conference was!) i'm not sure if the hotel provided the meals i ate at the conference but if yes, i can vouch that the food is decent also. i'd recommend it if you need to stay somewhere close to U.W.","ratings":{"Overall":4.0},"author":"Lewis Hackett","date":"2014-07-31 22:24:19 +0300"},{"content":"This is a complete revamp of the old Meany Hotel. The rooms are nicely done and the bed is superb, (I second the comment on the awful scratchy toilet paper.) The staff is helpful and friendly. The large free parking lot is welcome in a neighborhood with scarce parking.The views are great from the upper floors. and if you have business at the University of Washington, it is two blocks away. The walls are thin and the plumbing is old - meaning spurts of hot and cold water in the shower. The negatives: Wireless is lousy with a poor signal that sometimes quits/ The lamp by the bed is indeed stylish but the light is very poor making reading in bed difficult. At least on my floor, for several hours there were big bags of trash in the hallway taht appeared to be left by the maids. Several suggestions There are no public laundry facilities but there is a laundromat in the parking lot across Brooklyn. They offer drop off servuce. This is a student neighborhood so fine dining is not an option. There are a lot of good options about a mile east. Go to Yelp and search for Seattle restaurants:in Laurehurst.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0,"Service":4.0},"author":"Madelynn Trantow","date":"2014-10-27 00:00:20 +0300"}],"public_likes":[],"vacancy":true,"description":"285 rooms and 11 suites.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}