{"title":"Yosemite National Park","name":"Wawona","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.544681,"lon":-119.672725,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":33894,"country":"United States","city":"Mariposa County","state":"California","reviews":[{"content":"Beautiful resort with terrible service The grounds of the Paradisus are beautiful and well-maintained.The rooms are adequate and housekeeping was not consistent - some days we got supplies and some days we did not, despite leaving a tip each day.The food ranged from marginal at the steakhouse to good at the Italian and French restaurants.No need to pay additional for royal service. For a small gratuity, we had our own personal concierge who made all our reservations and even accompanied us to the Plaza Bavaro, a shopping village within walking distance but outside the hotel grounds. He also arranged for us to be picked up and dropped off at the side gate for a trip to the casino at the next hotel.We were also granted access to the royal service section of the beach where drinks were delivered regularly. Perhaps because it was off season, but we were able to avail ourselves of many of the perks without paying more.Although we enjoyed our vacation there, the service left much to be desired. Unless you asked multiple times, you did not get what you requested. Sometimes it was lack of communication and sometimes we were just ignored. Either way, it was unacceptable. The club was under renovation but the music and dancing took place in the lobby, which was fine.Having said all that, the single biggest problem, and one that will insure I never return to the DR was the airport.On our previous two trips, the airport was an annoyance, but this trip was unbearable. There was only one (yes, one) security scanner operating for thousands of people. Needless to say, it took hours to get through. The lines snaked around until there was no place left to go at which point, people just began getting on line wherever they wanted, causing huge gridlock. The officials did nothing to help. It was a nightmare.","ratings":{"Service":1.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Dovie Grady","date":"2015-04-14 19:36:56 +0300"},{"content":"wish we could have loved it, but... We received a Travelzoo special deal on Paradisus for a package price with a guaranteed upgrae at the hotel. We booked it and pre-paid on the hotel web site (they're part of Sol Melia) and asked the hotel for help with booking transfers. We received the confirmation of the transfers from Karina Rijo at Sol, but when we arrived there was nobody waiting and we couldn'teven find the transfer company she referred us to. We got a cab.Once at the resort, we tried to check in with Lourdes at the front desk. She had a reservation for us but had no record of the upgrade. She didn't even have a record of the payment, though she did have a booking. After nearl 80 minutes at the front desk, we finally paid the booking again and took the lower grade room. Unfortunately, we found that we'd been at the front desk so long that we'd missed the opportunity to book a reservation at one of the better restaurants at the facility, so we figured we'd just chill and have dinner at one of the buffets.Dinner is a funny thing at Paradisus. There are a number of restaurants at the resort, some of which are open and some of which are closed on any given day. The schedule says you have to make reservations between 8.30 and 3pm each day for the following day, but the reality is that if you show up after 9am you're ou of luck. The good restaurants fill up within minutes (they have a premium reservation package for an extra fee and I suspect those people get first crack at the good tables) so get there early. On the first day we went to one of the two restaurants that didn't require advance reservations and were told (at 8.30) that the wait was about an hour. We went to the other one and, again, the wat was about an hour. Curiously, we found that the better restaurants that required bookings were, according to the staff booked to capacity but the rooms were only about half full. When we finally did get into one of the restaurants, we noticed that, again, the good restaurants were still only about half full. and when we left 45 minutes later the tables were--you guessed it--about half full. On the second day the story with the restaurants played out about the same, except that we tried going earlier--about 7pm. Again, the better restaurants wouldn't seat us because they were full to capacity and the others had a 60-minute wait. A friend in the hotel business said that some resort operators deliberately keep the number of bookings at the better restaurants way below capacity to save money and channel people into the lower cost places. But if you're getting lines of an hour, is that a reasonable course of action?It migh have been worth it if the food had been good, but it wasn't. They might have a focus on lowest common denominator, but I've never seen such beautifully arranged and presented food that was so incredibly bland. Devoid of flavor, dead, vapid. Contrast that with the bar, which was stocked with lots of top shelf alcohol up front--for display only, though. I saw the drinks were actually mixed with no-name bottles below the view unlss you specifically asked for it to be made from one of the good bottles and watched the barkeep make the drink.One thing that was great at this resort is the beach and the grounds. Whoever manages the grounds deserves a medal. the housekeeping staff and groundskeepers are wonderful and the surroundings are lush and beautiful.We really wanted to love this place but couldn't. The beautiful grounds couldn't make up for the terrible management. We won't be back, and I don't think we'd go back to a Sol Melia place either. I'm sure the locals take their cue from the Sol management.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":4.0},"author":"Kayla Langworth","date":"2015-05-07 14:33:07 +0300"},{"content":"Careful of the ATM Just a heads up ..... I tried to take out some $$ from the hotel's ATM.... it dispensed the pesos then immediately withdrew them back into the machine and said transaction cancelled. So I waited and did the transaction again. When I got home --- BOTH transactions had been deducted from my bank account.I am disputing this and my bank says it happens sometimes so they are sure the funds will be deposited. Just be ready and GRAB that money quickly before it gets sucked backed in.Have a great vacation.... it is gorgeous !!!","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Jamison Medhurst","date":"2013-12-17 00:29:43 +0300"},{"content":"AMAZING!!! This place it AMAZING! Everything was beautiful!, The food was delicious. The view was soo pretty. This was our 2 year. Might go back again. First year we went here we stayed here for 1 week. Second time we stayed here was for 2 weeks!, We all loved it, we went down as a family of 10. The entertainment was awsome!. I have absolutely nothing bad to say about this place. It is worth the money to stay here. Hope my advice is helpful!.Might see you next year!","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Rachael Schowalter","date":"2015-06-22 00:45:29 +0300"},{"content":"ok but only jusr stayed here in 1999 and this time everywhere is far far busier, as expected. Beach is fabulous but crowded. We upgraded to Royal Service, not sure the extra we paid was fully worth it. True you do have the rooms with the best views but they are a little tired and need of renovation and certainly redecoration. The grounds are great as as the staff. The food was a little disappointing until we ate at the sister complex, the Reserve, far better here, ate there for 4 nights out of the 7. French, and seafood Rest. very disappoining. Also make sure you are fully aware of what is on offer as part of the fully invclusive - all water sports. there is also an inclusive wine list which they seem reluctant to give out!! Tghere is strange retro music throughtout the grounds, this grated after a while but that may be personal taste. One review did say the drinks were diluted, utter nonsense, they are always plentiful and too strong at times. Be aware of the activities in the main lobby and at the reserve, daily lists are simply not available and in the rooms there is no composite document of what the hotel has to offer. There is a great gym for use in the reserve but nothing is on hand to alert you to that fact!! Overall, location great and enjoyed our stay, Royal Service, not sure. The RS restauarant and private beach was welcomed but it came at a price. Its not what we call; 5 start in theUK but it was a good week.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":3.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Janessa Beatty","date":"2015-09-26 00:56:07 +0300"},{"content":"A place to just, relax....well not quite. My boy's and I had the chance to visit the DR this past winter during their Spring Break. After reading some reviews here, and talking to some friends, we decided to visit Paradisus. The hotel is about 30min from the airport and on the southern coast. It is situated in a very lush tropical setting and the grounds are beautiful.We arrived around 6pm and waited over an hour to check into the hotel. While there seemed to be plenty of hotel staff, they were really not focused on taking care of the guests as they arrived.After a lot of confusion we were taken to the Family Conceirge to check in, and they too were a bit confused and unorganized. Eventually, we were given our rooms but the confusion did not stop there. One of the rooms was occupied by another guest, who was suprised to see 3 boys appear at their door at 900p!! We moved into one room, while the Conceirge went to figure out where the other room was. About an hour later they found a room to use for one night in another part of the hotel. It was almost 1030p before this was ever resolved. The next day we had to move to another set of rooms that were adjacent to each other. We had an all inclusive meal plan which was very convenient for all of us. The downside is that you are pretty much locked into eating within set times, and there are no late night places to get a snack or late dinner. The restaraunts are not the resorts strong point, in fact they are all fairly average, the one exception is the one that is on the beach and open for lunch - this one had a pretty good buffet in a nice setting on the beach. The pool is very nice, but you need to claim your spots early in the morning to be assured being close to the pool. The beach is also very nice, good surf, nice wide beaches. This too requires a little advance scouting to claim chaises etc in the early am.If sleeping on the beach/pool and completely relaxing due to a lack of activities is not your thing. You will need to get off the property. The lobby had quite a few services geared toward scuba diving, snorkling with sharks (more of a booze cruise), atv's etc I used the gym, it was very small for a resort of this size, but if you hit it at the right time you had the place to yourself.For us it was nice to get away and spend time together, but I would not return to Paradisus. The restaurants need to improve, the room decor could use an update/refreshening and the hotel staff was just a bit to unorganized for my taste.","ratings":{"Service":2.0,"Business service":1.0,"Cleanliness":3.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":3.0,"Location":5.0},"author":"Mollie Spencer","date":"2012-09-18 04:18:03 +0300"},{"content":"Excellent hotel despite the food My husband, son and I stayed at the new Reserve section of the Paradisus Punta Cana over the new year's holiday. Overall, the experience was excellent. We stayed in a junior luxury suite. The rooms were well-appointed and clean. There was an enormous jacuzzi tub, a massage shower, a bedroom, living room, kitchenette, and balcony. The room overlooked the Reserve's private pool which was surrounded by plenty of private bed/huts and lounge chairs. The Reserve also has two private restaurants - Gabi, for breakfast, lunch and dinner (buffet) and Vento, fine-dining. We spent most of our time at the Reserve section of the beach - very clean sand, plenty of lounges, plenty of shade, etc. The staff is extremely kind, especially to children, although the lack of english is a barrier to getting things done. We did feel that the front desk staff needed to have at least one FLUENT speaker of english to provide orientation and solve little problems. (This is not just for us Americans, the hotel had a large number of native French and Russian guests as well. ) Drinks were plentiful and of good quality; food was easy to come by, but, as noted by many others in all reviews of all-inclusives, is the food is just not that good and we did get sick either from food or water. Overall, the beach and the service made up for the food, but I do wish it had been better.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Brock McGlynn","date":"2012-05-28 22:00:14 +0300"}],"public_likes":[],"vacancy":true,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Wawona campground is open year-round, requires reservations April–September, and offers 93 sites for both tents and RVs up to 35' in length.  Water and flush toilets are available. Campsites 69 and 70 are wheelchair accessible.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}