{"title":"Criccieth","name":"Rhos Country Cottages","address":"Rhos Cottages, Ynys,Criccieth.LL52 0PB","directions":"One mile off the B4411 road at Rhoslan","phone":"+44 (0) 1766 810295 or 0776 9864642","tollfree":null,"email":"anwen@rhos.freesere.co.uk","fax":null,"url":"http://www.rhos-cottages.co.uk","checkin":null,"checkout":null,"price":"From £380 to £1200 weekly (winter breaks from £80 nightly)","geo":{"lat":52.9464,"lon":-4.2795,"accuracy":"ROOFTOP"},"type":"hotel","id":7001,"country":"United Kingdom","city":"Gwynedd","state":null,"reviews":[{"content":"My husband and I stayed at Harrah's for three nights with a conference, and we were disappointed by the facilities. First, the room in the Mardi Gras Tower was small, dark, and noisy. The \"view\" consisted of other high-rises, rooftop A/C equipment, and construction. Also, the room was without amenities. The TV offered only a dozen (mostly local) channels, but plenty of advertisements for Harrah's facilities. The bedside clock radio was inoperable. Not only was the room without a micro/fridge, there was neither in-room coffee nor daily newspaper. Second, Harrah's food services were disappointing. The continental breakfast in the business center was attractive, but limited. Two meals (one breakfast, one lunch) were offered at The Range, both of which were far below expectations. The menu, presentation, and service were on par with typical cafeteria fare. The Chinese restaurant offered tasty dishes, however service was inexplicably slow, and the food chilled quickly after it was served. Third, the common areas of Harrah's were less than accommodating. There was no place to sit unless one was gambling, eating or drinking. There was no complementary coffee or paper, even at the front desk. Most disappointing was the lack of pool/spa facilities. I was shocked that a resort with the renown of Harrah's didn't have a year around pool. The only positive comment I have for Harrah's is its central location on the strip. This, however, wouldn't be reason enough for me to consider staying there again.","ratings":{"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Service":1.0,"Rooms":2.0},"author":"Mona Bernhard","date":"2013-07-07 02:24:07 +0300"},{"content":"We just returned from a 2 night stay at Harrah's in September! We have stayed at other casinos on the strip ie mirage and luxor, but after staying at Harrah's a few years back, we decided this was definitely our favorite! It is definitely the most fun and what a great location! The Carnaval Court right outside is addictive! The bartenders there are such a source of entertainment, it's hard to tear yourself away. One word of warning, the drinks are expensive but you are paying for the entertainment value as well! And there's no skimping on the alcohol either. I'm sure most alcoholic beverages were doubles at least! The only complaint I have is that the rooms are very noisy. We stayed in the Mardis Gras tower and we heard every noise down the hall and the surrounding rooms, toilets flushing, taps running, bodily sounds etc. But I did hear that the rooms in the Carnival tower were newer and much quieter. I also heard that they were improving the Carnival Court so the noise from the outside didn't travel up to the rooms and they were also improving the buffet. So that's exciting. We wouldn't hesitate to stay there again!","ratings":{"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":2.0},"author":"Brook Keeling I","date":"2013-12-04 09:45:47 +0300"},{"content":"I was in Vegas this month and found Harrah's Carnaval Court to be the best bar I visited. I loved that it was outdoors and had such a fun, inviting atmosphere. The bartenders were GREAT! Their skills and \"flair\" bartending were the reason I stayed there all night. They were so much fun to watch and were very attentive to everyone at the bar. The music they played at Carnaval Court was good and they had a nice dancefloor which was almost packed on the two nights I was there. I am definitely going back to Vegas soon and will probably be going to Harrah's every night!","ratings":{"Overall":5.0},"author":"Charity Gottlieb","date":"2012-01-07 09:53:58 +0300"},{"content":"We went to Vegas in February to get married. Stayed at Harrahs - it was wonderful. Very clean, all amenities, nice people. Only complaint is when you check in, the ladies there pushing the time share program.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Alexanne Legros DDS","date":"2015-07-23 12:26:25 +0300"}],"public_likes":["Audreanne Hills","Javonte Quitzon","Alverta Reynolds","Godfrey Boyle IV"],"vacancy":false,"description":"A collection of 4 quality 5 Star (Visit Wales Graded) self catering cottages. Situated 4 miles north of Criccieth in peaceful secluded grounds with lovely views of Snowdonia and country walks from the door down to the Coastal Path.  Accommodation sleeps 2 - 6 people and is open all year. Always warm and inviting.","alias":"Holiday Cottages","pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}