{"title":"London/Hammersmith and Fulham","name":"Jim's Guest House","address":"26 Aldine St, W12 8AN","directions":"tube: Shepherd's Bush","phone":"+44 20 8743-0456","tollfree":null,"email":"info@jimsguesthouse.co.uk","fax":null,"url":"http://www.jimsguesthouse.co.uk/","checkin":null,"checkout":null,"price":"From £79","geo":{"lat":51.5058,"lon":-0.2226,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16171,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Loved the Bambu       The awesome fruit decorations","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":4.0},"author":"Catalina Willms","date":"2012-11-03 12:58:41 +0300"},{"content":"Upgrade to the Palace!!! We booked a two week vacation to Punta Cana, staying at the Riu Bambu. We chose this hotel as we had stayed in it 5 years prior and had a GREAT time. But since the construction of the Palace Punta Cana, located next door to the Bambu, the Bambu has lost its appeal and pales in comparison. As soon as we checked in, we were forced to move to two different rooms as the air conditioning in the rooms didn't work. The room we finally ended up in did have air conditioning but it was VERY weak. None of the restaurants in the hotel have air conditioning so we would be sweating as we ate dinner.The food at the hotel was very bland and selection was limited. We basically ate pizza and fries everyday. The entertainment at night was enjoyable but where they put on the shows is enclosed but without air conditioning. This made it unbearable to sit through an hour-long show. During the first week of our stay we were given a complimentary dinner at the Palace Punta Cana. After eating there we knew what we had been missing. The palace has beautiful restaurants with great food. All of the buffets and A La Carte restaurants are air conditioned making dinner very comfortable. The pool was amazing, the drinks were much better and had more selection ,and the entertainment shows at night were in an air conditioned theatre. After our experience there we paid the extra money and moved to the Palace Punta Cana for the second week we were there. All in all, you get what you pay for. For us, being there for two weeks, it was DEFINITELY worth it to pay the extra money and eat better food, have better drinks and overall, better service. The Riu Bambu is listed as a 5 star hotel but is far from a five star. I would rate it a 3 1/2 Star if that.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":2.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Miss Norris Klein","date":"2015-04-05 00:07:40 +0300"},{"content":"great holiday We have just returned from this hotel after spending a week there. It was a great place to stay, the rooms are very good and are kept very clean. We only encountered a slight problem with our mini bar not being re-stocked every 2 days, however if you spoke to the guys on the mini bar rounds, they would give you all the drinks you needed. We have previously stayed in Riu resort in Peurto Plata, and this resort was very similar in layout and style and the staff equally as entertaining and happy. We found that learning a few basic spanish words went a long way with the staff, but to be honest, there was no real problem with language barriers with bar/waiting/reception staff. The food was great, and there was plenty to choose from and Im fussy! The restaurants were also worth a visit with the Caribe grill being the best both for food and its location on the sea front. There was a nice breeze which you didnt have in the steak house and Italian. Do be warned that you may experience what could be termed as  dominican belly but we believe this is down to over-indulgance rather than anything to do with the food!!!!!!!!The alcohol was free flowing and it certainly wasnt watered down as has been suggested, or at least our heads didnt say that after a few late nights! Our main disappointment was the disco, as although it was free to get in, you had to pay for drinks, which we found a bit off putting in an all inclusive resort. We visited once, and to be honest it seems to cater towards the staff and locals, rather than the tourists. The riu resort in the north also had a nightclub and this was completely free so we felt a bit miffed!Overall we would recommend this hotel/resort as it has everything you need and have found that riu are ahead of other chains when it comes to all inclusive holidays. Dont listen to the moans and groans, its what you make of it and if you want 5 star then book one of the palaces - we werent allowed to use their facilities, but they did look impressive. As one of the other reviews stated, there are few brits at this hotel, and found that the majority of the tourists were from Germany the week we stayed.Off to book the next holiday now!","ratings":{"Service":5.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":4.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Kiana Kuhn","date":"2015-07-27 22:39:37 +0300"},{"content":"Wouldn't go back to the RIU What was good...the staff was friendly and the food was good.What was bad....Went to the disco (which is open to the public), our male friends were approached by prostitutes and a drug dealers that were both persistent. So no more disco.The walls were paper thin and I am a light sleeper so because of the screaming German children at 6:30am, 7am and 7:45am in the echo chamber that is the hallway outside your room, I got less sleep than during a regular workweek. The phone number provided by the agent was disconnected, the only phone number that works rings into the RIU Palace and then you have to ask for Bambu reception then the room number. And sometimes NO one would even answer the phone so I had to make phone calls from my room costing me $80.00 US.The pool bar is good until the kids start jumping around you and splashing everyone while their parents ignore it or are not even around.The activities board is not right and I prefer the resorts that hand out photocopied itineraries because we would constantly have to check the board.Take a watch or some time piece, the maid would turn off the room power every day and the clock would have to be reset.Take big cups...6 oz cups on steaming hot days are worthless.Air conditioner does NOT keep up, room was warm.I have stayed at the Iberostar resort next to the RIU and would book there...at least I got to sleep.","ratings":{"Service":3.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":2.0,"Location":3.0},"author":"Mike Connelly","date":"2012-06-26 05:33:18 +0300"}],"public_likes":["Lizzie Hackett","Josiane Mayer","Jayce Pacocha","Darion Cartwright Sr.","Henry Corwin","Mr. Hannah Schuster"],"vacancy":false,"description":"Good value bed and breakfast. Family suite available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}