{"title":"Carmel (California)","name":"Carmel Mission Inn","address":"3665 Rio Road","directions":null,"phone":"+1-831-624-1841","tollfree":"+1-800-348-9090","email":null,"fax":null,"url":"http://www.carmelmissioninn.com","checkin":null,"checkout":null,"price":"$100-$200","geo":{"lat":36.53899,"lon":-121.90921,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":5110,"country":"United States","city":"Carmel-by-the-Sea","state":"California","reviews":[{"content":"Stayed here after the fires, every room in SD was booked as well as my favorite the Park Manor. I prefer to stay close to hillcrest so this was my other option. The room was large and the kitchen was great to have. I booked a king but as usual since I check in late was given two doubles. The front desk adjusted my bill and I was thankful. The front room was nice to have and the bedroom was decent size. The internet was spotty and it took a long time to download my email but it worked. The beds were so-so and the pillows were the same. This place has a much better location than the Park and it is less expensive. I booked again for next month even though I prefer the park, end of year budget crunch...","ratings":{"Service":3.0,"Cleanliness":3.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":3.0,"Value":4.0,"Rooms":3.0,"Location":4.0},"author":"Zoie Rohan","date":"2012-08-18 14:28:25 +0300"},{"content":"We are a family of 5 and we stayed for seven nights at Sommerset Suites Hotel. We all liked the hotel and would stay there again. It had its good and bad points: PRO Central location to everything Friendly staff Nice breakfast selection every morning Spacious rooms with full kitchen, bedding for five, and two television sets Balcony with decent view (great if like hospitals) Attentive housekeeping Walking distance to many Hillcrest restaurants Relatively quiet despite the occasional ambulance siren CON Parking spaces too narrow A little outdated, but not as bad as people are writing. It could use some fresh paint but overall, it's more than acceptable Overall, a solid choice for vacationing. It's nothing spectacular, but it's budget-friendly and a nice place to stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Abigale McClure","date":"2015-06-12 07:27:10 +0300"},{"content":"We rented the 2 bedroom, 1 bath suite for 3 nights. While the panaromic ocean views from the balcony were beautiful, it did not make up for the lack of service, the noise that we had to endure 2 out of 3 nights, or the general uncleanliness of the suite. The kitchen was lacking basic equipment like paper towels, dish soap or dish cloths, and maid service never cleaned our kitchen at all. Both days we came back at 4 pm and the rooms still had not been cleaned. There was loud banging all night from the kitchen/bar below, and pounding music 2 out of 3 nights well past 2 am. The shag carpet was disgusting, and the wifi did not work well. The towels were old and stained, and they didn't provided enough until our last day. They tried to charge us $479 per night, way over the quoted rate on the phone. After getting no sleep the first night we complained, and they immediately reduced the rate $100 (to the originally quoted price). After the last night of noise and having to phone front desk to complain, they took another $80 off the total bill. A nice gesture, but does not make up for the lack of sleep we experienced on this trip. I'm all for retro hotels, but under no circumstances would I recommend this one to friends. One note: the maids, when they did finally clean our rooms, were friendly and did the best job they could under the circumstances.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":1.0,"Location":5.0,"Rooms":1.0},"author":"Toby Rodriguez","date":"2015-12-21 02:27:55 +0300"},{"content":"Mission Beach has surfing, sand castles, sun bathing, football playing, and wakeboarding. Surfer Beach Hotel is directly on the beach. Most of the rooms have a view of the ocean. This is a 4 story hotel with elevator access, a restaurant onsite, and walking distance to board shops, restaurants, drug store, pizza places etc. People are laid back and friendly. There are a lot of rental villas, other motels, sandwich shops, gift shops, and things to do nearby. Parking is available at about 12 bucks a day onsite. Pets are allowed, but be aware that dogs are not allowed on the beach between 9 am and 4 pm. Teenagers, retirees, families with kids, vacationers, young couples, surfers, and beach bums are all there. A nice mix of nice people. Security is pretty good. Staff is very helpful and available 24 hours. Room had to double beds, a balcony, and a small fridge. There is also a pool in a wind protected area. Some days required a sweatshirt and other days required sun screen. Water was in the 50's but kids were in it. Recommend a wet suit if you want to be in the water more than 30 minutes in March. This is not a fancy place, but we were there for the sun, the beach, the water, the relaxation, and the family time. This was a perfect place for all that. Reminded me of Florida beach hotels.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Pink Swift DDS","date":"2015-01-18 16:38:35 +0300"}],"public_likes":["Junior Gaylord","Gunner Leuschke","Dylan Ernser","Blair Crist","Geraldine Dooley","Lisandro Welch","Herminio White"],"vacancy":true,"description":"Combines a private garden setting with the warmth of a country inn. Offers free Wi-Fi access.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}