{"title":"San Francisco/Union Square-Financial District","name":"Hotel Rex","address":"562 Sutter St","directions":"between Powell and Mason","phone":"+1 415 433-4434","tollfree":null,"email":null,"fax":"+1 415 433-3695","url":"http://www.jdvhotels.com/rex","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7893,"lon":-122.4096,"accuracy":"ROOFTOP"},"type":"hotel","id":26224,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"At the Confortel Atrium, I experienced great service from the staff. They spoke okay English and were very accommodating. Someone was knocking on my door various times over the course of an hour my first night there, and there were no peepholes on the door. As a woman traveling alone, I was quite nervous. When I went down to the desk, they just set me up in another room immediately after I explained. I stayed in a superior room as the price difference between standard and superior wasn't huge. The room was big, with a desk, couch, plasma tv, and huge bathroom. I was not impressed at all with the bed...it was extremely hard. So if you're a light sleeper and prefer soft beds, don't stay here. The location was alright. It was a 10-15 minute walk from the Arturio Soria metro station. It took awhile to get into the center by metro...maybe 15-30 minutes but it didn't bother me much. The hotel isn't really around much of anything...a couple restaurants and a little park. There were no vending machines/minibar in the hotel so I would bring some snacks if you tend to get hungry at times when you'd be in the hotel. The gym was small but adequate. It was not crowded at all so I wouldn't let its size dissuade you. I got the breakfast. It was good, but a bit expensive for the quality. I paid 17 euros a day and I think it was worth maybe half that. I think the service was the best aspect of my stay at this hotel and the uncomfortable beds were the worst.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":2.0},"author":"Ara Crist","date":"2014-11-14 00:43:14 +0300"},{"content":"Had another great stay at the GEM hotel in Chelsea. Well appointed and efficient clean room with a great bathroom! Staff was always friendly and assisted with everything. Thank you!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brendan Kunze","date":"2015-05-23 12:28:51 +0300"},{"content":"My spouse and I stayed in a double room. As others have noted, the rooms are very small, but I was impressed with how efficiently the space is used to make it a comfortable space for two (not petite) people. The staff was friendly, the bed was comfortable, and the outside noise was minimal because our room faced a wall of another building. We could, however, hear every word and sound made by guests in the hallway. Overall, given the very reasonable rate and good location, the Chelsea Gem is a great value, but next time, I will bring earplugs.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Jefferey Dicki","date":"2012-07-07 09:28:30 +0300"},{"content":"Decent enough, but room was very small and also hard on 21st & 8th I think so lots of road noise at night. The bathroom was pretty nice, with an excellent shower. As for the area, it was close to my office so convenient for me. However, the vicinity of the hotel is nothing special.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":3.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Michael Beatty I","date":"2015-10-13 15:11:54 +0300"}],"public_likes":["Ernie Lakin","Cathy Schulist"],"vacancy":false,"description":"The Hotel Rex was inspired by the San Francisco art and literary salons of the 1920s and 30s. The clubby lobby surrounds guests with distinctive period furnishings, walls of antiquarian books, and a collection of exotic objects, original portraits and murals.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}