{"title":"Wikivoyage:Listings/Draft","name":"Hotel Eldorado","address":"rue des Dames 18","directions":"17th, metro: Place de Clichy","phone":"+33 1 4522 3521","tollfree":null,"email":"eldoradohotel@wanadoo.fr","fax":"+33 1 4387 2597","url":"http://www.eldoradohotel.fr","checkin":null,"checkout":null,"price":"€23-39 sgl, €49-79 dbl","geo":{"lat":48.88487,"lon":2.32478,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":41209,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"The sofa on the couch had 7 different color stains (do not want to know what originated) so let's just say I never sat on the couch nor did I want to put my luggage on it. The sheets did not seem like they were washed but thankfully I brought my pillow case with me. The bathtub had mold growing and coffee table still had coffee stains on it. Bottom line - avoid this place if you can.","ratings":{"Service":4.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":2.0},"author":"Rachelle Gleason","date":"2013-07-06 10:06:44 +0300"},{"content":"I stayed here for two weeks in September on a business trip to Dallas. I was greeted by a warm receptionist and provided a very clean and modern two room suite. This hotel is centrally lcoated to get anywhere in the greater Dallas/Fort Worth area. The evening socials are typical of most Residence Inn's and most guests appear to have been staying in Dallas for extended business stays. The rate I had for this Hotel was excellent and I would not hesitate to book this trip again for a future business stay in Dallas.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":4.0},"author":"Ward Fahey","date":"2013-02-18 02:39:18 +0300"},{"content":"The Manager has serious issues Everything was pretty good on check in evne though it was late at night, however one thing that annoyed me was getting knocks on the door from the maids at10:30 well before it would be normal check out time to clean the room. But the kicker is I had called the night before check out and asked for a late check out with which the clerk who answered the phone said was fine but the next day while taking a shower, the manager or asst manager pounded on the door and my gf said he told her we had to leave immediately and that any late check outs had to be cleared thru him, stupid me, I should have known that right, because obviously Im psychic. Upon returning home I noticed that he charged my card for an additional day even though I hadn't stayed so now as we speak Im disputing this with my bank, and I called Ramada's customer service to let them know and within 30 mins later I get a call from the manager person who basically calls me a liar and tells me I can drive down there anytime to review the video for whatever reason, anyways, avoid at all costs unless you like getting screwed over.","ratings":{"Service":1.0,"Business service":1.0,"Cleanliness":3.0,"Check in / front desk":-1.0,"Overall":1.0,"Value":2.0,"Rooms":2.0,"Location":3.0},"author":"Eva Bosco","date":"2015-06-15 10:50:52 +0300"},{"content":"All the desk reps are great, especially Arturo and Jackie. They both helped me with special arrangements I needed.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Margarita Schinner","date":"2014-02-05 06:16:07 +0300"}],"public_likes":["Miss August Sauer"],"vacancy":true,"description":"The Eldorado, a former ''maison de rendez-vous'', was once home to the kept women of the 19th century bourgeois. Now a very cute ''no'' star hotel, its charm more than makes up for what it lacks in amenities (who needs a TV in Paris anyway?). The  staff are super friendly, the décor is garage sale chic, and there's a lovely courtyard that fills with neighbourhood hipsters on warm evenings. It also has a very good location and you can easily avoid the noise of Pigalle or Montmartre's high prices, but they're within stumble distance if you decide to explore. For early risers breakfast (€5, until 10:00) is served in the attached restaurant/bar. Some English spoken, especially for those who pet the cat sprawled across the reception desk.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}