{"title":"Lochmaddy","name":"The Old Courthouse","address":"Lochmaddy HS6 5AE","directions":"Around 15 minutes walk from the ferry.","phone":"+44 1876 500 358","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60405,"lon":-7.1623,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":15975,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"We were offered an upgrade when we checked in which we snapped up ! It was excellent value for money. The hotel was very full but there were no problems with lifts/ shuttle buses/ restaurants. Reception was manned by brilliant staff and Kasey in particular was extremely helpful. Concierge staff / floor walker again very helpful. We had a leak in the bathroom and someone came from house keeping immediately to clean up followed by a plumber - you couldn't ask for more. There are excellent restaurants near by and plenty of small shops, a multitude of different ways to get to the city centre and a regular free shuttle service. If you thought you had booked on Nathan road then you would be disappointed, but the hotel never said that they were! The price of the room well made up for the location.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Graham Medhurst","date":"2013-01-30 19:28:38 +0300"},{"content":"No complain at all...we were just there to sleep & so far, we enjoyed our stay & the room was so nice for the three of us.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":3.0,"Location":3.0,"Rooms":4.0},"author":"Zackery Douglas","date":"2014-01-24 09:15:55 +0300"},{"content":"The hotel's appearance is quite good trying to match international standards but the ratio of problems and facilities is 1:4. the garden terrace bar and pool side is very gud but there is heavy language problem and food problems specially for Indians, sum of the house keeping staff is rude, certain weird rules exist like one must keep a security deposit for using the mini bar else it'll remain locked. AND THERE IS NO COMPLIMENTARY WATER. So travelers & travel agents plz think twice before choosing this hotel.","ratings":{"Service":2.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":3.0},"author":"Breana Muller","date":"2012-04-05 13:13:18 +0300"},{"content":"We stayed at the Plaza 8 Degrees for 3 nights before returning home after our trip to China and Hong Kong. Located in Kowloon, there is not too much around the hotel and it is a 30 minute walk to the MTR station, so we opted for the double decker buses to get us to the spots we wanted to see. The views from the hotel aren't great but you can see what life in Kowloon is really like inside small flats across the way and the little street markets that pop up during the day. We enjoyed the complimentary breakfast one morning but the food options were a bit limited for me, since i am on a gluten-free diet. My boyfriend loved the coffee here: \"Just like home!\" The small size of the room really surprised me at first. The bathroom was not much bigger than that on the airplane, with a stand-up shower added in. However, the beds were soft, the room was clean and cool, and it was the quietest hotel we stayed in over the past two weeks ... we didn't hear a single sound all night which made for a very restful sleep. The beds were soft and we asked for an extra pillow because the softness of those provided was a bit too much - but a third pillow each made sleep very easy. The staff was helpful. We used the business centre twice to confirm our flights and check emails. It was pricey but worth it for its convenience. We would stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Service":4.0},"author":"Isaac Langosh","date":"2015-09-29 01:53:42 +0300"},{"content":"I would highly reccomend this hotel - sue to the fact its new and its more than you expect - very good service & free bus service to the downtown and station. the location is not in the town but the free shuttle just does it as its very often and drops you /picks you from Nathan Road (downtown Kawloon) flat screens in each room adn reccomend to stay on top floor as the views are just fantastic.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Domenico Harber","date":"2014-06-07 23:10:53 +0300"}],"public_likes":["Mr. Everette Farrell","Noel Cassin","Brown Batz","Luella Hackett","Willa Morar","Ms. Destinee Moore","Valentin Klocko","Maegan Greenholt Jr."],"vacancy":true,"description":"Bed and Breakfast from 25 - 30 pounds per person per night.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}