{"title":"San Francisco/The Avenues","name":"Seal Rock Inn","address":"545 Point Lobos Avenue","directions":"between 47th and 48th","phone":"+1 415 752-8000","tollfree":null,"email":null,"fax":"+1 415 752-6034","url":"http://www.sealrockinn.com/","checkin":"1PM","checkout":"11AM. Front Desk hours: 7:30AM-11PM","price":"$114-$152 Summer, $99-$137 Winter","geo":{"lat":37.7797,"lon":-122.5092,"accuracy":"ROOFTOP"},"type":"hotel","id":26142,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"This motel is a very nice clean place to stay. The beds were very comfortable and it was a very quiet location. Easy to get in and out of as far as traffic and getting to other places. The staff members were very friendly. The breakfast was pretty good and the lady in that area was very friendly and even made your waffles for you. The pool was nice and clean. I would highly recommend this place.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Rogelio Boyer","date":"2014-08-14 22:10:36 +0300"},{"content":"I went to Branson on business and just picked Dockers Inn out of the blue. The value was excellent and the staff was very helpful. I like the location because it was out of the traffic yet close to the strip. Also my bed was very comfortable. I highly recommend for a good clean room with good value.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Maximilian Kris","date":"2013-01-09 07:45:01 +0300"}],"public_likes":[],"vacancy":false,"description":"Nestled at the westernmost edge of the city overlooking The Cliff House and The Sutro Baths' ruins, this hotel has a small pool, volleyball court, and restaurant. You're a bit out of the way from downtown (about a 30 minute drive/bus), but a great location for someone who enjoys San Francisco's nature, or who will be heading to Marin or down to the peninsula, as you are on the other side of most of the clogged commuting routes.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}