{"title":"Vaison-la-Romaine","name":"Municipal area Motorhome","address":"Avenue Coudray","directions":null,"phone":"+33 4 90 36 14 53","tollfree":null,"email":"dom.lacambuse@wanadoo.fr","fax":"+33 6 31 61 89 81","url":"http://www.domainelacambuse.com","checkin":null,"checkout":null,"price":"€ 7 per night, free during winter","geo":{"lat":44.2474739,"lon":5.073972000000026,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":35855,"country":"France","city":"Vaison-la-Romaine","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"We are from New York and traveled to Puerto Rico for a family reunion and decided to do it at Tamarindo Estates. Each little apartment kitchen had everything we needed from dishwashing soap in the kitchen, pots and pans, paper towels and the bathrooms were clean and wer also equiped with soap, shampoo and conditioner. Each small apartment has a balcony with tables and chairs. There is a shower outside to clean up before going to the apartment. There is a barbecue pit in front of the villas with tables. The place was clean and comfortable. The walk to the beach is a long one but once you get there the view is fabulous. The pool is a good size and the pool house is equipmed with bathrooms and shower. The beach house has tables and you can also barbecue there. The property manager was very helpful and was always there when we needed him. Adults and kids enjoyed the place. The best snorkling in the island is right in front of this property, we found out it is a natural reserve. The only problem we found is that you must bring your food supplies from the main island or be prepared to pay the prices of culebra. They do not have supermarkets but small stores. We found everything we needed but not always in the same place. Make sure that you rent a jeep (we did) or you will not be able to move around at wish. We did find that taxi drivers are easy to find and during off hours if you make previous arrangements they will pick you up and wait for you to take you back to the hotel. There are many restaurants in town. Recommendations: The most beautiful beach is Flamenco beach - a taxi ride away. You can walk it but there are no side walks and you can not always see the cars coming so we decided it was safer to drive there. There you will find kiosks with food and beverages. Make sure you get your ferry tickets early as they sold out fast and be on line at least an hour before if you are traveling with luggage. There is a car transport that works from Monday to Friday, if you want to take your car from the mainland a reservation is needed but it does not work on Saturday and Sundays. All and all we will do it again. If what you are looking is a quiet, peaceful place full of nature. This is it. We are ready to do it again..","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":4.0,"Value":3.0,"Rooms":4.0,"Location":4.0},"author":"Stewart Olson","date":"2012-04-07 19:44:43 +0300"}],"public_likes":["Alanna Schaefer","Jeanne Kilback"],"vacancy":true,"description":"Area for motor homes, rents mobile homes and caravans.","alias":"Camping Domaine de la Cambusse","pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":false}