{"title":"Huntly (Scotland)","name":"Castle Hotel","address":null,"directions":null,"phone":"+44 1466 792696","tollfree":null,"email":null,"fax":null,"url":"http://www.castlehotel.uk.com/","checkin":null,"checkout":null,"price":"£80 - £175","geo":{"lat":57.46019,"lon":-2.78018,"accuracy":"ROOFTOP"},"type":"hotel","id":12068,"country":"United Kingdom","city":"Aberdeenshire","state":null,"reviews":[{"content":"i have stayed here on several trips to the indy area. it is quiet and well maintained. Service is just outstanding, Amy (Manager) always does her best to make sure everyone is happy.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Myles Roberts Sr.","date":"2013-06-28 04:22:03 +0300"},{"content":"I have been awake since 4:00 AM and most likely so will you be if you stay here. I have been listening to planes fly \"directly\" overhead for the last hour or so. They pass every 1.5 minutes (no exaggeration!). Apparently this hotel is directly in the flight path of one of the Fed-Ex hubs. Since the planes are so frequent you do not get a chance to go back to sleep if you are awaken. I stay at Hilton brand hotels almost every week of the year, This property appears to live up to the quality of many other Hilton Garden Inn's I have stayed at with the exception of the location. I have stayed at MANY hotels located adjacent to airports in the past that have not been this bad. The key difference is that consumer flights do not start until 6:00 AM in the worst case and do not fly nearly as frequently as a Fed-Ex Hub evacuating it's cargo. Note there is a Hampton Inn next door and the planes are flying right between the hotels. So I doubt that option would be any better. I will not stay at either one of these properties again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":1.0},"author":"Margarete Orn","date":"2012-07-02 05:17:18 +0300"},{"content":"Rooms were neat, clean, and large. Did not hear outside noise during the night. Staff was friendly. Had a manager special from 5 to 7 which was enjoyable. Not near the traffic problems going into downtown Dallas as other directions. Felt safe in area.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mr. Gus Pagac","date":"2015-06-12 15:04:27 +0300"},{"content":"Hosts are a no show. They buy the place and they are not there. Only the maid. I booked on line so they put me in the basement. Room was half painted and was a mess. No extra towels. One roll of tolit paper. Room was very noisy. I asked to change rooms. The owner on the phone said no as I booked on the Internet. They had other rooms for abit more as I would have paid more but they said no. If you book online they put you downstairs. The maid was also upset for what the owners did to me. I would stay away from this place. I had some food to reheat and they would not give me a Microwave as I would pay extra for it and I would but due to booking with Redtag they don't care. I had some people come over for dinner and had to say sorry to them for the condition of the room. They said that was not nice of the owner to do that. Stay away from this place and go to a normal hotel. You would be better off than this place. They should be ashamed of themself for doing this to people like me and others.","ratings":{"Service":1.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":1.0,"Location":3.0},"author":"Zoey Grady","date":"2015-04-22 04:18:10 +0300"},{"content":"I'm not quite sure how theWit fits into the Double Tree brand because it's unlike any Double Tree I've ever stayed out. The hotel has an honest modern/cool/hip vibe - it doesn't feel overdone and isn't trying too hard like some other hotels. The staff is extremely friendly and well polished and is what you'd expect to find at a 5 star hotel, but without the attitude.. The accommodations are simply fantastic. I was traveling on business and checked-in on Valentine's day - there was a very nice note and a plate of heart shaped cookies waiting for me in my room. It's those small thoughtful details that sets this hotel apart. Unfortunately for Double Tree, theWit sets expectations so high for the Double Tree brand that their other hotels just can't match","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Delilah Hyatt","date":"2014-01-23 01:36:33 +0300"},{"content":"We booked a room at this hotel as we were planning on seeing a concert at the Chicago Theater. We prepaid for the room via their website. The concert was postponed and we contacted the hotel to inquire into changing our reservation to the new date only to find that the hotel REFUSED to allow us to change the date and informed us that the $196.00 we had spent on the room would be lost. The customer service employees with Hilton were rude and were not accommodating at all. We will definitely stay at a different hotel for the rescheduled date of the show and would not recommend booking at this hotel.","ratings":{"Overall":1.0,"Value":1.0,"Service":1.0},"author":"Ezekiel Hansen","date":"2014-10-23 17:39:12 +0300"},{"content":"Great bathroom for two and a spacious, relaxing room with a modern look and a decent floor to ceiling view of downtown Chicago.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Gwen DuBuque","date":"2014-05-15 03:31:51 +0300"},{"content":"Upon entering our room, we booked a junior executive suite, we realized our room was handicap accessible (not per our request). We called the front desk to see if another room was available, mainly due to the shower in this room. We were told no, all junior suites are handicap accessible. Ok. We unpacked, went downstairs where, Sean, the conceirge, asked how everything was. Also asked him about the junior suites, not true, they are not all handicap accessible. He offered to have our stuff moved, but we chose to do it ourselves. Upstairs, repack, move, back downstairs. All of this could have been avoided if the front desk person would have be more properly informed. The rooms have taken some abuse in the last year. Furniture rather beat up, stained fabric, etc. The couch in the room is not comfortable at all. We had dual TV's, which proved to be interesting. Turn on one, the other one came on, manually turn one off, try to turn the other off while in bed, the other on turns on. The bathrooms are very cold and the shower caddy is useless as the amenities fall out through the slots. Sean, the conceirge, was very helpful as was Jonah, our bellhop. The front desk staff seemed to be otherwise busy whenever we came or went. The staff at State and Lake is hit or miss. Personally, I'd like to see them offer free WiFi, in your room, especially if you pay for an upgraded room. The hotel is okay, but unfortunately, nothing special. I feel like with a little tweaking they could be great.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":5.0,"Rooms":3.0,"Location":5.0},"author":"Leola Harber","date":"2013-01-06 07:59:38 +0300"},{"content":"This hotel is in a great location for exploring downtown Chicago. As a woman, I felt very safe staying here and walking around the neighborhood. We went in November on a \"girls weekend\" to see the lighting of Michigan Avenue and participate in the festivities. The bed was extremely comfortable and there was plenty of hot water and water pressure. The decor is on the masculine side - which made it feel rather \"cold\" to me, and it was all very modern. I do wonder about the artwork in the bathroom that was a replica of a cover of Esquire magazine. All that aside, it was an okay place to stay - but for a Doubletree, I was surprised that there were no bathrobes in the room, no turn-down service, etc. Perhaps I was considered a \"sub customer\" due to the fact that I booked my room through a popular on-line travel service? Even the cookie that I was offered at check-in was not warmed. Come on, Doubletree - I know you can do better than this. I've stayed at other Doubletrees that offered all the above and more. Would I stay here again? Probably not - there are too many other choices in downtown Chicago that would probably be a bit more attentive to me as a customer, even on a busy weekend. But, it's not a horrible place to stay, either. I came away from this trip feeling just \"meh\" about this hotel.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":5.0},"author":"Regan Sanford","date":"2014-06-30 05:02:40 +0300"}],"public_likes":["Luigi Dickinson","Nathanael Langworth","Jaunita Pfeffer","Christop Cartwright PhD","Martin Spinka","Destinee O'Hara","Delmer Purdy","Gustavo Cummerata","Rory Greenfelder II"],"vacancy":false,"description":"18 room hotel in a house built in 18th century.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}