{"title":"Birmingham (England)","name":"Radisson Blu Hotel Birmingham","address":"12 Holloway Circus","directions":null,"phone":"+44 121 654-6000","tollfree":null,"email":null,"fax":null,"url":"http://www.radissonblu.co.uk/hotel-birmingham","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.47537,"lon":-1.90022,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":3647,"country":"United Kingdom","city":"Birmingham","state":null,"reviews":[{"content":"Our experience at the Palmer House was outstanding. The customer service and amenities made our trip extra special. We truly enjoyed the best musical ever, Billy Elliott in the threatre district along with the shopping opportunities. All of our activities were within walking distance of the hotel. The elegance of the hotel, the breakfast and hospitaility hour were very nice perks!! The best place to stay downtown Chicago!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ignacio Welch","date":"2015-11-03 13:35:29 +0300"},{"content":"This is a much nicer building than most Hilton Hotels with beautiful architecture. It's situated in the heart of downtown in the Chicago loop. We didn't eat in the restaurant or drink in the bar, there is a lovely Corner Coffee shop on the corner of the hotel selling reasonably priced coffee and a good breakfast. There are lots of local restaurants. It's a bit of a walk to the Magnificant Mile but possible. I tried to go swimming but it was full of kids (it was 4th July!)","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Neva Hermann","date":"2012-01-10 23:04:54 +0300"},{"content":"My fiance and I stayed at the Palmer House Hilton the weekend of June 26th and from the moment we walked in, I regretted my choice of this hotel. We entered the lobby late Friday night and were met with loud hip-hop music being played. I actually walked around looking for the entrance to the club that I thought was off of the lobby until I realized it was being played through the house speakers! The lobby environment left a lot to be desired, I'll leave it at that. Our room consisted of a double bed, 3 feet from the door and about 10 square feet of walking space after you account for the huge desk and dresser (which should not be in that room to account for the minimal space). Not only was the room TINY for 2 people, but it was also right off of the elevator lobby, and with the bed being 3 feet from the door, I was able to share in everyone's conversations as they exited/entered the elevator bank. The toilet that ran all night I'll chalk up to a small maintenance problem and these things just happen. Completely disappointed with the room, we headed down to the lobby for a drink. We watched the waiter pass us 3 times as he serviced the tables around us so my fiance walked up to the bar to get drinks himself. Paying $33 for 2 martinis (tip not included) was a little ridiculous but we figured those are downtown prices if only a bit inflated. If you decide to drive to the hotel, expect to pay $38/night for parking in the lot across the street from the hotel. There is no validation, this is the price the lot charges and the exact same price the hotel charges, so don't forget to include that in the room cost. We parked at the lot on Clark and Harrison the second night -walking distance and $8 for the night- after having learned our lesson and paying $32 for parking the first night, and were lucky enough to find free street parking the next day on Wabash and Jackson (beware of the \"pay to park\" meters that charge $4.25 for 1 hour of parking). Fitness center is $10 to use and don't expect anything by way of free water or anything else because everything they have to offer, they've put a price on. I should say that they did change our room after we complained about the noise/location/size to a normal sized room with a queen size bed and space enough for two people, but I think at that point, the damage had been done and had I been able to change hotels without penalty, I definitely would have. The location of the hotel is great because you're within walking distance to most everything and a short cab ride away to everything else, but I would NOT recommend staying here again to anyone. For the price (room, taxes, parking, fitness, etc), you can stay at a much nicer hotel and I highly recommend staying elsewhere.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":2.0,"Value":1.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":5.0},"author":"Morris Pacocha","date":"2012-06-02 03:26:52 +0300"}],"public_likes":[],"vacancy":false,"description":"The Radisson is located in a blue glass tower, with views over Birmingham's city centre, and is one of the few truly modern high-end hotels in the city.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}