{"title":"London/South Kensington-Chelsea","name":"The Londonears Hostel","address":"1 Barkston Gdns, SW5 0ER","directions":"tube:Earl's Court","phone":"+44 20 7373-4322","tollfree":null,"email":null,"fax":"+44 20 3417-6386","url":"http://www.thelondonearshostel.com/","checkin":null,"checkout":null,"price":"From £12 for a bed in a dormitory with up to 14 people","geo":{"lat":51.4924,"lon":-0.1904,"accuracy":"APPROXIMATE"},"type":"hotel","id":16435,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"The Casa Camper is the best hotel I've stayed at so far in Europe. And I've been to a dozen different countries, stayed at Marriotts and Intercontinentals etc. I think that's high praise and the Casa Camper deserves all of it. My room was very large, especially the bathroom area. I think all of the \"corner\" rooms are a liitle bigger than the others (which are still quite big) and have big bathtubs plus large showers. Everything was clean and modern. All of the staff were friendly. The location is very good. It's a short walk to the Museum Island and a lot of other sites of interest as well. On top of that, the hotel is actually right on top of a U-bahn station. The station entrance is no more than 20 meters from the hotel door. The line (U8) doesn't take you anywhere interesting really but it's easy to change lines at Alexanderplatz. In-room Wi-Fi was perfect. There are two Macs and a printer to use on the top floor. The best and most distinguishing feature of this hotel is the Tentiempie: the top floor restaurant area with great views. Breakfast is very good and served until 11am on weekdays, until 2pm on weekends. To top it off you can go there for snacks anytime you want by yourself - or just take something away to your room. There are croissants, fresh fruit, crisps, coffee and tea, a fridge full of sodas, juices and bottled water etc. etc. - all for free. The top floor area also has a self-service bar that works on the honor system. So you could mix yourself a drink, just how you like it. A/C worked great even though the temperatures were over 30C most of the time. I highly recommend the Casa Camper for anyone visiting Berlin.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Quinten Cruickshank","date":"2012-10-13 10:24:12 +0300"},{"content":"Not the greatest place, but still had a good time! We stayed at Natura Park from Dec 4- 11/08. We paid $1950 for 2 people. All inclusive of course. We have previously been to Puerto Plata, Dominican Republic and Varadero, Cuba. We flew with Air Transat and both flights were uneventful.... this time we paid more for the extra leg room which is a MUST - definitely worth it! I would not recommend Natura Park to anyone if they asked me if they should stay there. We had very good service at the front desk, they were always attentive. The grounds are very beautiful and well taken care of. Lots of ponds, bridges, flamingos, geese, ducks and BATS at night (EWWW) The beach was amazing of course (though there was a lot more seaweed here than any of the other places we've been). The open beach to the left of the resort is very nice - secluded and nice for walking. No problems finding loungers on the beach, by the pool is a bit more difficult. The food was ok - not the greatest but we never went hungry. We mainly ate at the buffet which always had a good variety of food (pasta, stirfry, omelets, etc). The seafood restaurant was horrible - the food was undercooked and they did not even have lobster. We ended up walking out and going to the buffet instead. The steakhouse was really good, no complaints there. We did not try the Italian restaurant but heard the buffet was better. These a la carte restaurants book up fast so get your reservations in as soon as you get there. All of the bars are quite good. It seems that none of the bartenders can make the same drink though - haha - you ask for something and they will each make you a different one! The male bartender at the bar by the steakhouse made a really good strawberry daquiri (he was usually there at 6:30PM until closing). The nightly entertainment was usually very good (Michael Jackson impersonator, karaoke, dancing, etc).The rooms were something else - and not in a good way. The maids did a good job, though sometimes they take your towels at like 8 AM and you do not get fresh ones unitl 4PM..... The room appeared to be ok - a bit outdated but we are used to that from places before. Our room (# 3230 in building 12) had a major wiring problem and even though someone came to fix it twice, we had no bathroom light for 4 days. Plus we found a huge mouse in our room one night, chased it out, and looked around to find that our ceiling air conditioner had a huge nest in it..... we've never had problems like that before. The power went out quite a bit too, usually in the early evening, but did not last too long.We did the tropical storm excursion for $89 USD per person which is going out on a catamaran for the day. You leave around 8AM and return around 4PM. This was a really fun day! You get to go cruising around the ocean and go by a shipwreck just off Bavaro beach, crash through some monster waves (and got soaked!!), go snorkeling in the reef, have lunch, lots of drinks, and go to the natural pool. I would go on this one again, should we ever return to Punta Cana.We also did the monster truck tour for $90 USD per person which we really liked as well. Our tour guide Gregory made this trip a lot of fun! You drive through the countryside (with drinks of course) and stop at a typical Dominican farm where you try fresh fruits and other products, then you go to a cock fight (which I did not watch - poor things), then you stop at a Dominican school (take supplies for the kids). Then stop for lunch at the river (pretty good food). The final stop is at a Haitian voodoo village. This was disappointing as I thought we'd get to see some voodoo, no such luck. You just walk through the little hut and check out the wierd stuff inside. You leave around 7:30AM and get back around 5:30PMWe visited Manati Park when we were there ($15 USD per person.) Totally not worth it. It is like a really crappy zoo and we saw some guy hitting a parrot there who wasn't performing properly in their little entertainment gig .... I'm totally anti-animal cruelty so that was really hard to see. Don't bother visiting the mall ... there are a lot of stores but they are all quite expensive. The shuttle is free from most hotels - it drops you off and then leaves you there for like 2 hours - it will take you about 1/2 hr to walk through the mall and then you'll sit there and wait for the rest. There is a market close to Natura Park. You can find some good stuff but they really try to rip you off. The general rule is when they give you a price drop it down to half of what you are actually wiling to pay and go from there. Most of the time you end up getting a pretty good deal. You do have to walk out of the resort to get to the market and we were a bit wary at first because you have to walk through some new development and there are a lot of onlookers but every went ok - we walked there twice. The shop in the resort is also ok - but more expensive than the markets of course.I don't think I missed anything.... if you have any questions feel free to ask!","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":2.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Mrs. Hester Bergnaum","date":"2015-12-10 02:38:49 +0300"},{"content":"Hmmmm ... We were placed here for one night by the tour operator after our flight home was delayed for 24 hours due to a tropical storm (the resort we'd been staying at for the previous 14 nights was full so we had to move). Reception was chaos with lots of other travellers in the same boat, but the receptionists coped well and got us checked in fairly quickly. The rooms were very basic for a resort purporting to be 5*. Perhaps I'm being a little unfair - they were clean but extremely tired and dated looking, however, especially having been in a brand new modern resort for the previous 2 weeks. However, the grounds were great with loads of palm trees, birds like flamingos and herons, running around the place. The pool is too small for the number of guests. The beach area is very good with plenty of beds, shade, and inclusive watersports. The main public areas like reception, the bar and the restaurants are not air-conditioned and in the tropics this is a problem. Overall, it was fine for an emergency one-night stop, but there are far better, more modern resorts close by.","ratings":{"Service":3.0,"Business service":-1.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":3.0,"Rooms":2.0,"Location":4.0},"author":"Green Huel","date":"2014-07-31 01:01:44 +0300"},{"content":"Not A Good Experience! We arrived at Natura Park @ 12.30 PM on;y to find our rooms were not ready.We did not get into our rooms until 5PM. My opinion is has follows:,the beach was great ,weather was perfect, the food was ok. Most of the staff were very nice,front desk was much to be desired. The room on the other hand was a nightmare.The pictures of the room are not what they appear to be.There was no air conditioning ,our TV didn't work,called front desk for service aleast 4 times for towel's  water  to fix the TV .I was always told they would send someone , but no one ever showed up. On our departure the TV was still not fixed (2DAYS)when they said they would send someone to fix it. If I was to return it would not be at Natura PARK. My family and I were on vacation to relax and enjoy our time together which we did during the day,but at night returning to our rooms was very upsetting. In my opinion this was not a relaxing vacation. Time  money not spent very well.","ratings":{"Service":4.0,"Business service":1.0,"Cleanliness":1.0,"Check in / front desk":1.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":5.0},"author":"Julius Kihn","date":"2012-10-19 00:25:40 +0300"},{"content":"Money well spent We booked an all inclusive week at the Natura Park Eco Resort with some doubt as we have had some not so good experiences in the past at other resorts.The price seemed too good to be true but we couldn't pass it up. We did some research about the resort including this website and had mixed feelings about we read but decided to try it anyway, what the $@!#%, it was cheap enough.We arrived at the resort around 10:00 pm on March 30th and were very impressed with the reception that we received. We were into our room within a half hour with drinks at hand. We had requested a room with a king size bed but to our disapointment, we ended up with 2 double beds. So, we went back to the front desk to see if this could be changed. They were quite full that night but said for us to go back in the morning and they would see if they could accomadate us. By 2 pm the following afternoon, we were in our new room with a king size bed and that was the worst part of our whole trip.The food was good (I'm not so fussy but my wife is a bit more selective and she was very impressed with all the selections they had) specially the pasta counter. The service was exceptional and deserved to be complimented specially Rapha毛l at the bar above the pool bar, Anthony at the La Perla Restaurant for the lunch buffet and Sandro/Jos茅 at the Mirgenta Bar along with everyone else on the resort...........too many names to mention them all or to remember.The entertainment was a mixture of professional and audience participation shows, some nights were better than others. The professional shows were really well orchastrated and very well performed.The weather was 70/30 but on the so so days, we went for a walk (about 20 minutes) to the local market which was very challenging (who doesn't like a challenge every once in a while), it was fun bartering for the best price.The beaches were very beautiful with their turquoise water and white sands. The water was warm almost like bath water and the scenery was good too. You could walk for miles and miles all day long if you wanted. There was a bit of seaweed but there was someone raking it up every morning. There was lots to do, kayaking, peddle boats, wind surfing, snorkeling and last but not least, you could drink all you wanted anywhere, anytime.The resort itself was very clean and very well maintained. The vegetation was beautiful with lots of different greenery. It also had different types of birds roaming free (pink flamingos, ducks, geese and other species). They even provided the bread to feed the fish, birds and turtles which made for a relaxing morning.One night, we even walked down to the Casino at the next resort and, much to our surprise, we actually made a little bit of money ($24.00 American dollars). It was worth the 10 minute walk.All in all, after being to a resort in Mexico that was rated a 4 1/2 star and a lot more expensive (which we wouldn't recommend to anyone that we know), our vacation to Natura Park Eco was very satisfying. We are looking forward to going back with friends.PS: We met a lot of people from Canada whom we'll never forget.","ratings":{"Service":-1.0,"Business service":-1.0,"Cleanliness":-1.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":-1.0,"Rooms":-1.0,"Location":-1.0},"author":"Elsa Morissette","date":"2014-08-24 15:48:52 +0300"},{"content":"A very enjoyable week at the Natura!       The entrance to the Natura Resort","ratings":{"Service":4.0,"Business service":3.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":3.0},"author":"Francis Reichel","date":"2012-12-16 02:06:21 +0300"},{"content":"Beautiful looking, but hit or miss on everything else Just arrived back from a Sunquest vacation to the Blau Natura Park. It is hard to give an overall impression of the hotel as some things were great, while others poor. The hotel is a short 20 minute drive from the airport (nice looking airport, but the staff will try to extort as much money from you as they can...). It really is in the middle of nowhere, and the area is not pleasant smelling once you get off the resort property.The property itself is quite nice, more natural looking than most - with the exception of the fish ponds/lagoons that are very clearly artificial. It is fun to see and feed the fish and birds that are all over the place. The buildings incorporate a lot of natural materials, which give it a more rustic feel. The beach is a decent size, but there is a lot of seaweed. This is mainly due to the strong winds (which actually help keep you comfortable during the day).The rooms were a disappointment. Everything in them smells musty, and we had little ants of some kind in the bathroom and on the desk. Thankfully, they didn't get into our stuff. The beds were harder than any futon I've ever slept on, and I had a sore neck all week as a result. The electricity is definitely an issue - some of the lights didn't work, and a surge blew out my battery charger. We did have hot water and the A/C worked well, so we were lucky compared to some. Don't travel with anyone you might be shy around, as the bathroom doors are made of slotted wood, and only slide back and forth. Note that noise carries pretty easily, especially near the theatre.The food was hit or miss. Generally, when the meat was cooked properly, it was quite flavourful. The pasta was generally okay. There were issues with keeping food hot though, and both me and my friend ended up with intestinal problems (and when they say don't drink the water from the taps, this includes brushing your teeth!). The a la carte restaurants weren't anything special. Service varied wildly depending on who you had, although the people at the bars were quite nice. Considering the variety of countries that they draw visitors from, I was impressed that most staff could converse in English, French, Spanish or German. The entertainment staff tried, but some of the shows were a litlle slow. Excellent dancers though.The prices at the hotel store were decent (good selection if you forgot anything), but you could get better if you haggled well with the merchants that came on site a few times a week. Don't accept their first or second offers though! They do get a bit annoying though as every one of them wants you to stop and look at their stuff. None of it is really original, as you can get the same items elsewhere on the island if you go into town or on a tour. Do take a tour though, as it will give you a better idea of the island outside of the hotel.  I am glad I went, but I wouldn't go back to this hotel again.","ratings":{"Service":3.0,"Business service":3.0,"Cleanliness":3.0,"Check in / front desk":2.0,"Overall":3.0,"Value":2.0,"Rooms":2.0,"Location":4.0},"author":"Eliane Leuschke","date":"2013-04-01 21:05:48 +0300"}],"public_likes":[],"vacancy":true,"description":"Youth hostel for those willing to sleep in a bunk bed in a dormitory with many others.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}