{"title":"Edale","name":"Edale Youth Hostel","address":"Rowland Cote, Nether Booth","directions":"1 mile east of Grindsbrook Booth","phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.yha.org.uk/hostel/edale","checkin":null,"checkout":null,"price":"From £10 pppn","geo":{"lat":53.3761,"lon":-1.791,"accuracy":"ROOFTOP"},"type":"hotel","id":8551,"country":"United Kingdom","city":"Derbyshire","state":null,"reviews":[{"content":"I was a little worried about staying here by some of the reviews I read at first. But I noticed the reviews only seemed to be bad around the renovation time, so since they were over I decided to give this hotel a try. Plus they have great goverment rates! And I'm glad I did. The hotel staff, valet, bar/resturant staff, everyone was very professional and very nice. Any questions asked, someone had an answer and were willing to help. The rooms were very clean, which is a biggie for me. I have a bit of an OCD problem when it comes to cleaness! The location was good as well. If you are looking to just be able to walk to places though, this is not the place for you. The closest attraction is the mall, which is about a 15 minute walk. You will need a rental car if you stay here. Downtown LA is about 25 minutes away. But you are close to Rodeo drive. Only about a 10 minute drive. I liked it because it is in Beverly Hills and you are out of the way of all the madness that goes on in Hollywood when it's time to go to bed! I will aboslutely be back. I honestly have nothing negative to say about this place.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Anika Medhurst","date":"2015-06-03 01:54:17 +0300"},{"content":"We enjoyed staying at the Courtyard Marriott. We were given, along with others, a great rate for the area. We asked for a quiet room and were accommodated. Although I was given a \"quiet\" room, there was a constant hum from the air conditioning (not in my room), music playing, or noise from the jacuzzi and guests. I am incredibly sensitive to noise. All of the staff were incredibly helpful and friendly. They are going through renovations so there was a little confusion regarding breakfast, their lobby and initial greetings. The continental breakfast was served in a small room with very little seating. I was advised that the hotel was under renovation. If you want a place to sleep, this hotel is adequate.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":3.0},"author":"Jennie West","date":"2015-10-18 10:12:45 +0300"},{"content":"I was looking for a hotel with easy access to UCLA (daughter is an incoming freshman and we are from out of state). Hotel is 10 min. from campus and an easy drive. Staff is very helpful and professional, rooms are clean, Ralph's supermarket across the street is great for stocking the fridge in the room. I'm a runner and the hotel is 3 min. from a big park that makes for a nice 3 to 5 mile run (pass Fox Studios at one point, a real thrill for a person from the midwest). Exersize room is open air behind the hotel with high quality treadmills and stair machines. Full dumbell set too. Free coffee in the mornings in the lobby Two stays so far and another coming up the end of the month.","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Abbie Green","date":"2012-02-23 07:58:54 +0300"}],"public_likes":["Anabelle Schmitt","Thurman Schneider","Reed Bernhard","Lamar Kassulke"],"vacancy":true,"description":"The YHA youth hostel is a particularly large establishment, offering a range of services. Advance booking during school holidays and weekends is advisable.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}