{"title":"North Uist","name":"The Old Courthouse","address":"Lochmaddy HS6 5AE","directions":"Around 15 minutes walk from the ferry.","phone":"+44 1876 500 358","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":57.60405,"lon":-7.1623,"accuracy":"ROOFTOP"},"type":"hotel","id":20738,"country":"United Kingdom","city":"Lochmaddy","state":null,"reviews":[{"content":"Stay two night in this hip hotel in the heart of LA. Locations is great(daytime) with everything you need in walking distance. Comfortable bed, nice flat screen TV, clean, spacious, decent room service quality(a bit pricey) and good choice of restaurants inside this hotel and in the adjacent Ritz Carlton(hotels are connected). Customer service was top notch.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":5.0},"author":"Willie Von","date":"2014-08-20 06:08:31 +0300"},{"content":"When I walked into the spacious lobby I was instantly impressed. The hotel is beautiful with a lot of wide open space. After check in the room was large with a view of LA. I went to the pool bar, which also had a view, had a few drinks, then walked to LA Live. There is a good selection of restaurants within walking distance. There also just happened to be the FLoyd Mayweather-Victor Ortiz pre-fight conference right in the plaza. Great location. Great hotel. It will serve all your downtown LA needs and then some. The staff was courteous and attentive, the food was decent.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Destiny Ritchie","date":"2013-10-06 08:43:36 +0300"},{"content":"Arrived just before 3 pm with a confirmed reservation since October 2010 for double beds. The hotel could only give us a room with a king size bed and then a promise with a room change for the next day. The first room was the smallest, dirtiest room I believe in the hotel. The bathroom was lacking enough towels, only had a shower and the shower floor was dirty. Having stayed at the hotel last year we were amazed how worn it seemed- from the service, the rooms, to the presentation of flowers in the lobby. The second room wasn't much better- dirty rug, bathroom walls, bent lamp and an unusual shower curtain- two uneven halves and colors not matching anything in Marriott that we have seem before. It appeared that excellence is not what this hotel is all about.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":4.0},"author":"Nina Collins","date":"2014-08-24 08:14:11 +0300"},{"content":"My advice is to avoid this upholstered cesspool like the plague. Even though I was travelling on business, had a confirmed (and paid for) room, I was unable to check in without a credit card. After much dancing I got it arranged but corporate has no flexibility and no mercy - all for the sake of 'possible incidental charges' (there were none, I used none of the additional services, thanks Marriott!). The room, on entry seemed clean enough but on close inspection I found long black hairs in the bathroom sink (I have photos) and curly brown (pubic??) hairs on the shower soap dish. YUCK. Housekeeping eventually (1 hour+) showed up to reclean the bathroom, no apology from the non-english-speaking staff. While I waited I tried to get a snack and a drink. Drinks you can get - that's the ONLY vending there is in the entire building. $1.25 bottle of Coke in hand I checked the room service menu - $14.95 was the cheapest item, club sandwich. Nearly $15 for a SANDWICH? Unless it's delivered by a naked dancing girl that's too much. No, dancing girls not available. Attempted to have pizza delivered - only Pizza Hut apparently pays the kickback and is allowed to deliver there. $15 got a large pepperoni delivered (and was quite good). Tried to call home - cordless phone handset dead, despite 'charge' light. Corded phone would not reach desk area - also had a ring loud enough to startle me and no obvious control to turn down. Cheap and flimsy set to boot. Cinema-size television had extremely weak and very directional remote (cheap) that took several seconds per channel change (television signal obviously delivered via house computer network) and dropped out / broke up / went dark a LOT. Nice robe in closet for use in spa - size far too small for average guy like me, unless I wanted to flash the other guests, so no spa for you. I decided to try and get some work done - wireless NOT free (don't buy the dodge about 'free wireless in the lobby' - you get one hour and your machine is locked out by MAC address, contrary to staff's hopeful fibs, besides I paid for a ROOM to work in). Not willing to cough up $15 a night (!) for likely awful service I resorted to local Starbucks for my email and web support. After the event I worked, our team gathered for a drink in the bar - their 'best' single-malt scotch? Glenlivet. Waiter had no idea what any of the other truly good malts were - and took 15 mins to deliver one drink with the lounge virtually empty. Motivation obviously pretty low despite the tony ambiance. The lobby was filled with ear-hurtingly-loud boom-boom disco music even in the morning... not sure what that says about the place. My guess is the manager was on vacation. Combine that with the must-have-room-card-to-access-elevator (for every single guest - some trips took nearly five minutes to go through the foolishness of card-in/punch floor) and the 1960s style (ie hideous) furniture with lots of sharp corners (ow) and I felt very unwelcome. The Holiday Inn in Fremont made me feel so much more welcome - and was far less than half the price.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":1.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":5.0},"author":"Myrtle Dickens","date":"2015-09-05 21:22:20 +0300"},{"content":"As the heading states, this is absolutely a fabulous facility, but make sure you check your bill constantly throughout your stay if you booked a package deal. For some odd reason, this hotel isn't able to track the different packages offered and, in some cases, the staff isn't familiar with the deal, which just adds to the confusion. This happened in my case, but fortunately I had a printed copy of the rate rules for the deal that I had booked through the Marriott website, so they were able to make the necessary adjustments without any problem. But, of course, it was annoying to see the charges (rate included breakfast for two) and then have to provide proof of the rate details to get them adjusted. Of all the Marriott's I've stayed in as a Platinum MR member, I've never encountered this before to the extent that the hotel offers so many different packages that the hotel staff is oblivious to the details of many of the offers and asks for proof from the guest. I'm sure they get lots of push back considering the level of clientele staying in this hotel, but in my case since I had printed the reservation details and had a copy, it eliminated an argument. So, just keep an eye on your bill and make sure you print a copy of the details....just in case!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Deonte Gutkowski","date":"2015-06-14 14:36:59 +0300"},{"content":"JW Marriot at LA Live is fantastic. Highly recommend it. Stayed there during the Gartner conference. The room was very spacious and nicely decorated. the big flat screen hd tv was an unexpected surprise. the bed was very comfortable. the room was quiet and I slept great. the LA Market restaurant in the hotel was really good. there's also a number of good restaurants near by. ate at ESPN Sportszone and Rock Fish, both of which were very good. the hot tub and pool were very nice. loved watching the projected tv images on the building from the hot tub at night. visible security in the hotel as well outside in the LA Live area so felt very safe.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Edythe Hand","date":"2013-05-01 09:45:51 +0300"},{"content":"Stayed over Labor Day weekend for concert at Staples. One block to Staples and convention center; 3 blocks to downtown. New, spacious rooms with frig and safe. Beds were nice and comfy and room was very quiet (maybe cuz hotel not that busy?). Lobby is airy and has free wi-fi! Unfortunately, no free wi-fi in rooms. 4th floor pool was nice and overlooked LA Live. Draft beer at bar was $8 but soda from vending machines were only $1.25! Valet parking is expensive but no free parking in area.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Neal Treutel","date":"2015-05-20 19:04:41 +0300"},{"content":"This hotel gives Marriott a bad name. Try calling their front desk before you arrive... \"Hello, Ritz Carlton\" \"Sorry, I dialed the wrong number\" (dial again) \"Hello, Ritz Carlton\" (Hang up and try again) \"Sorry, I'm trying to reach the Marriott and I think I have the wrong number\" \"No, we share the same line\" Really?! Is the Marriott manager that ^*(#ing stupid? You can't afford your own phone line or operators?! It doesn't end there. During a 5 day stay ordered room service 7 times. 6 times the order was completely screwed up. 5 times the food was very late. No joke. Even after speaking with the manager, after the 2nd room service disaster, the problem was never fixed. And the food quality was poor, at even half the price we paid. The manager eventually offered us complimentary breakfast at the restaurant downstairs, but failed to mention (even after we told her we were in a hurry in the morning and the usless, late room service forced us to skip breakfast and be late for work) she failed to tell us that there's a 30-45 minute wait for a table at breakfast. If a hotel can not get even these elementary services right, it says a lot about the management. And none of what it says is good. These kind of shortcomings are unacceptable for a Marriott, especially a Marriott in the price range of this one. I'd give them negative-one star if it weren't for the nice decor, view, and amenities.","ratings":{"Service":1.0,"Cleanliness":5.0,"Overall":2.0,"Value":1.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":5.0},"author":"Thalia Yundt","date":"2015-02-08 09:04:43 +0300"}],"public_likes":["Modesta Lubowitz","Manuel Ondricka","Imogene Hilpert","Maureen Brown"],"vacancy":true,"description":"Bed and Breakfast from 25 - 30 pounds per person per night.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}