{"title":"Penzance","name":"Mounts Bay Caravan Park","address":null,"directions":"Marazion near Penzance","phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.mountsbay-caravanpark.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":50.128042,"lon":-5.47944,"accuracy":"APPROXIMATE"},"type":"hotel","id":22095,"country":"United Kingdom","city":"Marazion","state":null,"reviews":[{"content":"We stayed at the NVL for 6 nights mid-March. We were more than pleased with our king room on the second floor of the hotel. The room was very spacious, clean, modern, with a wood-burning fireplace that we lit each evening. The bathroom was recently remodelled with slate and marble, it was large, with a huge shower and separate make-up area. Breakfast was ok - a bit boring, so we ate at Bouchon Bakery, and the Model Bakery in St. Helena as well. We had surprisingly good weather while there (in the mid-70's), and sat by the pool in the afternoons. The pool area is beside the vineyard, beautifully landscaped, there is a fire-pit close by that is lit in the evenings. The hotel is very close to all of the wonderful restaurants in Yountville (we highly recommend Bottega, Bouchon and Redd!). For the price we paid (hotel web special), the NVL was great value. We probably would not stay there again if the rate was higher than what we paid.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Cortez Gutkowski","date":"2014-02-07 10:41:34 +0300"},{"content":"We could not resist slipping off to the Napa Valley Lodge for a few days after visiting family in the Bay Area. Yountville has some of the top restaurants (French Laundry among others) in the area and is a very quaint city. The Napa Valley Lodge location is excellent, just a short walk to the center of town but far enough away from the activity to offer a quiet setting. The staff was friendly and the recently remodeled room was perfect, comfortable bed, soft sheets plus a gorgeous shower/bathroom. The pool, fire pit and surrounding grounds were the ideal setting for a glass of wine in the evening. Overall, I highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Marianne Metz","date":"2012-01-16 06:13:10 +0300"},{"content":"Clean and updated rooms in a beautiful setting. The courtyard and pool area was nice to relax at. The included breakfast was good - fresh fruit, granola, cottage cheese, good breads, cereal, juices, etc. The hotel is close to Hwy 29, but the only time we noticed any slight traffic noise was in the courtyard sitting next to the pool. I would stay here again.","ratings":{"Service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Cyril Casper","date":"2012-11-04 07:20:07 +0300"},{"content":"The Napa Valley Lodge is great. We had a lovely large, clean room with a balcony overlooking the pool and the surrounding countryside. The service was really friendly and, best of all, there was a food and wine festival in the town when we stayed! The only let-down was the continental buffet breakfast. It was perfecty adequate, but it would've been nice to have had the choice of a cooked one. Still, that's only a minor quibble. If we ever go back there, this will be the place we stay.","ratings":{"Service":4.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"John Terry PhD","date":"2013-02-25 06:43:35 +0300"},{"content":"My husband and I just stayed here for our 5th wedding anniversary and were surprised with all the good reviews it got. For $250.00 plus per night I expected a lot more. The bathrooms are small and old. The room was decorated with weird furniture that didn't match. Our biggest complaint was the breakfast. They advertise a complinentary champagne breakfast buffet with the room. I can't belive they have gotten away with calling it a buffet for this long without every guest complaining. There was NO warm food. It was in a little room off the pool and was a medicore continental breakfast at best. There was danishes, toast, bagels, cereal, and yogurt. The same break\\fast you would find at a holiday inn. There are many better choices in the area with better locations and I wish we would have chosen somewhere else for our anniversary!","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":4.0,"Overall":3.0,"Value":1.0,"Rooms":2.0,"Location":4.0},"author":"Guiseppe Homenick","date":"2013-06-18 11:06:41 +0300"},{"content":"This is a very pleasant place to stay in Napa. Rooms are comfortable with charming features including fireplace, balcony, vaulted ceilings and more. The location is perfect...walking distance to wineries, shops and restaurants in St Helena. Situated right off of Rt 29 and easy access to Silverado Trail. Staff was very attentive. Full service spa and fitness facility including a heated lap pool and superb staff right next door. This is not what I would call a \"high end, luxury\" hotel. More of a low-key inn with no pretense. We enjoyed our stay and would return without hesitation.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Freddie Baumbach","date":"2015-08-05 09:15:05 +0300"}],"public_likes":["Matilda Stehr","Rae Kilback","Carol Rau","Dovie Erdman","Elwin Mraz","Shea Hegmann"],"vacancy":true,"description":"5 star small exclusive, family-run park.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}