{"title":"Swansea","name":"Hurst Dene Guest House","address":"10 Sketty Road, Uplands, Swansea, SA2 0LJ","directions":null,"phone":"+44 1792 280920","tollfree":null,"email":"hurstdenehotel@yahoo.co.uk","fax":"+44 1792 280920","url":"http://www.hurstdene.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.620442,"lon":-3.946629,"accuracy":"ROOFTOP"},"type":"hotel","id":28956,"country":"United Kingdom","city":"Swansea","state":null,"reviews":[{"content":"We met a really serviceminded personnel, this is always a good start for a stay! Further on we got a really nice room - an appartment really - on 19th floor, and the view was spectacular! Walking south on 2nd Ave you find breakfast and dinner easily. Nearness of Central Park for fresh air, quick access to museums, and short way to Lexington Ave for shopping makes this hotel a really good starting point. If one doesn't want all the walking we did, getting on buses is no problem, and Subway is only some blocks away. We slept really well in comfortable beds. The kitchenette was well equipped - with fridge, freezer and cooking possibilities. Please note that we upgraded the room as we wanted to stay as high up as possible and this we find was well spent money. I really would recommend this hotel for other travellers when purpose is exploring NYC.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Alvina Tremblay","date":"2012-02-04 12:11:43 +0300"},{"content":"We came to new york city for the holidays, and we stayed at The Marmara Manhattan and it was great. thank you for your hospitality. Special thanks to Mr.Mete ,Mr.Mehmet and all the other staff. We recommend everybody who would come to New York.","ratings":{"Service":4.0,"Cleanliness":1.0,"Overall":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Wanda Mohr","date":"2013-07-26 03:12:35 +0300"},{"content":"We had booked a studio at this apartment hotel and got a one bedroom suite. It was very roomy, clean and comftorable. There is alot of construction going on outside but that did not really bother us. It is probably as far north as you want to go but we did feel safe. There is an all night pizza place and a little grocery right across the street. It is just a short walk to Lexington where there are at least a million restaurants! You are close to bus and subway stops. On the subway you are not more than 15 minutes to most places including Times Square and the Theatre District. Otherwise you can walk to Central Park , alot ol the museums, restaurants and some shopping. The staff was very nice. All that said we will look for another location. It is a little out of the way and as I said earlier the location is not the best but, if you are looking for alot of room in a clean space this is great.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":2.0},"author":"Randy Ferry","date":"2012-07-11 09:10:27 +0300"},{"content":"My husband and our 2 kids (1&2 yr olds) luckily used our credit card reward points to book a 3 night stay and paid for a 2 br upgrade and we are so happy with our pick. The room is spacious and clean and great for traveling with toddlers. The staff is extremely friendly and answered every question professionally. With every good thing there's always a few cons. The rooms are quite a bit outdated and in need of renovation (old old fixtures, door handles are loose and furnishings are different from the pics). The other think to be cautious of is if you're traveling with toddlers, there are alot of electrical wires from the printer and modem that are dangerous. But all in all, were happy with the space. Room to breathe!","ratings":{"Cleanliness":4.0,"Overall":4.0,"Rooms":4.0,"Service":5.0},"author":"Seth Predovic","date":"2013-08-04 14:01:42 +0300"},{"content":"I strongly recommend the Marmara Manhattan. My husband was an in-patient at Mt. Sinai Hospital and we did not know the duration of his stay. I am a small town girl and intimidated by staying in New Your City by myself. The Marmara Manhattan became my haven. Nesli (and the others in reservations) are wonderful. They understand that surgical and medical stays are unpredictable in duration and very stressful. They provided us a great rate because my husband was in-patient at Mt. Sinai and were very flexible in scheduling. The hotel is very attractive, clean, roomy, and well maintained. It is unique, not your standard cookie cutter rooms. It is about a 20 minute walk to Mt. Sinai which I enjoyed taking. The suites are really attractive and even my teenage daughters were saying what I good job I had done finding it! In addition to the great rate, it has a full kitchen and a grocery around the corner. I cooked most meals there and was able to keep down the cost of my stay. What particularly struck me about the Marmara Manhattan is that everyone from reservations, to the front desk, to the doorman and bellhop, were friendly and helpful. This place understands customer service. Unfortunately we will not be coming back to the Marmara because my husband has chosen to change hospitals to Cleveland Clinic. When he is all fixed up and healthy again, my goal is to return to the Marmara for a few days with my family and relax and spend some time with them in the city. If you need to find a place while a family member is in one of the nearby hospitals, choose the Marmara Manhattan. I talked to other families who had chosen the Wales and the Marriot. They were not nearly as happy with their choices as I was with mine.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Lurline Trantow","date":"2012-09-27 18:06:35 +0300"}],"public_likes":["Isadore Langosh","Matilda Little"],"vacancy":false,"description":"Hurst Dene is located in the leafy suburb of Uplands just off Uplands Square on the main road to the heart of the Gower peninsula. They offer guest rooms and self-catering apartments at affordable prices.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":true}