{"title":"San Francisco/Golden Gate","name":"Greenwich Inn","address":"3201 Steiner St","directions":"at Greenwich St","phone":"+1 415 921-5162","tollfree":null,"email":"info@greenwichinn.com","fax":"+1 415 921-3602","url":"http://www.greenwichinn.com/","checkin":"3PM","checkout":"11AM","price":"$54-$104","geo":{"lat":37.799,"lon":-122.4378,"accuracy":"APPROXIMATE"},"type":"hotel","id":25794,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"We had a wonderful stay at the Hotel Deca, although the Hotel was not located directly in Downtown Seattle, we were still close enough to the city that it was only a 10-15 minute drive down to the Seattle water front. The hotel staff was very personable and friendly and the rooms were very clean and decorated nicely. We will definitely stay here again!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Harvey Auer","date":"2014-02-25 00:20:53 +0300"},{"content":"Perfectly nice hotel in the U District, very convenient to downtown as well. It was clean and safe. Nicely designed, not too swanky and not too motel-ly looking. WiFi was pretty weak but I bring my own anyway, so it didn't matter. The room was a bit chilly, but I turned the heat on and it was fine. The staff were nice and helpful. I hadn't thought to ask that the bed have a blanket on it--seems kinda standard, right-- but when i asked for a blanket that wasn't made of down, they didn't have any, so they gave me a pile of sheets. the bed was quite comfortable and I slept like a log. No more free breakfast, but there's a Tully's Coffee in the hotel where you can get a coffee that's probably better than what their free coffee would be. Tons of places to eat nearby-- you're in the best part of Seattle for ethnic cheap eats.","ratings":{"Service":3.0,"Cleanliness":4.0,"Business service (e.g., internet access)":2.0,"Check in / front desk":3.0,"Overall":3.0,"Rooms":3.0,"Location":3.0},"author":"Lucius Raynor","date":"2015-03-08 12:08:04 +0300"},{"content":"My colleague told me that staying at the Hotel Deca would be a treat, but I was not prepared for what I encountered. I fell in love with the \"boutique\" concept of intimate, unique accommodations while traveling frequently for business to San Francisco a few years ago. I did not expect to find anything remotely similar in Seattle, but the Hotel Deca proved me wrong. The clever \"Art Deco meets Michael Graves\" style lobby was both stunning and cozy and our beautifully appointed room followed suit. Unlike many other boutique hotels I have frequented, the meticulously styled room was quite large and the king-sized bed was a delight. Throughout our stay, the staff was professional, friendly and, I might add, as elegant as the property itself. The hotel’s U District location proved to be perfect for my business needs at the University of Washington while my wife had quick and easy access to Seattle’s downtown and Lake Union tourist destinations. We both decided that the next time Seattle is in our itinerary for whatever reason, we will be staying at the Deca.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Rooms":5.0,"Location":5.0},"author":"Torey Bailey","date":"2015-10-05 07:26:46 +0300"},{"content":"This was a fabulous hotel in the University district area. The room I stayed in had a king-sized bed, an I-Home for my Ipod and a flat screen TV! While the room was on the small side -it was very cozy and most of all - clean! There is an amazing complimentary continental breakfast in the morning and while I only stayed for one night, the staff was accomodating and friendly! FYI, taxi cabs are very expensive. From the airport, $55.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":4.0},"author":"Carolanne Hirthe","date":"2012-09-27 17:11:11 +0300"}],"public_likes":["Noel Dietrich"],"vacancy":false,"description":"Budget hotel with free parking, located just one block from Union St. It has 32 recently renovated guest rooms and offers an in-room coffee service and a complimentary newspaper daily.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}