{"title":"Paris/La Défense","name":"Fraser Suites Harmonie Paris La Défense","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://paris.frasershospitality.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.88819,"lon":2.25211,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21873,"country":"France","city":"Courbevoie","state":"Île-de-France","reviews":[{"content":"Everything you'd expect a ritz-Carlton to be. First class all the way. World class golf right out your door. Great pool and beach. Great food nearby, and you can use a free shuttle to reach them. Drawback: driving distances to essentially everything else on Maui. There's basically one road in west Maui, circling the mountains, so it takes four times as long to go east as it would as the crow flies. Almost 2 hrs to Haleakala and I-don't-wanna-know to Hana. Judging by the clientele at the pool, there must have been some sort of tattoo convention in town that week.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Location":3.0,"Rooms":5.0},"author":"Carrie Walsh","date":"2012-12-13 06:40:01 +0300"},{"content":"My husband and I stayed here for the first half of our honeymoon. We chose to visit Maui because we wanted to end our honeymoon in Napa and we wanted to have the option of adventure if we got bored with laying by the pool. Overall, we had a wonderful experience at this hotel. The bedroom and bathroom were well-maintained and very clean (which is, of course, to be expected at a Ritz). The style is very simple though, so if you're looking for a modern and trendy room, or something over the top with luxury, this is not the hotel for you. While planning our trip, we struggled with staying here or at the Four Seasons in Wailea. We thought the Four Seasons would be a little more decadent and \"at-your-service.\" But when we learned that the Four Seasons shares their beach with the #1 family resort in Maui, we opted for the Ritz to have a more romantic honeymoon. While in Maui, we checked out the Four Seasons, and we were glad with our decision. The Four Seasons is in a \"hotel row,\" and right next to a huge mall (even if it is high-end shopping, I don't want to vacation next to a mall.) We've heard the Four Season's has an adult pool and staff come around with frozen grapes, mist you water, etc etc. The Ritz did not have these services. We were certainly bummed, but it didn't ruin our vacation. We had a wonderful experience at the Ritz spa, that made up for the simplicity of the pool service. We did a couples package and we enjoyed every minute of it. Everything was very clean and the staff were friendly and knowledgeable. But, the real shining star was the concierge. We stayed on the club level and had our own concierge- they booked everything for us, gave us tips, maps, and even a CD to play on the Road to Hana that tells you when to stop and explains what you're looking at. They weren't too much help when we wanted to know where to get the best local food, but when we found out from our instructor at Maui Paddle Sports, they were extremely interested in getting a copy of our restaurant list in case anyone else inquired (apparently most people staying at the Ritz don't ask about the best food trucks for a mix plate). All-in-all, we had a vacation mixed with relaxation and adventure, and were very satisfied with our Ritz Carlton, Kapalua pick.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":4.0},"author":"Creola Schneider","date":"2015-06-15 14:26:26 +0300"},{"content":"My wife and I stayed at the Ritz Carlton for 7 nights in November. Even hard-to-please people would have a difficult time complaining about this place, though the location means people who like being in the center of activity should avoid it. Location: The Ritz is located on Kapalua beach, which is about 20 minutes north of Lahaina and 15 minutes north of Kaanapali. It's a touch remote, but is worth it for me as this meant a much quieter vacation. If this are were Las Vegas, Kaanapali would be the strip with reams of people while Kapalua would be a beautiful ranch just outside the city. Service: The only complaint I had in this area was rectified. We had some really slow pool service one day, but when I stood up to flag down the waiter a managerial-type person ran up to me and took care of my order and then attended to those around me who also may have been neglected. Everything else was outstanding. Any questions were asked, and the staff gave me lots of local, inside tips for exploring West Maui. Room: Room was good, but probably if I had to pick a 'low spot' of the trip this would be it. It wasn't very soundproofed as I could hear people chattering in the hall and moving above me. The room had a great patio, but it unfortunately didn't have a light! When the sun goes down at 5:45 this is a must in my opinion. Otherwise the room was great. Nice big TV, great maid service, two free bottles of water everyday. Amenities: The pool here is fantastic. The middle pool is 'adults only', and I did see an attendant kick two kids out of it one day. The beach is extremely close....people who complain about the 'hike' to the beach are absolutely out of their mind. 3 minutes from the Ritz, tops. And it's a beautiful walk over perfectly manicured lawns. The beach itself (DT Fleming) is considered one of the best in Hawaii. It's sheltered so the wind isn't crazy, is nice and calm during low tide for swimming, but perfect during high tide for boogey boarding or surfing. The hotel is also serviced by a Kapalua shuttle, which will take you anywhere in the immediate area for free. This service is also on-demand, which is awesome. Whenever you want it, just speak to a nearby attendant and it will come scoop you up. Ditto for returning, as most of Kapalua seems to service the Ritz. Nearby Services: These were great. Staying at the Ritz is obviously expensive, and eating there only exascrbates this issue. There is a Kapalua 'General Store' about a 5 minute walk away that has a deli, grocery store, and liquor. Given the mini-fridge in the room, you can really make use of this. There's also an excellent Japanese restaurant near the General Store (Sansei), which has quality on-par with the Ritz but prices are about 50% cheaper. Overall this place won me over. It was my first time at the Ritz and certainly won't be my last.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":4.0,"Location":4.0},"author":"Kelli Littel","date":"2014-04-11 03:53:26 +0300"},{"content":"Yes there is a lot of wind, and the Hotel is not in the middle of the hotel district, but overall I see that as a plus. The grounds are spectacular, the service is first class, thef ood is pricey, but very good and the over all experience was perfect. We enjoyed driving to other beaches and restaurants, but we were glad that we were not surrounded by hotels. We stayed in a two bedroom residential suite with two adult children and the extra space was worth the money. When there were minor problems they were corrected and everyone had the aloha spirit.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lelah Romaguera","date":"2012-03-24 21:49:50 +0300"},{"content":"My wife and I have traveled all over the world and have stayed at some of the finest hotels. While luxury is important, service is key. In this regard, the Ritz in Kapalua has succeeded with flying colors. We are here celebrating my birthday and the service has made this experience one of my best birthdays. Specifically, we were comped a VIP cabana at the pool, treated to a wonderful lunch with cocktails and treated with extreme kindness and attentiveness. Specifically I want to mention Kyle, Shannon and Margie who made our experience exceptional. They made their hard work look as if it was effortless and always had smiles on their faces. Just wanted to give a shout out to them and the Ritz in Kapalua for making my birthday one of the best.!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Nathanael King","date":"2015-10-11 01:14:06 +0300"},{"content":"The resort was in an ideal location, removed from the hustle and crowds of Kaanapali but only a 10 minute drive away. Service was beyond exceptional and resort was absolutely immaculate. The upscale feel of this property makes it well worth the extra $$ to stay here.","ratings":{"Location":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Bennett DuBuque","date":"2014-03-30 15:25:51 +0300"},{"content":"We were there over week between Christmas and New Years. Didn't care for the property or hotel. Poor value and very put off by loud band that played till 2am on nye that kept guests from sleeping and was playing for largely a local crowd.","ratings":{"Service":2.0,"Cleanliness":5.0,"Overall":3.0,"Value":2.0,"Location":2.0,"Rooms":3.0},"author":"Kaylin Corwin","date":"2012-02-09 07:02:56 +0300"},{"content":"this is a beautiful property, and the plantation golf course is my favorite course in the world. [yeps, said it, my favorite]. spent 4 days at four seasons in wailea, then 5 days at the ritz. i accept one pays more and expects more at the four seasons. this time was more noticable the difference between the two. the ritz, and this is also a comparision from 3 past stays, just seemed under staffed. less folks by pool. took longer to get rooms tidied up. the concierge lounge [great staff], just had less food to offer. [we have stayed on 4 ritz concierge floors in last 12 months. this was the least stuff offered]. this is a beautiful property. [better than four seasons]. it was noticable to all of us that they were cutting costs. charging for in room internet? at these prices?","ratings":{"Cleanliness":4.0,"Sleep Quality":5.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Roslyn Glover","date":"2012-03-31 21:05:14 +0300"},{"content":"We stayed on the Club Level the last week of July, 2011. The property was absolutely amazing - fabulous pools, ocean, walking trails and rooms. The Club Level service was truly wonderul. Leslie, Charlotte, Athena and Laura met every need we ever had. They served us special drinks, made reservations for us, and generally treated us like family! We highly recommend the club level. As others have mentioned, the pool does get windy. We rented cabanas on the days were at the pool a lot ot minimize the wind. The cabanas were $100 a day and came with a cooler of drinks and a tray of fresh pineapple. The swimming pool was pretty chilly, but it didn't seem to bother the kids! Our group did a snorkeling/photography program through the Ritz that was really good. We also enjoyed the lei making class. The beach at the Ritz was great for boogie boarding! Overall, we loved the Ritz at Kapalua and we cannot wait to return.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Coby Carter","date":"2013-05-17 18:33:01 +0300"}],"public_likes":["Ena Schmidt Sr.","Nettie Hammes","Alice Lang","Roxanne Heaney"],"vacancy":true,"description":"A higher-end apart-hotel close to the Esplanade de la Defense metro station","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}