{"title":"Wirral","name":"Travelodge Wirral Bromborough","address":"Pool Lane, Bromborough, CH62 4UE","directions":null,"phone":"+44 871 984 8484","tollfree":null,"email":null,"fax":null,"url":"http://www.travelodge.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.349092,"lon":-2.985837,"accuracy":"ROOFTOP"},"type":"hotel","id":33537,"country":"United Kingdom","city":"Birkenhead","state":null,"reviews":[{"content":"We’ve been to Hawaii many times over the years, and I have to say our last stay there was the best. We stayed at the Trump Waikiki in a 1 bedroom suite (which we booked through a company called jet luxury resorts and got a great deal.) From the moment we entered the hotel till the second we had to leave, the service was impeccable. The guys at the hotel lobby offered us complimentary water every time we walked in and out of the hotel and offered us even a local map as well. The suite was gorgeous. Huge windows, kitchen, flatscreens and wife loved the bathtub. Best part was the balconies outside the living room and bedroom which have amazing views of the both the ocean and of the Downtown Waikiki skyline. Location perfect. Overall, we truly felt like this was a luxury vacation from the moment we got there to the moment we left. (The way it should be when you travel all the way to Hawaii). We would highly recommend this hotel right now over all others in the area. A true luxury experience!","ratings":{"Overall":5.0},"author":"Ceasar Zemlak DVM","date":"2012-01-14 06:39:19 +0300"},{"content":"My wife & I stayed here for 5 nights.From the moment we arrived until the moment we left,we felt special.We used the fifth night for free package staying in a Studio Deluxe Ocean View for $339 USD per night.So all up taking into account our free + taxes = $1545.When we walked into our Studio our mouths dropped in awe at the size of our Studio.2 Toilets,2 Showers,1 Super Bath that opened up overlooked our super comfy bed/pillows & out over 1 of 2 of our balconies that overlooked the parkland & ocean.It also came with 3 Tv's,Full Timber Kitchen,6 seater Dining Table,Lounge,Washer & Dryer. (Magic ) We were on the 16 th Floor & loved the view,especially the Fireworks Display on Friday Nights around 7.30 from the Hilton. The pool was a little small as it was just a lap pool about 25mtrs long,but it did the trick to cool down whilst sunning ones self by the pool as the waiter brings me my $7 Corona.We ate downstairs at BLT where the food was very nice at a reasonable price. All the staff were courteous & made our stay a wonderful event.A special mention goes to Dennis at Concierge for his ork in obtaining a Hire Car (he had 2 phones on the go to get me the car I wanted) & he helped following up on making sure our Adaptor worked with our Camera to charge it. Everything exceeded our expectations including our whole stay in Hawaii. (Australian Hospitality needs to take a leaf out of the workers in Hawaii )Oh & we love how they came in while we were out for Dinner & placed Gowns on the bed,slippers nearby,radio & lamps on :-)) Note we also stayed at The Outrigger Reef on the Beach for 5 nights Mahalo nui loa","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Cornell Gerlach","date":"2013-12-06 13:32:42 +0300"},{"content":"I have stayed over 2000 nights in Hotels over my Business career and when I researched Hotels in Waikiki Ohau to take my family on summer vacation I read the trip advisor reviews and decided on the Trump International Hotel. During this vacation my family and I stayed in Kauai (Marriott Kauai Lagoons Beach Club (Disappointed), the Big Islandat the Fairmont Orchid (Excellent) and the aforementioned Trump International in Ohau. My family and I can say everything about this property is SPECTACULAR. The 2 Bedroom, Den, 2 Bathroom suite (2219), the location, the service, the employees and the view of Waikiki and the pacific ocean. Waikiki is substantially different today then it was on our last trip to Hawaii 8 years ago. Two blocks from the Hotel is a better 5th avenue than NYC has including all of the high end retailers. Restaurants abound within a couple of blocks of the hotel including NYC favorites, Wolfgangs, BLT Steakhouse, Nobu, PF Changs, Cheesecake factory etc. The price of the suite will stretch your budget, but to experience the Spectacular it is worth it. The very best and worthy of the Trump Brand.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Joelle Kunze","date":"2013-01-02 21:40:07 +0300"}],"public_likes":["Karelle King","Tamia Price","Mabel Prosacco","Diego Yost","Annetta Reilly III","Berenice Dare"],"vacancy":true,"description":"Opening Autumn 2009","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}