{"title":"San Francisco/Haight","name":"Red Victorian Bed & Breakfast","address":"1665 Haight Street","directions":null,"phone":"+1 415 864-1978","tollfree":null,"email":"peacefulworldtravel@redvic.com","fax":null,"url":"http://www.redvic.com/","checkin":null,"checkout":null,"price":"$90–$200","geo":{"lat":37.7694,"lon":-122.4499,"accuracy":"ROOFTOP"},"type":"hotel","id":25865,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"My husband and I flew straight to vegas from Mexico and stayed at the summer bay resort with 2 other friends. The 2 bedroom suite was very large with a kitchen, washer & dryer, flat screen tvs and many different pools. I loved the huge tub in the master bedroom =) The only problem we came across on this trip was that all the soda machines that we went to were either broken or not accepting coins, it was very hot so we needed to drive to a corner store to buy water. Other from that the hotel was a very nice place to stay and we will definitely be returning in the future.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Mr. Arnulfo Krajcik","date":"2014-08-17 21:16:24 +0300"},{"content":"I did some extensive review reading on TripAdvisor before I decided to book our surprise(to my husband) anniversary stay at Summer Bay. I chose it because the reviews were much less scary than the hotels on the strip in our price range. After booking I continued to read more reviews and started to get a little worried, but all of those worries were for nothing. Here's the play by play: We flew in at 7:30am and Check-In time wasn't until 4pm, but we decided to try our luck. After picking up our rental car we arrived at Summer Bay about 8:30am. We had no trouble finding the entrance, or temporary front desk, and barely noticed the construction at the front of the complex. At the front desk, they told us they had a room ready for us, no problem. I tried to hint around, hoping to get an upgrade to an owner suite, mentioned our anniversary, then flat out asked if they were booked up. She said they were full. Oh well, can't blame a gal for trying! We got to our room (Building 3, 207) and loved it from the moment we walked in. Spacious living room and kitchen, nice big king size bed, and huge garden tub. Everything was clean, and, despite a little bit of wear on the couch, very welcoming. This was a One Bedroom rental, so there was just a small two person table in the kitchen, and 'old-style (read:non-flat-screen) TVs. Worked for us, who goes to Vegas to watch TV?!? However, all the remotes were missing batteries, one call to the front desk and that was fixed. I've read complaints on these reviews about not enough towels, and not enough, and too small pillows. There were plenty of each, with extras under the sink and in the closet. Check out my pictures to see the room, and the great view from the balcony. We did visit the concierge, and she was helpful, though we didn't end up going to any shows. We also used the free shuttle, which was great! They pick up at the back of the property, so it was a little walk from where we were, but I think a golf cart went by and offered a ride everytime. The shuttle always picked up and dropped off right on time. And remember it's FREE, so even though we had a rental car, we used the shuttle so we didn't have to worry about parking. The times were very convenient, and the drivers all very pleasant. The grounds are beautiful. We walked around once, and probably didn't see half of it. The pool closest to us was under construction, and we didn't have much time so we didn't swim. The only very, very minor complaint I have is, we didn't get maid service (our choice) so I asked for an extra packet of coffee for our second morning, and they wouldn't give it to me. Like I said, very minor! The free popcorn at the front desk totally made up for it! In conclusion, I don't think we'd stay anywhere else if/when we return, and I've already recommended Summer Bay whenever I hear anyone mention going to Vegas!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Coralie Turner","date":"2014-04-05 17:09:16 +0300"},{"content":"This place was great, tons of space, 2 bedrooms, full kitchen, laundry! perfect place for a family trip or to stay with a few couples, you can save $ on food by making your own meals in their fully stocked kitchen, you can pack less (save on those pesky luggage airline fees!) because you can wash your clothes, they even provide detergent and it's all conveniently in your suite. these suites were perfect, HUGE awesome bathtub in the master 2. choice of I think 4 pools and on site entertainment as well. just a short walk or shuttle ride to the strip, 2 blocks away and the price was amazing for a vegas hotel on a weekend!!! I would recommend this place to everyone. when we were there they were doing some construction to enhance it, so some of it was tore up and the pool closest to us was closed for remodeling, but I can't wait to go back when it's done and even nicer :)","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":5.0,"Service":3.0},"author":"Dino Osinski","date":"2015-10-18 03:28:13 +0300"},{"content":"The resort neglected to tell us that the resort was under construction, so it took us 30 mins longer to walk around the contruction area. The maids NEVER came during our visit, internet was not working half the time when we needed it, and the shuttle never came to pick us up, and the walk to the strip takes 40 minutes.","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":2.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":1.0},"author":"Miss Omari Reichert","date":"2013-01-15 17:45:35 +0300"},{"content":"This is a wonderful facility to utilize. Our first with a resort and it was fantastic. We were a little apprehensive when we pulled up, since it is under going an expansion, and the construction was obvious, but once we began interacting with the staff, we realized the commitment they had to the guests. Only a block off the strip, but with the feel of being secluded and quiet. The units are fully equipped and extremely clean. Four pools provided plenty of accessibility and the security staff allows for your comfort. Whenever we were walking the property, we would be offered a ride on the golf carts that the staff drove around the facility, or even picked up by a shuttle as they passed. First and foremost, was the hospitality of the entire staff, without exception, we had positive interactions with them; however, we would like to highlight Pat P. who drove our shuttle and was always extremely friendly and helpful with suggestions and answering questions for us. A great ambassador for Summer Bay. Thank you for making us converts to resorts from hotels!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Eric Kub","date":"2012-10-03 19:37:59 +0300"},{"content":"This is an good place to rest and get away from the strip. The service provided by all departments is excellent. We had some minor problems that were rectified immediately. Saying that the housekeeping could have been better. Our maid was wonderful, but the floors needed to be swept and mopped and there was mould in the shower. The free shuttle service to the strip was excellent, as well as the pick up by golf cart available within the hotel itself, this is a huge facility. Amenities such as hot tub and pool were refreshing when we came in from a hard day of walking the strip. Grocery shopping to Vons was superb (ask for the discount) there is currently no food services on the site. The 2 bedroom/bathroom fitted our group of 5 quite comfortably. Heard some plane noise and but you get use to it. Well worth the money you pay........very friendly staff.","ratings":{"Service":5.0,"Cleanliness":2.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Lane Stanton","date":"2013-08-04 03:05:25 +0300"},{"content":"Staying at the Summer Bay Resort Las Vegas Desert Club worked for us! Although there is a major rennovation happening at this resort that we were not aware of before we arrived (could be why we got such a good deal), our stay was still great. Having a two bedroom, two bath unit allowed two couples to share a space easily. I believe we got an updated unit and it was very nice with comfortable king size beds and big screen tv's in each bedroom. It was very clean. The location (the parallel street behind the strip) was very convenient and made it easy to either walk (although a bit of a hike) or drive to all of the strip activities. I look forward to staying there again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Sid Wiza","date":"2012-05-24 15:30:37 +0300"},{"content":"We just stayed a week at the Summer Bay Resort Las Vegas Desert Club. It was just ok, nothing special. The staff were nice and the shuttle drivers were very nice and helpful. We stayed in a 2 B/2 Bath unit on the north side in building 15. If you wanted to sleep in, forget it. There is a large lot of construction equipment and plants that they begin work at 4:30 and 5:00 am. Back-up alarms on trucks etc, woke you up. The carpets needed cleaning and they need to get rid of all the dusty fake silk flower arrangements. They were very prompt on their shuttle service to and from the casinos and grocery store. It was no luxury place to stay and I do not see how people buy these units. We used our stay as a gift from a relative. It was nice to have a washer and dryer and full kitchen.","ratings":{"Service":2.0,"Cleanliness":2.0,"Overall":3.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":2.0},"author":"Mr. Elton Zboncak","date":"2012-05-15 04:48:31 +0300"}],"public_likes":["Verlie Schinner","Ms. Minnie Hammes","Jane Weissnat","Sonny Hodkiewicz"],"vacancy":false,"description":"A throwback to the Haight Ashbury's glory days during the 1960s, this peace and love themed B&B has several eclectically themed rooms and suites, as well as a cafe downstairs.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":true}