{"title":"London/South Kensington-Chelsea","name":"The Sloane Square Hotel","address":"7-12 Sloane Sq, SW1W 8EG","directions":"tube: Sloane Square","phone":"+44 20 7896-9988","tollfree":null,"email":"reception@SloaneSquareHotel.co.uk","fax":null,"url":"http://www.sloanesquarehotel.co.uk/","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.4928,"lon":-0.1572,"accuracy":"ROOFTOP"},"type":"hotel","id":16452,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"Our stay at Ames was fantastic. All the staff, but particularly Nina and Charles, couldn't have been more helpful in advance of and during our stay. Ames is extremely stylish with a cool vibe. The bar is lively and the restaurant serves excellent food. The Ames is just a few feet away from the freedom trail, we walked every where from the hotel. If you go to Boston try and stay at Ames.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Darrick Beier IV","date":"2012-08-08 01:55:50 +0300"},{"content":"If you are visiting Boston - for business or pleasure, the Ames is the perfect location. We spent 3 nights and had a great trip. Rooms are modern an clean. Beds and pillows are comfortable. Flat screen TV with good selection of channels offered. Other than the fact that they charge extra for Wi-Fi, everything was just what we hoped for it to be. Free Wi-Fi is just steps away at one or the other of 2 Starbucks very near the front door of the Ames. Hotels in Boston are really expensive, especially if you choose your hotel for location. Right on the Freedom Trail puts you in the best position to make the most of your time.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tillman Steuber","date":"2014-07-21 13:47:03 +0300"},{"content":"We spent a few days in Boston to celebrate our 25th wedding anniversary and found the Ames comfortable and very friendly. The staff were very helpful. The location is unbeatable - right on the Freedom trail, with lots of central locations within easy walking distance. I'd recommend that you ask for a room on an upper floor as the central location means that the streets below are pretty noisy and there were roadworks as well. But we were well away from it in our 11th floor room, which was modern, bright and well laid out. We had a really memorable stay - highly recommended!","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Rozella Douglas","date":"2012-01-03 20:33:12 +0300"}],"public_likes":["Brielle Padberg","Zelma Funk","Ray Gerhold","Santiago Sawayn","Mrs. Fredrick Oberbrunner"],"vacancy":true,"description":"Modern and stylish hotel with good location in Chelsea close to a great array of shops.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}