{"title":"Orange (France)","name":"Arène Kulm Best Western","address":"place de Langes","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.hotel-arene.fr","checkin":null,"checkout":null,"price":null,"geo":{"lat":44.13730434575296,"lon":4.806636852154043,"accuracy":"APPROXIMATE"},"type":"hotel","id":21243,"country":"France","city":"Orange","state":"Provence-Alpes-Côte d'Azur","reviews":[{"content":"NIce hotel.Good staff, rooms comfortable, roomy and clean. Location is excellent. Right next door to Macys, across from Boston Common and within walking distance of Chinatown & the Theatre district. Bit of a nuisance having to use two seperate lifts to get to the exit but you get used to it. Did not have breakfast in the hotel but can recommend the Boston Common Coffee house across the road. Good Coffee and Breakfast pastries. Good restaurant for a quiet evening meal. This hotel is much frequented by Airline personnel which is a good sign.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":5.0},"author":"Jaylan Quigley","date":"2014-11-06 23:24:52 +0300"},{"content":"After securing this room on priceline, i was a bit nervous after reading some of the TA reviews! However, we had NO problems at the Hyatt! First of all, there is an elevator that takes you from the street level to the lobby. Then another elevator that takes you up to the rooms. Some people were complaining about this feature, but this is becoming more and more common in larger hotels. It also adds an element of security to your stay. One evening as we were walking from the main elevator to the guest elevator, a stationed Hyatt employee stopped us, and asked to see our room card before boarding the guest elevator. A comforting touch nonetheless. Check in was a breeze. Got the room we requested, and everything was smooth. Julia at the desk was extremely nice and courteous. When we got up to the room (10th floor), the room halls were very cool. Its interesting how they designed it. Blocks of 4 or 5 floors are kind of exposed.. you can look up once you get off the elevator and see the other floors (or down). it has a eurpoean/bavarian forest type of feel in a way! it was kind cool, and unexpected. The room was very clean. The bed was VERY soft. the LCD tv was brand new. the view was even decent. we self parked ourselves... (i believe this was $32 for the single weekend day/night we stayed for). From what i read on the website, i think valet at the hotel, was $42. the parking garage is extremely convenient. at about midnight we ventured to the bar at the hotel.. not a seat remaining. There are tables that are seat yourself to the right of the bar, that are staffed by waiters. we sat and looked at a menu for a late snakc as we just had gotten back from fenway, and decided the late night menu wasnt exactly what we were looking for. Not to mention in the 10 minutes we were there, no one approached us. So we went to Dylan and Max's... about 3-4 minutes down the street. cool, low key bar. Great bar food! The location of the hyatt is interesting. It's suprisingly convenient. The T is really close. The Common is a block away. You are just a block or two from Chinatown section, and you are 'in' the financial district. In my opinion, this isnt really the financial district. We usually stay at Club Quarters. IMO, THAT is the financial district. The Hyatt is more on the fringe i would say. it took about 10-12 minutes to get to fanuiel hall, etc. not too bad. There are stores very close by (dunkin donuts, cvs, tons of retail). I must add that they were SOLD OUT (overbooked actually) the night we stayed... And we had no service issues, nor did we hear anyone else through the walls, floors, ceilings, etc. we had no complaints! The Hyatt's reputation here MAY BE what's hurting it the most. The hyatt is known for its plush accomodations and catering to the higher end. Im thinking this could be it's downfall on the review boards in many instances. We rated the hyatt as very comparable to the other 3.5 to 4 star hotels we have stayed at in Boston and NYC... Clean. Comfy, and conveneint. We really saw no issues!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Dante Will","date":"2014-06-17 05:27:02 +0300"},{"content":"I had previously lived in Boston and this trip was to meet up with some friends from that time frame. I opted to stay at a hotel as, when booking through Travelocity, the cost of some of the flights to Boston from DC was the same as the flight and a few nights hotel stay as I was only there for 2 nights. That being said, I was already family with the area. One of the first things I noticed and really appreciated was the travel sized toothpaste that was in the bathroom. Sure, this is small detail but most places just seem to give you shampoo, lotion and soap and I had forgotten toothpaste so this was a nice convenience. I was also able to check in a few hours early which was nice since the trip was so short. The bed was nice and comfortable. I could have sleep forever but this did not happen as it seemed every morning nearby rooms were being vacuumed before/right around 9am. The AC rattled a lot and the pipes were noisy when the shower was going in neighboring rooms but other than that, the room was very quiet at night. I had a few drinks one night at the restaurant in the hotel as it was a Sunday night and no other restaurant in the vicinity of the hotel was going to stay open as late. The lobby area is weird but not that inconvenient as its just two elevators to get to your room not too sets of stairs. The area is right in the Downtown Crossing/Theater District area so you will see interesting characters if you return to your hotel late at night but I never felt unsafe and knew before hand that the area is not the worst area that a young female could find herself in. The location actually worked quite well as it won't take you long to get to the airport, shopping, Faneuil Hall, Cambridge and any other popular touristy spot.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Maude Nolan","date":"2013-01-08 11:31:17 +0300"},{"content":"We stayed here for 5 nights having booked the hotel as part of a package through British Airways. The price was a major influence in our selection, it was the cheapest central hotel they offered. It was only after that we read more of the reviews and began to get worried. We took a taxi from the airport and the doorman offered to help us with the bags on arrival but we declined. The entrance is strange, the lobby is on the third floor so you need to take a lift (there are 3) from the ground. However, to get to these from the street entrance you need to go down a small flight of stairs which was a pain with the luggage (we wished we had used the bellboy)! Also these doors don't really open properly, they are stuck open at an angle which you can walk through without luggage. If the doorman is there they manage to force them open. Check in was a breeze there was no queue and the agent Rosario, was so helpful making sure that our requests had been fulfilled and offering further help and information. It was then, however, we found out that the pool was shut for renovations which had overrun. This was disappointing for us as we do like to chill in the pool normally. However, Rosario explained they had an agreement with the Langham should we wish to use a pool although as it happened, Boston kept us so occupied we didn't have time. We were on the 19th floor which pleased us and there were four lifts, which although were a bit creaky, were always working and we never had a situation where we had a long wait. The room was very spacious and clean and well maintained. It was, however, a little dated and this is reflected throughout the hotel but not to any extent that disappointed us. We had absolutely no issues with noise at all. Every member of staff we met was always friendly and helpful and went out of their way to make sure we were happy. Even after we had checked out the staff on the front desk were more than happy to give us a key to use the sauna and fitness suite so we could shower before our flight home. We found the location to be ideal. It is on top of Downtown Crossing subway station and Boylston was only a couple of minutes walk too. So many of the attractions were such a short distance anyway that sometimes it was just quicker just to walk. There is also an alternate entrance through Macy's (an alternate set of 3 lifts take you down to there). All in all we had a very good time in Boston and was very pleased with the Hyatt as a choice of hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":4.0,"Location":5.0},"author":"Augusta Cronin","date":"2014-04-06 14:40:49 +0300"},{"content":"First of all this hotel is refusing to take responsibility for stolen items under the valets care. The bed was uncomfortable, the air condition didnt work, poor water pressure in the shower, and terrible food. Save yourself some sanity and stay around the corner at the Ritz..","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":2.0,"Sleep Quality":2.0,"Rooms":2.0,"Location":3.0},"author":"Joana Steuber","date":"2012-11-29 14:32:28 +0300"},{"content":"Stayed here for 4 nights over Valentines and turned out we picked really well for a first stay in Boston. The location was superb, as its fairly quiet around the property but its still 3 minutes from all the action. State in one direction, Boston Common in the other. Both Downtown Crossing and Chinatown `T` stops are less than 5 minutes away. The staff were also very helpful and in good spirits, and in the room the view over the common to the Massachussets Sate House was outstanding. But the best thing about the place is the amazing king size bed. The mattress is about 2 foot thick!. Combine this with the excellent rate we got from Expedia and it was a 5 star trip for a 3 star price. Stay here when in Boston!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Alysha Gerlach","date":"2015-04-22 18:36:23 +0300"},{"content":"Hyatt was offering a 30% discount from the best available rate on their website, which made booking here very attractive. It's only a few blocks from the Boston Common and right next to the theater district. It's walking distance to the Back Bay and Beacon Hill. The Boston Ballet (at the Opera House) is right across the street, which was very convienent. The room itself was nice, with very comfortable beds (my friend said they were a little too soft though, but I thought they were great). Their fitness center is also decent, with a selection of cardio equipment (4 treadmills, a few ellipticals, bikes and rowing machines), as well as weights and weight machines. There is a small pool, designed for laps (not very children-friendly if that's what you're looking for). Overall, it was a great experience for the weekend and I would definitely stay again.","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":5.0,"Rooms":4.0},"author":"Miss Marta Gerlach","date":"2014-01-27 13:29:53 +0300"},{"content":"I recently traveled to Boston and stayed at the Hyatt Regency from September 25th, 2009 to September 27th 2009. You enter the hotel on street level, then there are 3 steps down (even though a sign besides the sliding glass doors states Handicapped Accessible???) to a lower elevator level and then you have to take an elevator to go up to the 3rd floor for the Reception Area and then another set of elevators to get you to your room.YIkes!!!! Decor is dated, rooms are quite standard and for some inexplicable reason- I was put in a handicapped room. Furntiure in the room is definitely showing wear and tear and whatever they put on the top of their mattresses, some sort of padding, does not even extend the whole length of the mattress. To boot, I could not get the phone in my room to work properly as I could only manage to work it with the speaker micro on. Additonally, their minibar bar prices are stratospheric. The bar and resutrant in the Hotel Lobby is quite generic with nothing to make it stand out in one's mind. I stayed there because when I think Hyatt- I hink of a pleasant Atrium Area but, if there was one, I did not find it. The exterior of the buuilding is also quite ugly- like a grey concrete fortrress- nothing charming or elegant about it whatsoever. I ewill definitely NOT stay there again.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":2.0,"Location":4.0,"Rooms":3.0},"author":"Abe Hackett","date":"2014-10-04 03:12:26 +0300"},{"content":"I booked the Hyatt using Priceline & got it for $63 a night! This hotel was probably 3 1/2 star hotel, but for the price... We got there early & the room was ready so we checked in before noon & had the day to start sightseeing. We were on the floor w/ the pool so sometimes it was a little noisy in the room. The room was clean, nothing fancy. The staff were quite friendly but the concierge was not so helpful when we asked about difference restaurants. Other than that, it was in a convenient location & great place.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Location":5.0,"Rooms":3.0},"author":"Tevin Thompson","date":"2014-04-18 11:52:12 +0300"}],"public_likes":["Erika Howell","Willa Runolfsson","Ms. Valentine Stehr","Emmanuelle Ritchie","Maybelle Harber Sr.","Betsy Okuneva"],"vacancy":true,"description":"Four-star hotel.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":false}