{"title":"Yosemite National Park","name":"Upper Pines","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$20 per night","geo":{"lat":37.738885,"lon":-119.565184,"accuracy":"ROOFTOP"},"type":"hotel","id":33893,"country":"United States","city":"YOSEMITE NATIONAL PARK","state":"California","reviews":[{"content":"Royal Service Needs NEW Staff Royal Service WORSTS:- ALL ROYAL SERVICE STAFF (EXCLUDING the workers at the royal service poolside bar and the waiters at the royal service restaurant)it is as if they want a tip for EVERTHING (even for something that is included in the package). everything seemed to be about more money with them and their 'friendly' atmosphere was EXTREMELY fake. they ironed my swimsuit, RUINED IT! (ofcourse! WHO irons swimsuits???????), put it back as if NOTHING was wrong, made me call me SEVERAL times, and had the nerve to charge me at the end for the service which is included in what I was paying for???????!!!!! ALL the workers speak English VERY VERY well BUT when they get the feeling that a guest is not happy with something they ALL OF A SUDDEN forget how to speak English! useful for them but SO annoying for guests. - Cleanliness of rooms NOT present. Royal Service GREATS:- awsome view of the beach- sectioned off beach chairs, always with THE view of the ocean - quiet royal pool with lots of bali beds to go around- excellent bartenders always asking if I need something else- royal service food in the morning and lunch- golf reservations, pickupsParadisus Punta Cana GREATS:- ALL Restaurants- The WHOLE resort is Beautiful","ratings":{"Service":1.0,"Business service":3.0,"Cleanliness":2.0,"Check in / front desk":3.0,"Overall":2.0,"Value":3.0,"Rooms":1.0,"Location":4.0},"author":"Albertha Haag","date":"2012-06-09 05:18:50 +0300"},{"content":"Nightmare in Paradise !!!!!!!!!! Where do i begin??? Let's see when we first walked in the hotel we were told at the front desk that our room was ready. To make a long story short when we got to the room it was a mess as if someone had just checked out. Going back to the part of first walking in we were encountered by a concierge named Leonardo. He told us we were staying in the reserve section of the hotel. Which is suppossedly the newer and better part. He said we had access to the private pool and beach. The next day we had found out that was a lie. We asked the bartender at the reserve section for a drink and were denied. Going back to our lying concierge Leonardo we did not confront him because we were on vacation and didnt want to deal with headaches so we left it as is.Our second day Leonardo invited us for breakfast at the Gabi restaurant. He never prepared us for any of the following.... he told us we would get a free gift for walking through the property. OK.. so we agreed. To find out when we got there it would be a 90 minute time share presentation..which i need to say turned out to be 2 1/2 hours long. We had a pleasant young lady escort us and show us through but later encountered by a beast named Randolf. I don't know where they find these time share people. Randolf was rude and highly unprofessional. He was trying to belittle my wife and I. Constantly laughing at us and making nasty comments. To much to write. All i have to say is whoever decides to go to this hotel BEWARE!!!! We complained about this uneducated man immediately and nothing was done.!!!!!!Lets now go to the service of the hotel. Let's see WHAT SERVICE! This place sucks!!! To put it simple. If you need a spoon bring one from home. If you need a fork bring your own. If you need soda go get it yourself at the bar before you eat . As a matter of fact get 3 or 4 drinks so you don't have to keep getting up. These people don't ask their guests if they would like refills . They throw away your food and drinks if you get up at the buffet. There is no service for food or drinks on the beach area. So if your used to that like we are you are in for a huge dissapointment.One more heads up about this place. You must remind that appetizers come before the main course at those so called reservation only restaurants. Like Fuego at the Paradisus.I strongly urge my fellow vacationers to never, ever stay at this MELIA/PARADISUS PUNTA CANA property . If you must stay at a melia property I would say go to the PALMA REAL it may cost more but you will be treated accordingly. We have stayed at other properties in Punta Cana and the Carribean and this hotel is horrible. Food was limited because all the resatraunts were on different schedule which means you had to find out on the day ofto eat. Front desk had no clue what was open when. The food was outright bad not much options. Dont waste your time.","ratings":{"Service":1.0,"Business service":3.0,"Cleanliness":1.0,"Check in / front desk":1.0,"Overall":1.0,"Value":-1.0,"Rooms":2.0,"Location":3.0},"author":"Jaycee West","date":"2014-08-03 04:23:07 +0300"}],"public_likes":["Kirk Becker","Lavinia Conn DVM","Rashawn Satterfield","Ms. Aric McKenzie","Janie Goyette","Maureen Steuber Jr.","Miss Raven Hand","Fredrick Fadel"],"vacancy":true,"description":"[[File:Handicap reverse blue background.svg|15px|frameless]] Located in Yosemite Valley and open year-round, this campground is closest to Happy Isles and the trailhead to Half Dome.  It  requires reservations and offers 238 sites for both tents and RVs up to 36' in length.  Water and flush toilets are available.  Campsites 21, 27, and 42 are wheelchair accessible.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}