{"title":"Venice (California)","name":"The Cadillac Hotel","address":"8 Dudley Ave","directions":"on Ocean Front Walk btwn Speedway Ave.","phone":"+1 310-399-8876","tollfree":null,"email":"reservations@thecadillachotel.com","fax":null,"url":"http://www.thecadillachotel.com","checkin":"3PM","checkout":"Noon","price":"$99-219","geo":{"lat":33.994061,"lon":-118.479643,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":32171,"country":"United States","city":"Los Angeles","state":"California","reviews":[{"content":"We were driving through the area and thought that Calistoga would be a nice place to stop for one night. The Roman Spa is a decent place to stay but is not a resort by any stretch of the imagination. It's an old establishment and shows it, but generally is comfortable. The rooms are updated, but the air conditioning unit is dismal. It was impossible to find a good setting during the night, it was either too cold, but when you turned it up a bit, you woke up sweating. Lots of older couples there which I thought was endearing. The baths are quite old and the tiles are fading badly, but that didn't seem to bother anyone. The reception and service seems to be an afterthought for those who work there. With the exception of a nice young lady, they would just let you stand at the counter indefinitely as they walked back and forth doing \"their work\". It's okay for one night, but I didn't feel it lived up to it's description on the website.","ratings":{"Service":1.0,"Cleanliness":3.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":2.0,"Overall":2.0,"Value":3.0,"Rooms":3.0,"Location":3.0},"author":"Selmer Ryan","date":"2014-10-04 02:10:03 +0300"}],"public_likes":["Dr. Jennie Jast","Dr. Rafael Hudson","Bart Bode","Ahmed Murazik","Theo Hodkiewicz"],"vacancy":false,"description":"The only hotel in Venice Beach located on the boardwalk on Ocean Front Walk and offering views of the Santa Monica Bay. All rooms have been recently renovated.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}