{"title":"San Francisco/Union Square-Financial District","name":"Pacific Tradewinds Backpackers","address":"680 Sacramento St","directions":"between Kearny and Spring","phone":"+1 415 433-7970","tollfree":null,"email":"info@pactradewinds.com","fax":null,"url":"http://www.sanfranciscohostel.org","checkin":"8AM-11:30PM","checkout":"10:30AM","price":"$26-29.50/night","geo":{"lat":37.7937,"lon":-122.4042,"accuracy":"ROOFTOP"},"type":"hotel","id":26211,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"Here is compression between price and the values. Price+Location = Awesome Price+Comfort = Medium Price+Quality = Medium Price+Breakfast = Poor Tip: Do not try stay on Nano Room. Those rooms are very small and boring.","ratings":{"Service":4.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Tyreek Lueilwitz","date":"2014-05-30 16:49:06 +0300"},{"content":"I joined my partner, swho was attending a conference at a nearby hotel. for four nights at the Mamara Sisli hotel. The hotel is not in the main tourist area, and it is quite expensive to get there by cab (I didn't have adequate Turkish or stamina to test the public transport system). The hotel has everything you would expect from a hotel catering to business men and women. There is a good choice of food at breakfast, the hotel is clean, and our room was reasonably spacious. The receptionists didn't always seem to know what was going on in terms of how long we had booked for, but managed everything with minimum fuss. The main drawback was that the walls were very thin, you could hear everything if the person next door spoke in anything other than a quiet voice","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":3.0,"Location":2.0,"Rooms":4.0},"author":"Loy Kreiger","date":"2014-03-31 07:44:08 +0300"},{"content":"We stayed at the Shangri-La in Vancouver for our anniversary and from the moment we arrived we were treated like royalty. The staff went above and beyond for us. Shortly after we arrived, the staff sent up a very decadent \"Happy Anniversary\" chocolate cake. Staff at the lounge, front desk and concierge were all very polite, helpful and friendly. Upon checkout the valet provided complimentary water for our drive home. The room itseft was impeccably clean and the decor was beautiful. Although we were only on the 14th floor we had a wonderful view of Stanley Park.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ellsworth Strosin","date":"2012-08-12 19:51:50 +0300"},{"content":"Thoroughly enjoyed an overnight stay with my family, including our dog. The hotel and staff ensure all amenities are provided including a dog bed, bowls and water for the pooch. Dinner at XiShi Lounge was delicious with great live entertainment as well. For me, the highlight was the WestCoast Wave massage at Chi Spa. The therapist used the perfect amount of pressure and even worked on areas of stress I didn't realize I was carrying. The atmosphere in the spa and in the client room was so tranquil. The experience from start to finish was incredible. The Shangri-la is as its namesake describes: a paradise on earth.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Charlene Gerhold","date":"2013-08-26 22:13:28 +0300"},{"content":"We stayed for five nights in August 2011. We had a few niggles, but nothing severe enough to drop this review to a 4. Service was outstanding. We had a problem with our initial room, and were kindly moved to a one-bedroom suite with balcony, which inevitably colours our review. The room was genuinely a luxury experience - a step above similar accommodation we have had in Four Seasons and Ritz-Carlton properties in the US. The mis-steps were as follows: The hotel had arranged a driver from YVR, who duly met our flight as arranged, but had managed to lose his car keys. Fortunately he was still able to get into and start the car, but any amusement faded when we stopped not once but twice so he could tie down the trunk with his belt. This added significantly to our journey time, not ideal coming in at midnight from Las Vegas. Market at Jean-Georges was hit and miss, or to be more precise as breakfast was included in our rate: miss-hit-miss-miss (the fifth day we had a dawn train to Seattle; the hotel kindly provided pastries and fruit (which was then confiscated by Customs at the station)). As I think someone else pointed out, a lot depends on your server - maybe we were just unlucky 75% of the time. However, we experienced similar service issues at several restaurants; maybe it's a Vancouver thing. My final gripe is being charged $12 for an espresso by the pool. It was from a automatic machine and not even any good. Overall, however, an experience I would recommend, and would probably stay here again if in Vancouver. The pool was a bonus (though not exactly a sun-trap) and we used Chi Spa which was very relaxing.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Lessie Kuvalis","date":"2012-03-09 20:43:59 +0300"},{"content":"This is my favorite hotel in Vancouver !! The design is beautiful and the rooms are fantastic. The location is great. The service of the staff is unbeatable. Try the market restaurant if you can. The spa is also wonderful-- the fees are little high but it's worth it. Highly recommended!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Amelie Borer II","date":"2014-07-21 06:51:04 +0300"},{"content":"We stayed a night at the Shangri-La hotel in transit to an Alaskan cruise my wife and i were taking. We booked the room through the American Express FHR program. To start with the hotel is more on the small size of the high rise hotels. The hotel rooms occupy the first 15 floors with luxury condos on the rest. The staff were very helpful and the front desk staff (on the lower level than the street level) were very nice and quick regarding checkin. They complementary upgraded our room to a balcony suite. This room was incredible! Very modern and luxurious with quite a few high tech ad ons such as push button drapes and dimming lights. The room was very clean and well kept as was the rest of the decor. The work out facilities where top of the line and very nice. The restaurant, Market, was great. We ate breakfast there the next morning. The apricot sausage was phenomenal! In the process of eating I managed to dump my coke all over myself. The restaurant manager, Gordon Hay, was near and came over to assist, switching chairs, picking up ice from everywhere and even had the chef retire some new food due to my original food having coke on it. We started talking to Mr Hay and he was a real wealth of knowledge regarding the local area and took the time to locate a map and answer our tourist questions as well as make some local recommendations as to what to do in the area. He was very personable and helpful and was a true crowning touch to the overall great experience of the hotel. We would definitely stay again and recommend the Shangri-La to anyone coming to vancouver!","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Dimitri Dickens","date":"2013-01-29 13:10:54 +0300"},{"content":"We stayed in an executive balcony king suite on the 12th floor for 4 nights at the beginning of our honeymoon. The hotel is very central, walking distance from most of Vancouver's significant attractions and in an area where we felt safe and comfortable. First and foremost we found the service absolutely excellent. The staff were chomping at the bit to go the extra mile to make our stay perfect. On the first day my wife realised she had left her contact lenses at home. One word to the concierge and they had called around several opticians and found us one of the few that was open on a public holiday. We asked them to reserve us a place for dinner at the restaurant on our way out one day and on returning had a full confirmation letter on printed on hallmarked paper and a telephone message just to make sure! The lobby is very plush but also quite modern. The corridors around the room were all clad in beautiful dark mahogany. The fittings in the room oozed quality and the view was superb, especially at night. The attention to detail in cleaning and room service was again excellent, every day of our stay the room looked perfect. We will definitely be back, we felt this was a great place to start our honeymoon and would recommended it highly to anybody looking for a real luxury experience in Vancouver.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":4.0,"Service":5.0},"author":"Hanna Jerde","date":"2013-03-11 21:51:44 +0300"},{"content":"Was in town for a convention and they billet us at the Vancouver Shangri-la. Was not excepting a having to beg for toiletries/amenities at a 5 star hotel. Internet was super slow and I couldnt connect to our office VPN. No club lounge and breakfast at the cafe was slow and mediocre. Hotel was in a great location, I give them up and they do have comfortable beds it just some things are looking a little worn out and threadbare. The pool changing room was dirty and I tried the Chi Spa which I thought was grossly overpriced.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":1.0,"Sleep Quality":2.0,"Rooms":3.0,"Location":4.0},"author":"Kellen Walsh","date":"2015-07-19 19:20:35 +0300"}],"public_likes":["Tia Stracke II","Ms. Amani Goodwin","Mr. Keanu Stoltenberg","Nathaniel Erdman","Germaine Waters","Mr. Elizabeth Wiegand","Charles Gorczany","Dr. Tyler Christiansen","Golda Boehm"],"vacancy":true,"description":"The highest rated and smallest hostel in San Francisco. On the edge of Chinatown and the Financial District. Friendly, clean, modern and safe. Free internet.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}