{"title":"San Francisco/Nob Hill-Russian Hill","name":"Holiday Inn Golden Gateway Hotel","address":"1500 Van Ness Avenue","directions":"at Pine","phone":"+1 415 441-4000","tollfree":null,"email":"service@goldengatewayhotel.com","fax":"+1 415 776-7155","url":"http://www.goldengatewayhotel.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":37.7898,"lon":-122.4218,"accuracy":"ROOFTOP"},"type":"hotel","id":25962,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"I've read a lot of negative reviews for this place both on TripAdvisor and on HostelWorld and I have to say, I didn't think it was that bad. We only stayed for two nights, and although I wouldn't say it was the best lodging I've ever had...it was safe, it had free wifi, and it was clean enough. I wouldn't recommend it for a long stay, especially if you consider yourself a more high maintenance person. The rooms are really just for sleeping (very small) and the bathroom situation is...temperamental (their toilet system is prone to having issues), but overall, you get what you paid for and it is relatively cheap considering it is Amsterdam. I'm going to say 'yes' to recommending this hotel, but I really only direct this towards people traveling on a budget or planning on a short stay in Amsterdam. Otherwise, I suggest looking elsewhere. PS something not listed on HostelWorld: they have a dog, for those of you with allergies.","ratings":{"Service":3.0,"Cleanliness":3.0,"Overall":3.0,"Value":4.0,"Sleep Quality":1.0,"Rooms":2.0,"Location":4.0},"author":"Dr. Omer Ziemann","date":"2012-01-24 00:37:13 +0300"},{"content":"My husband and I stayed at the Aina Nalu for 6 nights in March in a 1 bedroom unit. The room itself was nicely updated with a gorgeous stone shower and washer/dryer. We loved the convenience of being within walking distance of Lahaina and, after spending $20-$30 on breakfast in town our first few mornings, took full advantage of the kitchen to cook our own breakfasts. We shopped at the local grocery store (make sure to sign up for a savings card - which is free - to save even more money) which also had a $1/night DVD rental we used one night when we just felt like relaxing inside. Although this hotel does not have an oceanfront location that many people look for in Hawaii, we are not the type of travelers that spend much time at the hotel, so the Aina Nalu was perfect for us!","ratings":{"Overall":4.0},"author":"Diego Zieme","date":"2013-07-17 11:44:22 +0300"},{"content":"When I booked the hotel I was hesitant as the price was much lower than other establishments, but I booked it based on TA anyway. To summarize: Pros: + I booked a 1 bedroom and it was very spacious and clean + There is a shopping/restaurant complex one block (2-3 minutes walk) away + Minutes from Front Street (main shopping street) and harbor for excursions + Staff was friendly and helpful with any inquiries + Pools were pretty quiet, free BBQ and free internet/wifi Cons: + No real view from the hotel as it is in the city + Parking is $15 a day + No front desk services at night (only some security staff) The hotel isn't perfect, but given the price, it exceeded my expectations. As some tips, street parking is free so you don't need to pay for hotel parking if you are on a budget. There is a lot (about 1.5 blocks to the west of the hotel) that is $5 a day and one right beside that at $12 a day. You can buy snacks/drinks cheaply at the ABC Store all around Front street if you want to stock up.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brady Effertz","date":"2015-11-30 16:04:18 +0300"},{"content":"Location perfect Service perfect room size perfect clean perfect staff perfect Parking access is dedicated only if you have high driving skills Rooms size is exactly opposite of parking size..happilly im not a car","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Lavinia Schulist DVM","date":"2015-02-27 05:05:42 +0300"},{"content":"The best part of Paris that we have found so far. Everywhere central is walkable but metro and buses are great. The restaurants and deli's in Cadet are excellent suiting all tastes and wallets. This Appartment-hotel is \"cosy\" yet the rooms are large, not cheap at nearly £180 per night but well appointed with separate toilet, separate bathoom and small kitchen with separate dining area. At 15 minutes walk from Gare du Nord it is the first city break where we had no need of taxis. We had breakfast in the local deli's at half the cost of the hotel and the local bars never seemed to close. Great time. The only negative in the whole trip was the food on the Eurostar, everything so cold as to be almost frozen, except the white wine which was warm. Can we have a collective whinge to get Eurostar to think again?","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Kristina Langworth","date":"2012-03-31 16:42:53 +0300"},{"content":"First Impressions - Very impressed. Good location 20 minutes on foot to the Louvre, 200 metres from Cadet Metro station. BAD POINTS...My wife's mobile was stolen from the room the hotel did nothing to resolve the situation or compensate us. The floors are paper thin, make sure you stay on the fifth floor otherwise expect some noise from above. Book your own taxi back to the airport, the hotel mini van cost 20 euro more than a normal cab. It is a real shame that I have negative comments about our experience. In general it is a good hotel. I guess we were VERY unlucky?","ratings":{"Service":1.0,"Cleanliness":4.0,"Overall":3.0,"Value":3.0,"Sleep Quality":1.0,"Rooms":4.0,"Location":3.0},"author":"Porter Kub","date":"2012-07-15 14:37:02 +0300"}],"public_likes":["Adah Tremblay","Rosemarie Bednar V","Garrett McDermott","Thea Murphy"],"vacancy":false,"description":"A Holiday Inn with more amenities than the typical location and nice views of the city.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":true,"free_parking":false}