{"title":"San Francisco/Civic Center-Tenderloin","name":"Hotel Adagio","address":"550 Geary St","directions":"between Taylor St and Jones St","phone":"+1 415 775-5000","tollfree":null,"email":"info@jdvhospitality.com","fax":"+1 415 775-9388","url":"http://www.jdvhotels.com/adagio/","checkin":"3PM","checkout":"noon","price":"$189-$289","geo":{"lat":37.787,"lon":-122.4125,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":25600,"country":"United States","city":"San Francisco","state":"California","reviews":[{"content":"An excellent value for what it is - a three star hotel. Though the rooms are a bit small and showing their age and the lobby a bit utilitarian, the Chancellor works hard to provide four/five star amenities in the room (iron, safe) and lobby (cookies, concierge, etc.). Great location. I recommend the hotel room and parking 'bundle' - very convenient. Strictly self-service which I prefer. Check in, check out, delivery of the car all handled perfectly. I probably would not stay there with my family, but I would definitely stay there again on my own.","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":4.0,"Location":5.0},"author":"Danielle Franecki","date":"2015-02-12 14:38:59 +0300"},{"content":"We were lucky enough to be given one of the two \"model\" rooms in the hotel which had just been redesigned. The room was beautiful and very comfortable to stay in for a few nights. The bathroom was small though and could have been better but overall the room was very nice. Free internet, tea, coffee and cookies in reception are a nice touch. Friendly staff and location was perfect for a few days stopover in the city, just off Union Square.","ratings":{"Service":5.0,"Cleanliness":5.0,"Business service (e.g., internet access)":5.0,"Check in / front desk":5.0,"Overall":5.0,"Value":5.0,"Rooms":5.0,"Location":5.0},"author":"Rogers Beahan","date":"2013-06-14 18:37:00 +0300"}],"public_likes":["Zechariah Larkin","Miss Dedric Rowe","Antone Ziemann"],"vacancy":true,"description":"A luxury boutique hotel featuring a fresh design that bridges its Spanish Colonial Revival architectural roots to a clean and contemporary design aesthetic. 2½ blocks away from the Powell St Cable Car line, 6 blocks from the Moscone Convention Center.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":false}