{"title":"Paris/8th arrondissement","name":"Marriott Champs-Elysees","address":"Avenue de Champs-Elysees 70","directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":"http://www.marriott.com/hotels/hotel-information/travel/pardt-paris-marriott-hotel-champs-elysees/","checkin":null,"checkout":null,"price":null,"geo":{"lat":48.87106,"lon":2.30504,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":21855,"country":"France","city":"Paris","state":"Île-de-France","reviews":[{"content":"We were a little worried after reading some reviews but they proved pretty much groundless. Our check-in and welcome was seamless. We arrived early and were given a room right away. The manager sent champagne for our anniversary. With one exception the staff was friendly and efficient and that is important to us after a trip to Kona where the service ranged from surly to incompetent at a hotel there. Believe me, a consultation with the manager and head of security can put a dampner on your trip. (But that's another story.) Our room was comfortable and clean but not luxurious so if marble baths are important to you, find another place. We liked the private lanai with a view. This property is up for sale so hopefully the new owners will make some refurbishing choices in the rooms and bathrooms. Food here was pricey but good. There are plenty of other good restaurants in nearby Wailea or 10 minutes away in Kihei for the more budget-minded. Check out the panoramic view from the golf clubhouse and sit on the beach at night with a canopy of stars overhead and the sound of the surf. Romantic! Maybe you'll see a shooting star like we did. The luaus were constant throughout the visit but they wind up early. If you just want to watch the show walk up the pool path and stand in back to see the Samoan fire dancers. ( Entertainment in the hotel lounge was sedate & not our style.) People seemed to be enjoying the beach and pool, but if this beach isn't enough, gorgeous Big Beach is just down the road. BTW our Entertainment card was accepted w/o question in the Prince Court and Hakone restaurants. If you have a need to see and be seen or are high energy, this place may not be for you. But if you, like us, like a hotel with a Hawaiian feel right on the beach with a relaxing environment, it's wonderful. If you go in the off season, you can save 40 percent off the hotel room and the Entertainment Book for HI can be purchased online at the end of their year (around Aug or Sept) for a greatly reduced price. That's what we did. Aloha!","ratings":{"Service":5.0,"Cleanliness":4.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Electa Hirthe DDS","date":"2012-01-10 11:23:56 +0300"},{"content":"My wife and I just returned from Hawaii of which 5 of our 10 day vacation took place at the Maui Prince Hotel on the island of Maui. The good: 1). Maui is a beautiful island, and the south shore where the Maui Prince is located is particularly beautiful. 2). The Maui Prince is a visually pleasing, moderately priced hotel accentuated by well-kept and aesthetically pleasing grounds. The room had a comfortable king size bed, a tub with a shower and a separate walk-in shower. Great view from lanai ( ocean front room) 3). The beach is a good size, easily accessible and is very good for swimming and snorkeling (Sea Turtles abound). 4). If you golf, there is a beautiful 18 hole course on the grounds of the hotel (a 9 hole mini course as well). The bad: 1). Because of its fairly isolated location, you'll definitely need a rental car to get around, but even more importantly, to take you to affordable restaurants. (We paid $50 including tip for breakfast at the Maui Prince. 2). There is no casual dining at this hotel except at the pool. (There are 2 expensive restaurants). Unless your reservation comes with a meal plan, your best bet is a 15 minute ride to Kihei where you will have several choices. The pool bar, which does have sandwiches at a decent price, is an option for lunch but closes promptly at 6 P.M. 3). 2 swimming pools (not cold as some writers mentioned) but too deep for small children.","ratings":{"Overall":4.0},"author":"Rocio Runolfsson","date":"2013-11-14 08:39:16 +0300"},{"content":"Maui Prince was not the first choice for us when we were looking for a hotel, but we were very happy to have chosen it for our Honeymoon. It is the perfect place for anyone seeking a quiet romantic and peaceful time. We had a pretty good view of the ocean and west Maui. The rooms were clean and nice. The staff was very courteous and helpful. The gardens were beautifully designed and well maintained. We booked through Expedia and the fun desk staff (Aribe and Angel) were both great and helped us plan our vacation perfectly. Besides couples like ourselves, we also saw kids having a great time at the beach and by the pool. So don't be fooled into thinking this place is only for couples. The beach was hardly crowded and was very private. Overall, we had a blast and will definitely come back again. Do remember to plan your vacation properly and you will hardly mind the long drives to any sight seeing spots from the hotel.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Travis Goyette","date":"2014-03-23 00:39:50 +0300"},{"content":"I have been traveling to Maui for 20 years and I have stayed at many hotels in Wailea, but never the Maui Prince. So I decided that I would try the Maui Prince to see how it compared to the other hotels. It is not up to par with any of the other hotels in Wailea. The rooms are small, noisy, uncomfortable and out dated. The pool was also a huge disapointment, it is about a 1/4 of the size of all of the other hotels. Most of all the costmer service was extremely disapointing, I would almost say rude at some points. You are better off staying at one of the other hotels in Wailea.","ratings":{"Cleanliness":2.0,"Overall":2.0,"Value":2.0,"Service":2.0,"Rooms":1.0},"author":"Shanel Streich III","date":"2012-10-07 23:17:24 +0300"},{"content":"We loved our stay at the Prince and hated to come home. To provide a bit of context, we were choosing between the 4 and 5 star hotels on Wailea--Wailea Grand, Renaissance, Fairmont, etc... We went with the Prince and in no way regretted it. Those other resorts are DEFINITELY more luxurious. So if you want 5-star luxury in your room, you'll be dissapointed in the Prince. What the Prince offers is seclusion and peace and quiet. We first visited The Wailea Grand and Fairmont for dinner. Nick's at the Fairmont is one of the finest eating experiences we have ever had. We were envious. Then, we visited the Grand, Fairmont, Renaissance, etc... during the day. UGH! CHILDREN $@!#%! They were so crowded on the grounds and around the pool, also felt crowded on the beach. None of that at the Prince--very peaceful and NOT crowded (and apparently they were close to capacity when we were there). If you want amazing pools, you won't like the Prince--it has a clean, simple round pool--rather small. However, who wants a pool when you go to Maui? The beach is around 1/4 mile long. It's a beautiful beach, and here's one of the #1 reasons to choose the Prince--there is a turtle cleaning station right on the rocks on the left side of the beach. It is fabulous--you walk right out and every day can swim along side the giant sea turtles. People from other resorts travel down to the Prince for the experience! The other main reason we loved the Prince was the proximity to the beach. While the other large resorts were set back 100 yards from the beach or more, the Prince is right there. We laughed with other guests about our experience of sleeping with the sliding doors wide open to the sound of crashing waves. Lovely. The biggest downside is probably that the rooms themselves fall somewhere between 3-star and 4-star. If a super luxury room is what you want, you might be dissapointed with the Prince. We cared less about that than the proximity to the beach. Also, the hotel was apparently nearly at capacity when we were there, but it sure felt like there weren't that many people around. There are several very nice restaurants at the Prince. As with all eating out on Maui, it is pricey! It wasn't a problem for us, but there is a louao (bad spelling, sorry) 3 or 4 nights per week. There is one side of the Prince that faces the event--the drums might bother you. However, avoid this problem by reserving a room away from that side of the hotel. The Prince is about a 5 minute drive past all of the other resorts toward the lava field. This results in the wonderful seclusion of the hotel. There is an amazing koi pond and the grounds are wonderfully maintained. If you want to go to the other resorts, the Prince offers complimentary transportation to any of the resorts on Wailea. What else...one of the snorkel services to Molokini leaves right off the Prince beach. The lava fields are about a 15 minute drive away--they will eat your shoes up, so be careful! We rented from Snorkel Bob's--found the equipment to be good at a good prince. We found what we think is the best snorkeling on the island (according to some locals). If you head about 10 minutes from the Prince toward the lava fields, the little road goes around a cove with houses. I think it's called the fishbowl or something like that (the aquarium?). It looks like NOTHING from the road. But when you wade in, you are greeted by hundreds of fish! We preferred this spot to Molokini. If we return to Maui, we will probably return to the Prince. The rooms are a little older and less luxurious than the other 5 star resorts on Wailea. But the seclusion and hearing the waves from your room and the turtles on the beach daily left us feeling completely satisfied with our choice.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Waino Kling","date":"2012-08-25 04:17:12 +0300"},{"content":"Lots of aloha going on here. We stayed here for 3 nights on our wedding trip and got a double upgrade and a bottle of fizz without even asking. Thanks to Ron for such a warm reception. Staff seem very happy here and they seem to really enjoy their work and care about your experience. We had a lovely room with a balcony and great ocean view. The snorkelling is great and a very good Molokini trip leaves from the hotel every morning. Out of bed and straight into the crater! I had a wonderful time and would recommend this hotel to anyone who enjoys nature, peace and seclusion. Oh and thanks also to the Hakone staff for creating a lovely veggie meal for my husband and doing it with a smile. Oh and be sure to look out for the kittens that play at the koi pond.","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Jammie Will","date":"2013-08-21 20:57:30 +0300"},{"content":"We just returned from a 10 night stay at the Maui Prince Hotel (August 15-25). We were married on the beach right behind the hotel. It was a beautiful beach. Starting with our arrival, everyone was so friendly. Free valet parking is offered which is always a plus. Our room was really nice - we had an ocean view room (room 222). It had a view of the mountain,ocean and it was right over the pool. You could always see the sunset from the balcony. Complimentary goodies and water were provided 2 out of the 10 nights. They provide a little refrigerator in the room - very convienent. Room service is really good as far as the food is concerned but it is quite pricy. Housekeeping did a great job every day and gave us a fresh bucket of ice daily. Exercise room is free to use for people staying at the hotel. And there is a self service laundry room that came in very handy. The pool was a nice size with lots of lounge chairs. They also provided lounge chairs for the beach. There was really not much to complain about ....the sheets were a little bit itchy but fresh. There were very few children staying at our hotel and that was a plus for us because we were on our honeymoon. The luaus held on the hotel grounds can get a little bit loud at times but nothing too annoying. The hotel gardens / grounds are beautiful. The restaurants at the hotel are pricy but very tasty. All in all - Maui Prince was a great choice and especially for the price. We would definitely stay there again.","ratings":{"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Rooms":4.0},"author":"Anita Baumbach","date":"2013-07-14 22:26:54 +0300"},{"content":"We've just got back from almost a week in paradise with my wife and son (June 13-19), and even though my wife said that I haven't got a romantic bone in my body, the Prince is a fantastic place for some loving! It's hard not to repeat all the good things that have been said about this hotel, so I can just re-emphasize most of them. Don't expect too much and you won't be disappointed. Fantastic beach, nice pool (so what if it's a bit small?), beautiful setting, wonderful wildlife (birds, turtles, deer) etc. etc. 10/10. We had a very nice room at the lobby level (#154). It opened towards the courtyard in rear of the hotel, where the birds congregate in the trees every morning and evening to socialize. They will probably wake you up the first time you hear them go, but you'll get used to it. If you want a more quiet room then ask for something near the front of the hotel. Of course the Lanai was nice, overlooking the gardens and west Maui in the distance. 9/10. The staff were fantastic - from the bell desk to the reception and especially Leila at the pool: 10/10. Free valet parking is superb! 10/10. Beach activities were great - my son also earned to Scuba dive and I had a refresher dive with the turtles! 9/10 Although the Luau is held in the grounds, there are probably better ones on the island than the one at the prince. The setting is great but the entertainment can be a bit cheesy. The food is only so-so and at $75 it's not cheap. The upside is that you can drink as much as you want and not worry about driving back afterwards! Overall 7/10 for the Luau. Room service is pretty good, considering the prices for food elsewhere in the hotel. I'd recommend stopping at Safeway in Pi'ilani (just off hiway 31) to get some supplies - drinks, salads etc. , then have a picnic on the beach (or in your room!). 8/10 for room service The Friday Seafood & Prime Rib Buffet was very good - it's worth not eating much for the whole day to make sure you have room for everything! More shrimp as well as crab and lobster would give it a higher score than my 8/10. The breakfast buffet is excellent too; it's great sitting outside with all the birds (Mynas, Night Herons etc.) by the Koi pool, and the meal will keep you satisfied the whole day. 10/10. You will need a car if you really want freedom, otherwise you can use the free shuttle to the nearby Wailea resort shops. Our overall score is a good 9.5/10 (it would be 10/10 if the prices were lower, but then that's Maui for you...). We will definitely be back there as soon as possible, even though the island is more expensive than the mainland. Catman","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Service":5.0,"Rooms":5.0},"author":"Emmitt Champlin","date":"2012-05-10 15:21:26 +0300"}],"public_likes":["Grover Ferry"],"vacancy":false,"description":"Behind the ''fin de siecle'' facade on the Champs-Elysees hides a much larger, late 20th-century building housing almost 200 rooms decorated in a subdued, for a Marriott property, way.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}