{"title":"Derby","name":"The Stuart Hotel","address":"119 London Road","directions":null,"phone":"+44 1332 340633","tollfree":null,"email":null,"fax":null,"url":"http://www.thestuart.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":52.916122,"lon":-1.468382,"accuracy":"ROOFTOP"},"type":"hotel","id":7769,"country":"United Kingdom","city":"Derby","state":null,"reviews":[{"content":"Stayed here with my son on a California trip. Our room ( two twin beds) was located on the back side of the hotel. It was very quiet and comfortable. The hotel was clean and well maintained. No A/C but the room was plenty cool. The staff was nice. I would stay here again.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":4.0,"Value":5.0},"author":"Rollin Beier","date":"2013-02-15 17:42:16 +0300"},{"content":"An efficient check-In, Welcoming receptionist and a helpful and honest Management was a good start to our 4 night stay. OK the rooms are not large but we were told that before we booked. They are kept beautifully clean and the beds are to die for.The best nights sleep that we had for the whole holiday. The location and proximity to Union Square is an added bonus as is the Cablecar stop right outside of the hotel. The hotel bar did close a bit early for our liking, but the complimentary bottle of wine in the room made up for it.However, we found a fantastic Bar just down the road on the right hand side which I can recommend. It is straight out of the 30`s , I think it is called the Golden Lounge. The little present for the ladies was a very nice touch, the chocolates had bloomed a bit but were very palatable. Breakfast was excellent in both quantity and quality as was the seemingly permanent availability of some of the best coffee I have tasted. Service could not be faulted, if anything a bit too attentive but nice all the same. In all I can honestly recommend this Hotel for a stay in S.F. and I would have no hesitation in re-booking when and if we return.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":5.0},"author":"Valentina Howe","date":"2013-01-25 02:09:58 +0300"},{"content":"If you want to shop in SF, look no further. Hotel is on Union Square. Hotel is exactly what I was looking for. I like staying in five star hotels just like anyone would, and this hotel is not a five star hotel. But, if you are generally an easy going, non high strung person not irritated that something is not 'perfect' and brand new- this is a great hotel on Powell St. where the cable cars run and close to everything we wanted to do. Room is smallish but so what- all I did was sleep there. How much room beside the bed do you need? Bathroom has a shower, sink, and toilet. They all were clean and functioning. What else do you need? Breakfast was convenient and tasty. Bottom line: if you don't need a five star hotel in SF then you don't have to pay for one and can still have a great room at a great price (with add-on parking I would suggest). Loved the uniqueness and boutique feel. Keep doing what your doing Chancellor. I'll be back!","ratings":{"Service":4.0,"Cleanliness":4.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":4.0},"author":"Tracey Langworth","date":"2013-03-28 05:38:11 +0300"}],"public_likes":["Robyn Howe","Chanelle Kihn","Allen Kling","Lucas Turner II"],"vacancy":true,"description":"Best Western","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}