{"title":"Carlsbad (California)","name":"Carlsbad Inn Beach Resort","address":"3075 Carlsbad Blvd","directions":null,"phone":"+1 760 434-7020","tollfree":null,"email":null,"fax":null,"url":"http://www.carlsbadinn.com/","checkin":null,"checkout":null,"price":null,"geo":{"lat":33.157,"lon":-117.3517,"accuracy":"APPROXIMATE"},"type":"hotel","id":5097,"country":"United States","city":"Carlsbad","state":"California","reviews":[{"content":"Sommerset suites hotel is perfect for family. Our room is very large with a full furnihed kitchen and very clean. In the afternoon they offer cookies and on friday they offer bbq in the swimmingpool. The stuff is very kind and the location is excellent. Breakfast is very good and rich and waiter is very nice.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Leda Swaniawski","date":"2015-08-15 07:54:27 +0300"},{"content":"The staff at this hotel is some of the best I have ever encountered, They are truely here to help out in what ever they can do for the guest's. In my opinion the are some of the most professional staff around. I would gladly stay here the next time I come to San Diego.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Wilfredo Mosciski","date":"2013-02-19 19:47:00 +0300"},{"content":"I chose this location because we were looking for a room that could accommodate our family of 4 and was located close to the zoo and Seaworld. The room we booked was very large and clean and included a full size kitchen, dining table, sofa bed and a separate bedroom with 2 queen beds. The complimentary breakfast was good and we were provided with fresh waffles, but be prepared to tip the breakfast staff. The location of this accommodation is ok if you have a car, however there is a $6 daily parking fee. The room was generally quiet although due to the close location to Mercy hospital there were occasional siren noises. The hotel also has good laundry facilities, which are require when travelling with kids. I would highly recommend this hotel if you are looking for a value for money suite in San Diego.","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":4.0,"Value":5.0,"Location":4.0,"Rooms":5.0},"author":"Kennith Torphy","date":"2013-01-28 07:04:16 +0300"},{"content":"I have stayed at this hotel for several years. It is at the top of the list for San Diego Hotels. It is withing walking distance to one of the most appealing neighborhoods in San Diego, Hillcrest. Restaurants, clubs, bars are just blocks away. The hotel offers excellent accomodations. A big plus is that each room has a small kitchen. Perhaps the greatest asset of the hotel is the staff who make each guest feel welcome and like family. I highly recommend this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Nestor Raynor","date":"2015-09-23 15:52:50 +0300"},{"content":"This was our first time to San Diego. We came with our 4 children (3 of them teenagers). The location was fantastic with easy access to all the local attractions and beaches. The hotel was clean and kept up well with nicely manicured grounds. The beds were surprisinglly quite comfortable and we slept well. There was WiFi and computer access if needed. The complimentary breakfast was good. The kids enjoyed the pool and hotub. We stayed here for a week and the on site laundry facilities came in handy. We really enjoyed the little shops, boutiques and resturants in the neighborhood within walking distance. The staff was friendly and helpful. Our microwave didn't work and they had a new one within minutes to our room. We liked the full size kitchen and it was great for saving money and cooking our own meals. There was also a couple of barbeque grills out by the pool we took advantage of for a couple of meals. Overall we would highly recommend this hotel and hope to return on another trip in the future.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Gage Hessel","date":"2013-09-05 14:34:30 +0300"},{"content":"Not perfect but great for families. Clean. Comfortable beds. Recently redone, but some of the quality is questionable...not sure how long it will stay looking nice. Pool perfect for kids...only 3 ft deep. Continental breakfast average. Convenient to the zoo and Sea World. Walking distance to a street with many restaurants. Next to a hospital so ambulance noise could be an issue...we didn't hear any at night.","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Mallory Rutherford","date":"2014-01-26 17:08:29 +0300"}],"public_likes":["Edd Crona","Ellie Feil","Jerald Rice","Kaitlin Ziemann","Demetrius Kuvalis","John Collier","Clementina Jacobson","Palma Marks","Marta Rutherford"],"vacancy":false,"description":"Charming beach-side vacation resort.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}