{"title":"London/Westminster","name":"Luna & Simone Hotel","address":"47/49 Belgrave Rd, SW1V 2BB","directions":"tube: Pimlico ''or'' Victoria","phone":"+44 20 7834-5897","tollfree":null,"email":"stay@lunasimonehotel.com","fax":"+44 20 7828-2474","url":"http://www.lunasimonehotel.com/","checkin":null,"checkout":null,"price":"Double ensuite £70-90","geo":{"lat":51.4908,"lon":-0.1387,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":16526,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"The sleeping rooms at Banos de Cuomo are clean but run down. The window shutters in the two rooms we looked at had broken mechanisms, and both showers dripped. But we stayed anyway and were glad. Our balcony looked out over a huge ancient tree with vines and bromiliads all over and sitting there in the evening was magical. the restaurant was huge and had a flavor of times past. The food was OK. There are two modern pools, one cool and the other hot, which are supposed to stay open until 6 or 7 PM. But they drained the hot pool a hour earlier than advertised; this however, shows that they put clean water in daily. There is another set of pools which is not part of the property. They are public, more primative, and more interesting because you can get into many great conversations with the locals, iln English. You reach them easily by walking around the fence at the front entry to the hotel. This place is not for people who like everything neat and clean and perfect, but it is for people who want to see the real Puerto Rico and have a special experience.","ratings":{"Cleanliness":2.0,"Overall":3.0,"Value":4.0,"Service":3.0,"Rooms":2.0},"author":"Lucie Hane","date":"2014-07-23 17:35:22 +0300"},{"content":"I found this little hotel to be quite clean and centrally located but my room was very simple and had the worst bed i have ever slept in. I felt like the princess with the pea under my mattress. I did not sleep a wink becaus my back and body hurt so badly. the next day i had to drive without any sleep, it was scary. In all fairness to the staff, they were very nice and accomodating, even let us leave 2 days in advance.","ratings":{"Service":3.0,"Cleanliness":5.0,"Overall":2.0,"Value":5.0,"Location":5.0,"Rooms":1.0},"author":"Hannah Adams","date":"2015-03-21 10:34:22 +0300"},{"content":"As some body else already said in another review, it's difficult to rate this place based upon the normal standards for a hotel since this is a \"suis generis\" spot in the middle of the rain forest in one of the most remote towns, though very beautiful, of Puerto Rico. The whole setting is what makes this place special. It was built in 1858 as a coffee plantation house and during the last three decades it's being operated as a parador or bed and breakfast. It's currently operated by the municipality. The staff in general is very kind. The service is nice; the food is what you would find at any puertorrican middle class home. Home style food. Generous portions. Don't expect food cooked by a chef; it's cooked by local women, that cook the same way they cook to their families. Nothing fancy at all but with very nice flavor. The rooms are not in top condition aesthetically speaking but are very clean. They have cable TV. I went with a group that took the whole place for us, and had a blast there. Looking forward to go back.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":3.0,"Rooms":3.0,"Location":5.0},"author":"Mr. Muriel Wilderman","date":"2012-12-26 10:33:05 +0300"},{"content":"Hacienda Gripinas is a WONDERFUL place to stay if you want peace and quiet. It is an old hacienda, NOT a hotel, up in the central mountains of Puerto Rico. The views are spectacular! At night, it gets cold--cool breeze from the mountains, ahhhh! We had a huge balcony and would come out at night to relax and drink beer! We were serenated by an orchestra of bugs. It was like being in the middle of a jungle. It was GREAT!!!!! This place is for couples and mature people. Don't bring any kids or immature adults here. Both breakfast and dinner are included and they are both very good. I would recommend the omeletts for breakfast and the chicken asopao for dinner. Our two hosts, Miguel and Juan Carlos, were excellent! They made sure we were enjoying our meal and would accommodate all requests made. Therefore, although tipping is included, we tipped them. Orlando at the front desk could not have been more accommodating. He gave me precise directions to get to the Hacienda, he changed us to a great room because our initial room was leaking water from the toilet, and he even helped us with our bags. I noticed that the people of Jayuya are very proud people. When we went into town and asked people on the street for directions or for the nearby sights, they would stop and very enthusiastically tell you what you needed to know and then they would ask you if you visited this or that other place in Jayuya, and they would tell you what the site meant to them and give you directions on how to get there. Very nice, friendly and decent people. More so here than at other places we have visited. So, my advice to you is treat people with respect and you'll have a far better time. Like others have recommended, I also advise to get here from Ponce (Route 10) even if you come from San Juan. Last year, we took the north route (Route 149), and although you'll see some great mountain panoramic views and small waterfalls, it will take you more than 30 minutes through very narrow and winding roads--it's mountain driving!--and you could get sick.","ratings":{"Cleanliness":3.0,"Overall":4.0,"Value":5.0,"Service":5.0,"Location":5.0},"author":"Maegan Hilll","date":"2014-11-01 14:06:01 +0300"},{"content":"I generally love historic lodges in rustic settings, but this property is simply not worth the trouble to get to. I reserved it after being told by the Frommers guidebook that it was close to the Rio Camuy Caves (a worthwhile stop). It wasn't. After an almost 2 hour grueling journey through amazingly twisty roads, we arrived. The lodge building itself is atmospheric, but the rooms are spartan (and you'll likely be sharing it with a mosquito or two). The kitchen tries -- but generally fails -- to deliver high quality food. There are apparently some walks available from the hotel, but they were inaccessible the night of my stay due to a gate being padlocked. One of the two pools was also closed for repair (the other pool was really too icy to be attractive). At least the drive south to Ponce from the inn only took about an hour. The bottomline is that this property isn't nice enough to make it worth the journey. If you want to see what a historic coffee plantation is like, sign up the the Conservation Trust's tour of Hacienda Buena Vista, just a couple miles from Ponce.","ratings":{"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Service":3.0,"Rooms":2.0},"author":"Kevon Collier Sr.","date":"2012-01-26 17:53:09 +0300"}],"public_likes":[],"vacancy":false,"description":"Small yet comfortable hotel with friendly staff.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":true,"free_parking":true}