{"title":"London/South Bank","name":"Marriott London County Hall","address":"Westminster Bridge Rd","directions":"tube: Waterloo","phone":"+44 20 7928-5200","tollfree":null,"email":null,"fax":null,"url":"http://marriott.com/property/propertypage/LONCH","checkin":"14:00","checkout":"noon","price":null,"geo":{"lat":51.5012,"lon":-0.1192,"accuracy":"APPROXIMATE"},"type":"hotel","id":16350,"country":"United Kingdom","city":"London","state":null,"reviews":[{"content":"These apartments were fabulous, we were upgraded to a 2 bedroom apartment on arrival by the manager 'Mr John' who was very friendly and helpful during our stay. As per the review below do not bother talking with desk clerk 'Parvez' if you can avoid him then do so.... i believe he mainly works the night shift so is generally there if you are checking in at night or early in the morning. His answer to everything is very unhelpful, always a no, and when finding out about excursions he always quoted 100 dirhams more then other staff, there is free internet available to use for staying guests and he even tried to charge for using that! Apart from him, we had a fabulous holiday, everything about these apartments were lovely, very modern, nice big bedrooms/beds, very clean bathrooms, nice kitchen. They also have a lovely rooftop swimming pool to cool of in the heat and a very new Gym. Apartments are in a good location too about a 10/15 minute walk to al karama/bur juman metro. Very good selection of restaurants nearby. Would not hesitate to go back.","ratings":{"Cleanliness":5.0,"Sleep Quality":5.0,"Overall":5.0,"Value":5.0,"Service":4.0},"author":"Jamil Kemmer","date":"2013-08-22 12:56:12 +0300"},{"content":"Everything in these hotel apartments were top class it was more than a 4 star service and quality , staff was amazing so helpful i have never experienced such a courtious service any were is the world not even in 5 star hotels like Hilton ,Intercontinital and Jumeriah beach hotel ,Dubai. I would strongly recommend stay in this hotel apartments. WINCHESTER DELUXE HOTEL APARTMENT. MY RECOMMADITION IS 6 STARS.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Adan Eichmann","date":"2015-05-15 07:09:24 +0300"},{"content":"I loved this hotel. Stayed for 3 nights last week for Business. It was in the perfect location and had such fab facilities. The 24 hour snacks available day and night were a nice touch and the rooftop lounge and bar was really stylish. Breakfast was delish too. I used the gym which was small but a great perk too. The staff were welcoming, the decor tres stylish. I'd definitely go back and have been recommending it to everyone I know.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Location":5.0},"author":"Clovis Halvorson","date":"2013-08-27 14:15:52 +0300"},{"content":"The locations of the Casa Camper hotels both in Berlin and Barcelona are great. I knew the Barcelona one, and trusted that they would choose an equally good location for their Berlin facility. So, since this was my first trip to Berlin, I trusted them. And I am glad I did. The hotel has really large rooms, very clean, an actual clean, fitness facility downstairs with apples, towels and a meditation room included. (treadmill, eliptical, modern weighted pull system (dont know the correct term), mats, mirrors) The roof is outfitted with a business area- and a wonderful floor to ceiling room where guests have breakfast, but can hang out whenever they like, 24 hours. There is food available all the time, with swanky smoothies and greek salads in glass jars...very green of them, and very appreciated. You can eat it upstairs or bring it to your room. They also have a bar set up where it is a trust system- you fill out a little form then take the kind of wine or other libation you desire. (there is a charge for that, but not for the food). This all means that there isn't a refrigerator in the room, which was fine with me. I have terrible allergies and the staff went to great lengths to look up the ingredients of the many breads they had available, printed it out and translated it all for me. One of the other reviews mentioned the lack of fresh air. This is true, it is impossible to open a window and it was rather frustrating. But the trade off is really a great value and a great experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Tyrique Kris","date":"2012-10-09 12:59:30 +0300"}],"public_likes":["Britney Bosco","Dr. Pascale Lueilwitz","Martin Morissette","Morris Koch","Asia Simonis","Dustin Dickinson","Nola Cummerata","Heidi Ratke","Lane Dare"],"vacancy":true,"description":"With Big Ben checking on you across the street, it's home to the largest pool in any London hotel. Provides first class service, luxurious spa treatment on site and trendy bar downstairs.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}