{"title":"Lerwick","name":"Lerwick Youth Hostel","address":"Islesburgh House, King Harald Street, ZE1 0EQ","directions":null,"phone":"0845 293 73 73","tollfree":null,"email":"islesburgh@shetland.gov.uk","fax":null,"url":"http://www.shetland.gov.uk/islesburgh/Hostel.asp","checkin":"1600 - 1630, 2145 - 2215","checkout":null,"price":"£17.50","geo":{"lat":60.15356,"lon":-1.14946,"accuracy":"ROOFTOP"},"type":"hotel","id":15539,"country":"United Kingdom","city":"Lerwick","state":null,"reviews":[{"content":"All I can say about the Caribe Hilton is that it was just OK. The facility and grounds were fine and enjoyable but the room was totally NOT what I expected from a Hilton Resort. Our room was in the main tower on the 5th floor and I hated it from the moment we walked in. It is old and dated and in desperate need of a facelift. I have stayed here in the past (which is why I decided to stay here again) but it was nothing like I remember. It was very disappointing and I highly doubt if I would ever stay here again. For what we were paying I expected better accommodations. I have stayed at other Hilton Hotels and at least you felt like you were getting your money's worth even if it was not an executive suite ! This room does not hold a candle to those. I attempted a room change but was told by the staff member who checked us in that unfortunately there was nothing else available and would not be for a few days. Let's see where do I begin. On top of the fact that the room had seen better days, the TV did not work properly with or without the remote. The dresser had a door in front of it that was loose and coming off the hinges. We complained about both and they sent two people up to fix the door but the TV problem was NEVER resolved. At first they blamed it on the cable company, then on the remote, then on the TV itself. (however our friends across the hall had no problem with their TV from the start). Let's see what else...the air conditioning was difficult to control. One minute we were hot and the next we were freezing. We had a problem with the tub because the water would not drain properly. The bathroom also had loose fixtures. I spent the first four days trying to correct the various problems with the front desk staff and several managers. One manager explained that this is an old hotel and they are in the process of renovating...but it's a very slow process. The maintenance staff must be pretty busy round the clock ! We did however like the facilities, spa, and grounds. We were traveling with a 14 year old who enjoyed the pool. Most of the staff were polite and pleasant. All I can say is please heed the warnings on this website and do not be fooled by pretty pictures on the internet. For what they are charging, unless you are planning on staying in one of the executive suites (which I understand are much nicer)....go somewhere else !","ratings":{"Service":3.0,"Cleanliness":3.0,"Check in / front desk":3.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":3.0},"author":"Agustin Becker","date":"2013-06-19 02:31:37 +0300"},{"content":"First let me start by saying that my girlfriends and I were kind of weary about going to Puerto Rico (which I must say turned out to be the most beautiful place and fun), much less about the hotel. But since I waited a little too late for my passport, we chose to go ahead and go. After much carousing and reviewing of all the different hotels in San Juan, we settle on the Caribe Hilton. We really didn't know what to expect because some of the reviews were very exceptional and some were down right anti-Caribe. We arrived in San Juan on Friday May 23rd and stayed until Tuesday May 27th. Upon arriving and checking in at the Caribe Hilton I notified the check in desk that I was a Hilton Honors member and immediately got a free upgrade. I'm not sure were we where staying prior but we were upgraded to the Garden Towers on the 4th floor. The room had 2 bathrooms (only one had a shower), a king size bed and a pullout sofa bed in the living room. There was a television in each room. It came with a safe and refrigerator. It was nicely decorated and gave you the feel of apartment living. We had 2 separate balconies with an entrance to each one. The view was partial garden and partial ocean, which was very nice. After we settled down into the room, two of us decided to go downstairs to one of the hotel restaurants to eat. We chose Palmeras...which was a great thing....because every Friday they have an all you can eat Seafood buffett (great for those seafood lovers). They had sauteed lobster ready to eat, stone crab claws sauteed ready to eat, fried shrimp, baked fish, cold boiled shrimp, various choices of salads with seafood...it was AMAZING. Yes, it was a little pricey...about $52 per person, but it was worth every bit of the price. While we were eating we did have a small incident take place back at our room. The other young lady left behind in the room had a nice surprise when she stepped out of the shower. There was another set of guest sitting in the living room. After trying to straighten it out herself (hard due to language constraints), I paid a visit to the front desk and spoke with the manager. She kindly apologized, changed the keys and gave us a $75.00 credit towards our room. This really did come in handy because it just about covered our tab at the restaurant. Each day was a new adventure at the hotel. There was the lively breakfast buffet that Palmera had every morning, not to mention a great menu selection too. Did I mention how awesome the wait staff is in this restaurant, especially Efrim, he's very attentive and as a guest you will not lack quality service. Then there's the mimosa's served that you could take by the pool area and layout. The pool area was absolutely beautiful and spacious. Several pools to choose from. There was small private beach, however, alongside of the Caribe's property was a public beach and there were a lot of visitors. The Caribe offered the rental of paddle boats at the hotel to take out on the water. There were water activities going on in the private area of the beach. It was great. There was never a shortage of cabs in the front of the hotel. Or you could walk 2 blocks and catch the city bus to Old San Juan to get there in 10 minutes for only .75 cents and it lets you off right by the cruise docks. The great part about this hotel is the location. It's not in the middle of all the Old San Juan hustle and bustle and it's not part of the Isla Verde fast paced strip. You can have quiet and then you can take a cab or bus to the busy areas in under 10 minutes. Any time of night or day. A great perk about this hotel is not just the boutiques that are located there in the hotel or the modern openness of the lobby, but it's the great convenience of the Starbucks. Located in the downstairs lobby. Great for the late night recoveries. Go downstairs get a cup of mojo and go back to the room to wake up. Lastly I can not go without mentioning how great the room service and housekeeping was. We were never short of towels and if we happened to use to many (because women do that sometimes) we called housekeeping for more and in a matter of 15 minutes we would have our fresh towels. We put in a late night call to room service for a request of a microwave, within a matter of 20minutes we had a microwave set up in our room, free of charge. The staff was great, service was great, ambiance was one of a kind. I will definitely be staying at the Caribe Hilton the next time I visited Puerto Rico, hands down!","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Tobin Schroeder","date":"2013-03-09 08:14:11 +0300"},{"content":"I stayed at the Caribe Hilton from May 5th - May 8th. I liked a lot of things about the hotel (the open-air lobby, the Starbucks, the cleanliness of the rooms and the tropical garden) but there were a few issues: 1) There was no one at the check-in desk when I arrived. If you were Hilton Honors or a VIP your line was staffed but there was no one there for normal check-ins. Not the best first impression. 2) Room service trays and garbage were not picked up promptly from the hallways. When my next door neighbor had dinner his tray of half-eaten food remained outside the room until lunchtime the next day. This happened more than once. 3) Beach service was spotty. One day there was someone taking orders but the next day there was no one to be seen. I don't mind getting up to get my drinks and food but sometimes you just want to veg out and not move. 4) Food and drink prices are extraordinarily high. $10 for a Bud Light! That's ridiculous. 5) There needs to be a higher level of attentiveness to guests from some of the staff. One evening when I tried to get a cab to take me to the casino at the El San Juan Hotel, it took 5 minutes of standing around before the staff stopped chatting with each other to ask if they could help. All in all, I had a great trip because the weather in PR was wonderful and the beach at the hotel was really all I needed for a relaxing stay. Would I stay here again? Maybe if I found a really great rate but it wouldn't be my first choice.","ratings":{"Service":2.0,"Cleanliness":3.0,"Business service (e.g., internet access)":3.0,"Check in / front desk":2.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":5.0},"author":"Johanna Spencer","date":"2012-04-23 19:15:10 +0300"},{"content":"My family stayed here post cruise for one night. This was a very nice, clean hotel but not worth the money. It is considered a resort which is why it probably costs more. The food choices were outrageously expensive for a family of 4 to eat at. The only restaurant within walking distance was a Subway. The pool area was nice for kids and there was a nice beach that appeared to be man-made. Overall we had a good experience here but I just felt it was overpriced.","ratings":{"Service":3.0,"Cleanliness":4.0,"Check in / front desk":3.0,"Overall":3.0,"Value":3.0,"Rooms":4.0,"Location":2.0},"author":"Jess Ritchie","date":"2013-09-05 07:02:14 +0300"},{"content":"The Hilton Caribe is a nice place overall.( *I'm use to staying at really nice hotels like the J.W Marriott and Ritz, so that's my point of view). I stayed in the Villas with 3 of my friends ( 3rd floor w/ ocean view). The bedroom is an okay size- 2 queen beds, nice bathroom and nice balcony view of the condado. The kitchenette is cute, it includes a small fridge, sink, microwave, cabinets, and counter space. Bedroom Cons: not much floor space for luggage, no WIFI (which was a HUUUUGE disappointment). I couldn't believe that in 2008 Hilton didn't have WIFI in the bedrooms. But we were able to pick up the WIFI from the Condado Plaza Hotel (Mariott- i think) across the water. So make sure you know how to use your phone as a modem or bring some type of wireless card if you go. (they only have free WIFI in the lobby). Room service is really expensive Bedroom Pros: Nice clean linen, nice size bathroom, nice balcony, good service. You can also buy food and store it in the cabinets and fridge. -------------------------------------------------------------------------------------------------------------------------------- The Hilton was not as glamorous as I thought it would be, but it is nice. The lobby was clean and it's kind of cool how it's connected to the outside- meaning that when you arrive to the hotel you get out of your car and automatically step into the lobby. The pool and beach area is great, simply nice. Its not grandeur, but its very extensive- the property includes alot: gardens, pools, jacuzzis, beaches, playground area, bars, decks, ponds, exotic fish and animals and more- I was not able to fully explore this area, but my friends were able to and they LOVED it. It's a great place for couples at night. The villas has its own separate lobby which is really small, but its somewhat convenient when you need help and information. But I did NOT like all the construction being built - because of the construction going on outside the lobby of the Villas, the outside of the villa area was ugly (very gray and gloomy). Overall Hilton Pros: perfect location- the Hilton seems to be in the middle of everything (Old San Juan (5 minutes away), the Condado (5 minutes away), Isla Verde(12 minutes away), Airport (15 minutes away) plus its a low traffic area so we barely got caught in traffic (which is everywhere in PR), the Hilton pool and beach area offers the widest variety of things to do, and nice people. Overall Hilton Cons: all the Construction, no WIFI, not very glamorous, lack of floor space in rooms w/ 2 beds Most people say the Hilton is overpriced, but I personally think you are paying for the location over anything else b/c the hotel itself is not very ritzy- it's sort of aesthetically disappointing, but you have to keep in mind that this is Hilton's first hotel in the Caribbean (they actually consider it historic) ---------------------------------------------------------------------------------------------------------------------------------- I also visited The Ritz, El San Juan Hotel, and the Intercontinental. The Ritz's beach was very disappointing and dirty.The intercontinental lobby, beach, and pool area was really pretty (i visited at night), but they all seemed kind of small (and their Casino is really small, but busy). El San Juan Hotel is the hot spot- the lobby is BEAUTIFUL and very grand i felt like i was in a fashion magazine- EVERY person there was BEAUTIFUL. It is veeeerry busy, so if you want to watch alot of beautiful people-go there. If you ever visit that hotel (especially at night) be sure to have your best and most fashionable clothes on w/ makeup & hair done etc. (women should wear dresses that compliment their body types with heels and men should just look clean and smell good). If you want to live the \"high life\" you should stay at a hotel like El San Juan, but if you want to relax you should stay at a hotel like the Hilton. El San Juan Hotel is sort of a place for single people (their are too many temptations there especially for men) and other hotels are better for couples and families. ----------------------------------------------------------------------------------------------------------------------------------- OVERALL Puerto Rico Advice: First off, I lost my camera in a taxi on the first night which made me really sad (b/c i lost over 200 pics) and put a little damper on my trip. So I greatly advise everyone to find one taxi driver and stick with them throughout your stay (be sure to ALWAYS get their name, number, and taxi number or license plate). But moreover to Truly experience Puerto Rico you should rent a car. After my experience I advise you to use taxi's for a day, then drive after that- you can get more done and you feel more free! Places to visit: 1. Old San Juan is a must at night (eat at a great restaurant and walk around and visit a club or three) 2. The rain forest (this was probably the best day we had in Puerto Rico- it was BEAUTIFUL!)- bring water and/or drinks, oh and good shoes 3. Culebra, Vieques, or Gilligans Island - you MUST visit one of the three (but visiting one of those will be an all day trip because you will need to arrive early and take ferries to them (so be sure to bring snacks, drinks, snorkel equipment, and an umbrella). 4. Forts in Old San Juan (Fort San Cristobal is better than el Morro) 5. For young people: -Isla Verde at night is a must, definitely go to the clubs, bars, and El San Juan Hotel -Senor Frogs (old san juan), Brava (el san juan hotel), and just ask around. . . (Vibes seemed nice, but we didnt get to go) 6. The Condado at night is really pretty too, when we went there were singers and performers on the big lawn/park area. 7. Ponce is a nice area with many historic places, gardens, etc. . .(old french town so it looks different from old San Juan). You should plan before you get there b/c its very easy to go astray and not get as much done as you want. Remember that EVERYTHING closes early (around 6pm) so tourist activities MUST be planned early and they must be done during the day. At night Old San Juan, the Condado, and Isla Verde are the best. . .If you drive be very cautious b/c people drive very loose down there. Though Puerto Rico is an American territory - 75% of the people their speak Spanish ONLY -if not more. So you should have a basic knowledge of spanish and download some type of translation program on your phone (i just used babelfish.altavista.com- which is an online translator). Walgreens are everywhere (and that will be your grocery and everything else store during the trip (we went almost everyday:-). --------------------------------------------------------------------------------------------------------------------------------------- Overall I LOVED Puerto Rico and I was not ready to go back after 5 days, I felt like I needed atleast 1 or 2 more days. I loved how racism and colorism just seemed to go out the window and everyone loved/liked each other for who they were and respected everyone's individual beauty. So don't be a typical stiff American when you go- relax, have fun, talk to random people no matter their background, race, or ethnicity. Most phone companies don't charge for using your phone in Puerto Rico, but call and make sure. Okay, I think my review is long enough. . . Vive (las) Puerto Rico! lol. . . . Adios! *make sure your camera has a strap on it and put your name and number on it- I would hate for anyone else to lose their camera. * you'll easily notice that most Puerto Ricans seem to be in relationships b/c everywhere you go there will be couples *as an attractive dark-skin woman of color i felt sooo Beautiful in Puerto Rico, everywhere i went i was told how gorgeous i was, not only by Puerto Rican men (and even some women) but by many white Americans (people seem to lose their prejudices in Puerto Rico)- this made my trip even better- i felt like a Goddess there:-)","ratings":{"Service":5.0,"Cleanliness":4.0,"Business service (e.g., internet access)":1.0,"Check in / front desk":4.0,"Overall":4.0,"Value":4.0,"Rooms":4.0,"Location":5.0},"author":"Ms. Mateo Bergstrom","date":"2013-01-04 21:29:46 +0300"}],"public_likes":["Floy Dooley V","Dortha Daugherty","Dr. Torrance Rempel","Miss Rusty Feest","Lorine Bergnaum","Paul Powlowski III","Abigayle Schaden","Dudley Emard"],"vacancy":false,"description":"Great 64 bed hostel run by the local council, but part of the SYHA network.","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":false}