{"title":"Cromford","name":"Alison House Hotel","address":"Intake Lane","directions":"Three miles S of Matlock on A6","phone":"+44 1629 822211","tollfree":null,"email":null,"fax":null,"url":"http://www.alison-house-hotel.co.uk/","checkin":null,"checkout":null,"price":"£55-£105","geo":{"lat":53.106933,"lon":-1.558625,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":7007,"country":"United Kingdom","city":"Cromford","state":null,"reviews":[{"content":"Last May 2004 I stayed at Sam's - got a chance to go to Harrah's to play and WOW could not wait to stay here - so I stayed Dec 26 - 30, 2005 and what an experience. This place gets my vote big time- the STaff is incredible - can't seem to do enough for you! The rooms were fabulous - I did a side trip to Stateline so I checked out and checked back in and therefore had two separate rooms both terrific!! I won big time at Harrah's and at RIO also won at MGM and Bally's - both places had not gone to - it was fun. I am Diamond member and therefore was in the Diamond Lounge at lot and ate a lot there so other than Breakfast at the Garden Cafe I believe is the name of it did not eat anywhere else. The Cafe was excellent - good food! What I found very interesting is as I was going home I had about a hour to $@!#% and just sat in the lobby watching people and Harrah's employees. Every time someone came through the door the employee would come up greet them and ask to help them - that kind of service you just don't see anymore!!! That impressed more than anything!! If you want a great experience and a fun place - this is it! I also went to the lounge and the Dueling Pianos was a BLAST! they are just \"crazy\" so much fun! I went to the Scinitas Show at the RIO - also incredible very funny and man can he play the PIANO WOW!! I am returning May 30th but this time to the RIO can't wait!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Ernie O'Reilly","date":"2014-09-27 04:55:35 +0300"},{"content":"We had a nice stay at Harrah's 12/4 - 12/7. Quick check-in (and a free room upgrade w/o asking), good service at all eating establishments, bars, and gaming tables. Excellent food & service at Andreotti's restaurant; Very good breakfast buffet 2x at Market Square Buffet. Decent burgers at Garden Cafe. Carnival Court was a blast every night! Live bands, juggling bartenders - a fun way to take a break from gaming & just hang out. Rooms were very clean in Carnival Tower, and after toying with the Heat/AC - quite comfortable. Had a beautiful view too. Could be a bit more soundproof - but heck, it's Vegas, people are out in the hallways day & night. I've stayed in much louder hotel rooms. Fantastic location - next to the Venetian & accross from Ceaser's/Mirage. Free shuttle to the Rio (don't miss the Rio!) I would stay there again, most definitely. (Just avoid the breakfast buffets next door at Imperial Palace - not very good, but the gaming was fun & relaxed there).","ratings":{"Overall":4.0},"author":"Kathryne Schroeder","date":"2012-08-30 05:28:28 +0300"},{"content":"My husband and I go to Vegas a lot as it is within a 4 hour driving distance from us, but we never stayed at Harrah's as it has a bit of a cheap-looking exterior and we thought the rooms would be the same. We had tickets to see Elton John last week at Caeser's and just wanted someting reasonable and Caeser's rates were really high , so we booked this on one of the internet travel sites and got a terrific rate. Well were we ever surprised!!!! We had a FANTASTIC suite which was nicer than the suite we had at the Venetian when we paid three-four times as much in May. We were upgraded obviously from a standard room, but this was without our asking or without them even telling us we were upgraded until we asked at check-out. They must just automatically do this when they are slow! It was two beautifully decorated rooms a living room and a bedroom, a huge two-room bath area! with jacuzzi tub and separate shower. The pool was nice, noting glamourous but they have misters to cool you off which was nice. The specialty drinks by the pool ran about $7.00 each (which is NOT a lot in veags ) but you actually got a decent amount of ALCOHOL in them (which is not usual in Vegas.) The staff were terrifically friendly. The valet staff was so fast and effcient. Our only problem was the Garden Cafe, the food was terrific, but they were not staffdd well enough to manage the crowd of people. So Don't be put off by this hotel's less than beautiful exterior. We hardly ever repeat hotels in Vegas as we like to try them all out, and many are so disappointing, but we will definitely go back to Harrah's! !! !!!","ratings":{"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Service":4.0,"Rooms":5.0},"author":"Jalon Kovacek","date":"2015-07-08 01:36:51 +0300"}],"public_likes":["Marie Gusikowski"],"vacancy":true,"description":"Small country house-style hotel in quiet setting, own grounds and rural views. Convenient for industrial heritage Arkwright's Cromford Mill and historic village of [[Cromford]]. Family rooms available.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}