{"title":"Santa Monica","name":"Georgian Hotel","address":"1415 Ocean Ave","directions":null,"phone":"+1 310 395-9945","tollfree":"+1-800-538-8147","email":null,"fax":null,"url":"http://www.georgianhotel.com","checkin":null,"checkout":null,"price":"$200-400","geo":{"lat":34.01388,"lon":-118.49733,"accuracy":"ROOFTOP"},"type":"hotel","id":26499,"country":"United States","city":"Santa Monica","state":"California","reviews":[{"content":"Once you arrive at the Westin on Century Blvd., you are greeted by the most accommodating Bellmen! Frankly, I have been pleased with the entire Staff at this location. I would definitely recommend this hotel to anyone, especially if you are traveling and need to be airport close! The Daily Grille is a wonderful addition to this hotel. If you haven't had the opportunity to eat at a daily Grille, you are missing out! Their soups and dishes are spectacular. The only suggestion I would make is that their pours could be better. I have never understood why better establishments just don't pour. Believe me, people recognize skimpy pours! We stay at this hotel more than 10 times a year and have been staying there for more than 11 years! Again, I would recommend this hotel to anyone! You will not find a more accommodating Hotel!","ratings":{"Service":5.0,"Cleanliness":4.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Vivienne Walsh","date":"2014-09-01 04:06:45 +0300"},{"content":"First, the restaurant is outstanding. The food and wait staff are fantastic. The room is very comfotable and laid out well.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Brenda O'Connell","date":"2012-08-22 11:07:41 +0300"},{"content":"Excellent hotel and extremely comfortable. It has all of the amenities that you could ask for. The location is convenient to the airport.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Rosalyn Murphy","date":"2013-11-14 15:15:51 +0300"},{"content":"This Westin Hotel lacks all the superior quality from others we have stayed in. Cons: From the moment we arrived - No Bell Captain/ Porter in sight; Check in Staff unfriendly and our poor old room with stained and worn carpet, moldy grout between the tiles in the bathroom and black hairs in the bath and bathroom floor. The pool and spa also sad, with tattered old towels. Pros: The bed was very comfortable after a 14H flight.","ratings":{"Service":1.0,"Cleanliness":3.0,"Overall":3.0,"Value":3.0,"Sleep Quality":4.0,"Rooms":3.0,"Location":4.0},"author":"Mrs. Miller Zboncak","date":"2015-07-11 20:02:00 +0300"},{"content":"We recently stayed at the Westin LAX during a stopover from New York to Australia. . We chose to do a bus tour during our time in LA & had no problems being collected & returned. The hotel stored our bags securely & their shuttle bus got us back to the airport in plenty of time for our return flight home. Our room was extremely comfortable & we wished we had arrived earlier so we could have enjoyed it more. The bed & bedding was 1st class. The staff were willing to meet our every need & the restaurant was very affordable & offered an extensive menu which was excellent. We were more than happy with our stay at the Westin & would highly recommend it to anyone who is looking for an inexpensive quality hotel","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Ms. Henriette Kohler","date":"2012-08-14 10:31:56 +0300"}],"public_likes":["Ike Hoeger","Kathlyn Waelchi"],"vacancy":false,"description":"The Georgian Hotel is an Art Deco classic that dates back to the 1920s.  Located right on Ocean Avenue and in the heart of downtown Santa Monica, it is in the thick of the action.  Rooms are smaller and prices are not cheap, but it is a great place to stay.","alias":null,"pets_ok":false,"free_breakfast":false,"free_internet":false,"free_parking":true}