{"title":"Offa's Dyke Path","name":"Blue Bell","address":"Churchstoke, Montgomery","directions":"East of B4385-A489 junction","phone":"+44 1588 620231","tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":null,"geo":{"lat":52.53305,"lon":-3.10332,"accuracy":"ROOFTOP"},"type":"hotel","id":21040,"country":"United Kingdom","city":"Church Stoke","state":null,"reviews":[{"content":"A/C-heat does not work, however Staff did supply a tiny \"space heater\" 9-8-11' Toilet flushes slowly and 9-10-11, upon flushing, it EXPELLED the entire bowl of human (my) waste onto the bathroom floor. - Staff (M) offered me a \"free breakfast\" when I reported the disgusting situation and threaten to have Security remove me from the Hotel when I declined the breakfast offer and pressed the Desk Manager for the Hotel Manager's name and telephone contact information. The Manager's name was given as Rob --, but he couldn't be contacted on a weekend. I had obviously pre-paid or Security might have been needed. I WOULD NOT GO NEAR THIS HOTEL AGAIN EVEN IF SOMEONE HAD ME AT GUN POINT !!! (One of the two \"Desk Managers (C. S.) did agree to and accompanied me at my request to the room to witness the disgusting mess in person)","ratings":{"Sleep Quality":3.0,"Overall":1.0,"Value":3.0,"Service":3.0},"author":"Kariane Brekke","date":"2014-06-15 15:00:02 +0300"},{"content":"My husband and I were only in town for one night. I decided to cancel our reservation at the Nine Zero and book here to save a little money. Huge mistake. I get the hotel is old, I expected that and it is charming in that way. What I didn't expect was 10 year old televisions and no free internet. The location is good and for business I could see the draw (except for the no internet). I think for the price you can find better at a place nearby. The check in and check out process was quick and painless. The beds were decent but the bathrooms showed their age and the floors are very slippery when wet, even with a towel down. Beware of the concierge, they seemed to be pushy when it came to getting a cab or taking the hotel truck, although either will set you back about $30 to Logan.","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":2.0,"Value":1.0,"Service":2.0},"author":"Tate Swift","date":"2015-09-16 13:00:46 +0300"}],"public_likes":["Isac Feil","Frida Doyle","Ms. Jeremie Ortiz"],"vacancy":true,"description":"Hotel","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":true,"free_parking":true}