{"title":"Ruthin","name":"Clwydian Holidays","address":"Graig, Llanelidan, Denbighshire LL15 2TB","directions":null,"phone":"+44 7766 694514","tollfree":null,"email":"clwydianwigwams@hotmail.com","fax":null,"url":"http://www.clwydianholidays.com","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.049,"lon":-3.3137,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":24622,"country":"United Kingdom","city":"Denbighshire","state":null,"reviews":[{"content":"I stayed at this hotel for 3 night recently, and it was not a pleasent stay. First, the rooms, not anything like the pictures. I had blood on my blanket, which I called housekeeping about, got a machine. Left a message and no one called back. Second, I had what looked to be the after math of the buffet left in my toilet, smelled great! Thanks a bunch, NOT! Not to mention the cracked and moldy caulk in the shower.. Lets talk about the service now.. The lady at the desk that checked me in was great, but other then that... awful! Whats the deal with the stairs? You dont like people to use them? Cause I waited for a evevator for an hour, while the asian tours used the elevators. Mind you, they have 6 evevators! When I asked 3 staff people about the stairs, they told me I had to wait. So now Im late to check in for my flight. I got to the desk and they will have no problem printing out my boarding passes, for 9 dollars!!! I was very excited to stay here, and I come to vegas every year. It really looked nice and sounded great. I will never ever even consider staying here again. I will also be telling my friends and family to stay else where.","ratings":{"Service":2.0,"Cleanliness":1.0,"Overall":2.0,"Value":4.0,"Sleep Quality":3.0,"Rooms":2.0,"Location":2.0},"author":"Katelin Senger","date":"2013-04-04 13:54:48 +0300"},{"content":"We arrived a night early than anticipated and couldn't find a room anywhere. Finally at the end of the strip we went to the stratosphere. They found us a very nice quiet room and offered to extend my stay for free because I checked in so late. My room was very clean comfy and wish I could have spent more time at this hotel.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":3.0},"author":"Mr. Marielle Gutkowski","date":"2012-04-15 19:19:27 +0300"},{"content":"My 13 year old son and I really liked this hotel and will stay there again next time we're in Vegas. The rooms were nice and clean. The staff was friendly. The tower was fun. It's easy to get to the Strip from this hotel - just a 10-15 minute drive. There's a small mall selling inexpensive stuff - clothes, food, souveniers, other stuff - that's attached to the hotel. It was kind of \"cheesy\" but liked it because we could actually afford to buy things - unlike the 'high-end-malls (e.g. The Forum Shops or the shops at The Venetian) where you can pay $200 for a simple shirt. I mean really... who buys that stuff at The Forum Shops? Other super-fun things we've done in Vegas: * Indoor go-cart racing at Pole Position Raceway - awesome * Pinball Hall of Fame! * Indoor skydiving * Machine gun rental at The Gun Store * Amusement Park at Circus Circus","ratings":{"Service":4.0,"Cleanliness":5.0,"Overall":3.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Herminio Rath","date":"2013-12-07 22:31:07 +0300"}],"public_likes":["Kevon Carter","Misty Grimes","Frida Jacobs"],"vacancy":true,"description":"Log cabin glamping in a rural setting with panoramic views toward the Clwydian Mountain Range.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":false,"free_parking":true}