{"title":"Death Valley National Park","name":"Stovepipe Wells","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"fax":null,"url":null,"checkin":null,"checkout":null,"price":"$12 per night","geo":{"lat":36.60545,"lon":-117.14634,"accuracy":"ROOFTOP"},"type":"hotel","id":7391,"country":"United States","city":"Inyo County","state":"California","reviews":[{"content":"We stayed at this hotel for 9 nights. And we loved it! The people who work there, the surroundings, the service, the relaxed atmosphere, peaceful outdoor chairs. Everything was perfect for us, a family with 4 children between 10 and 17 years. The restaurant, too, was the very best in the area!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Bonnie Lowe","date":"2015-11-18 06:15:31 +0300"},{"content":"We spent four really good days in Istambul in may 09. Oceans 7 was an excellent place to stay, clean, homely, well located, friendly staff, nice roof terrace ... Will be back!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Amber McLaughlin","date":"2012-12-05 11:15:16 +0300"},{"content":"My time in Ocean's was fantastic and one which myself and my friends will always remember. It was the place where we all found out that we passed our Final medical exams and became Doctors. The staff were extremely friendly especially Ahmed, who always looked out for us during our stay in Turkey. I have already recommended it to my friends and family.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Location":5.0,"Rooms":5.0},"author":"Morgan Kirlin","date":"2013-11-22 03:03:36 +0300"},{"content":"I chose this hotel to be close to business colleagues, not typically where I stay in Barcelona. However, just a 5 mins walk direct to the beach front, and a leisurely 20 mins stroll along to the port. ME is cool, from rop to bottom. Uber design, this has every modernity you can imagine, although rooms are fairly small (but then again, you dont visit barcelona to be cooped in a room!) - neon lights, mood lighting, power monsoon showers and sounddocks. Added fun comes in a ritter-sport stocked mini bar, with a special Love Me Tender late night bag, for those that dont wnat to sleep (feather and massage gel included!). Free wifi from room and lobby, and chic lounge bar with slump sofas and chess boards, and DJ at weekend. The pool is great, as is the outside cocktail bar. Club was under refurb during my stay, but the lobby restaurant is spectacular for food (tip: order the Solomillo!)","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":3.0},"author":"Mrs. Zetta Barton","date":"2013-12-17 18:20:35 +0300"},{"content":"Booked a room at hotel ME Barcelona expecting to have a relaxing holiday only to find service below the standards of a 1 star hotel. On the first night we were not allowed to sit and dine at the hotel's restaurant even though there were plenty of free tables because according to the Manager the waiters were busy. We were told to come back in 15 minutes only to hear the same answer and ended up having to leave and dine elsewhere. Second night the air conditioning doesn't work, after calling several times, someone came and said that it was fixed but the room is still 26 degrees and the air conditioning still doesn't work. Only solution offered was to move to another room for a couple of hours to sleep and that will be called once the problem is fixed...but it is 1:20 am!!! Avoid if possible!!","ratings":{"Service":1.0,"Cleanliness":2.0,"Overall":1.0,"Value":1.0,"Location":3.0,"Rooms":3.0},"author":"Wanda D'Amore","date":"2015-01-06 13:25:00 +0300"},{"content":"Hotel ME located at a nice neighbourhood where it's within walking distance to beach and shopping area. I love my room as it comes with great sea view. I can even enjoy sunrise in my room :) The bathroom is not really spacious but I love the rain shower and bathtub. Oh, and I love the coffee maker too. I enjoy having a nice cup of coffee every morning to start my day, and to have a nice cup of coffee after a long day walk. The buffet breakfast is very good. A lot of variety to choose from, and you can eigher have your breakfast in the unique design restaurant, or at the outdoor.","ratings":{"Service":3.0,"Cleanliness":4.0,"Overall":4.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Barton Grimes","date":"2015-06-01 09:53:17 +0300"},{"content":"ME Barcelona by Melia is a wonderful 4 star hotel with exquisite service. I have rarely encountered such a welcoming staff. You feel right at home as you step into this modern hotel. The decoration and architecture reflects the new Barcelona. Do not expect plush rugs and carpet. Everything is sober and bright and clean. The airconditioning is so quiet, it is hard to believe it is on. By the night table one can control the whole room. We chose a room with a city view, just to see the lights at night. We were not disappointed. We opted for a Red Level room to enjoy the amenities without much expense: the food and all the drinks are included, all day long in the Level lounge which we enjoyed. This hotel has one of the best restaurants in Barcelona, Dos Cielos. Not to be missed! Although the hotel is not in the center of town, it is just a few euros away by taxi. And for those, like us, who can walk, it is just 20 minutes away. There are always the bus and the metro which are the best way to get around. The hotel staff will help you in this matter. I definitely recomand this hotel.","ratings":{"Location":4.0,"Overall":5.0,"Value":5.0,"Service":5.0,"Rooms":5.0},"author":"Wilton Tremblay","date":"2013-05-31 18:00:45 +0300"},{"content":"My girlfriend and I booked the hotel ME for short break in Barcelona, flights with ryanair flying into Giona airport. Firstly (although nothing to do with the hotel) Girona airport is not in Barcelona..! anyone expecting a short taxi to the city maybe shocked when the driver tells you its 120 euros ! Girona is actually around 100 km north of Barcelona ! Best bet is a taxi to Girona train station (15-20 euros), train to Barcelona-Passige de Gracia (20 euros), yellow metro from Passige de Gracia to Poblenou (1.45 euros each). All in all takes about an 1hr 20mins and the hotels about 10 mins walk north of Poblenou metro station. Anyway, the hotel is in a district called 22@ which is a nice area to the west of Barcelona city centre. This turned out to be a real plus as we felt we saw more of Barca than we would have had we stayed in the city centre. The area felt safe and clean and had a few good restaurants and cafes for lunch or breakfast. The best way into town from the hotel is via metro, Poblenou station has the yellow line which goes via all the best spots in barca. We particularly liked Port de Olympica and Barceloneta best at night, and all the touristy stuff in the day (la ramblas, passiege de gracia for shopping, parc guell and sagrada familia cathedral etc). The hotel is a 29 story high rise building and is quite striking from the ground. when we arrved the lady on reception was really friendly and helped us with directions and gave us some recomendations etc. we actually ended up agreeing with pretty much everything she said! The hotel It has a roof top pool on the 6th flr with a bar, sunbeds and little booths to sleep and relax in. word of warning, the cocktails will blow your head off and cost about 10 euros each!! we didnt use the restaurants although we heard they were supposed to be good. All in all this hotel is a really good choice, we had an amazing time and although its a little out of town we actually found this to be a real positive! Lastly - if you decide to use the \"love me tender\" pack they provide..FYI - ITS NOT COMPLIMENTRY, ITS ACTUALLY 30 euroes !!!!!!! total rip off for whats inside (trust me)..","ratings":{"Overall":4.0},"author":"Sophie Moore","date":"2013-07-25 06:18:51 +0300"}],"public_likes":["Dr. Keon Goldner","Novella Walsh V","Chris McKenzie"],"vacancy":true,"description":"(Closed in summer).  Located at sea level, Stovepipe Wells has 190 sites with water, some tables, some fireplaces, flush toilets, and dump station.","alias":null,"pets_ok":false,"free_breakfast":true,"free_internet":true,"free_parking":false}