{"title":"Church Bay (Anglesey)","name":"Pen y Graig B&B and Holiday Farmhouse","address":"Pen y Graig","directions":null,"phone":"+44 1407 730857","tollfree":null,"email":"info@holidayonanglesey.co.uk","fax":null,"url":"http://www.holidayonanglesey.co.uk","checkin":null,"checkout":null,"price":null,"geo":{"lat":53.374599,"lon":-4.549305,"accuracy":"RANGE_INTERPOLATED"},"type":"hotel","id":41237,"country":"United Kingdom","city":"Isle of Anglesey","state":null,"reviews":[{"content":"Our weekend stay at La Quinta Addison was a pleasant surprise. Many hotels in the area are advertised as \"dog friendly,\" but this one truly is. We also got a great deal by getting reservations through the call center. So for the money and with no required fee for our 2 small dogs, we enjoyed our stay in the center of restaurants galore. The room was large enough with a satisfactory bathroom. The beds (double) were quite comfortable. The single king rooms may have a small refrigerator and microwave. Dorothy at the front desk was very friendly and took care of any questions and billing concerns very efficiently. There is a shuttle to the Galleria and areas within a 5 mile radius which is nice since you don't have to find a parking spot. The only negative is that the carpet wasn't very clean in our room and the shower curtain wouldn't hang right but since we had dogs, didn't complain about the carpet. I would stay here again.","ratings":{"Overall":4.0},"author":"Orville Howell","date":"2015-10-09 19:15:58 +0300"},{"content":"Fantastic location My husband and I stayed at the Mandira from the 26th December to the 2nd January. Overall we really enjoyed our time at the Resort the pools, restaurants, gardens etc are fantastic and for peak season there were plenty of sun lounges to go around. The resort had a mixture of families, couples and retirees staying there. We upgraded to the deluxe room with the outdoor shower plus club lounge benefits. The room was a bit older than I was expecting and could do with a bit of a makeover but it was very clean. The outdoor shower is a nice touch. The club lounge was great with free afternoon tea  softdrinks everyday  free alcohol from 5:30-7:30 every evening. You cannot fault the location of the Mandira its right on the beach and only a 15 minute walk into Kuta. The staff were extremely friendly and you could not fault their service. We ate dinner at the resort 3 times (in different restaurants) and the food was very nice. The breakfast is amazing with every type of food you can think of on offer. They also changed a few things every morning so there was some variety. My only complaint for the whole holiday was the bed in the room was extremely uncomfortable  we both ended up with very sore backs!!","ratings":{"Service":5.0,"Business service":5.0,"Cleanliness":5.0,"Check in / front desk":5.0,"Overall":4.0,"Value":4.0,"Rooms":3.0,"Location":5.0},"author":"Whitney Koelpin","date":"2013-08-10 03:55:35 +0300"},{"content":"Would NOT recommend Mandira A friend and I stayed at the Bali Mandira for a weeks holiday. The twin room needed refurbishing. The beds were very uncomfortable, you can not adequately block out the sunlight for a little sleep-in, we had to boil the kettle on the floor as this is where the powerpoint was, and to top it off when we asked for extra pillows we were told the hotel had ran out. Although I loved the rainshower they have in the bathroom.We had paid extra to have the club benefits, but I do not consider that this was worth it. The afternoon tea is not replenished, the cocktails are too sweet and poor quality alcohol - that is when a staff member is available to make them. Also none of the choices are rotated, so after a couple of days you would appreciate some variety.Only two internet terminals so a lot of waiting.Upper level pool had a nice view, but it was too hard to get any service up there. The ground level pool is small and you had to reserve a deck chair with a towel before you went to breakfast - which is ridiculous! The breakfast was very nice!!Nyepi Day (like a public holiday) was on when we were there - (take note - it is ILLEGAL to leave your hotel grounds on this day). The hotel served a buffet dinner and did not have enough seats so were turning guests away!!! Parents were begging for a plate to take back to their rooms for their families dinner as the were forbidden to leave the hotel!! Good location, but not worth the overall cost.","ratings":{"Service":3.0,"Business service":2.0,"Cleanliness":4.0,"Check in / front desk":4.0,"Overall":2.0,"Value":2.0,"Rooms":1.0,"Location":5.0},"author":"Gerry Hartmann","date":"2015-10-14 10:40:46 +0300"},{"content":"excellent bargain We stayed at the Bali Mandira two weeks prior to our wedding in Bali. We payed the extra 10 dollars for the upgrade to a deluxe cottage, and it was well worth it. The cottage itself was nothing special, not a lot of natural light came in, so it was quite dark and cold a lot of the time, however the bathroom was terrific! It was half enclosed, half open air, so you could stand in a little rockwalled shower, with tropical plants surrounding you and look up at the clear blue sky! Also included with the upgrade was access to the lounge area, which provided soft drinks and cakes free all day long, with a happy hour from around 5 to 7 with free cocktails - my husband was in heaven! The location is terrific - the beach is separated from the hotel by a pathway, however the beach itself was immaculate, a big change from the last time we stayed in Legian. Although you are only a short stroll from the main shopping streets, the hotel itself is very quiet. The two pools are fantastic, particularly the one on the roof top, and at nighttime, the candles on the tables that surround the other pool from the restaurant give it a really nice ambience. We were so happy with the Mandira, we will definitely stay there again.","ratings":{"Service":4.0,"Business service":-1.0,"Cleanliness":5.0,"Check in / front desk":-1.0,"Overall":4.0,"Value":5.0,"Rooms":3.0,"Location":-1.0},"author":"Verona Wisoky","date":"2013-03-08 11:11:04 +0300"},{"content":"I was in Hotel for Ten days, if you are looking for a place where you could get comfort, cleanliness all on a budget, this is your Hotel, nice friendly staff and they also have a great kitchen where you prepare your food with lots of things provided by the hotel itself. Really enjoyed my stay.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":4.0,"Rooms":4.0,"Location":4.0},"author":"Cory Hagenes","date":"2014-05-24 07:32:26 +0300"},{"content":"The hotel closes at midnight and if you dont reach there before, you stay out. Can you imagine? A city that excels at night, the hotel forces you to be back and spend it in there rooms! We booked a double room and what we got was a bunker. They didnt mention any such thing on the website. The place is beside some cathedral, so the bell sound will never let you sleep. But the most annoying part remains the timing. Overall very dissatisfied with the stay.","ratings":{"Cleanliness":3.0,"Sleep Quality":1.0,"Overall":1.0,"Value":1.0,"Service":3.0},"author":"Evan Ferry","date":"2013-08-04 20:09:24 +0300"},{"content":"What you expect from a ramada I have been as their rates are good Front desk staff is very friendly and gave us instructions to the Target store There’s a upper class breakfast, eggs, sausages, muffins, juice, toast, raisin brans etc. The room was OK, no fuss, basic cable There is a nice pool with lawn chairs so that’s good Near a few fast-food restaurants and gas stations in the area Not too far from the airport but we didnt flew in or out of Dallas Good parking for our rented a car","ratings":{"Cleanliness":4.0,"Sleep Quality":4.0,"Overall":4.0,"Value":4.0,"Service":4.0},"author":"Hazle Reinger","date":"2013-06-02 18:43:47 +0300"}],"public_likes":["Dillon Upton","Mrs. Leanna Gutmann","Orrin Wehner","Daron Yundt"],"vacancy":false,"description":"Self contained B&B apartment for 2 people sharing. Self catering Holiday Farmhouse to sleep 4 or 8. Pen y Graig is 500m from Church Bay beach and the Anglesey Coastal Footpath","alias":null,"pets_ok":true,"free_breakfast":false,"free_internet":false,"free_parking":true}