{"title":"Monmouth (Wales)","name":"Bistro Prego With Rooms","address":"7 Church St, NP25 3BX","directions":null,"phone":"+44 1600 712600","tollfree":null,"email":"enquiries@pregomonmouth.co.uk","fax":null,"url":"http://bistro-prego-with-rooms.wales.info","checkin":null,"checkout":null,"price":null,"geo":{"lat":51.81254,"lon":-2.71494,"accuracy":"ROOFTOP"},"type":"hotel","id":18819,"country":"United Kingdom","city":"Monmouth","state":null,"reviews":[{"content":"My wife and I decided at the last minute to go to the Riviera Maya for a well deserved rest after my dad past away. From the time we arrived (greated with Champagne) to the time we left, we were treated like royalty. Our only concern was the check-out time as our Tour Company was going to pick us up around 9pm, we did not want to have to wait in the lobby for a whole day with nothing to do. Without asking, and I insist, without any request from our part, the check-out staff offered (at no additional cost) to extend the check-out time by 1 hour, to ensure that we could use the resort (and all the restaurants) until we actually leave the property at 9pm, and most importantly, they provided us with a Hospitality Room to shower, change and get ready for our flight back.... Now, that is what I call going above and behond the expectations.... In a few words, this was the ultimate rest and worry-free experience. When I was asked to complete a satisfaction survey, I could not find anything that needs improvement until I remembered the road leading to the resort. There is a very bumpy section shared with 2 other resorts that could use improvement. But..... with the resort, the staff, the restaurants, the pools, the beach, oh! did I mention the staff, the restaurants, the pools, the beach... you know what I mean... with all of that, you are sure to quickly forget about the road... Thank you Secret Maroma, hope to see you soon.... Mr. and Mrs Champagne","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":4.0},"author":"Carlie Walker","date":"2015-02-10 08:39:30 +0300"},{"content":"From the moment we arrived we were treated like royalty. Thank you for the excellent experience.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Robin Kulas","date":"2014-06-14 21:52:25 +0300"},{"content":"Room super nice and clean. Loved the large tub, shower space, and private toliet. Balcony and view was super. Next time I would like pool outside my door. Stocked bar. Bartenders at swim up pool very friendly especially Jose. Crown my favorite drink, was in good supply. Loved that Loved having waiters and waitress' around the pool serving food. (Sprimp on a stick) the best!! The entire experience was outstanding. Look forward to returning next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Andrew Halvorson","date":"2013-09-19 15:44:54 +0300"},{"content":"My husband and I were able to stay at Secrets Maroma Beach for our vacation in March 2010. The minute I walked out of our private transfer, the service was impeccable! We were guided to our concierge to check in. We were in just awe at the main lobby. The lobby looked into an amazing lobby bar and sitting area with a baby grand piano, and beautiful boutique shops. As we walked outside the lobby bar, the restaurant stretch was to die for!! So many choices and such delightful decor to feel as if you were dining in a romantic upscale dining experience! The ocean from our room was so turquoise. I have never stayed at a place with such an amazing beach. The water was so blue/turquoise. This has got to be one of the Top 10 beaches in the world. The beach is so wide with soft, white sand. We walked the beach and swam in it every day. You can not feel any rocks or seaweed, just pure white sand. We are not even pool people, but we chose for 2 days to lay out by the pool because it was unlike any other pool you have seen. The service from the moment we got there was a \"WOW\" factor in my book. The hotel concierge \"Welcomed us Home\" right when we got there, the servers at the beach/pool never let you thirsty or hungry. The servers at dinner knew exactly how to give you a fine dining experience with the perfect timing between courses. Nothing bad happend, only great things beyond anything I would have expected. We are definetely coming back next year.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Berry Keebler","date":"2013-01-30 10:30:52 +0300"},{"content":"excellent resort. everything was outstanding including rooms, beach, service, food, & room. already trying to figure out when we can return. wait staff was very helpful & curteous.","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":4.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Efren Heathcote","date":"2015-04-06 11:22:14 +0300"},{"content":"This place is amazing! The staff was wonderful and helpful. The food was great and plentyful. Even the unexpected rain was fun. There was so much to do. We went swimming with the dolphins and the staff was very helpful setting it all up. We will definately come back but this time we plan for a swim out by the spa. Did I mention the spa? I had a hard time getting my husband to get out after 4 hours. The best spa ever!!!","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":5.0,"Rooms":5.0,"Location":5.0},"author":"Mrs. Eleanore Ruecker","date":"2015-08-31 07:38:51 +0300"},{"content":"We had a magnificient stay in maroma ,no sound of children, great large rooms with plenty of extras (bathrobes,slippers,playboy channel, relaxing music,even a secret box to have our room service delivered without opening the door!!) tips are included but found guest tipping once in a while discretely to waiters for extra service, at the pool during lunch plenty of chefs and waiters come out and offer trays of food at your chair even popsicles! We were offered drinks consistently by our pool waiter :impeccable no waiting. You must reserve the hibashi table ahead of time otherwise always full, we would of liked to have seen dimmer lights and more atmosphere during the night in the restaurants and lobby to make it more cozy and warm. internet works great (5 stations and 1 printer) ,the gym needs to expand 5 machines in 2010 in not enough we found ourselves going to walk on the beach instead because the gym was always full ...but the machines are new and work very well (used them once), overall we will be back this is our second time at secrets maroma things are changing and getting better and better keep up the good work!!! A+","ratings":{"Service":5.0,"Cleanliness":5.0,"Overall":5.0,"Value":5.0,"Sleep Quality":4.0,"Rooms":5.0,"Location":5.0},"author":"Antonio Kshlerin","date":"2012-02-02 04:22:03 +0300"}],"public_likes":["Miss Shyanne Hilll","Kaden Leannon I"],"vacancy":false,"description":"Eight comfortable ''en suite'' letting rooms available at competitive rates. Attached to contemporary restaurant selling rustic Italian cuisine. Centre of town location close to Wye Valley, Offa's Dyke path and golf courses.","alias":null,"pets_ok":true,"free_breakfast":true,"free_internet":false,"free_parking":true}