{"title":"San Diego/La Jolla","name":"Black's Beach","alt":null,"address":"in north La Jolla just below Torrey Pines State Park","directions":null,"phone":null,"tollfree":null,"email":null,"url":"http://www.sandiego.gov/lifeguards/beaches/blacks.shtml","hours":null,"image":null,"price":null,"content":"Set against high cliffs, Black's Beach is the largest '''nude beach''' in the country. Technically, there are two parts of the beach. There is the southern part located within the City of San Diego, where nudity is not allowed (although this rule is rarely enforced) and the northern part located within Torrey Pines State Park, where clothing is purely optional. Black's Beach has one of the most powerful beach breaks in Southern California, making it a popular, but dangerous, surfing spot. To get down to the beach, you have three options. First, you can walk from La Jolla Shores, which is a long stretch. Second, you can go to the Gliderport and take a breathtaking path on the side of the cliff that goes straight down. Don't come in high heels, although it's a safe enough path for surfers to run by you with their surfboards. The top is a great spot to watch the sunset! Third, you can drive along the cliffs north from the Gliderport. Park in the last allowable spot, and take another breathtaking path down. The second path is less beautiful but takes you farther towards the unexplored parts of the beach. The second path forks at the very bottom of the cliff. If you take the fork, which goes into the canyon, you will arrive via a twisty path at the bottom of a hidden waterfall which is home to hummingbirds. It's a few hundred feet in and well worth the walk. The '''full moon drum circle''' goes on here each month. Look for it on a rainbowgathering website. It starts at dawn and goes till dusk. People bring tents and sleeping bags, though most go back up the cliffs. This is a no alcohol event, but feel free to bring wood, a drum, juice and a trashbag to clean up. For latest details, visit [http://home.earthlink.net/~scrollinfo/fullmoon.html this site].","geo":{"lat":32.89595,"lon":-117.25332,"accuracy":"ROOFTOP"},"activity":"do","type":"landmark","id":25183,"country":"United States","city":"San Diego","state":"California"}