{"title":"Paris/6th arrondissement","name":"Eglise de Saint Sulpice","alt":null,"address":"75 rue Bonaparte","directions":"Métro Saint Sulpice","phone":"+33 1 42 34 59 98","tollfree":null,"email":null,"url":"http://www.paroisse-saint-sulpice-paris.org/visite.aspx","hours":"07:00AM to 6:45PM","image":"https://en.wikivoyage.org/wiki/File:P1000718 Paris VI Eglise Saint-Sulpice reductwk1.JPG","price":"free","content":"a Roman Catholic church on the east side of the Place Saint-Sulpice within the rue Bonaparte, in the Luxembourg Quarter of the VIe arrondissement. At 113 metres long, 58 metres in width and 34 metres tall, it is only slightly smaller than Notre-Dame and thus the second largest church in the city. It is dedicated to Sulpitius the Pious. During the 18th century, an elaborate gnomon, the Gnomon of Saint-Sulpice, was constructed in the church. In front of the church itself is the magnificent Place Saint-Sulpice which contains the 'Fountain of the Four Bishops'. The church has a long-standing tradition of talented organists that dates back to the eighteenth century. In 1862, Aristide Cavaillé-Coll reconstructed and improved the existing organ built by François-Henri Clicquot. Though using many materials from Clicquot's French Classical organ, it is considered to be Cavaillé-Coll's magnum opus, featuring 102 speaking stops, and is perhaps the most impressive instrument of the romantic French symphonic-organ era. Its organists have also been renowned, starting with Nicolas Séjan in the 18th century, and continuing with Charles-Marie Widor (organist 1870-1933) and Marcel Dupré (organist 1934-1971), both great organists and composers of organ music. The current organists are 'titulaire' Daniel Roth (since 1985) and 'assistant titulaire' Sophie-Véronique Cauchefer-Choplin. In Saint-Sulpice Sunday organ recitals are held on a regular basis (Auditions du Dimanche, following the High Mass, usually from 11:30am till 12:05pm, during the subsequent mass, a visit of the organ loft is possible).","geo":{"lat":48.85096,"lon":2.33487,"accuracy":"ROOFTOP"},"activity":"see","type":"landmark","id":21788,"country":"France","city":"Paris","state":"Île-de-France","image_direct_url":"https://upload.wikimedia.org/wikipedia/commons/4/40/P1000718_Paris_VI_Eglise_Saint-Sulpice_reductwk1.JPG"}