{"title":"Edinburgh/West","name":"Murrayfield Stadium","alt":null,"address":"Roseburn Street","directions":"tram stop: Murrayfield Stadium","phone":"+44 131 346-5100","tollfree":null,"email":null,"url":"http://www.scottishrugby.org/bt-murrayfield-stadium","hours":null,"image":null,"price":"Match tickets from £15-£60. Stadium Tours £6 adults, £3 concessions","content":"The home of Scottish rugby and a most impressive stadium. The highlight of the season is the '''[http://www.rbs6nations.com/ 6 Nations Championship]''' - effectively the ''European Championship'' of rugby, taking place every February and March between [[Scotland]], [[Wales]], [[Ireland]], [[France]], [[Italy]] and [[England]]. The teams play each other once per year, and alternate home and away games. In odd-numbered years, Scotland host Wales, Ireland and Italy at Murrayfield, with England and France visiting in even-numbered years. On the weekend of a home match, Edinburgh is absolutely full to bursting, and the atmosphere is like nothing else, especially if Wales or Ireland are in town. It can be easier to obtain tickets for the Autumn Test series, generally 3 matches in October and November against southern hemisphere or &quot;non-6 Nations&quot; European opposition. Another Murrayfield highlight is the '''[http://www.edinburgh7s.com Edinburgh Sevens Rugby Festival]''', the final event in the [[:wikipedia:IRB Sevens World Series|IRB Sevens World Series]], an annual circuit featuring national teams in rugby sevens, a variant of rugby union with 7 players per side instead of 15. The Edinburgh Sevens is held over one weekend, typically at the end of May. On non match days, ''stadium tours'' are available (must be booked 48 hours in advance, call +44 131 346 5160) Mon-Sat at 11:00. Generally you can walk around the stadium for free between 9:00-17:00.","geo":{"lat":55.94223,"lon":-3.24062,"accuracy":"APPROXIMATE"},"activity":"see","type":"landmark","id":8694,"country":"United Kingdom","city":"Edinburgh","state":null}