{"title":"Fontainebleau","name":"Château de Fontainebleau","alt":"Palace of Fontainebleau","address":null,"directions":null,"phone":null,"tollfree":null,"email":null,"url":"http://www.musee-chateau-fontainebleau.fr/spip.php?lang=en","hours":null,"image":null,"price":null,"content":"This is one of the most beautiful chateaux in France. Its interior decorations are especially interesting as a fine example of the French Renaissance style. At the same time, its historical significance is hard to overestimate, since it was the preferred residence of French kings and emperors for 7 centuries. The first mention of the castle dates back to 1137 but by the time when François I decided to make it his principal residence (1527), the medieval castle was mostly in ruins. This monarch undertook an ambitious reconstruction program, playing himself the role of the chief architect and inviting two prominent Italian artists, Rosso and Primatice to decorate the interior. Their collaboration resulted in such treasures as the François I gallery (pictured right) with wooden panels, stuccoes and frescoes depicting various episodes from the life of the king; the Church of the Trinity and the Ball room are also from this epoch. After François I, many French monarchs chose Fontainebleau as their residence; the construction started by François I was mostly completed under Henri II and Henri IV. Louis XIII, the son of Henri IV was born in Fontainebleau; the tourists can see the room where Marie de' Medici delivered the baby and imagine how crowded it was at the time: to avoid any risk of substitution, the birth of the king must take place in presence of many witnesses.Somewhat neglected during the French Revolution, the Fontainebleau castle is back to its glory under the reign of Napoleon I, who lived there for a long time and bade his farewell to his troops in the court of the castle in 1814. The visitor can see the Emperor's Throne room (unique in France) and his private apartments. Pope Pie VII visited Fontainebleau twice, first as a guest and then as a prisoner of Napoleon; the papal quarters have recently been opened to visitors. After your visit to the main building, do not forget to take a stroll in the park and the gardens around the castle; you will see Diane's fountain and (if you are lucky) meet one of the peacocks who live there. Although by no means less interesting than the Versailles castle, the Fontainebleau castle is a bit more difficult to reach and less known to tourists; as a result, there are at least ten times less visitors in Fontainebleau than in Versailles. Except maybe on national holidays, there is never a queue to get in, and you can explore the immense castle almost on your own, which, together with the fresh air and the absence of street vendors contributes to make your visit a very peaceful and enjoyable experience. The castle is open every day except Tuesday, January 1, May 1 and December 25th, from 9h30 to 17h in winter and from 9h30 to 18h in summer. As of April 2011, the entrance fee for adults is 10 euros; children below 18 and residents of the European Union below 26 enter free. [[UNESCO World Heritage List|UNESCO World Heritage Site]] [http://whc.unesco.org/en/list/160]","geo":{"lat":48.39704,"lon":2.69236,"accuracy":"ROOFTOP"},"activity":"see","type":"landmark","id":9286,"country":"France","city":"Fontainebleau","state":"Île-de-France"}