{"title":"Great Bernera","name":"Bostadh Iron Age House","alt":null,"address":null,"directions":"From Breaclete continue further along the road until it divides, keep to the right. Until the next fork, continue straight (Bostadh is signposted). At the end of the road is a car park (with a public toilet). From the car park walk to the cemetery / beach. At the end of the cemetery wall on the left and follow the path. Through the gate and to the left on the sandy path. From here you can see the house.","phone":null,"tollfree":null,"email":null,"url":null,"hours":"The Iron Age House is open Mon to Fri from 12.00 - 16.00","image":null,"price":"£3.00","content":"It had long been known that something special had to lie in the sand dunes at Bostadh. Again and again, artifacts had been found. In 1992 a storm changed the coastline, parts of houses appeared and 5 buildings were discovered. In 1996 several excavations were carried out, which exposed and secured the village. The preserved walls of a house were demolished and removed piece by piece to be rebuilt. The others were covered with sand for the conservation. The house has double walls, reminiscent of the top of an 8. It stands in a hollow that is surrounded by a dry stone wall. This provided shelter from the wind. There is no archaeological evidence of the roof construction, but it used only techniques that known by the people at that time. On the south side is a semi-subterranean entrance, which leads you into the main circular room. In the middle of the room is a stone hearth with a peat fire. Above the entrance door into the room, there was a wooden gallery. It is believed that there were beds here. In addition to the main room there is a much smaller side room. In it is a recessed in the wall closet, similar to those in Skara Brae (Orkney).","geo":{"lat":58.2553,"lon":-6.88167,"accuracy":"APPROXIMATE"},"activity":"see","type":"landmark","id":38436,"country":"United Kingdom","city":"Na h-Eileanan an Iar","state":null}